#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_AkEvent

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AnimNotify_AkEvent.AnimNotify_AkEvent_C.Received_Notify
// 0x00C0 (0x00C0 - 0x0000)
struct AnimNotify_AkEvent_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetOrCreateAkComponent_ComponentCreated;  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_GetOrCreateAkComponent_ReturnValue;       // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimNotify_AkEvent_C_Received_Notify) == 0x000008, "Wrong alignment on AnimNotify_AkEvent_C_Received_Notify");
static_assert(sizeof(AnimNotify_AkEvent_C_Received_Notify) == 0x0000C0, "Wrong size on AnimNotify_AkEvent_C_Received_Notify");
static_assert(offsetof(AnimNotify_AkEvent_C_Received_Notify, MeshComp) == 0x000000, "Member 'AnimNotify_AkEvent_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotify_AkEvent_C_Received_Notify, Animation) == 0x000008, "Member 'AnimNotify_AkEvent_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotify_AkEvent_C_Received_Notify, ReturnValue) == 0x000010, "Member 'AnimNotify_AkEvent_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_AkEvent_C_Received_Notify, Temp_delegate_Variable) == 0x000014, "Member 'AnimNotify_AkEvent_C_Received_Notify::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(AnimNotify_AkEvent_C_Received_Notify, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000024, "Member 'AnimNotify_AkEvent_C_Received_Notify::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_AkEvent_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000030, "Member 'AnimNotify_AkEvent_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_AkEvent_C_Received_Notify, CallFunc_GetDisplayName_ReturnValue) == 0x000038, "Member 'AnimNotify_AkEvent_C_Received_Notify::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_AkEvent_C_Received_Notify, CallFunc_GetDisplayName_ReturnValue_1) == 0x000048, "Member 'AnimNotify_AkEvent_C_Received_Notify::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_AkEvent_C_Received_Notify, CallFunc_Concat_StrStr_ReturnValue) == 0x000058, "Member 'AnimNotify_AkEvent_C_Received_Notify::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_AkEvent_C_Received_Notify, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000068, "Member 'AnimNotify_AkEvent_C_Received_Notify::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_AkEvent_C_Received_Notify, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000078, "Member 'AnimNotify_AkEvent_C_Received_Notify::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AnimNotify_AkEvent_C_Received_Notify, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000088, "Member 'AnimNotify_AkEvent_C_Received_Notify::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AnimNotify_AkEvent_C_Received_Notify, CallFunc_Conv_StringToName_ReturnValue) == 0x000098, "Member 'AnimNotify_AkEvent_C_Received_Notify::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_AkEvent_C_Received_Notify, CallFunc_GetOrCreateAkComponent_ComponentCreated) == 0x0000A0, "Member 'AnimNotify_AkEvent_C_Received_Notify::CallFunc_GetOrCreateAkComponent_ComponentCreated' has a wrong offset!");
static_assert(offsetof(AnimNotify_AkEvent_C_Received_Notify, CallFunc_GetOrCreateAkComponent_ReturnValue) == 0x0000A8, "Member 'AnimNotify_AkEvent_C_Received_Notify::CallFunc_GetOrCreateAkComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_AkEvent_C_Received_Notify, CallFunc_PostEventAtLocation_ReturnValue) == 0x0000B0, "Member 'AnimNotify_AkEvent_C_Received_Notify::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_AkEvent_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x0000B4, "Member 'AnimNotify_AkEvent_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_AkEvent_C_Received_Notify, CallFunc_PostAkEvent_ReturnValue) == 0x0000B8, "Member 'AnimNotify_AkEvent_C_Received_Notify::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

}

