#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AstralGuardiansImpact_VisualEntity

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AstralGuardiansImpact_VisualEntity.BP_AstralGuardiansImpact_VisualEntity_C.ExecuteUbergraph_BP_AstralGuardiansImpact_VisualEntity
// 0x0020 (0x0020 - 0x0000)
struct BP_AstralGuardiansImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansImpact_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ExplodingOrb_C*                     K2Node_DynamicCast_AsBP_Exploding_Orb;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLastOrb_ReturnValue;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AstralGuardiansImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansImpact_VisualEntity) == 0x000008, "Wrong alignment on BP_AstralGuardiansImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansImpact_VisualEntity");
static_assert(sizeof(BP_AstralGuardiansImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansImpact_VisualEntity) == 0x000020, "Wrong size on BP_AstralGuardiansImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansImpact_VisualEntity");
static_assert(offsetof(BP_AstralGuardiansImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansImpact_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_AstralGuardiansImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansImpact_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AstralGuardiansImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansImpact_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AstralGuardiansImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansImpact_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AstralGuardiansImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansImpact_VisualEntity, K2Node_DynamicCast_AsBP_Exploding_Orb) == 0x000010, "Member 'BP_AstralGuardiansImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansImpact_VisualEntity::K2Node_DynamicCast_AsBP_Exploding_Orb' has a wrong offset!");
static_assert(offsetof(BP_AstralGuardiansImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansImpact_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AstralGuardiansImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansImpact_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AstralGuardiansImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansImpact_VisualEntity, CallFunc_IsLastOrb_ReturnValue) == 0x000019, "Member 'BP_AstralGuardiansImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansImpact_VisualEntity::CallFunc_IsLastOrb_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AstralGuardiansImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansImpact_VisualEntity, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00001C, "Member 'BP_AstralGuardiansImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansImpact_VisualEntity::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");

}

