#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AbilityDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AbilityDetails.BP_AbilityDetails_C
// 0x0100 (0x0360 - 0x0260)
class UBP_AbilityDetails_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UManRichTextBlock*                      CostRichText;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManRichTextBlock*                      DescriptionRichText;                               // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconImage;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               IconSizeBox;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManRichTextBlock*                      Requirements;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_2;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SlotOverlay;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Upgrade1;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Upgrade2;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Upgrade3;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Upgrade4;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Upgrade5;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Upgrades;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnHovered;                                         // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUnhovered;                                       // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnReleased;                                        // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnPressed;                                         // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnFocus;                                           // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UTexture2D*                             Icon;                                              // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IconVisible;                                       // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxUpgrades;                                       // 0x0354(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         LearnedUpgrades;                                   // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsSmallScreen;                                     // 0x035C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BP_AbilityDetails(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void UpdateDetailsPanel(const class FText& Param_Name_0, const class FText& Description, const class FText& CostText, const class FText& Requirements_0, class UTexture2D* Icon_0, class UClass* AbilityBaseClass, int32 InMaxUpgrades, int32 InLearnedUpgrades);
	void FadeIn();
	void FadeOut();
	void SetIconVisible(bool InIconVisible);
	bool IsValidItem(class UManItemSlotBase* ManItemSlotBase);
	void SetUpgrades(int32 InMaxUpgrades, int32 InLearnedUpgrades);
	void ToggleSmallScreen(bool InIsSmallScreen);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AbilityDetails_C">();
	}
	static class UBP_AbilityDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AbilityDetails_C>();
	}
};
static_assert(alignof(UBP_AbilityDetails_C) == 0x000008, "Wrong alignment on UBP_AbilityDetails_C");
static_assert(sizeof(UBP_AbilityDetails_C) == 0x000360, "Wrong size on UBP_AbilityDetails_C");
static_assert(offsetof(UBP_AbilityDetails_C, UberGraphFrame) == 0x000260, "Member 'UBP_AbilityDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, FadeOutAnim) == 0x000268, "Member 'UBP_AbilityDetails_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, FadeInAnim) == 0x000270, "Member 'UBP_AbilityDetails_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, CostRichText) == 0x000278, "Member 'UBP_AbilityDetails_C::CostRichText' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, DescriptionRichText) == 0x000280, "Member 'UBP_AbilityDetails_C::DescriptionRichText' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, IconImage) == 0x000288, "Member 'UBP_AbilityDetails_C::IconImage' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, IconSizeBox) == 0x000290, "Member 'UBP_AbilityDetails_C::IconSizeBox' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, Name_0) == 0x000298, "Member 'UBP_AbilityDetails_C::Name_0' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, Requirements) == 0x0002A0, "Member 'UBP_AbilityDetails_C::Requirements' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, SizeBox_2) == 0x0002A8, "Member 'UBP_AbilityDetails_C::SizeBox_2' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, SlotOverlay) == 0x0002B0, "Member 'UBP_AbilityDetails_C::SlotOverlay' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, Upgrade1) == 0x0002B8, "Member 'UBP_AbilityDetails_C::Upgrade1' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, Upgrade2) == 0x0002C0, "Member 'UBP_AbilityDetails_C::Upgrade2' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, Upgrade3) == 0x0002C8, "Member 'UBP_AbilityDetails_C::Upgrade3' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, Upgrade4) == 0x0002D0, "Member 'UBP_AbilityDetails_C::Upgrade4' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, Upgrade5) == 0x0002D8, "Member 'UBP_AbilityDetails_C::Upgrade5' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, Upgrades) == 0x0002E0, "Member 'UBP_AbilityDetails_C::Upgrades' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, OnClicked) == 0x0002E8, "Member 'UBP_AbilityDetails_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, OnHovered) == 0x0002F8, "Member 'UBP_AbilityDetails_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, OnUnhovered) == 0x000308, "Member 'UBP_AbilityDetails_C::OnUnhovered' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, OnReleased) == 0x000318, "Member 'UBP_AbilityDetails_C::OnReleased' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, OnPressed) == 0x000328, "Member 'UBP_AbilityDetails_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, OnFocus) == 0x000338, "Member 'UBP_AbilityDetails_C::OnFocus' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, Icon) == 0x000348, "Member 'UBP_AbilityDetails_C::Icon' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, IconVisible) == 0x000350, "Member 'UBP_AbilityDetails_C::IconVisible' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, MaxUpgrades) == 0x000354, "Member 'UBP_AbilityDetails_C::MaxUpgrades' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, LearnedUpgrades) == 0x000358, "Member 'UBP_AbilityDetails_C::LearnedUpgrades' has a wrong offset!");
static_assert(offsetof(UBP_AbilityDetails_C, IsSmallScreen) == 0x00035C, "Member 'UBP_AbilityDetails_C::IsSmallScreen' has a wrong offset!");

}

