#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ACtiveAbilities_UpgradesPopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ACtiveAbilities_UpgradesPopup.BP_ActiveAbilities_UpgradesPopup_C
// 0x00C8 (0x05F8 - 0x0530)
class UBP_ActiveAbilities_UpgradesPopup_C final : public UActiveAbilitiesUpgradeWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0530(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x0538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x0540(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_CloseButton_C*                      BtnClose;                                          // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyB;                                        // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ContentFrame;                                      // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         EssenceCost;                                       // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         EssenceCost_1;                                     // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FrameTexture;                                      // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ResourceCost;                                      // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UpgradeCurrencyIcon;                               // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManRichTextBlock*                      UpgradeDescription;                                // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_AbilityUpgradeSlot_v3_C*            UpgradeSlot_0;                                     // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_AbilityUpgradeSlot_v3_C*            UpgradeSlot_1;                                     // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_AbilityUpgradeSlot_v3_C*            UpgradeSlot_2;                                     // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_AbilityUpgradeSlot_v3_C*            UpgradeSlot_3;                                     // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_AbilityUpgradeSlot_v3_C*            UpgradeSlot_4;                                     // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_AbilityUpgradeSlot_v3_C*            UpgradeSlot_5;                                     // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_AbilityUpgradeSlot_v3_C*            UpgradeSlot_6;                                     // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_AbilityUpgradeSlot_v3_C*            UpgradeSlot_7;                                     // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_AbilityUpgradeSlot_v3_C*            UpgradeSlot_8;                                     // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           UpgradeSlots;                                      // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           UpgradeTooltip;                                    // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Warning;                                           // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup(int32 EntryPoint);
	void OnSetInputDisplay(EInputDisplay InInputDisplay, EInputDisplay InControlDisplay);
	void BndEvt__BP_ActiveAbilities_UpgradesPopup_BtnClose_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void OnSetAbilityName(const class FText& AbilityName);
	void OnUpdateUpgradeDetails(const class FText& Description, int32 Cost);
	void OnGamepadBEvent();
	void BndEvt__BtnClose_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void OnHide(float AnimDuration);
	void OnShow(float AnimDuration);
	void BtnHotkeyBClicked();
	void SetBtnCloseVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ActiveAbilities_UpgradesPopup_C">();
	}
	static class UBP_ActiveAbilities_UpgradesPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ActiveAbilities_UpgradesPopup_C>();
	}
};
static_assert(alignof(UBP_ActiveAbilities_UpgradesPopup_C) == 0x000008, "Wrong alignment on UBP_ActiveAbilities_UpgradesPopup_C");
static_assert(sizeof(UBP_ActiveAbilities_UpgradesPopup_C) == 0x0005F8, "Wrong size on UBP_ActiveAbilities_UpgradesPopup_C");
static_assert(offsetof(UBP_ActiveAbilities_UpgradesPopup_C, UberGraphFrame) == 0x000530, "Member 'UBP_ActiveAbilities_UpgradesPopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ActiveAbilities_UpgradesPopup_C, FadeOutAnim) == 0x000538, "Member 'UBP_ActiveAbilities_UpgradesPopup_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_ActiveAbilities_UpgradesPopup_C, FadeInAnim) == 0x000540, "Member 'UBP_ActiveAbilities_UpgradesPopup_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_ActiveAbilities_UpgradesPopup_C, BtnClose) == 0x000548, "Member 'UBP_ActiveAbilities_UpgradesPopup_C::BtnClose' has a wrong offset!");
static_assert(offsetof(UBP_ActiveAbilities_UpgradesPopup_C, BtnHotkeyB) == 0x000550, "Member 'UBP_ActiveAbilities_UpgradesPopup_C::BtnHotkeyB' has a wrong offset!");
static_assert(offsetof(UBP_ActiveAbilities_UpgradesPopup_C, ContentFrame) == 0x000558, "Member 'UBP_ActiveAbilities_UpgradesPopup_C::ContentFrame' has a wrong offset!");
static_assert(offsetof(UBP_ActiveAbilities_UpgradesPopup_C, EssenceCost) == 0x000560, "Member 'UBP_ActiveAbilities_UpgradesPopup_C::EssenceCost' has a wrong offset!");
static_assert(offsetof(UBP_ActiveAbilities_UpgradesPopup_C, EssenceCost_1) == 0x000568, "Member 'UBP_ActiveAbilities_UpgradesPopup_C::EssenceCost_1' has a wrong offset!");
static_assert(offsetof(UBP_ActiveAbilities_UpgradesPopup_C, FrameTexture) == 0x000570, "Member 'UBP_ActiveAbilities_UpgradesPopup_C::FrameTexture' has a wrong offset!");
static_assert(offsetof(UBP_ActiveAbilities_UpgradesPopup_C, Name_0) == 0x000578, "Member 'UBP_ActiveAbilities_UpgradesPopup_C::Name_0' has a wrong offset!");
static_assert(offsetof(UBP_ActiveAbilities_UpgradesPopup_C, ResourceCost) == 0x000580, "Member 'UBP_ActiveAbilities_UpgradesPopup_C::ResourceCost' has a wrong offset!");
static_assert(offsetof(UBP_ActiveAbilities_UpgradesPopup_C, UpgradeCurrencyIcon) == 0x000588, "Member 'UBP_ActiveAbilities_UpgradesPopup_C::UpgradeCurrencyIcon' has a wrong offset!");
static_assert(offsetof(UBP_ActiveAbilities_UpgradesPopup_C, UpgradeDescription) == 0x000590, "Member 'UBP_ActiveAbilities_UpgradesPopup_C::UpgradeDescription' has a wrong offset!");
static_assert(offsetof(UBP_ActiveAbilities_UpgradesPopup_C, UpgradeSlot_0) == 0x000598, "Member 'UBP_ActiveAbilities_UpgradesPopup_C::UpgradeSlot_0' has a wrong offset!");
static_assert(offsetof(UBP_ActiveAbilities_UpgradesPopup_C, UpgradeSlot_1) == 0x0005A0, "Member 'UBP_ActiveAbilities_UpgradesPopup_C::UpgradeSlot_1' has a wrong offset!");
static_assert(offsetof(UBP_ActiveAbilities_UpgradesPopup_C, UpgradeSlot_2) == 0x0005A8, "Member 'UBP_ActiveAbilities_UpgradesPopup_C::UpgradeSlot_2' has a wrong offset!");
static_assert(offsetof(UBP_ActiveAbilities_UpgradesPopup_C, UpgradeSlot_3) == 0x0005B0, "Member 'UBP_ActiveAbilities_UpgradesPopup_C::UpgradeSlot_3' has a wrong offset!");
static_assert(offsetof(UBP_ActiveAbilities_UpgradesPopup_C, UpgradeSlot_4) == 0x0005B8, "Member 'UBP_ActiveAbilities_UpgradesPopup_C::UpgradeSlot_4' has a wrong offset!");
static_assert(offsetof(UBP_ActiveAbilities_UpgradesPopup_C, UpgradeSlot_5) == 0x0005C0, "Member 'UBP_ActiveAbilities_UpgradesPopup_C::UpgradeSlot_5' has a wrong offset!");
static_assert(offsetof(UBP_ActiveAbilities_UpgradesPopup_C, UpgradeSlot_6) == 0x0005C8, "Member 'UBP_ActiveAbilities_UpgradesPopup_C::UpgradeSlot_6' has a wrong offset!");
static_assert(offsetof(UBP_ActiveAbilities_UpgradesPopup_C, UpgradeSlot_7) == 0x0005D0, "Member 'UBP_ActiveAbilities_UpgradesPopup_C::UpgradeSlot_7' has a wrong offset!");
static_assert(offsetof(UBP_ActiveAbilities_UpgradesPopup_C, UpgradeSlot_8) == 0x0005D8, "Member 'UBP_ActiveAbilities_UpgradesPopup_C::UpgradeSlot_8' has a wrong offset!");
static_assert(offsetof(UBP_ActiveAbilities_UpgradesPopup_C, UpgradeSlots) == 0x0005E0, "Member 'UBP_ActiveAbilities_UpgradesPopup_C::UpgradeSlots' has a wrong offset!");
static_assert(offsetof(UBP_ActiveAbilities_UpgradesPopup_C, UpgradeTooltip) == 0x0005E8, "Member 'UBP_ActiveAbilities_UpgradesPopup_C::UpgradeTooltip' has a wrong offset!");
static_assert(offsetof(UBP_ActiveAbilities_UpgradesPopup_C, Warning) == 0x0005F0, "Member 'UBP_ActiveAbilities_UpgradesPopup_C::Warning' has a wrong offset!");

}

