#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimatedProgressBar_Glide

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AnimatedProgressBar_Glide.BP_AnimatedProgressBar_Glide_C
// 0x0098 (0x0340 - 0x02A8)
class UBP_AnimatedProgressBar_Glide_C final : public UHUDAnimatedProgressBarUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UProgressBar*                           Bar;                                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Normal;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         CurrentPercent;                                    // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DisplayPercent;                                    // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinValue;                                          // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimSpeed;                                         // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxValue;                                          // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentValue;                                      // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HighlightChange;                                   // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           HighlightColorDecrease;                            // 0x02FC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               BarMaterial;                                       // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               EndMaterial;                                       // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBelowZero;                                       // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LengthRatioValue;                                  // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(float NewWidth, bool Animate)> ResizeBarFrame;                                    // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Visible;                                           // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          RequestAnimateBar;                                 // 0x0339(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_AnimatedProgressBar_Glide(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnSetNewValue(float NewValue, bool bHighlightChange, bool bAnimate, bool bNeedExtraHighlight);
	void OnSetNewMinMax(float NewMin, float NewMax, float LengthRatio, bool bAnimate);
	void PreConstruct(bool IsDesignTime);
	void SetNewValue(float NewValue, bool HighlightChange_0, bool Animate);
	void UpdateHighlight(float CurrentPercent_0, float NewPercent);
	void TestWithRandom();
	void SetNewMinMax(float NewMin, float NewMax, bool Animate_);
	void AnimateBar(float InDeltaTime);
	void AnimateBarColor();
	void FadeIn();
	void FadeOut();

	void OnPaint(struct FPaintContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AnimatedProgressBar_Glide_C">();
	}
	static class UBP_AnimatedProgressBar_Glide_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AnimatedProgressBar_Glide_C>();
	}
};
static_assert(alignof(UBP_AnimatedProgressBar_Glide_C) == 0x000008, "Wrong alignment on UBP_AnimatedProgressBar_Glide_C");
static_assert(sizeof(UBP_AnimatedProgressBar_Glide_C) == 0x000340, "Wrong size on UBP_AnimatedProgressBar_Glide_C");
static_assert(offsetof(UBP_AnimatedProgressBar_Glide_C, UberGraphFrame) == 0x0002A8, "Member 'UBP_AnimatedProgressBar_Glide_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_Glide_C, FadeOutAnim) == 0x0002B0, "Member 'UBP_AnimatedProgressBar_Glide_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_Glide_C, FadeInAnim) == 0x0002B8, "Member 'UBP_AnimatedProgressBar_Glide_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_Glide_C, Bar) == 0x0002C0, "Member 'UBP_AnimatedProgressBar_Glide_C::Bar' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_Glide_C, Frame_Normal) == 0x0002C8, "Member 'UBP_AnimatedProgressBar_Glide_C::Frame_Normal' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_Glide_C, Overlay_0) == 0x0002D0, "Member 'UBP_AnimatedProgressBar_Glide_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_Glide_C, SizeBox) == 0x0002D8, "Member 'UBP_AnimatedProgressBar_Glide_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_Glide_C, CurrentPercent) == 0x0002E0, "Member 'UBP_AnimatedProgressBar_Glide_C::CurrentPercent' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_Glide_C, DisplayPercent) == 0x0002E4, "Member 'UBP_AnimatedProgressBar_Glide_C::DisplayPercent' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_Glide_C, MinValue) == 0x0002E8, "Member 'UBP_AnimatedProgressBar_Glide_C::MinValue' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_Glide_C, AnimSpeed) == 0x0002EC, "Member 'UBP_AnimatedProgressBar_Glide_C::AnimSpeed' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_Glide_C, MaxValue) == 0x0002F0, "Member 'UBP_AnimatedProgressBar_Glide_C::MaxValue' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_Glide_C, CurrentValue) == 0x0002F4, "Member 'UBP_AnimatedProgressBar_Glide_C::CurrentValue' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_Glide_C, HighlightChange) == 0x0002F8, "Member 'UBP_AnimatedProgressBar_Glide_C::HighlightChange' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_Glide_C, HighlightColorDecrease) == 0x0002FC, "Member 'UBP_AnimatedProgressBar_Glide_C::HighlightColorDecrease' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_Glide_C, BarMaterial) == 0x000310, "Member 'UBP_AnimatedProgressBar_Glide_C::BarMaterial' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_Glide_C, EndMaterial) == 0x000318, "Member 'UBP_AnimatedProgressBar_Glide_C::EndMaterial' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_Glide_C, IsBelowZero) == 0x000320, "Member 'UBP_AnimatedProgressBar_Glide_C::IsBelowZero' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_Glide_C, LengthRatioValue) == 0x000324, "Member 'UBP_AnimatedProgressBar_Glide_C::LengthRatioValue' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_Glide_C, ResizeBarFrame) == 0x000328, "Member 'UBP_AnimatedProgressBar_Glide_C::ResizeBarFrame' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_Glide_C, Visible) == 0x000338, "Member 'UBP_AnimatedProgressBar_Glide_C::Visible' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_Glide_C, RequestAnimateBar) == 0x000339, "Member 'UBP_AnimatedProgressBar_Glide_C::RequestAnimateBar' has a wrong offset!");

}

