#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AutosaveScreen

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_AutosaveScreen.BP_AutosaveScreen_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_AutosaveScreen_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AutosaveScreen_C_Tick) == 0x000004, "Wrong alignment on BP_AutosaveScreen_C_Tick");
static_assert(sizeof(BP_AutosaveScreen_C_Tick) == 0x00003C, "Wrong size on BP_AutosaveScreen_C_Tick");
static_assert(offsetof(BP_AutosaveScreen_C_Tick, MyGeometry) == 0x000000, "Member 'BP_AutosaveScreen_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_AutosaveScreen_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_AutosaveScreen_C_Tick::InDeltaTime' has a wrong offset!");

// Function BP_AutosaveScreen.BP_AutosaveScreen_C.OnShow
// 0x0004 (0x0004 - 0x0000)
struct BP_AutosaveScreen_C_OnShow final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AutosaveScreen_C_OnShow) == 0x000004, "Wrong alignment on BP_AutosaveScreen_C_OnShow");
static_assert(sizeof(BP_AutosaveScreen_C_OnShow) == 0x000004, "Wrong size on BP_AutosaveScreen_C_OnShow");
static_assert(offsetof(BP_AutosaveScreen_C_OnShow, AnimDuration) == 0x000000, "Member 'BP_AutosaveScreen_C_OnShow::AnimDuration' has a wrong offset!");

// Function BP_AutosaveScreen.BP_AutosaveScreen_C.OnHide
// 0x0004 (0x0004 - 0x0000)
struct BP_AutosaveScreen_C_OnHide final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AutosaveScreen_C_OnHide) == 0x000004, "Wrong alignment on BP_AutosaveScreen_C_OnHide");
static_assert(sizeof(BP_AutosaveScreen_C_OnHide) == 0x000004, "Wrong size on BP_AutosaveScreen_C_OnHide");
static_assert(offsetof(BP_AutosaveScreen_C_OnHide, AnimDuration) == 0x000000, "Member 'BP_AutosaveScreen_C_OnHide::AnimDuration' has a wrong offset!");

// Function BP_AutosaveScreen.BP_AutosaveScreen_C.OnSetTexts
// 0x0048 (0x0048 - 0x0000)
struct BP_AutosaveScreen_C_OnSetTexts final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Description;                                       // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Count;                                             // 0x0030(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_AutosaveScreen_C_OnSetTexts) == 0x000008, "Wrong alignment on BP_AutosaveScreen_C_OnSetTexts");
static_assert(sizeof(BP_AutosaveScreen_C_OnSetTexts) == 0x000048, "Wrong size on BP_AutosaveScreen_C_OnSetTexts");
static_assert(offsetof(BP_AutosaveScreen_C_OnSetTexts, Title) == 0x000000, "Member 'BP_AutosaveScreen_C_OnSetTexts::Title' has a wrong offset!");
static_assert(offsetof(BP_AutosaveScreen_C_OnSetTexts, Description) == 0x000018, "Member 'BP_AutosaveScreen_C_OnSetTexts::Description' has a wrong offset!");
static_assert(offsetof(BP_AutosaveScreen_C_OnSetTexts, Count) == 0x000030, "Member 'BP_AutosaveScreen_C_OnSetTexts::Count' has a wrong offset!");

// Function BP_AutosaveScreen.BP_AutosaveScreen_C.ExecuteUbergraph_BP_AutosaveScreen
// 0x00B0 (0x00B0 - 0x0000)
struct BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration_1;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue_1;       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_Title;                                // 0x0028(0x0018)(ConstParm)
	class FText                                   K2Node_Event_Description;                          // 0x0040(0x0018)(ConstParm)
	class FText                                   K2Node_Event_Count;                                // 0x0058(0x0018)(ConstParm)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0070(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen) == 0x000008, "Wrong alignment on BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen");
static_assert(sizeof(BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen) == 0x0000B0, "Wrong size on BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen");
static_assert(offsetof(BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen, EntryPoint) == 0x000000, "Member 'BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen, K2Node_Event_AnimDuration_1) == 0x000004, "Member 'BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen::K2Node_Event_AnimDuration_1' has a wrong offset!");
static_assert(offsetof(BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen, CallFunc_GetAnimPlaybackSpeed_ReturnValue) == 0x000008, "Member 'BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen::CallFunc_GetAnimPlaybackSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen, K2Node_Event_AnimDuration) == 0x00000C, "Member 'BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen::K2Node_Event_AnimDuration' has a wrong offset!");
static_assert(offsetof(BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen, CallFunc_GetAnimPlaybackSpeed_ReturnValue_1) == 0x000018, "Member 'BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen::CallFunc_GetAnimPlaybackSpeed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen, K2Node_Event_Title) == 0x000028, "Member 'BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen::K2Node_Event_Title' has a wrong offset!");
static_assert(offsetof(BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen, K2Node_Event_Description) == 0x000040, "Member 'BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen::K2Node_Event_Description' has a wrong offset!");
static_assert(offsetof(BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen, K2Node_Event_Count) == 0x000058, "Member 'BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen::K2Node_Event_Count' has a wrong offset!");
static_assert(offsetof(BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen, K2Node_Event_MyGeometry) == 0x000070, "Member 'BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen, K2Node_Event_InDeltaTime) == 0x0000A8, "Member 'BP_AutosaveScreen_C_ExecuteUbergraph_BP_AutosaveScreen::K2Node_Event_InDeltaTime' has a wrong offset!");

}

