#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ArbitersFuryMaxCharge_VE

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ArbitersFuryMaxCharge_VE.BP_ArbitersFuryMaxCharge_VE_C
// 0x0020 (0x0370 - 0x0350)
class ABP_ArbitersFuryMaxCharge_VE_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NiagaraMaxCharge;                                  // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArbitersFuryAbility*                   Ab;                                                // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UArbitersFuryAbility*                   Ability;                                           // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ArbitersFuryMaxCharge_VE_C">();
	}
	static class ABP_ArbitersFuryMaxCharge_VE_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ArbitersFuryMaxCharge_VE_C>();
	}
};
static_assert(alignof(ABP_ArbitersFuryMaxCharge_VE_C) == 0x000008, "Wrong alignment on ABP_ArbitersFuryMaxCharge_VE_C");
static_assert(sizeof(ABP_ArbitersFuryMaxCharge_VE_C) == 0x000370, "Wrong size on ABP_ArbitersFuryMaxCharge_VE_C");
static_assert(offsetof(ABP_ArbitersFuryMaxCharge_VE_C, UberGraphFrame) == 0x000350, "Member 'ABP_ArbitersFuryMaxCharge_VE_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ArbitersFuryMaxCharge_VE_C, NiagaraMaxCharge) == 0x000358, "Member 'ABP_ArbitersFuryMaxCharge_VE_C::NiagaraMaxCharge' has a wrong offset!");
static_assert(offsetof(ABP_ArbitersFuryMaxCharge_VE_C, Ab) == 0x000360, "Member 'ABP_ArbitersFuryMaxCharge_VE_C::Ab' has a wrong offset!");
static_assert(offsetof(ABP_ArbitersFuryMaxCharge_VE_C, Ability) == 0x000368, "Member 'ABP_ArbitersFuryMaxCharge_VE_C::Ability' has a wrong offset!");

}

