#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AbilityUpgradeSlot_v3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AbilityUpgradeSlot_v3.BP_AbilityUpgradeSlot_v3_C
// 0x00F0 (0x0448 - 0x0358)
class UBP_AbilityUpgradeSlot_v3_C final : public UAbilityUpgradeSlotUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       UpgradeProgressAnim;                               // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UpgradeEndAnim;                                    // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UpgradeStartAnim;                                  // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HighlightAnim;                                     // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Bg;                                                // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonFrame;                                       // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_AbilityUpgradeConnection_v3_C*      ConnectionLeft;                                    // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_AbilityUpgradeConnection_v3_C*      ConnectionLeftUp;                                  // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_AbilityUpgradeConnection_v3_C*      ConnectionUp;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Normal;                                      // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_over;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Selected;                                    // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoldVFX_1;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoldVFX_2;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconImage;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnlockVFX_1;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnlockVFX_2;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnlockVFX_3;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnlockVFX_4;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnlockVFX_5;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnlockVFX_6;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnUpdate;                                          // 0x0418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsHighlighted;                                     // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UBP_AbilityUpgradeSlot_v3_C* ItemReference)> OnFocus;                                           // 0x0430(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsSelected;                                        // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         UpgradeID;                                         // 0x0444(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AbilityUpgradeSlot_v3(int32 EntryPoint);
	void OnSetUpgradeIcon(int32 UpgradeIconID);
	void OnSetConnectionsVisibility(const TArray<ESkillUpgradeConnectionType>& SkillUpgradeConnectionTypes);
	void OnUpgradeFinished();
	void OnUpgradeStop();
	void OnUpgradeStart();
	void OnSetState(EAbilityUpgradeState InAbilityUpgradeState);
	void OnSetIcon(const class UTexture2D* InIcon);
	void OnUnfocused(bool bAnimate);
	void OnFocused(bool bAnimate);
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void SetIcon(class UTexture2D* InIcon);
	void Set_Highlighted(bool PlayAnim);
	void SetUnhighlighted(bool PlayAnim);
	void ToggleSelected(bool InIsSelected, bool PlayAnim);
	void SetState(EAbilityUpgradeState InNodeState);
	void Set_Connections_Visibility(TArray<ESkillUpgradeConnectionType>& SkillUpgradeConnectionTypes);
	void UpgradeStart(float MaxKeyTimerHoldTime);
	void UpgradeEnd();
	void UpgradeAbort();
	void SetUpgradeIcon(int32 InUpgradeID);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AbilityUpgradeSlot_v3_C">();
	}
	static class UBP_AbilityUpgradeSlot_v3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AbilityUpgradeSlot_v3_C>();
	}
};
static_assert(alignof(UBP_AbilityUpgradeSlot_v3_C) == 0x000008, "Wrong alignment on UBP_AbilityUpgradeSlot_v3_C");
static_assert(sizeof(UBP_AbilityUpgradeSlot_v3_C) == 0x000448, "Wrong size on UBP_AbilityUpgradeSlot_v3_C");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, UberGraphFrame) == 0x000358, "Member 'UBP_AbilityUpgradeSlot_v3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, UpgradeProgressAnim) == 0x000360, "Member 'UBP_AbilityUpgradeSlot_v3_C::UpgradeProgressAnim' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, UpgradeEndAnim) == 0x000368, "Member 'UBP_AbilityUpgradeSlot_v3_C::UpgradeEndAnim' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, UpgradeStartAnim) == 0x000370, "Member 'UBP_AbilityUpgradeSlot_v3_C::UpgradeStartAnim' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, HoverAnim) == 0x000378, "Member 'UBP_AbilityUpgradeSlot_v3_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, HighlightAnim) == 0x000380, "Member 'UBP_AbilityUpgradeSlot_v3_C::HighlightAnim' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, Bg) == 0x000388, "Member 'UBP_AbilityUpgradeSlot_v3_C::Bg' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, ButtonFrame) == 0x000390, "Member 'UBP_AbilityUpgradeSlot_v3_C::ButtonFrame' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, ConnectionLeft) == 0x000398, "Member 'UBP_AbilityUpgradeSlot_v3_C::ConnectionLeft' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, ConnectionLeftUp) == 0x0003A0, "Member 'UBP_AbilityUpgradeSlot_v3_C::ConnectionLeftUp' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, ConnectionUp) == 0x0003A8, "Member 'UBP_AbilityUpgradeSlot_v3_C::ConnectionUp' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, Frame_Normal) == 0x0003B0, "Member 'UBP_AbilityUpgradeSlot_v3_C::Frame_Normal' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, Frame_over) == 0x0003B8, "Member 'UBP_AbilityUpgradeSlot_v3_C::Frame_over' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, Frame_Selected) == 0x0003C0, "Member 'UBP_AbilityUpgradeSlot_v3_C::Frame_Selected' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, HoldVFX_1) == 0x0003C8, "Member 'UBP_AbilityUpgradeSlot_v3_C::HoldVFX_1' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, HoldVFX_2) == 0x0003D0, "Member 'UBP_AbilityUpgradeSlot_v3_C::HoldVFX_2' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, IconImage) == 0x0003D8, "Member 'UBP_AbilityUpgradeSlot_v3_C::IconImage' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, Overlay_0) == 0x0003E0, "Member 'UBP_AbilityUpgradeSlot_v3_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, UnlockVFX_1) == 0x0003E8, "Member 'UBP_AbilityUpgradeSlot_v3_C::UnlockVFX_1' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, UnlockVFX_2) == 0x0003F0, "Member 'UBP_AbilityUpgradeSlot_v3_C::UnlockVFX_2' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, UnlockVFX_3) == 0x0003F8, "Member 'UBP_AbilityUpgradeSlot_v3_C::UnlockVFX_3' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, UnlockVFX_4) == 0x000400, "Member 'UBP_AbilityUpgradeSlot_v3_C::UnlockVFX_4' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, UnlockVFX_5) == 0x000408, "Member 'UBP_AbilityUpgradeSlot_v3_C::UnlockVFX_5' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, UnlockVFX_6) == 0x000410, "Member 'UBP_AbilityUpgradeSlot_v3_C::UnlockVFX_6' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, OnUpdate) == 0x000418, "Member 'UBP_AbilityUpgradeSlot_v3_C::OnUpdate' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, IsHighlighted) == 0x000428, "Member 'UBP_AbilityUpgradeSlot_v3_C::IsHighlighted' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, OnFocus) == 0x000430, "Member 'UBP_AbilityUpgradeSlot_v3_C::OnFocus' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, IsSelected) == 0x000440, "Member 'UBP_AbilityUpgradeSlot_v3_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UBP_AbilityUpgradeSlot_v3_C, UpgradeID) == 0x000444, "Member 'UBP_AbilityUpgradeSlot_v3_C::UpgradeID' has a wrong offset!");

}

