#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ArtBook

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ArtBook.BP_ArtBook_C
// 0x0118 (0x05F8 - 0x04E0)
class UBP_ArtBook_C final : public UArtbookUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowTOCAnim;                                       // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowControlBarAnim;                                // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOutTextsAnim;                                  // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInTextsAnim;                                   // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ArrowLeft;                                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ArrowRight;                                        // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               BottomScreenFrame;                                 // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyB;                                        // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyLB;                                       // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyRB;                                       // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyY;                                        // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconClose;                                         // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_Button_C*                   Item1;                                             // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_Button_C*                   Item1_1;                                           // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_Button_C*                   Item1_2;                                           // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_Button_C*                   Item1_3;                                           // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_Button_C*                   Item1_4;                                           // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_Button_C*                   Item1_5;                                           // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_Button_C*                   Item1_6;                                           // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_Button_C*                   Item1_7;                                           // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_Button_C*                   Item1_8;                                           // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_Button_C*                   Item1_9;                                           // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_Button_C*                   Item1_10;                                          // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_Button_C*                   Item1_11;                                          // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManScrollBox*                          ManScrollBox_0;                                    // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NormalFrame;                                       // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManWrapBox*                            Options;                                           // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PageText;                                          // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TableOfContents;                                   // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TOC;                                               // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsTOCVisible;                                      // 0x05E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E9[0x3];                                      // 0x05E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentPage;                                       // 0x05EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ControlBarsVisibleRemainingTime;                   // 0x05F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	struct FEventReply OnMouseMove(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnPreviewKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void BtnHotkeyYClicked();
	void HideTOC();
	void ShowTOC();
	void HideControlBars();
	void ShowControlBars();
	void BtnHotkeyRBClicked();
	void BtnHotkeyLBClicked();
	void BtnHotkeyBClicked();
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnShow(float AnimDuration);
	void OnHide(float AnimDuration);
	void BndEvt__BP_ArtBook_BtnHotkeyB_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void OnGamepadBEvent();
	void OnSetPage(const class FText& InPageNumber, int32 InCurrentPage, int32 InMaxPage);
	void BndEvt__BP_ArtBook_BtnHotkeyDPad_Right_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void BndEvt__BP_ArtBook_BtnHotkeyDPad_Left_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();
	void BndEvt__BP_ArtBook_BtnHotkeyY_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();
	void OnGamepadYEvent();
	void CustomEvent_0(class UBP_Options_Button_C* OptionsButton);
	void OnGamepadRBEvent();
	void OnGamepadLBEvent();
	void ExecuteUbergraph_BP_ArtBook(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ArtBook_C">();
	}
	static class UBP_ArtBook_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ArtBook_C>();
	}
};
static_assert(alignof(UBP_ArtBook_C) == 0x000008, "Wrong alignment on UBP_ArtBook_C");
static_assert(sizeof(UBP_ArtBook_C) == 0x0005F8, "Wrong size on UBP_ArtBook_C");
static_assert(offsetof(UBP_ArtBook_C, UberGraphFrame) == 0x0004E0, "Member 'UBP_ArtBook_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, ShowTOCAnim) == 0x0004E8, "Member 'UBP_ArtBook_C::ShowTOCAnim' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, ShowControlBarAnim) == 0x0004F0, "Member 'UBP_ArtBook_C::ShowControlBarAnim' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, FadeOutTextsAnim) == 0x0004F8, "Member 'UBP_ArtBook_C::FadeOutTextsAnim' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, FadeInTextsAnim) == 0x000500, "Member 'UBP_ArtBook_C::FadeInTextsAnim' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, FadeOutAnim) == 0x000508, "Member 'UBP_ArtBook_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, FadeInAnim) == 0x000510, "Member 'UBP_ArtBook_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, ArrowLeft) == 0x000518, "Member 'UBP_ArtBook_C::ArrowLeft' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, ArrowRight) == 0x000520, "Member 'UBP_ArtBook_C::ArrowRight' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, BottomScreenFrame) == 0x000528, "Member 'UBP_ArtBook_C::BottomScreenFrame' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, BtnHotkeyB) == 0x000530, "Member 'UBP_ArtBook_C::BtnHotkeyB' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, BtnHotkeyLB) == 0x000538, "Member 'UBP_ArtBook_C::BtnHotkeyLB' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, BtnHotkeyRB) == 0x000540, "Member 'UBP_ArtBook_C::BtnHotkeyRB' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, BtnHotkeyY) == 0x000548, "Member 'UBP_ArtBook_C::BtnHotkeyY' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, IconClose) == 0x000550, "Member 'UBP_ArtBook_C::IconClose' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, Item1) == 0x000558, "Member 'UBP_ArtBook_C::Item1' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, Item1_1) == 0x000560, "Member 'UBP_ArtBook_C::Item1_1' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, Item1_2) == 0x000568, "Member 'UBP_ArtBook_C::Item1_2' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, Item1_3) == 0x000570, "Member 'UBP_ArtBook_C::Item1_3' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, Item1_4) == 0x000578, "Member 'UBP_ArtBook_C::Item1_4' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, Item1_5) == 0x000580, "Member 'UBP_ArtBook_C::Item1_5' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, Item1_6) == 0x000588, "Member 'UBP_ArtBook_C::Item1_6' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, Item1_7) == 0x000590, "Member 'UBP_ArtBook_C::Item1_7' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, Item1_8) == 0x000598, "Member 'UBP_ArtBook_C::Item1_8' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, Item1_9) == 0x0005A0, "Member 'UBP_ArtBook_C::Item1_9' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, Item1_10) == 0x0005A8, "Member 'UBP_ArtBook_C::Item1_10' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, Item1_11) == 0x0005B0, "Member 'UBP_ArtBook_C::Item1_11' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, ManScrollBox_0) == 0x0005B8, "Member 'UBP_ArtBook_C::ManScrollBox_0' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, NormalFrame) == 0x0005C0, "Member 'UBP_ArtBook_C::NormalFrame' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, Options) == 0x0005C8, "Member 'UBP_ArtBook_C::Options' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, PageText) == 0x0005D0, "Member 'UBP_ArtBook_C::PageText' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, TableOfContents) == 0x0005D8, "Member 'UBP_ArtBook_C::TableOfContents' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, TOC) == 0x0005E0, "Member 'UBP_ArtBook_C::TOC' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, IsTOCVisible) == 0x0005E8, "Member 'UBP_ArtBook_C::IsTOCVisible' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, CurrentPage) == 0x0005EC, "Member 'UBP_ArtBook_C::CurrentPage' has a wrong offset!");
static_assert(offsetof(UBP_ArtBook_C, ControlBarsVisibleRemainingTime) == 0x0005F0, "Member 'UBP_ArtBook_C::ControlBarsVisibleRemainingTime' has a wrong offset!");

}

