#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimatedProgressBarRage

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_AnimatedProgressBarRage.BP_AnimatedProgressBarRage_C.ExecuteUbergraph_BP_AnimatedProgressBarRage
// 0x0090 (0x0090 - 0x0000)
struct BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_NewMin;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewMax;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_LengthRatio;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAnimate_1;                           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_NewValue;                             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHighlightChange;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bAnimate;                             // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bNeedExtraHighlight;                  // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InReservedValue;                      // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInDisplayPercentageOnResourceBars;   // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_PercentageText;                       // 0x0070(0x0018)(ConstParm)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage) == 0x000008, "Wrong alignment on BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage");
static_assert(sizeof(BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage) == 0x000090, "Wrong size on BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage, EntryPoint) == 0x000000, "Member 'BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage, K2Node_Event_MyGeometry) == 0x000004, "Member 'BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage, Temp_bool_Variable) == 0x000040, "Member 'BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage, Temp_byte_Variable) == 0x000041, "Member 'BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage, Temp_byte_Variable_1) == 0x000042, "Member 'BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage, K2Node_Event_IsDesignTime) == 0x000043, "Member 'BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage, K2Node_Event_NewMin) == 0x000044, "Member 'BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage::K2Node_Event_NewMin' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage, K2Node_Event_NewMax) == 0x000048, "Member 'BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage::K2Node_Event_NewMax' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage, K2Node_Event_LengthRatio) == 0x00004C, "Member 'BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage::K2Node_Event_LengthRatio' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage, K2Node_Event_bAnimate_1) == 0x000050, "Member 'BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage::K2Node_Event_bAnimate_1' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage, K2Node_Event_NewValue) == 0x000054, "Member 'BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage::K2Node_Event_NewValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage, K2Node_Event_bHighlightChange) == 0x000058, "Member 'BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage::K2Node_Event_bHighlightChange' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage, K2Node_Event_bAnimate) == 0x000059, "Member 'BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage::K2Node_Event_bAnimate' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage, K2Node_Event_bNeedExtraHighlight) == 0x00005A, "Member 'BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage::K2Node_Event_bNeedExtraHighlight' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000060, "Member 'BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage, K2Node_Event_InReservedValue) == 0x000068, "Member 'BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage::K2Node_Event_InReservedValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage, K2Node_Event_bInDisplayPercentageOnResourceBars) == 0x00006C, "Member 'BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage::K2Node_Event_bInDisplayPercentageOnResourceBars' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage, K2Node_Event_PercentageText) == 0x000070, "Member 'BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage::K2Node_Event_PercentageText' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage, K2Node_Select_Default) == 0x000088, "Member 'BP_AnimatedProgressBarRage_C_ExecuteUbergraph_BP_AnimatedProgressBarRage::K2Node_Select_Default' has a wrong offset!");

// Function BP_AnimatedProgressBarRage.BP_AnimatedProgressBarRage_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_AnimatedProgressBarRage_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimatedProgressBarRage_C_Tick) == 0x000004, "Wrong alignment on BP_AnimatedProgressBarRage_C_Tick");
static_assert(sizeof(BP_AnimatedProgressBarRage_C_Tick) == 0x00003C, "Wrong size on BP_AnimatedProgressBarRage_C_Tick");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_Tick, MyGeometry) == 0x000000, "Member 'BP_AnimatedProgressBarRage_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_AnimatedProgressBarRage_C_Tick::InDeltaTime' has a wrong offset!");

// Function BP_AnimatedProgressBarRage.BP_AnimatedProgressBarRage_C.OnSetPercentageText
// 0x0018 (0x0018 - 0x0000)
struct BP_AnimatedProgressBarRage_C_OnSetPercentageText final
{
public:
	class FText                                   PercentageText_0;                                  // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_AnimatedProgressBarRage_C_OnSetPercentageText) == 0x000008, "Wrong alignment on BP_AnimatedProgressBarRage_C_OnSetPercentageText");
static_assert(sizeof(BP_AnimatedProgressBarRage_C_OnSetPercentageText) == 0x000018, "Wrong size on BP_AnimatedProgressBarRage_C_OnSetPercentageText");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_OnSetPercentageText, PercentageText_0) == 0x000000, "Member 'BP_AnimatedProgressBarRage_C_OnSetPercentageText::PercentageText_0' has a wrong offset!");

// Function BP_AnimatedProgressBarRage.BP_AnimatedProgressBarRage_C.OnDisplayPercentageOnResourceBars
// 0x0001 (0x0001 - 0x0000)
struct BP_AnimatedProgressBarRage_C_OnDisplayPercentageOnResourceBars final
{
public:
	bool                                          bInDisplayPercentageOnResourceBars;                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AnimatedProgressBarRage_C_OnDisplayPercentageOnResourceBars) == 0x000001, "Wrong alignment on BP_AnimatedProgressBarRage_C_OnDisplayPercentageOnResourceBars");
static_assert(sizeof(BP_AnimatedProgressBarRage_C_OnDisplayPercentageOnResourceBars) == 0x000001, "Wrong size on BP_AnimatedProgressBarRage_C_OnDisplayPercentageOnResourceBars");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_OnDisplayPercentageOnResourceBars, bInDisplayPercentageOnResourceBars) == 0x000000, "Member 'BP_AnimatedProgressBarRage_C_OnDisplayPercentageOnResourceBars::bInDisplayPercentageOnResourceBars' has a wrong offset!");

// Function BP_AnimatedProgressBarRage.BP_AnimatedProgressBarRage_C.OnSetReservedValue
// 0x0004 (0x0004 - 0x0000)
struct BP_AnimatedProgressBarRage_C_OnSetReservedValue final
{
public:
	float                                         InReservedValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimatedProgressBarRage_C_OnSetReservedValue) == 0x000004, "Wrong alignment on BP_AnimatedProgressBarRage_C_OnSetReservedValue");
static_assert(sizeof(BP_AnimatedProgressBarRage_C_OnSetReservedValue) == 0x000004, "Wrong size on BP_AnimatedProgressBarRage_C_OnSetReservedValue");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_OnSetReservedValue, InReservedValue) == 0x000000, "Member 'BP_AnimatedProgressBarRage_C_OnSetReservedValue::InReservedValue' has a wrong offset!");

// Function BP_AnimatedProgressBarRage.BP_AnimatedProgressBarRage_C.OnSetNewValue
// 0x0008 (0x0008 - 0x0000)
struct BP_AnimatedProgressBarRage_C_OnSetNewValue final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHighlightChange;                                  // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bAnimate;                                          // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bNeedExtraHighlight;                               // 0x0006(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AnimatedProgressBarRage_C_OnSetNewValue) == 0x000004, "Wrong alignment on BP_AnimatedProgressBarRage_C_OnSetNewValue");
static_assert(sizeof(BP_AnimatedProgressBarRage_C_OnSetNewValue) == 0x000008, "Wrong size on BP_AnimatedProgressBarRage_C_OnSetNewValue");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_OnSetNewValue, NewValue) == 0x000000, "Member 'BP_AnimatedProgressBarRage_C_OnSetNewValue::NewValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_OnSetNewValue, bHighlightChange) == 0x000004, "Member 'BP_AnimatedProgressBarRage_C_OnSetNewValue::bHighlightChange' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_OnSetNewValue, bAnimate) == 0x000005, "Member 'BP_AnimatedProgressBarRage_C_OnSetNewValue::bAnimate' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_OnSetNewValue, bNeedExtraHighlight) == 0x000006, "Member 'BP_AnimatedProgressBarRage_C_OnSetNewValue::bNeedExtraHighlight' has a wrong offset!");

// Function BP_AnimatedProgressBarRage.BP_AnimatedProgressBarRage_C.OnSetNewMinMax
// 0x0010 (0x0010 - 0x0000)
struct BP_AnimatedProgressBarRage_C_OnSetNewMinMax final
{
public:
	float                                         NewMin;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewMax;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LengthRatio;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAnimate;                                          // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AnimatedProgressBarRage_C_OnSetNewMinMax) == 0x000004, "Wrong alignment on BP_AnimatedProgressBarRage_C_OnSetNewMinMax");
static_assert(sizeof(BP_AnimatedProgressBarRage_C_OnSetNewMinMax) == 0x000010, "Wrong size on BP_AnimatedProgressBarRage_C_OnSetNewMinMax");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_OnSetNewMinMax, NewMin) == 0x000000, "Member 'BP_AnimatedProgressBarRage_C_OnSetNewMinMax::NewMin' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_OnSetNewMinMax, NewMax) == 0x000004, "Member 'BP_AnimatedProgressBarRage_C_OnSetNewMinMax::NewMax' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_OnSetNewMinMax, LengthRatio) == 0x000008, "Member 'BP_AnimatedProgressBarRage_C_OnSetNewMinMax::LengthRatio' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_OnSetNewMinMax, bAnimate) == 0x00000C, "Member 'BP_AnimatedProgressBarRage_C_OnSetNewMinMax::bAnimate' has a wrong offset!");

// Function BP_AnimatedProgressBarRage.BP_AnimatedProgressBarRage_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_AnimatedProgressBarRage_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AnimatedProgressBarRage_C_PreConstruct) == 0x000001, "Wrong alignment on BP_AnimatedProgressBarRage_C_PreConstruct");
static_assert(sizeof(BP_AnimatedProgressBarRage_C_PreConstruct) == 0x000001, "Wrong size on BP_AnimatedProgressBarRage_C_PreConstruct");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_AnimatedProgressBarRage_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_AnimatedProgressBarRage.BP_AnimatedProgressBarRage_C.SetNewValue
// 0x0040 (0x0040 - 0x0000)
struct BP_AnimatedProgressBarRage_C_SetNewValue final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HighlightChange_0;                                 // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Animate;                                           // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Restore;                                           // 0x0006(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          isDecrease;                                        // 0x0007(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_NormalizeToRange_ReturnValue;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimatedProgressBarRage_C_SetNewValue) == 0x000004, "Wrong alignment on BP_AnimatedProgressBarRage_C_SetNewValue");
static_assert(sizeof(BP_AnimatedProgressBarRage_C_SetNewValue) == 0x000040, "Wrong size on BP_AnimatedProgressBarRage_C_SetNewValue");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetNewValue, NewValue) == 0x000000, "Member 'BP_AnimatedProgressBarRage_C_SetNewValue::NewValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetNewValue, HighlightChange_0) == 0x000004, "Member 'BP_AnimatedProgressBarRage_C_SetNewValue::HighlightChange_0' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetNewValue, Animate) == 0x000005, "Member 'BP_AnimatedProgressBarRage_C_SetNewValue::Animate' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetNewValue, Restore) == 0x000006, "Member 'BP_AnimatedProgressBarRage_C_SetNewValue::Restore' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetNewValue, isDecrease) == 0x000007, "Member 'BP_AnimatedProgressBarRage_C_SetNewValue::isDecrease' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetNewValue, Temp_bool_Variable) == 0x000008, "Member 'BP_AnimatedProgressBarRage_C_SetNewValue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetNewValue, Temp_float_Variable) == 0x00000C, "Member 'BP_AnimatedProgressBarRage_C_SetNewValue::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetNewValue, Temp_float_Variable_1) == 0x000010, "Member 'BP_AnimatedProgressBarRage_C_SetNewValue::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetNewValue, K2Node_Select_Default) == 0x000014, "Member 'BP_AnimatedProgressBarRage_C_SetNewValue::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetNewValue, CallFunc_Less_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_AnimatedProgressBarRage_C_SetNewValue::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetNewValue, CallFunc_BooleanOR_ReturnValue) == 0x000019, "Member 'BP_AnimatedProgressBarRage_C_SetNewValue::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetNewValue, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00001C, "Member 'BP_AnimatedProgressBarRage_C_SetNewValue::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetNewValue, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_AnimatedProgressBarRage_C_SetNewValue::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetNewValue, CallFunc_Abs_ReturnValue) == 0x000024, "Member 'BP_AnimatedProgressBarRage_C_SetNewValue::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetNewValue, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000028, "Member 'BP_AnimatedProgressBarRage_C_SetNewValue::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetNewValue, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00002C, "Member 'BP_AnimatedProgressBarRage_C_SetNewValue::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetNewValue, CallFunc_MakeVector2D_ReturnValue) == 0x000030, "Member 'BP_AnimatedProgressBarRage_C_SetNewValue::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetNewValue, CallFunc_BooleanAND_ReturnValue) == 0x000038, "Member 'BP_AnimatedProgressBarRage_C_SetNewValue::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetNewValue, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x000039, "Member 'BP_AnimatedProgressBarRage_C_SetNewValue::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetNewValue, CallFunc_NormalizeToRange_ReturnValue) == 0x00003C, "Member 'BP_AnimatedProgressBarRage_C_SetNewValue::CallFunc_NormalizeToRange_ReturnValue' has a wrong offset!");

// Function BP_AnimatedProgressBarRage.BP_AnimatedProgressBarRage_C.UpdateHighlight
// 0x001C (0x001C - 0x0000)
struct BP_AnimatedProgressBarRage_C_UpdateHighlight final
{
public:
	float                                         CurrentPercent_0;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewPercent;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimatedProgressBarRage_C_UpdateHighlight) == 0x000004, "Wrong alignment on BP_AnimatedProgressBarRage_C_UpdateHighlight");
static_assert(sizeof(BP_AnimatedProgressBarRage_C_UpdateHighlight) == 0x00001C, "Wrong size on BP_AnimatedProgressBarRage_C_UpdateHighlight");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_UpdateHighlight, CurrentPercent_0) == 0x000000, "Member 'BP_AnimatedProgressBarRage_C_UpdateHighlight::CurrentPercent_0' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_UpdateHighlight, NewPercent) == 0x000004, "Member 'BP_AnimatedProgressBarRage_C_UpdateHighlight::NewPercent' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_UpdateHighlight, Temp_bool_Variable) == 0x000008, "Member 'BP_AnimatedProgressBarRage_C_UpdateHighlight::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_UpdateHighlight, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_AnimatedProgressBarRage_C_UpdateHighlight::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_UpdateHighlight, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_AnimatedProgressBarRage_C_UpdateHighlight::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_UpdateHighlight, Temp_float_Variable) == 0x000014, "Member 'BP_AnimatedProgressBarRage_C_UpdateHighlight::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_UpdateHighlight, K2Node_Select_Default) == 0x000018, "Member 'BP_AnimatedProgressBarRage_C_UpdateHighlight::K2Node_Select_Default' has a wrong offset!");

// Function BP_AnimatedProgressBarRage.BP_AnimatedProgressBarRage_C.TestWithRandom
// 0x0004 (0x0004 - 0x0000)
struct BP_AnimatedProgressBarRage_C_TestWithRandom final
{
public:
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimatedProgressBarRage_C_TestWithRandom) == 0x000004, "Wrong alignment on BP_AnimatedProgressBarRage_C_TestWithRandom");
static_assert(sizeof(BP_AnimatedProgressBarRage_C_TestWithRandom) == 0x000004, "Wrong size on BP_AnimatedProgressBarRage_C_TestWithRandom");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_TestWithRandom, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'BP_AnimatedProgressBarRage_C_TestWithRandom::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");

// Function BP_AnimatedProgressBarRage.BP_AnimatedProgressBarRage_C.SetNewMinMax
// 0x0010 (0x0010 - 0x0000)
struct BP_AnimatedProgressBarRage_C_SetNewMinMax final
{
public:
	float                                         NewMin;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewMax;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LengthRatio;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Animate_;                                          // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AnimatedProgressBarRage_C_SetNewMinMax) == 0x000004, "Wrong alignment on BP_AnimatedProgressBarRage_C_SetNewMinMax");
static_assert(sizeof(BP_AnimatedProgressBarRage_C_SetNewMinMax) == 0x000010, "Wrong size on BP_AnimatedProgressBarRage_C_SetNewMinMax");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetNewMinMax, NewMin) == 0x000000, "Member 'BP_AnimatedProgressBarRage_C_SetNewMinMax::NewMin' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetNewMinMax, NewMax) == 0x000004, "Member 'BP_AnimatedProgressBarRage_C_SetNewMinMax::NewMax' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetNewMinMax, LengthRatio) == 0x000008, "Member 'BP_AnimatedProgressBarRage_C_SetNewMinMax::LengthRatio' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetNewMinMax, Animate_) == 0x00000C, "Member 'BP_AnimatedProgressBarRage_C_SetNewMinMax::Animate_' has a wrong offset!");

// Function BP_AnimatedProgressBarRage.BP_AnimatedProgressBarRage_C.AnimateBar
// 0x0028 (0x0028 - 0x0000)
struct BP_AnimatedProgressBarRage_C_AnimateBar final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_Constant_ReturnValue;           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimatedProgressBarRage_C_AnimateBar) == 0x000004, "Wrong alignment on BP_AnimatedProgressBarRage_C_AnimateBar");
static_assert(sizeof(BP_AnimatedProgressBarRage_C_AnimateBar) == 0x000028, "Wrong size on BP_AnimatedProgressBarRage_C_AnimateBar");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_AnimateBar, InDeltaTime) == 0x000000, "Member 'BP_AnimatedProgressBarRage_C_AnimateBar::InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_AnimateBar, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_AnimatedProgressBarRage_C_AnimateBar::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_AnimateBar, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_AnimatedProgressBarRage_C_AnimateBar::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_AnimateBar, CallFunc_MakeVector2D_ReturnValue) == 0x00000C, "Member 'BP_AnimatedProgressBarRage_C_AnimateBar::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_AnimateBar, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_AnimatedProgressBarRage_C_AnimateBar::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_AnimateBar, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000018, "Member 'BP_AnimatedProgressBarRage_C_AnimateBar::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_AnimateBar, CallFunc_Abs_ReturnValue) == 0x00001C, "Member 'BP_AnimatedProgressBarRage_C_AnimateBar::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_AnimateBar, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000020, "Member 'BP_AnimatedProgressBarRage_C_AnimateBar::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_AnimateBar, CallFunc_FInterpTo_Constant_ReturnValue) == 0x000024, "Member 'BP_AnimatedProgressBarRage_C_AnimateBar::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");

// Function BP_AnimatedProgressBarRage.BP_AnimatedProgressBarRage_C.ResizeBar
// 0x0038 (0x0038 - 0x0000)
struct BP_AnimatedProgressBarRage_C_ResizeBar final
{
public:
	float                                         Min;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Max;                                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LengthRatio;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Animate;                                           // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimatedProgressBarRage_C_ResizeBar) == 0x000008, "Wrong alignment on BP_AnimatedProgressBarRage_C_ResizeBar");
static_assert(sizeof(BP_AnimatedProgressBarRage_C_ResizeBar) == 0x000038, "Wrong size on BP_AnimatedProgressBarRage_C_ResizeBar");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ResizeBar, Min) == 0x000000, "Member 'BP_AnimatedProgressBarRage_C_ResizeBar::Min' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ResizeBar, Max) == 0x000004, "Member 'BP_AnimatedProgressBarRage_C_ResizeBar::Max' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ResizeBar, LengthRatio) == 0x000008, "Member 'BP_AnimatedProgressBarRage_C_ResizeBar::LengthRatio' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ResizeBar, Animate) == 0x00000C, "Member 'BP_AnimatedProgressBarRage_C_ResizeBar::Animate' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ResizeBar, Temp_bool_Variable) == 0x00000D, "Member 'BP_AnimatedProgressBarRage_C_ResizeBar::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ResizeBar, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_AnimatedProgressBarRage_C_ResizeBar::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ResizeBar, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_AnimatedProgressBarRage_C_ResizeBar::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ResizeBar, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000018, "Member 'BP_AnimatedProgressBarRage_C_ResizeBar::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ResizeBar, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'BP_AnimatedProgressBarRage_C_ResizeBar::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ResizeBar, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000028, "Member 'BP_AnimatedProgressBarRage_C_ResizeBar::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ResizeBar, K2Node_Select_Default) == 0x00002C, "Member 'BP_AnimatedProgressBarRage_C_ResizeBar::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ResizeBar, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000030, "Member 'BP_AnimatedProgressBarRage_C_ResizeBar::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_AnimatedProgressBarRage.BP_AnimatedProgressBarRage_C.SetReserve
// 0x001C (0x001C - 0x0000)
struct BP_AnimatedProgressBarRage_C_SetReserve final
{
public:
	float                                         InReservedValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeToRange_ReturnValue;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimatedProgressBarRage_C_SetReserve) == 0x000004, "Wrong alignment on BP_AnimatedProgressBarRage_C_SetReserve");
static_assert(sizeof(BP_AnimatedProgressBarRage_C_SetReserve) == 0x00001C, "Wrong size on BP_AnimatedProgressBarRage_C_SetReserve");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetReserve, InReservedValue) == 0x000000, "Member 'BP_AnimatedProgressBarRage_C_SetReserve::InReservedValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetReserve, Temp_bool_Variable) == 0x000004, "Member 'BP_AnimatedProgressBarRage_C_SetReserve::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetReserve, Temp_float_Variable) == 0x000008, "Member 'BP_AnimatedProgressBarRage_C_SetReserve::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetReserve, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_AnimatedProgressBarRage_C_SetReserve::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetReserve, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_AnimatedProgressBarRage_C_SetReserve::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetReserve, CallFunc_NormalizeToRange_ReturnValue) == 0x000014, "Member 'BP_AnimatedProgressBarRage_C_SetReserve::CallFunc_NormalizeToRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_SetReserve, K2Node_Select_Default) == 0x000018, "Member 'BP_AnimatedProgressBarRage_C_SetReserve::K2Node_Select_Default' has a wrong offset!");

// Function BP_AnimatedProgressBarRage.BP_AnimatedProgressBarRage_C.RestoreHighlight
// 0x0008 (0x0008 - 0x0000)
struct BP_AnimatedProgressBarRage_C_RestoreHighlight final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimatedProgressBarRage_C_RestoreHighlight) == 0x000008, "Wrong alignment on BP_AnimatedProgressBarRage_C_RestoreHighlight");
static_assert(sizeof(BP_AnimatedProgressBarRage_C_RestoreHighlight) == 0x000008, "Wrong size on BP_AnimatedProgressBarRage_C_RestoreHighlight");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_RestoreHighlight, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'BP_AnimatedProgressBarRage_C_RestoreHighlight::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BP_AnimatedProgressBarRage.BP_AnimatedProgressBarRage_C.ToggleFull
// 0x0020 (0x0020 - 0x0000)
struct BP_AnimatedProgressBarRage_C_ToggleFull final
{
public:
	bool                                          InIsFull;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AnimatedProgressBarRage_C_ToggleFull) == 0x000008, "Wrong alignment on BP_AnimatedProgressBarRage_C_ToggleFull");
static_assert(sizeof(BP_AnimatedProgressBarRage_C_ToggleFull) == 0x000020, "Wrong size on BP_AnimatedProgressBarRage_C_ToggleFull");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ToggleFull, InIsFull) == 0x000000, "Member 'BP_AnimatedProgressBarRage_C_ToggleFull::InIsFull' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ToggleFull, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'BP_AnimatedProgressBarRage_C_ToggleFull::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ToggleFull, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'BP_AnimatedProgressBarRage_C_ToggleFull::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_ToggleFull, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000018, "Member 'BP_AnimatedProgressBarRage_C_ToggleFull::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function BP_AnimatedProgressBarRage.BP_AnimatedProgressBarRage_C.OnPaint
// 0x0030 (0x0030 - 0x0000)
struct BP_AnimatedProgressBarRage_C_OnPaint final
{
public:
	struct FPaintContext                          Context;                                           // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_AnimatedProgressBarRage_C_OnPaint) == 0x000008, "Wrong alignment on BP_AnimatedProgressBarRage_C_OnPaint");
static_assert(sizeof(BP_AnimatedProgressBarRage_C_OnPaint) == 0x000030, "Wrong size on BP_AnimatedProgressBarRage_C_OnPaint");
static_assert(offsetof(BP_AnimatedProgressBarRage_C_OnPaint, Context) == 0x000000, "Member 'BP_AnimatedProgressBarRage_C_OnPaint::Context' has a wrong offset!");

}

