#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimatedProgressBarHealth

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AnimatedProgressBarHealth.BP_AnimatedProgressBarHealth_C
// 0x00E8 (0x0390 - 0x02A8)
class UBP_AnimatedProgressBarHealth_C final : public UHUDAnimatedProgressBarUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideFullAnim;                                      // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowFullAnim;                                      // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Scale;                                             // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowHighlight;                                     // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UProgressBar*                           Bar;                                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 End;                                               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Full;                                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PercentageText;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         CurrentPercent;                                    // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DisplayPercent;                                    // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinValue;                                          // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimSpeed;                                         // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxValue;                                          // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentValue;                                      // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HighlightChange;                                   // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           HighlightColorDecrease;                            // 0x031C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               BarMaterial;                                       // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               EndMaterial;                                       // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBelowZero;                                       // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LengthRatioValue;                                  // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(float NewWidth, bool Animate)> ResizeBarFrame;                                    // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              BarSizeChange;                                     // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         DisplayValue;                                      // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxBarWidth;                                       // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         ReservedValue;                                     // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              RestoreBar;                                        // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsFull;                                            // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          RequestAnimateBar;                                 // 0x0389(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_AnimatedProgressBarHealth(int32 EntryPoint);
	void OnSetHealthBarTypeModifier(const TArray<EHealthBarTypeModifier>& InHealthBarTypeModifiers);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnSetPercentageText(const class FText& PercentageText_0);
	void OnSetReservedValue(float InReservedValue);
	void OnSetNewValue(float NewValue, bool bHighlightChange, bool bAnimate, bool bNeedExtraHighlight);
	void OnSetNewMinMax(float NewMin, float NewMax, float LengthRatio, bool bAnimate);
	void PreConstruct(bool IsDesignTime);
	void SetNewValue(float NewValue, bool HighlightChange_0, bool Animate, bool Restore);
	void UpdateHighlight(float CurrentPercent_0, float NewPercent);
	void TestWithRandom();
	void Set_New_Min_Max(float NewMin, float NewMax, float LengthRatio, bool Animate_);
	void AnimateBar(float InDeltaTime);
	void AnimateBarColor();
	void ResizeBar(float Min, float Max, float LengthRatio, bool Animate);
	void SetType();
	void SetReserve(float InReservedValue);
	void RestoreHighlight();
	void ToggleFull(bool InIsFull);
	void ToggleDamageNegate(bool InDamageNegate);

	void OnPaint(struct FPaintContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AnimatedProgressBarHealth_C">();
	}
	static class UBP_AnimatedProgressBarHealth_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AnimatedProgressBarHealth_C>();
	}
};
static_assert(alignof(UBP_AnimatedProgressBarHealth_C) == 0x000008, "Wrong alignment on UBP_AnimatedProgressBarHealth_C");
static_assert(sizeof(UBP_AnimatedProgressBarHealth_C) == 0x000390, "Wrong size on UBP_AnimatedProgressBarHealth_C");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, UberGraphFrame) == 0x0002A8, "Member 'UBP_AnimatedProgressBarHealth_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, HideFullAnim) == 0x0002B0, "Member 'UBP_AnimatedProgressBarHealth_C::HideFullAnim' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, ShowFullAnim) == 0x0002B8, "Member 'UBP_AnimatedProgressBarHealth_C::ShowFullAnim' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, Scale) == 0x0002C0, "Member 'UBP_AnimatedProgressBarHealth_C::Scale' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, ShowHighlight) == 0x0002C8, "Member 'UBP_AnimatedProgressBarHealth_C::ShowHighlight' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, Bar) == 0x0002D0, "Member 'UBP_AnimatedProgressBarHealth_C::Bar' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, End) == 0x0002D8, "Member 'UBP_AnimatedProgressBarHealth_C::End' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, Full) == 0x0002E0, "Member 'UBP_AnimatedProgressBarHealth_C::Full' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, Overlay_0) == 0x0002E8, "Member 'UBP_AnimatedProgressBarHealth_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, PercentageText) == 0x0002F0, "Member 'UBP_AnimatedProgressBarHealth_C::PercentageText' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, SizeBox) == 0x0002F8, "Member 'UBP_AnimatedProgressBarHealth_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, CurrentPercent) == 0x000300, "Member 'UBP_AnimatedProgressBarHealth_C::CurrentPercent' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, DisplayPercent) == 0x000304, "Member 'UBP_AnimatedProgressBarHealth_C::DisplayPercent' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, MinValue) == 0x000308, "Member 'UBP_AnimatedProgressBarHealth_C::MinValue' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, AnimSpeed) == 0x00030C, "Member 'UBP_AnimatedProgressBarHealth_C::AnimSpeed' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, MaxValue) == 0x000310, "Member 'UBP_AnimatedProgressBarHealth_C::MaxValue' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, CurrentValue) == 0x000314, "Member 'UBP_AnimatedProgressBarHealth_C::CurrentValue' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, HighlightChange) == 0x000318, "Member 'UBP_AnimatedProgressBarHealth_C::HighlightChange' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, HighlightColorDecrease) == 0x00031C, "Member 'UBP_AnimatedProgressBarHealth_C::HighlightColorDecrease' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, BarMaterial) == 0x000330, "Member 'UBP_AnimatedProgressBarHealth_C::BarMaterial' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, EndMaterial) == 0x000338, "Member 'UBP_AnimatedProgressBarHealth_C::EndMaterial' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, IsBelowZero) == 0x000340, "Member 'UBP_AnimatedProgressBarHealth_C::IsBelowZero' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, LengthRatioValue) == 0x000344, "Member 'UBP_AnimatedProgressBarHealth_C::LengthRatioValue' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, ResizeBarFrame) == 0x000348, "Member 'UBP_AnimatedProgressBarHealth_C::ResizeBarFrame' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, BarSizeChange) == 0x000358, "Member 'UBP_AnimatedProgressBarHealth_C::BarSizeChange' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, DisplayValue) == 0x000368, "Member 'UBP_AnimatedProgressBarHealth_C::DisplayValue' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, MaxBarWidth) == 0x00036C, "Member 'UBP_AnimatedProgressBarHealth_C::MaxBarWidth' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, ReservedValue) == 0x000370, "Member 'UBP_AnimatedProgressBarHealth_C::ReservedValue' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, RestoreBar) == 0x000378, "Member 'UBP_AnimatedProgressBarHealth_C::RestoreBar' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, IsFull) == 0x000388, "Member 'UBP_AnimatedProgressBarHealth_C::IsFull' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBarHealth_C, RequestAnimateBar) == 0x000389, "Member 'UBP_AnimatedProgressBarHealth_C::RequestAnimateBar' has a wrong offset!");

}

