#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AstralGuardiansWaveOfLightImpact_VisualEntity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AstralGuardiansWaveOfLightImpact_VisualEntity.BP_AstralGuardiansWaveOfLightImpact_VisualEntity_C.ExecuteUbergraph_BP_AstralGuardiansWaveOfLightImpact_VisualEntity
// 0x0030 (0x0030 - 0x0000)
struct BP_AstralGuardiansWaveOfLightImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansWaveOfLightImpact_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AExplodingOrbActor*                     K2Node_DynamicCast_AsExploding_Orb_Actor;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AstralGuardiansWaveOfLightImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansWaveOfLightImpact_VisualEntity) == 0x000008, "Wrong alignment on BP_AstralGuardiansWaveOfLightImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansWaveOfLightImpact_VisualEntity");
static_assert(sizeof(BP_AstralGuardiansWaveOfLightImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansWaveOfLightImpact_VisualEntity) == 0x000030, "Wrong size on BP_AstralGuardiansWaveOfLightImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansWaveOfLightImpact_VisualEntity");
static_assert(offsetof(BP_AstralGuardiansWaveOfLightImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansWaveOfLightImpact_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_AstralGuardiansWaveOfLightImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansWaveOfLightImpact_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AstralGuardiansWaveOfLightImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansWaveOfLightImpact_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AstralGuardiansWaveOfLightImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansWaveOfLightImpact_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AstralGuardiansWaveOfLightImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansWaveOfLightImpact_VisualEntity, K2Node_DynamicCast_AsExploding_Orb_Actor) == 0x000010, "Member 'BP_AstralGuardiansWaveOfLightImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansWaveOfLightImpact_VisualEntity::K2Node_DynamicCast_AsExploding_Orb_Actor' has a wrong offset!");
static_assert(offsetof(BP_AstralGuardiansWaveOfLightImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansWaveOfLightImpact_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AstralGuardiansWaveOfLightImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansWaveOfLightImpact_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AstralGuardiansWaveOfLightImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansWaveOfLightImpact_VisualEntity, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00001C, "Member 'BP_AstralGuardiansWaveOfLightImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansWaveOfLightImpact_VisualEntity::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AstralGuardiansWaveOfLightImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansWaveOfLightImpact_VisualEntity, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000020, "Member 'BP_AstralGuardiansWaveOfLightImpact_VisualEntity_C_ExecuteUbergraph_BP_AstralGuardiansWaveOfLightImpact_VisualEntity::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");

}

