#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ArbitersFuryCharge_VE

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ArbitersFuryCharge_VE.BP_ArbitersFuryCharge_VE_C.ExecuteUbergraph_BP_ArbitersFuryCharge_VE
// 0x00F8 (0x00F8 - 0x0000)
struct BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHeroBase*                              K2Node_DynamicCast_AsHero_Base;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x002C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetVirtualChargeRate_ReturnValue;         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UArbitersFuryAbility*                   K2Node_DynamicCast_AsArbiters_Fury_Ability;        // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE) == 0x000008, "Wrong alignment on BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE");
static_assert(sizeof(BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE) == 0x0000F8, "Wrong size on BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE");
static_assert(offsetof(BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE, EntryPoint) == 0x000000, "Member 'BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE, K2Node_DynamicCast_AsHero_Base) == 0x000010, "Member 'BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE::K2Node_DynamicCast_AsHero_Base' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE, CallFunc_GetSocketLocation_ReturnValue) == 0x000020, "Member 'BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x00002C, "Member 'BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0000B4, "Member 'BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x0000B8, "Member 'BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE, CallFunc_GetVirtualChargeRate_ReturnValue) == 0x0000C0, "Member 'BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE::CallFunc_GetVirtualChargeRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE, K2Node_DynamicCast_AsCharacter_Base) == 0x0000C8, "Member 'BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE, CallFunc_FClamp_ReturnValue) == 0x0000D4, "Member 'BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE, CallFunc_GetAbilityController_ReturnValue) == 0x0000D8, "Member 'BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x0000E0, "Member 'BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE, K2Node_DynamicCast_AsArbiters_Fury_Ability) == 0x0000E8, "Member 'BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE::K2Node_DynamicCast_AsArbiters_Fury_Ability' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE, K2Node_DynamicCast_bSuccess_2) == 0x0000F0, "Member 'BP_ArbitersFuryCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryCharge_VE::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BP_ArbitersFuryCharge_VE.BP_ArbitersFuryCharge_VE_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ArbitersFuryCharge_VE_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArbitersFuryCharge_VE_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ArbitersFuryCharge_VE_C_ReceiveTick");
static_assert(sizeof(BP_ArbitersFuryCharge_VE_C_ReceiveTick) == 0x000004, "Wrong size on BP_ArbitersFuryCharge_VE_C_ReceiveTick");
static_assert(offsetof(BP_ArbitersFuryCharge_VE_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ArbitersFuryCharge_VE_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

