#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimatedProgressBarVendorXPNew

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_AnimatedProgressBarVendorXPNew.BP_AnimatedProgressBarVendorXPNew_C.ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew
// 0x005C (0x005C - 0x0000)
struct BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_NewMin;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewMax;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_LengthRatio;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAnimate_1;                           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_NewValue;                             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHighlightChange;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bAnimate;                             // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bNeedExtraHighlight;                  // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew) == 0x000004, "Wrong alignment on BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew");
static_assert(sizeof(BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew) == 0x00005C, "Wrong size on BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew, EntryPoint) == 0x000000, "Member 'BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew, K2Node_Event_MyGeometry) == 0x000004, "Member 'BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew, K2Node_Event_IsDesignTime) == 0x000040, "Member 'BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew, K2Node_Event_NewMin) == 0x000044, "Member 'BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew::K2Node_Event_NewMin' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew, K2Node_Event_NewMax) == 0x000048, "Member 'BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew::K2Node_Event_NewMax' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew, K2Node_Event_LengthRatio) == 0x00004C, "Member 'BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew::K2Node_Event_LengthRatio' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew, K2Node_Event_bAnimate_1) == 0x000050, "Member 'BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew::K2Node_Event_bAnimate_1' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew, K2Node_Event_NewValue) == 0x000054, "Member 'BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew::K2Node_Event_NewValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew, K2Node_Event_bHighlightChange) == 0x000058, "Member 'BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew::K2Node_Event_bHighlightChange' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew, K2Node_Event_bAnimate) == 0x000059, "Member 'BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew::K2Node_Event_bAnimate' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew, K2Node_Event_bNeedExtraHighlight) == 0x00005A, "Member 'BP_AnimatedProgressBarVendorXPNew_C_ExecuteUbergraph_BP_AnimatedProgressBarVendorXPNew::K2Node_Event_bNeedExtraHighlight' has a wrong offset!");

// Function BP_AnimatedProgressBarVendorXPNew.BP_AnimatedProgressBarVendorXPNew_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_AnimatedProgressBarVendorXPNew_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimatedProgressBarVendorXPNew_C_Tick) == 0x000004, "Wrong alignment on BP_AnimatedProgressBarVendorXPNew_C_Tick");
static_assert(sizeof(BP_AnimatedProgressBarVendorXPNew_C_Tick) == 0x00003C, "Wrong size on BP_AnimatedProgressBarVendorXPNew_C_Tick");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_Tick, MyGeometry) == 0x000000, "Member 'BP_AnimatedProgressBarVendorXPNew_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_AnimatedProgressBarVendorXPNew_C_Tick::InDeltaTime' has a wrong offset!");

// Function BP_AnimatedProgressBarVendorXPNew.BP_AnimatedProgressBarVendorXPNew_C.OnSetNewValue
// 0x0008 (0x0008 - 0x0000)
struct BP_AnimatedProgressBarVendorXPNew_C_OnSetNewValue final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHighlightChange;                                  // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bAnimate;                                          // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bNeedExtraHighlight;                               // 0x0006(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AnimatedProgressBarVendorXPNew_C_OnSetNewValue) == 0x000004, "Wrong alignment on BP_AnimatedProgressBarVendorXPNew_C_OnSetNewValue");
static_assert(sizeof(BP_AnimatedProgressBarVendorXPNew_C_OnSetNewValue) == 0x000008, "Wrong size on BP_AnimatedProgressBarVendorXPNew_C_OnSetNewValue");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_OnSetNewValue, NewValue) == 0x000000, "Member 'BP_AnimatedProgressBarVendorXPNew_C_OnSetNewValue::NewValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_OnSetNewValue, bHighlightChange) == 0x000004, "Member 'BP_AnimatedProgressBarVendorXPNew_C_OnSetNewValue::bHighlightChange' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_OnSetNewValue, bAnimate) == 0x000005, "Member 'BP_AnimatedProgressBarVendorXPNew_C_OnSetNewValue::bAnimate' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_OnSetNewValue, bNeedExtraHighlight) == 0x000006, "Member 'BP_AnimatedProgressBarVendorXPNew_C_OnSetNewValue::bNeedExtraHighlight' has a wrong offset!");

// Function BP_AnimatedProgressBarVendorXPNew.BP_AnimatedProgressBarVendorXPNew_C.OnSetNewMinMax
// 0x0010 (0x0010 - 0x0000)
struct BP_AnimatedProgressBarVendorXPNew_C_OnSetNewMinMax final
{
public:
	float                                         NewMin;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewMax;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LengthRatio;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAnimate;                                          // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AnimatedProgressBarVendorXPNew_C_OnSetNewMinMax) == 0x000004, "Wrong alignment on BP_AnimatedProgressBarVendorXPNew_C_OnSetNewMinMax");
static_assert(sizeof(BP_AnimatedProgressBarVendorXPNew_C_OnSetNewMinMax) == 0x000010, "Wrong size on BP_AnimatedProgressBarVendorXPNew_C_OnSetNewMinMax");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_OnSetNewMinMax, NewMin) == 0x000000, "Member 'BP_AnimatedProgressBarVendorXPNew_C_OnSetNewMinMax::NewMin' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_OnSetNewMinMax, NewMax) == 0x000004, "Member 'BP_AnimatedProgressBarVendorXPNew_C_OnSetNewMinMax::NewMax' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_OnSetNewMinMax, LengthRatio) == 0x000008, "Member 'BP_AnimatedProgressBarVendorXPNew_C_OnSetNewMinMax::LengthRatio' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_OnSetNewMinMax, bAnimate) == 0x00000C, "Member 'BP_AnimatedProgressBarVendorXPNew_C_OnSetNewMinMax::bAnimate' has a wrong offset!");

// Function BP_AnimatedProgressBarVendorXPNew.BP_AnimatedProgressBarVendorXPNew_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_AnimatedProgressBarVendorXPNew_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AnimatedProgressBarVendorXPNew_C_PreConstruct) == 0x000001, "Wrong alignment on BP_AnimatedProgressBarVendorXPNew_C_PreConstruct");
static_assert(sizeof(BP_AnimatedProgressBarVendorXPNew_C_PreConstruct) == 0x000001, "Wrong size on BP_AnimatedProgressBarVendorXPNew_C_PreConstruct");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_AnimatedProgressBarVendorXPNew_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_AnimatedProgressBarVendorXPNew.BP_AnimatedProgressBarVendorXPNew_C.SetNewValue
// 0x0050 (0x0050 - 0x0000)
struct BP_AnimatedProgressBarVendorXPNew_C_SetNewValue final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HighlightChange_0;                                 // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Animate;                                           // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeToRange_ReturnValue;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimatedProgressBarVendorXPNew_C_SetNewValue) == 0x000008, "Wrong alignment on BP_AnimatedProgressBarVendorXPNew_C_SetNewValue");
static_assert(sizeof(BP_AnimatedProgressBarVendorXPNew_C_SetNewValue) == 0x000050, "Wrong size on BP_AnimatedProgressBarVendorXPNew_C_SetNewValue");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_SetNewValue, NewValue) == 0x000000, "Member 'BP_AnimatedProgressBarVendorXPNew_C_SetNewValue::NewValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_SetNewValue, HighlightChange_0) == 0x000004, "Member 'BP_AnimatedProgressBarVendorXPNew_C_SetNewValue::HighlightChange_0' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_SetNewValue, Animate) == 0x000005, "Member 'BP_AnimatedProgressBarVendorXPNew_C_SetNewValue::Animate' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_SetNewValue, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'BP_AnimatedProgressBarVendorXPNew_C_SetNewValue::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_SetNewValue, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_AnimatedProgressBarVendorXPNew_C_SetNewValue::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_SetNewValue, CallFunc_FClamp_ReturnValue) == 0x000014, "Member 'BP_AnimatedProgressBarVendorXPNew_C_SetNewValue::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_SetNewValue, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000018, "Member 'BP_AnimatedProgressBarVendorXPNew_C_SetNewValue::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_SetNewValue, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00001C, "Member 'BP_AnimatedProgressBarVendorXPNew_C_SetNewValue::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_SetNewValue, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000020, "Member 'BP_AnimatedProgressBarVendorXPNew_C_SetNewValue::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_SetNewValue, CallFunc_Abs_ReturnValue) == 0x000024, "Member 'BP_AnimatedProgressBarVendorXPNew_C_SetNewValue::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_SetNewValue, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000028, "Member 'BP_AnimatedProgressBarVendorXPNew_C_SetNewValue::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_SetNewValue, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00002C, "Member 'BP_AnimatedProgressBarVendorXPNew_C_SetNewValue::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_SetNewValue, CallFunc_MakeVector2D_ReturnValue) == 0x000030, "Member 'BP_AnimatedProgressBarVendorXPNew_C_SetNewValue::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_SetNewValue, CallFunc_BooleanAND_ReturnValue) == 0x000038, "Member 'BP_AnimatedProgressBarVendorXPNew_C_SetNewValue::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_SetNewValue, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x00003C, "Member 'BP_AnimatedProgressBarVendorXPNew_C_SetNewValue::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_SetNewValue, CallFunc_MakeVector2D_ReturnValue_1) == 0x000040, "Member 'BP_AnimatedProgressBarVendorXPNew_C_SetNewValue::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_SetNewValue, CallFunc_NormalizeToRange_ReturnValue) == 0x000048, "Member 'BP_AnimatedProgressBarVendorXPNew_C_SetNewValue::CallFunc_NormalizeToRange_ReturnValue' has a wrong offset!");

// Function BP_AnimatedProgressBarVendorXPNew.BP_AnimatedProgressBarVendorXPNew_C.UpdateHighlight
// 0x0008 (0x0008 - 0x0000)
struct BP_AnimatedProgressBarVendorXPNew_C_UpdateHighlight final
{
public:
	float                                         CurrentPercent_0;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewPercent;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimatedProgressBarVendorXPNew_C_UpdateHighlight) == 0x000004, "Wrong alignment on BP_AnimatedProgressBarVendorXPNew_C_UpdateHighlight");
static_assert(sizeof(BP_AnimatedProgressBarVendorXPNew_C_UpdateHighlight) == 0x000008, "Wrong size on BP_AnimatedProgressBarVendorXPNew_C_UpdateHighlight");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_UpdateHighlight, CurrentPercent_0) == 0x000000, "Member 'BP_AnimatedProgressBarVendorXPNew_C_UpdateHighlight::CurrentPercent_0' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_UpdateHighlight, NewPercent) == 0x000004, "Member 'BP_AnimatedProgressBarVendorXPNew_C_UpdateHighlight::NewPercent' has a wrong offset!");

// Function BP_AnimatedProgressBarVendorXPNew.BP_AnimatedProgressBarVendorXPNew_C.TestWithRandom
// 0x0004 (0x0004 - 0x0000)
struct BP_AnimatedProgressBarVendorXPNew_C_TestWithRandom final
{
public:
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimatedProgressBarVendorXPNew_C_TestWithRandom) == 0x000004, "Wrong alignment on BP_AnimatedProgressBarVendorXPNew_C_TestWithRandom");
static_assert(sizeof(BP_AnimatedProgressBarVendorXPNew_C_TestWithRandom) == 0x000004, "Wrong size on BP_AnimatedProgressBarVendorXPNew_C_TestWithRandom");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_TestWithRandom, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'BP_AnimatedProgressBarVendorXPNew_C_TestWithRandom::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");

// Function BP_AnimatedProgressBarVendorXPNew.BP_AnimatedProgressBarVendorXPNew_C.SetNewMinMax
// 0x0010 (0x0010 - 0x0000)
struct BP_AnimatedProgressBarVendorXPNew_C_SetNewMinMax final
{
public:
	float                                         NewMin;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewMax;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LengthRatio;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Animate_;                                          // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AnimatedProgressBarVendorXPNew_C_SetNewMinMax) == 0x000004, "Wrong alignment on BP_AnimatedProgressBarVendorXPNew_C_SetNewMinMax");
static_assert(sizeof(BP_AnimatedProgressBarVendorXPNew_C_SetNewMinMax) == 0x000010, "Wrong size on BP_AnimatedProgressBarVendorXPNew_C_SetNewMinMax");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_SetNewMinMax, NewMin) == 0x000000, "Member 'BP_AnimatedProgressBarVendorXPNew_C_SetNewMinMax::NewMin' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_SetNewMinMax, NewMax) == 0x000004, "Member 'BP_AnimatedProgressBarVendorXPNew_C_SetNewMinMax::NewMax' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_SetNewMinMax, LengthRatio) == 0x000008, "Member 'BP_AnimatedProgressBarVendorXPNew_C_SetNewMinMax::LengthRatio' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_SetNewMinMax, Animate_) == 0x00000C, "Member 'BP_AnimatedProgressBarVendorXPNew_C_SetNewMinMax::Animate_' has a wrong offset!");

// Function BP_AnimatedProgressBarVendorXPNew.BP_AnimatedProgressBarVendorXPNew_C.AnimateBar
// 0x0038 (0x0038 - 0x0000)
struct BP_AnimatedProgressBarVendorXPNew_C_AnimateBar final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_Constant_ReturnValue;           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimatedProgressBarVendorXPNew_C_AnimateBar) == 0x000004, "Wrong alignment on BP_AnimatedProgressBarVendorXPNew_C_AnimateBar");
static_assert(sizeof(BP_AnimatedProgressBarVendorXPNew_C_AnimateBar) == 0x000038, "Wrong size on BP_AnimatedProgressBarVendorXPNew_C_AnimateBar");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_AnimateBar, InDeltaTime) == 0x000000, "Member 'BP_AnimatedProgressBarVendorXPNew_C_AnimateBar::InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_AnimatedProgressBarVendorXPNew_C_AnimateBar, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_AnimatedProgressBarVendorXPNew_C_AnimateBar::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
