#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ArbitersFury_VisualEntity

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ArbitersFury_VisualEntity.BP_ArbitersFury_VisualEntity_C.ExecuteUbergraph_BP_ArbitersFury_VisualEntity
// 0x01C0 (0x01C0 - 0x0000)
struct BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UArbitersFuryAbility*                   K2Node_DynamicCast_AsArbiters_Fury_Ability;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0048(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBeamDirection_ReturnValue;             // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x011C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x01A8(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity) == 0x000008, "Wrong alignment on BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity");
static_assert(sizeof(BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity) == 0x0001C0, "Wrong size on BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity");
static_assert(offsetof(BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity, Temp_delegate_Variable) == 0x000004, "Member 'BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity, CallFunc_GetAbilityController_ReturnValue) == 0x000018, "Member 'BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000028, "Member 'BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity, K2Node_DynamicCast_AsArbiters_Fury_Ability) == 0x000030, "Member 'BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity::K2Node_DynamicCast_AsArbiters_Fury_Ability' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity, CallFunc_GetSocketLocation_ReturnValue) == 0x00003C, "Member 'BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000048, "Member 'BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0000D0, "Member 'BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity, CallFunc_SelectFloat_ReturnValue) == 0x0000D4, "Member 'BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity, CallFunc_GetBeamDirection_ReturnValue) == 0x0000D8, "Member 'BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity::CallFunc_GetBeamDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0000E4, "Member 'BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0000F0, "Member 'BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0000F8, "Member 'BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity, K2Node_DynamicCast_AsCharacter_Base) == 0x000100, "Member 'BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity, K2Node_DynamicCast_bSuccess_1) == 0x000108, "Member 'BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity, CallFunc_GetSocketLocation_ReturnValue_1) == 0x00010C, "Member 'BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity, CallFunc_PostAkEvent_ReturnValue) == 0x000118, "Member 'BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity, CallFunc_K2_SetActorLocation_SweepHitResult_1) == 0x00011C, "Member 'BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity::CallFunc_K2_SetActorLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity, CallFunc_K2_SetActorLocation_ReturnValue_1) == 0x0001A4, "Member 'BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity::CallFunc_K2_SetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity, Temp_delegate_Variable_1) == 0x0001A8, "Member 'BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity, K2Node_Event_DeltaSeconds) == 0x0001B8, "Member 'BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity, CallFunc_PostAkEvent_ReturnValue_1) == 0x0001BC, "Member 'BP_ArbitersFury_VisualEntity_C_ExecuteUbergraph_BP_ArbitersFury_VisualEntity::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");

// Function BP_ArbitersFury_VisualEntity.BP_ArbitersFury_VisualEntity_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ArbitersFury_VisualEntity_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArbitersFury_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ArbitersFury_VisualEntity_C_ReceiveTick");
static_assert(sizeof(BP_ArbitersFury_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong size on BP_ArbitersFury_VisualEntity_C_ReceiveTick");
static_assert(offsetof(BP_ArbitersFury_VisualEntity_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ArbitersFury_VisualEntity_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

