#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimatedProgressbar_CreateCharacter_AttributeBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AnimatedProgressbar_CreateCharacter_AttributeBar.BP_AnimatedProgressbar_CreateCharacter_AttributeBar_C
// 0x00A8 (0x0350 - 0x02A8)
class UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C final : public UHUDAnimatedProgressBarUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UProgressBar*                           Bar;                                               // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 End;                                               // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         CurrentPercent;                                    // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DisplayPercent;                                    // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinValue;                                          // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimSpeed;                                         // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxValue;                                          // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentValue;                                      // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HighlightChange;                                   // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           HighlightColorDecrease;                            // 0x02EC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HighlightColorIncrease;                            // 0x02FC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TimerHandle;                                       // 0x0310(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TempColor;                                         // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ColorTimerHandle;                                  // 0x0328(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         LengthRatioValue;                                  // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxBarWidth;                                       // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          RequestAnimateBar;                                 // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             BarTexture;                                        // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             BarRightEdgeTexture;                               // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void InitTextures();
	void AnimateBar(float InDeltaTime);
	void SetNewMinMax(float NewMin, float NewMax, float LengthRatio, bool Animate_);
	void UpdateHighlight(float CurrentPercent_0, float NewPercent);
	void SetNewValue(float NewValue, bool HighlightChange_0, bool Animate);
	void PreConstruct(bool IsDesignTime);
	void OnSetNewMinMax(float NewMin, float NewMax, float LengthRatio, bool bAnimate);
	void OnSetNewValue(float NewValue, bool bHighlightChange, bool bAnimate, bool bNeedExtraHighlight);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ExecuteUbergraph_BP_AnimatedProgressbar_CreateCharacter_AttributeBar(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AnimatedProgressbar_CreateCharacter_AttributeBar_C">();
	}
	static class UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C>();
	}
};
static_assert(alignof(UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C) == 0x000008, "Wrong alignment on UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C");
static_assert(sizeof(UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C) == 0x000350, "Wrong size on UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C");
static_assert(offsetof(UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C, UberGraphFrame) == 0x0002A8, "Member 'UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C, Bar) == 0x0002B0, "Member 'UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C::Bar' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C, End) == 0x0002B8, "Member 'UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C::End' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C, Overlay_0) == 0x0002C0, "Member 'UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C, SizeBox) == 0x0002C8, "Member 'UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C, CurrentPercent) == 0x0002D0, "Member 'UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C::CurrentPercent' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C, DisplayPercent) == 0x0002D4, "Member 'UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C::DisplayPercent' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C, MinValue) == 0x0002D8, "Member 'UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C::MinValue' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C, AnimSpeed) == 0x0002DC, "Member 'UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C::AnimSpeed' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C, MaxValue) == 0x0002E0, "Member 'UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C::MaxValue' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C, CurrentValue) == 0x0002E4, "Member 'UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C::CurrentValue' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C, HighlightChange) == 0x0002E8, "Member 'UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C::HighlightChange' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C, HighlightColorDecrease) == 0x0002EC, "Member 'UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C::HighlightColorDecrease' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C, HighlightColorIncrease) == 0x0002FC, "Member 'UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C::HighlightColorIncrease' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C, TimerHandle) == 0x000310, "Member 'UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C::TimerHandle' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C, TempColor) == 0x000318, "Member 'UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C::TempColor' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C, ColorTimerHandle) == 0x000328, "Member 'UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C::ColorTimerHandle' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C, LengthRatioValue) == 0x000330, "Member 'UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C::LengthRatioValue' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C, MaxBarWidth) == 0x000334, "Member 'UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C::MaxBarWidth' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C, RequestAnimateBar) == 0x000338, "Member 'UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C::RequestAnimateBar' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C, BarTexture) == 0x000340, "Member 'UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C::BarTexture' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C, BarRightEdgeTexture) == 0x000348, "Member 'UBP_AnimatedProgressbar_CreateCharacter_AttributeBar_C::BarRightEdgeTexture' has a wrong offset!");

}

