#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ArbitersFuryCharge_VE

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ArbitersFuryCharge_VE.BP_ArbitersFuryCharge_VE_C
// 0x0018 (0x0368 - 0x0350)
class ABP_ArbitersFuryCharge_VE_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArbitersFuryAbility*                   Ab;                                                // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ArbitersFuryCharge_VE(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ArbitersFuryCharge_VE_C">();
	}
	static class ABP_ArbitersFuryCharge_VE_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ArbitersFuryCharge_VE_C>();
	}
};
static_assert(alignof(ABP_ArbitersFuryCharge_VE_C) == 0x000008, "Wrong alignment on ABP_ArbitersFuryCharge_VE_C");
static_assert(sizeof(ABP_ArbitersFuryCharge_VE_C) == 0x000368, "Wrong size on ABP_ArbitersFuryCharge_VE_C");
static_assert(offsetof(ABP_ArbitersFuryCharge_VE_C, UberGraphFrame) == 0x000350, "Member 'ABP_ArbitersFuryCharge_VE_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ArbitersFuryCharge_VE_C, Niagara) == 0x000358, "Member 'ABP_ArbitersFuryCharge_VE_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_ArbitersFuryCharge_VE_C, Ab) == 0x000360, "Member 'ABP_ArbitersFuryCharge_VE_C::Ab' has a wrong offset!");

}

