#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Alchemist_Cat

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Alchemist_Cat.BP_Alchemist_Cat_C
// 0x0028 (0x0250 - 0x0228)
class ABP_Alchemist_Cat_C final : public AActor
{
public:
	class UAkComponent*                           AkComponent;                                       // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Crow_Anim_C*                        Crow_Anim;                                         // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Idle_Bridge_Chance;                                // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Idle_Bridge_Start_Timer;                           // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Direction;                                         // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Alchemist_Cat_C">();
	}
	static class ABP_Alchemist_Cat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Alchemist_Cat_C>();
	}
};
static_assert(alignof(ABP_Alchemist_Cat_C) == 0x000008, "Wrong alignment on ABP_Alchemist_Cat_C");
static_assert(sizeof(ABP_Alchemist_Cat_C) == 0x000250, "Wrong size on ABP_Alchemist_Cat_C");
static_assert(offsetof(ABP_Alchemist_Cat_C, AkComponent) == 0x000228, "Member 'ABP_Alchemist_Cat_C::AkComponent' has a wrong offset!");
static_assert(offsetof(ABP_Alchemist_Cat_C, SkeletalMesh) == 0x000230, "Member 'ABP_Alchemist_Cat_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_Alchemist_Cat_C, Crow_Anim) == 0x000238, "Member 'ABP_Alchemist_Cat_C::Crow_Anim' has a wrong offset!");
static_assert(offsetof(ABP_Alchemist_Cat_C, Idle_Bridge_Chance) == 0x000240, "Member 'ABP_Alchemist_Cat_C::Idle_Bridge_Chance' has a wrong offset!");
static_assert(offsetof(ABP_Alchemist_Cat_C, Idle_Bridge_Start_Timer) == 0x000244, "Member 'ABP_Alchemist_Cat_C::Idle_Bridge_Start_Timer' has a wrong offset!");
static_assert(offsetof(ABP_Alchemist_Cat_C, Direction) == 0x000248, "Member 'ABP_Alchemist_Cat_C::Direction' has a wrong offset!");

}

