#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ArbitersFuryMaxCharge_VE

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ArbitersFuryMaxCharge_VE.BP_ArbitersFuryMaxCharge_VE_C.ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE
// 0x0108 (0x0108 - 0x0000)
struct BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBeamDirection_ReturnValue;             // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0048(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base_1;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UArbitersFuryAbility*                   K2Node_DynamicCast_AsArbiters_Fury_Ability;        // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE) == 0x000008, "Wrong alignment on BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE");
static_assert(sizeof(BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE) == 0x000108, "Wrong size on BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE");
static_assert(offsetof(BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE, EntryPoint) == 0x000000, "Member 'BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE, CallFunc_GetBeamDirection_ReturnValue) == 0x000004, "Member 'BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE::CallFunc_GetBeamDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000010, "Member 'BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000018, "Member 'BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE, K2Node_DynamicCast_AsCharacter_Base) == 0x000028, "Member 'BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000031, "Member 'BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE, CallFunc_GetSocketLocation_ReturnValue) == 0x000034, "Member 'BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x000040, "Member 'BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000048, "Member 'BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0000D0, "Member 'BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE, K2Node_DynamicCast_AsCharacter_Base_1) == 0x0000D8, "Member 'BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE::K2Node_DynamicCast_AsCharacter_Base_1' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE, K2Node_Event_DeltaSeconds) == 0x0000E4, "Member 'BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE, CallFunc_GetAbilityController_ReturnValue) == 0x0000E8, "Member 'BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x0000F0, "Member 'BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE, K2Node_DynamicCast_AsArbiters_Fury_Ability) == 0x0000F8, "Member 'BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE::K2Node_DynamicCast_AsArbiters_Fury_Ability' has a wrong offset!");
static_assert(offsetof(BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE, K2Node_DynamicCast_bSuccess_2) == 0x000100, "Member 'BP_ArbitersFuryMaxCharge_VE_C_ExecuteUbergraph_BP_ArbitersFuryMaxCharge_VE::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BP_ArbitersFuryMaxCharge_VE.BP_ArbitersFuryMaxCharge_VE_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ArbitersFuryMaxCharge_VE_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArbitersFuryMaxCharge_VE_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ArbitersFuryMaxCharge_VE_C_ReceiveTick");
static_assert(sizeof(BP_ArbitersFuryMaxCharge_VE_C_ReceiveTick) == 0x000004, "Wrong size on BP_ArbitersFuryMaxCharge_VE_C_ReceiveTick");
static_assert(offsetof(BP_ArbitersFuryMaxCharge_VE_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ArbitersFuryMaxCharge_VE_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

