#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimatedProgressBar_HeavyAttack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AnimatedProgressBar_HeavyAttack.BP_AnimatedProgressBar_HeavyAttack_C
// 0x00B0 (0x0358 - 0x02A8)
class UBP_AnimatedProgressBar_HeavyAttack_C final : public UHUDAnimatedProgressBarUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UProgressBar*                           Bar;                                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 End;                                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               EndSizeBox;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Normal;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MaxDamagePoint;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         CurrentPercent;                                    // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DisplayPercent;                                    // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinValue;                                          // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimSpeed;                                         // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxValue;                                          // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentValue;                                      // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HighlightChange;                                   // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           HighlightColorDecrease;                            // 0x0314(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               BarMaterial;                                       // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBelowZero;                                       // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LengthRatioValue;                                  // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(float NewWidth, bool Animate)> ResizeBarFrame;                                    // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Visible;                                           // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxDamagePointValue;                               // 0x034C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          RequestAnimateBar;                                 // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_AnimatedProgressBar_HeavyAttack(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnSetNewValue(float NewValue, bool bHighlightChange, bool bAnimate, bool bNeedExtraHighlight);
	void OnSetNewMinMax(float NewMin, float NewMax, float LengthRatio, bool bAnimate);
	void PreConstruct(bool IsDesignTime);
	void SetNewValue(float NewValue, bool HighlightChange_0, bool Animate);
	void UpdateHighlight(float CurrentPercent_0, float NewPercent);
	void TestWithRandom();
	void SetNewMinMax(float NewMin, float NewMax, bool Animate_);
	void AnimateBar(float InDeltaTime);
	void AnimateBarColor();
	void FadeIn();
	void FadeOut();
	void SetMaxDamagePoint(float InMaxDamagePoint);

	void OnPaint(struct FPaintContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AnimatedProgressBar_HeavyAttack_C">();
	}
	static class UBP_AnimatedProgressBar_HeavyAttack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AnimatedProgressBar_HeavyAttack_C>();
	}
};
static_assert(alignof(UBP_AnimatedProgressBar_HeavyAttack_C) == 0x000008, "Wrong alignment on UBP_AnimatedProgressBar_HeavyAttack_C");
static_assert(sizeof(UBP_AnimatedProgressBar_HeavyAttack_C) == 0x000358, "Wrong size on UBP_AnimatedProgressBar_HeavyAttack_C");
static_assert(offsetof(UBP_AnimatedProgressBar_HeavyAttack_C, UberGraphFrame) == 0x0002A8, "Member 'UBP_AnimatedProgressBar_HeavyAttack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_HeavyAttack_C, FadeOutAnim) == 0x0002B0, "Member 'UBP_AnimatedProgressBar_HeavyAttack_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_HeavyAttack_C, FadeInAnim) == 0x0002B8, "Member 'UBP_AnimatedProgressBar_HeavyAttack_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_HeavyAttack_C, Bar) == 0x0002C0, "Member 'UBP_AnimatedProgressBar_HeavyAttack_C::Bar' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_HeavyAttack_C, End) == 0x0002C8, "Member 'UBP_AnimatedProgressBar_HeavyAttack_C::End' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_HeavyAttack_C, EndSizeBox) == 0x0002D0, "Member 'UBP_AnimatedProgressBar_HeavyAttack_C::EndSizeBox' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_HeavyAttack_C, Frame_Normal) == 0x0002D8, "Member 'UBP_AnimatedProgressBar_HeavyAttack_C::Frame_Normal' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_HeavyAttack_C, MaxDamagePoint) == 0x0002E0, "Member 'UBP_AnimatedProgressBar_HeavyAttack_C::MaxDamagePoint' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_HeavyAttack_C, Overlay_0) == 0x0002E8, "Member 'UBP_AnimatedProgressBar_HeavyAttack_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_HeavyAttack_C, SizeBox) == 0x0002F0, "Member 'UBP_AnimatedProgressBar_HeavyAttack_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_HeavyAttack_C, CurrentPercent) == 0x0002F8, "Member 'UBP_AnimatedProgressBar_HeavyAttack_C::CurrentPercent' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_HeavyAttack_C, DisplayPercent) == 0x0002FC, "Member 'UBP_AnimatedProgressBar_HeavyAttack_C::DisplayPercent' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_HeavyAttack_C, MinValue) == 0x000300, "Member 'UBP_AnimatedProgressBar_HeavyAttack_C::MinValue' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_HeavyAttack_C, AnimSpeed) == 0x000304, "Member 'UBP_AnimatedProgressBar_HeavyAttack_C::AnimSpeed' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_HeavyAttack_C, MaxValue) == 0x000308, "Member 'UBP_AnimatedProgressBar_HeavyAttack_C::MaxValue' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_HeavyAttack_C, CurrentValue) == 0x00030C, "Member 'UBP_AnimatedProgressBar_HeavyAttack_C::CurrentValue' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_HeavyAttack_C, HighlightChange) == 0x000310, "Member 'UBP_AnimatedProgressBar_HeavyAttack_C::HighlightChange' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_HeavyAttack_C, HighlightColorDecrease) == 0x000314, "Member 'UBP_AnimatedProgressBar_HeavyAttack_C::HighlightColorDecrease' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_HeavyAttack_C, BarMaterial) == 0x000328, "Member 'UBP_AnimatedProgressBar_HeavyAttack_C::BarMaterial' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_HeavyAttack_C, IsBelowZero) == 0x000330, "Member 'UBP_AnimatedProgressBar_HeavyAttack_C::IsBelowZero' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_HeavyAttack_C, LengthRatioValue) == 0x000334, "Member 'UBP_AnimatedProgressBar_HeavyAttack_C::LengthRatioValue' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_HeavyAttack_C, ResizeBarFrame) == 0x000338, "Member 'UBP_AnimatedProgressBar_HeavyAttack_C::ResizeBarFrame' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_HeavyAttack_C, Visible) == 0x000348, "Member 'UBP_AnimatedProgressBar_HeavyAttack_C::Visible' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_HeavyAttack_C, MaxDamagePointValue) == 0x00034C, "Member 'UBP_AnimatedProgressBar_HeavyAttack_C::MaxDamagePointValue' has a wrong offset!");
static_assert(offsetof(UBP_AnimatedProgressBar_HeavyAttack_C, RequestAnimateBar) == 0x000350, "Member 'UBP_AnimatedProgressBar_HeavyAttack_C::RequestAnimateBar' has a wrong offset!");

}

