#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ArbitersFury_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ArbitersFury_VisualEntity.BP_ArbitersFury_VisualEntity_C
// 0x0020 (0x0370 - 0x0350)
class ABP_ArbitersFury_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         As_Character_Base_0;                               // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ArbitersFury_VisualEntity(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ArbitersFury_VisualEntity_C">();
	}
	static class ABP_ArbitersFury_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ArbitersFury_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_ArbitersFury_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_ArbitersFury_VisualEntity_C");
static_assert(sizeof(ABP_ArbitersFury_VisualEntity_C) == 0x000370, "Wrong size on ABP_ArbitersFury_VisualEntity_C");
static_assert(offsetof(ABP_ArbitersFury_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_ArbitersFury_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ArbitersFury_VisualEntity_C, Ak) == 0x000358, "Member 'ABP_ArbitersFury_VisualEntity_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_ArbitersFury_VisualEntity_C, Niagara) == 0x000360, "Member 'ABP_ArbitersFury_VisualEntity_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_ArbitersFury_VisualEntity_C, As_Character_Base_0) == 0x000368, "Member 'ABP_ArbitersFury_VisualEntity_C::As_Character_Base_0' has a wrong offset!");

}

