#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ArmorFragment

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ArmorFragment.BP_ArmorFragment_C.ExecuteUbergraph_BP_ArmorFragment
// 0x0178 (0x0178 - 0x0000)
struct BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0030(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHeroBase*                              K2Node_DynamicCast_AsHero_Base;                    // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHeroBase*                              K2Node_DynamicCast_AsHero_Base_1;                  // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue_1;       // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue_1;        // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeSinceCreation_ReturnValue;     // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment) == 0x000008, "Wrong alignment on BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment");
static_assert(sizeof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment) == 0x000178, "Wrong size on BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, EntryPoint) == 0x000000, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000004, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000010, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, K2Node_ComponentBoundEvent_OtherActor) == 0x000018, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, K2Node_ComponentBoundEvent_OtherComp) == 0x000020, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000028, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, K2Node_ComponentBoundEvent_bFromSweep) == 0x00002C, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, K2Node_ComponentBoundEvent_SweepResult) == 0x000030, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, CallFunc_PostEventAtLocation_ReturnValue) == 0x0000B8, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, K2Node_DynamicCast_AsHero_Base) == 0x0000C0, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::K2Node_DynamicCast_AsHero_Base' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, CallFunc_GetAbilityController_ReturnValue) == 0x0000D0, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x0000D8, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, K2Node_Event_DeltaSeconds) == 0x0000E0, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0000E8, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000F0, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, K2Node_DynamicCast_AsHero_Base_1) == 0x000100, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::K2Node_DynamicCast_AsHero_Base_1' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, K2Node_DynamicCast_bSuccess_1) == 0x000108, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, CallFunc_GetAbilityController_ReturnValue_1) == 0x000110, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::CallFunc_GetAbilityController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000118, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, CallFunc_BPGetAbilityByClass_ReturnValue_1) == 0x000128, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::CallFunc_BPGetAbilityByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, CallFunc_Add_VectorVector_ReturnValue) == 0x000130, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00013C, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, CallFunc_GetGameTimeSinceCreation_ReturnValue) == 0x000148, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::CallFunc_GetGameTimeSinceCreation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, CallFunc_Less_FloatFloat_ReturnValue) == 0x00014C, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, CallFunc_BreakVector_X) == 0x000150, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, CallFunc_BreakVector_Y) == 0x000154, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, CallFunc_BreakVector_Z) == 0x000158, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, CallFunc_MakeVector_ReturnValue) == 0x00015C, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000168, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, CallFunc_VSize_ReturnValue) == 0x00016C, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000170, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000171, "Member 'BP_ArmorFragment_C_ExecuteUbergraph_BP_ArmorFragment::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function BP_ArmorFragment.BP_ArmorFragment_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ArmorFragment_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArmorFragment_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ArmorFragment_C_ReceiveTick");
static_assert(sizeof(BP_ArmorFragment_C_ReceiveTick) == 0x000004, "Wrong size on BP_ArmorFragment_C_ReceiveTick");
static_assert(offsetof(BP_ArmorFragment_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ArmorFragment_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ArmorFragment.BP_ArmorFragment_C.BndEvt__BP_ArmorFragment_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_ArmorFragment_C_BndEvt__BP_ArmorFragment_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ArmorFragment_C_BndEvt__BP_ArmorFragment_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_ArmorFragment_C_BndEvt__BP_ArmorFragment_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_ArmorFragment_C_BndEvt__BP_ArmorFragment_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_ArmorFragment_C_BndEvt__BP_ArmorFragment_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_ArmorFragment_C_BndEvt__BP_ArmorFragment_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_ArmorFragment_C_BndEvt__BP_ArmorFragment_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_BndEvt__BP_ArmorFragment_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_ArmorFragment_C_BndEvt__BP_ArmorFragment_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_BndEvt__BP_ArmorFragment_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_ArmorFragment_C_BndEvt__BP_ArmorFragment_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_BndEvt__BP_ArmorFragment_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_ArmorFragment_C_BndEvt__BP_ArmorFragment_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_BndEvt__BP_ArmorFragment_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_ArmorFragment_C_BndEvt__BP_ArmorFragment_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_ArmorFragment_C_BndEvt__BP_ArmorFragment_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_ArmorFragment_C_BndEvt__BP_ArmorFragment_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

}

