#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ACtiveAbilities_UpgradesPopup

#include "Basic.hpp"

#include "man_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_ACtiveAbilities_UpgradesPopup.BP_ActiveAbilities_UpgradesPopup_C.ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup
// 0x0098 (0x0098 - 0x0000)
struct BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_AnimDuration_1;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue_1;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Description;                          // 0x0038(0x0018)(ConstParm)
	int32                                         K2Node_Event_Cost;                                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_IntToText_ReturnValue;                    // 0x0058(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_AbilityName;                          // 0x0078(0x0018)(ConstParm)
	EInputDisplay                                 K2Node_Event_InInputDisplay;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDisplay                                 K2Node_Event_InControlDisplay;                     // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup) == 0x000008, "Wrong alignment on BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup");
static_assert(sizeof(BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup) == 0x000098, "Wrong size on BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup, EntryPoint) == 0x000000, "Member 'BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup, Temp_byte_Variable) == 0x000004, "Member 'BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup, Temp_byte_Variable_1) == 0x000005, "Member 'BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup, K2Node_Event_AnimDuration_1) == 0x000008, "Member 'BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup::K2Node_Event_AnimDuration_1' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup, CallFunc_GetAnimPlaybackSpeed_ReturnValue) == 0x00000C, "Member 'BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup::CallFunc_GetAnimPlaybackSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup, K2Node_Event_AnimDuration) == 0x000010, "Member 'BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup::K2Node_Event_AnimDuration' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup, CallFunc_GetAnimPlaybackSpeed_ReturnValue_1) == 0x000020, "Member 'BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup::CallFunc_GetAnimPlaybackSpeed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup, CallFunc_PlayAnimation_ReturnValue_1) == 0x000028, "Member 'BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup, Temp_bool_Variable) == 0x000030, "Member 'BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup, K2Node_Event_Description) == 0x000038, "Member 'BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup::K2Node_Event_Description' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup, K2Node_Event_Cost) == 0x000050, "Member 'BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup::K2Node_Event_Cost' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup, CallFunc_Greater_IntInt_ReturnValue) == 0x000054, "Member 'BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup, CallFunc_IntToText_ReturnValue) == 0x000058, "Member 'BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup::CallFunc_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup, K2Node_Select_Default) == 0x000070, "Member 'BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup, K2Node_Event_AbilityName) == 0x000078, "Member 'BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup::K2Node_Event_AbilityName' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup, K2Node_Event_InInputDisplay) == 0x000090, "Member 'BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup::K2Node_Event_InInputDisplay' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup, K2Node_Event_InControlDisplay) == 0x000091, "Member 'BP_ActiveAbilities_UpgradesPopup_C_ExecuteUbergraph_BP_ActiveAbilities_UpgradesPopup::K2Node_Event_InControlDisplay' has a wrong offset!");

// Function BP_ACtiveAbilities_UpgradesPopup.BP_ActiveAbilities_UpgradesPopup_C.OnSetInputDisplay
// 0x0002 (0x0002 - 0x0000)
struct BP_ActiveAbilities_UpgradesPopup_C_OnSetInputDisplay final
{
public:
	EInputDisplay                                 InInputDisplay;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDisplay                                 InControlDisplay;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActiveAbilities_UpgradesPopup_C_OnSetInputDisplay) == 0x000001, "Wrong alignment on BP_ActiveAbilities_UpgradesPopup_C_OnSetInputDisplay");
static_assert(sizeof(BP_ActiveAbilities_UpgradesPopup_C_OnSetInputDisplay) == 0x000002, "Wrong size on BP_ActiveAbilities_UpgradesPopup_C_OnSetInputDisplay");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_OnSetInputDisplay, InInputDisplay) == 0x000000, "Member 'BP_ActiveAbilities_UpgradesPopup_C_OnSetInputDisplay::InInputDisplay' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_OnSetInputDisplay, InControlDisplay) == 0x000001, "Member 'BP_ActiveAbilities_UpgradesPopup_C_OnSetInputDisplay::InControlDisplay' has a wrong offset!");

// Function BP_ACtiveAbilities_UpgradesPopup.BP_ActiveAbilities_UpgradesPopup_C.OnSetAbilityName
// 0x0018 (0x0018 - 0x0000)
struct BP_ActiveAbilities_UpgradesPopup_C_OnSetAbilityName final
{
public:
	class FText                                   AbilityName;                                       // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_ActiveAbilities_UpgradesPopup_C_OnSetAbilityName) == 0x000008, "Wrong alignment on BP_ActiveAbilities_UpgradesPopup_C_OnSetAbilityName");
static_assert(sizeof(BP_ActiveAbilities_UpgradesPopup_C_OnSetAbilityName) == 0x000018, "Wrong size on BP_ActiveAbilities_UpgradesPopup_C_OnSetAbilityName");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_OnSetAbilityName, AbilityName) == 0x000000, "Member 'BP_ActiveAbilities_UpgradesPopup_C_OnSetAbilityName::AbilityName' has a wrong offset!");

// Function BP_ACtiveAbilities_UpgradesPopup.BP_ActiveAbilities_UpgradesPopup_C.OnUpdateUpgradeDetails
// 0x0020 (0x0020 - 0x0000)
struct BP_ActiveAbilities_UpgradesPopup_C_OnUpdateUpgradeDetails final
{
public:
	class FText                                   Description;                                       // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Cost;                                              // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActiveAbilities_UpgradesPopup_C_OnUpdateUpgradeDetails) == 0x000008, "Wrong alignment on BP_ActiveAbilities_UpgradesPopup_C_OnUpdateUpgradeDetails");
static_assert(sizeof(BP_ActiveAbilities_UpgradesPopup_C_OnUpdateUpgradeDetails) == 0x000020, "Wrong size on BP_ActiveAbilities_UpgradesPopup_C_OnUpdateUpgradeDetails");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_OnUpdateUpgradeDetails, Description) == 0x000000, "Member 'BP_ActiveAbilities_UpgradesPopup_C_OnUpdateUpgradeDetails::Description' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_OnUpdateUpgradeDetails, Cost) == 0x000018, "Member 'BP_ActiveAbilities_UpgradesPopup_C_OnUpdateUpgradeDetails::Cost' has a wrong offset!");

// Function BP_ACtiveAbilities_UpgradesPopup.BP_ActiveAbilities_UpgradesPopup_C.OnHide
// 0x0004 (0x0004 - 0x0000)
struct BP_ActiveAbilities_UpgradesPopup_C_OnHide final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActiveAbilities_UpgradesPopup_C_OnHide) == 0x000004, "Wrong alignment on BP_ActiveAbilities_UpgradesPopup_C_OnHide");
static_assert(sizeof(BP_ActiveAbilities_UpgradesPopup_C_OnHide) == 0x000004, "Wrong size on BP_ActiveAbilities_UpgradesPopup_C_OnHide");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_OnHide, AnimDuration) == 0x000000, "Member 'BP_ActiveAbilities_UpgradesPopup_C_OnHide::AnimDuration' has a wrong offset!");

// Function BP_ACtiveAbilities_UpgradesPopup.BP_ActiveAbilities_UpgradesPopup_C.OnShow
// 0x0004 (0x0004 - 0x0000)
struct BP_ActiveAbilities_UpgradesPopup_C_OnShow final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActiveAbilities_UpgradesPopup_C_OnShow) == 0x000004, "Wrong alignment on BP_ActiveAbilities_UpgradesPopup_C_OnShow");
static_assert(sizeof(BP_ActiveAbilities_UpgradesPopup_C_OnShow) == 0x000004, "Wrong size on BP_ActiveAbilities_UpgradesPopup_C_OnShow");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_OnShow, AnimDuration) == 0x000000, "Member 'BP_ActiveAbilities_UpgradesPopup_C_OnShow::AnimDuration' has a wrong offset!");

// Function BP_ACtiveAbilities_UpgradesPopup.BP_ActiveAbilities_UpgradesPopup_C.SetBtnCloseVisibility
// 0x000B (0x000B - 0x0000)
struct BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility final
{
public:
	EInputDisplay                                 Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDisplay                                 CallFunc_GetInputDisplay_ReturnValue;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility) == 0x000001, "Wrong alignment on BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility");
static_assert(sizeof(BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility) == 0x00000B, "Wrong size on BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility, Temp_byte_Variable) == 0x000000, "Member 'BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility, Temp_byte_Variable_1) == 0x000001, "Member 'BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility, Temp_byte_Variable_2) == 0x000002, "Member 'BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility, Temp_byte_Variable_3) == 0x000003, "Member 'BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility, Temp_byte_Variable_4) == 0x000004, "Member 'BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility, Temp_byte_Variable_5) == 0x000005, "Member 'BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility, Temp_byte_Variable_6) == 0x000006, "Member 'BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility, Temp_byte_Variable_7) == 0x000007, "Member 'BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility, Temp_byte_Variable_8) == 0x000008, "Member 'BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility, CallFunc_GetInputDisplay_ReturnValue) == 0x000009, "Member 'BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility::CallFunc_GetInputDisplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility, K2Node_Select_Default) == 0x00000A, "Member 'BP_ActiveAbilities_UpgradesPopup_C_SetBtnCloseVisibility::K2Node_Select_Default' has a wrong offset!");

}

