#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Alchemist

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Alchemist.BP_Alchemist_C.VisualVolumeEnter
// 0x0008 (0x0008 - 0x0000)
struct BP_Alchemist_C_VisualVolumeEnter final
{
public:
	class ALevelVisualVolume*                     Volume;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Alchemist_C_VisualVolumeEnter) == 0x000008, "Wrong alignment on BP_Alchemist_C_VisualVolumeEnter");
static_assert(sizeof(BP_Alchemist_C_VisualVolumeEnter) == 0x000008, "Wrong size on BP_Alchemist_C_VisualVolumeEnter");
static_assert(offsetof(BP_Alchemist_C_VisualVolumeEnter, Volume) == 0x000000, "Member 'BP_Alchemist_C_VisualVolumeEnter::Volume' has a wrong offset!");

// Function BP_Alchemist.BP_Alchemist_C.OnVfxEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_Alchemist_C_OnVfxEvent final
{
public:
	class FName                                   VfxEventType;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Alchemist_C_OnVfxEvent) == 0x000004, "Wrong alignment on BP_Alchemist_C_OnVfxEvent");
static_assert(sizeof(BP_Alchemist_C_OnVfxEvent) == 0x000008, "Wrong size on BP_Alchemist_C_OnVfxEvent");
static_assert(offsetof(BP_Alchemist_C_OnVfxEvent, VfxEventType) == 0x000000, "Member 'BP_Alchemist_C_OnVfxEvent::VfxEventType' has a wrong offset!");

// Function BP_Alchemist.BP_Alchemist_C.ExecuteUbergraph_BP_Alchemist
// 0x0078 (0x0078 - 0x0000)
struct BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGlobalBool_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMandragoraGameMode*                    CallFunc_GetGameMode_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelVisualVolume*                     K2Node_CustomEvent_Volume;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Alchemist_Anim_C*                   K2Node_DynamicCast_AsBP_Alchemist_Anim;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AlchemistCat_Anim_C*                K2Node_DynamicCast_AsBP_Alchemist_Cat_Anim;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ALevelVisualVolume* Volume)> K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsInCaravan_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_VfxEventType;                         // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGlobalBool_ReturnValue_1;              // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_1;       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist) == 0x000008, "Wrong alignment on BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist");
static_assert(sizeof(BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist) == 0x000078, "Wrong size on BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist");
static_assert(offsetof(BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist, EntryPoint) == 0x000000, "Member 'BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist, CallFunc_GetGlobalBool_ReturnValue) == 0x000004, "Member 'BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist::CallFunc_GetGlobalBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist, CallFunc_GetGameMode_ReturnValue) == 0x000008, "Member 'BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist, K2Node_CustomEvent_Volume) == 0x000010, "Member 'BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist::K2Node_CustomEvent_Volume' has a wrong offset!");
static_assert(offsetof(BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist, CallFunc_GetAnimInstance_ReturnValue) == 0x000018, "Member 'BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000020, "Member 'BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist, K2Node_DynamicCast_AsBP_Alchemist_Anim) == 0x000028, "Member 'BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist::K2Node_DynamicCast_AsBP_Alchemist_Anim' has a wrong offset!");
static_assert(offsetof(BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000038, "Member 'BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist, K2Node_DynamicCast_AsBP_Alchemist_Cat_Anim) == 0x000040, "Member 'BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist::K2Node_DynamicCast_AsBP_Alchemist_Cat_Anim' has a wrong offset!");
static_assert(offsetof(BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000049, "Member 'BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist, CallFunc_RandomIntegerInRange_ReturnValue) == 0x00004C, "Member 'BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist, CallFunc_IsInCaravan_ReturnValue) == 0x000060, "Member 'BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist::CallFunc_IsInCaravan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist, K2Node_Event_VfxEventType) == 0x000064, "Member 'BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist::K2Node_Event_VfxEventType' has a wrong offset!");
static_assert(offsetof(BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist, K2Node_SwitchName_CmpSuccess) == 0x00006C, "Member 'BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist, CallFunc_GetGlobalBool_ReturnValue_1) == 0x00006D, "Member 'BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist::CallFunc_GetGlobalBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00006E, "Member 'BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist, CallFunc_BooleanAND_ReturnValue) == 0x00006F, "Member 'BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist, CallFunc_RandomIntegerInRange_ReturnValue_1) == 0x000070, "Member 'BP_Alchemist_C_ExecuteUbergraph_BP_Alchemist::CallFunc_RandomIntegerInRange_ReturnValue_1' has a wrong offset!");

}

