#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ArtBook

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_ArtBook.BP_ArtBook_C.OnMouseMove
// 0x0228 (0x0228 - 0x0000)
struct BP_ArtBook_C_OnMouseMove final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0160(0x00B8)()
	struct FVector2D                              CallFunc_PointerEvent_GetCursorDelta_ReturnValue;  // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_Vector2DVector2D_ReturnValue;    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ArtBook_C_OnMouseMove) == 0x000008, "Wrong alignment on BP_ArtBook_C_OnMouseMove");
static_assert(sizeof(BP_ArtBook_C_OnMouseMove) == 0x000228, "Wrong size on BP_ArtBook_C_OnMouseMove");
static_assert(offsetof(BP_ArtBook_C_OnMouseMove, MyGeometry) == 0x000000, "Member 'BP_ArtBook_C_OnMouseMove::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_OnMouseMove, MouseEvent) == 0x000038, "Member 'BP_ArtBook_C_OnMouseMove::MouseEvent' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_OnMouseMove, ReturnValue) == 0x0000A8, "Member 'BP_ArtBook_C_OnMouseMove::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_OnMouseMove, CallFunc_Unhandled_ReturnValue) == 0x000160, "Member 'BP_ArtBook_C_OnMouseMove::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_OnMouseMove, CallFunc_PointerEvent_GetCursorDelta_ReturnValue) == 0x000218, "Member 'BP_ArtBook_C_OnMouseMove::CallFunc_PointerEvent_GetCursorDelta_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_OnMouseMove, CallFunc_NotEqual_Vector2DVector2D_ReturnValue) == 0x000220, "Member 'BP_ArtBook_C_OnMouseMove::CallFunc_NotEqual_Vector2DVector2D_ReturnValue' has a wrong offset!");

// Function BP_ArtBook.BP_ArtBook_C.OnPreviewKeyDown
// 0x01E0 (0x01E0 - 0x0000)
struct BP_ArtBook_C_OnPreviewKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0128(0x00B8)()
};
static_assert(alignof(BP_ArtBook_C_OnPreviewKeyDown) == 0x000008, "Wrong alignment on BP_ArtBook_C_OnPreviewKeyDown");
static_assert(sizeof(BP_ArtBook_C_OnPreviewKeyDown) == 0x0001E0, "Wrong size on BP_ArtBook_C_OnPreviewKeyDown");
static_assert(offsetof(BP_ArtBook_C_OnPreviewKeyDown, MyGeometry) == 0x000000, "Member 'BP_ArtBook_C_OnPreviewKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_OnPreviewKeyDown, InKeyEvent) == 0x000038, "Member 'BP_ArtBook_C_OnPreviewKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_OnPreviewKeyDown, ReturnValue) == 0x000070, "Member 'BP_ArtBook_C_OnPreviewKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_OnPreviewKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000128, "Member 'BP_ArtBook_C_OnPreviewKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function BP_ArtBook.BP_ArtBook_C.BtnHotkeyYClicked
// 0x0001 (0x0001 - 0x0000)
struct BP_ArtBook_C_BtnHotkeyYClicked final
{
public:
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ArtBook_C_BtnHotkeyYClicked) == 0x000001, "Wrong alignment on BP_ArtBook_C_BtnHotkeyYClicked");
static_assert(sizeof(BP_ArtBook_C_BtnHotkeyYClicked) == 0x000001, "Wrong size on BP_ArtBook_C_BtnHotkeyYClicked");
static_assert(offsetof(BP_ArtBook_C_BtnHotkeyYClicked, CallFunc_IsActive_ReturnValue) == 0x000000, "Member 'BP_ArtBook_C_BtnHotkeyYClicked::CallFunc_IsActive_ReturnValue' has a wrong offset!");

// Function BP_ArtBook.BP_ArtBook_C.HideTOC
// 0x0048 (0x0048 - 0x0000)
struct BP_ArtBook_C_HideTOC final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Options_Button_C*                   K2Node_DynamicCast_AsBP_Options_Button;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArtBook_C_HideTOC) == 0x000008, "Wrong alignment on BP_ArtBook_C_HideTOC");
static_assert(sizeof(BP_ArtBook_C_HideTOC) == 0x000048, "Wrong size on BP_ArtBook_C_HideTOC");
static_assert(offsetof(BP_ArtBook_C_HideTOC, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_ArtBook_C_HideTOC::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_HideTOC, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_ArtBook_C_HideTOC::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_HideTOC, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_ArtBook_C_HideTOC::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_HideTOC, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'BP_ArtBook_C_HideTOC::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_HideTOC, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_ArtBook_C_HideTOC::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_HideTOC, K2Node_DynamicCast_AsBP_Options_Button) == 0x000028, "Member 'BP_ArtBook_C_HideTOC::K2Node_DynamicCast_AsBP_Options_Button' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_HideTOC, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_ArtBook_C_HideTOC::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_HideTOC, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'BP_ArtBook_C_HideTOC::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_HideTOC, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_ArtBook_C_HideTOC::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_HideTOC, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'BP_ArtBook_C_HideTOC::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BP_ArtBook.BP_ArtBook_C.ShowTOC
// 0x0058 (0x0058 - 0x0000)
struct BP_ArtBook_C_ShowTOC final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Options_Button_C*                   K2Node_DynamicCast_AsBP_Options_Button;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArtBook_C_ShowTOC) == 0x000008, "Wrong alignment on BP_ArtBook_C_ShowTOC");
static_assert(sizeof(BP_ArtBook_C_ShowTOC) == 0x000058, "Wrong size on BP_ArtBook_C_ShowTOC");
static_assert(offsetof(BP_ArtBook_C_ShowTOC, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_ArtBook_C_ShowTOC::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_ShowTOC, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_ArtBook_C_ShowTOC::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_ShowTOC, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_ArtBook_C_ShowTOC::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_ShowTOC, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'BP_ArtBook_C_ShowTOC::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_ShowTOC, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'BP_ArtBook_C_ShowTOC::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_ShowTOC, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_ArtBook_C_ShowTOC::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_ShowTOC, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_ArtBook_C_ShowTOC::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_ShowTOC, K2Node_DynamicCast_AsBP_Options_Button) == 0x000038, "Member 'BP_ArtBook_C_ShowTOC::K2Node_DynamicCast_AsBP_Options_Button' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_ShowTOC, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_ArtBook_C_ShowTOC::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_ShowTOC, CallFunc_Less_IntInt_ReturnValue) == 0x000041, "Member 'BP_ArtBook_C_ShowTOC::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_ShowTOC, CallFunc_GetChildAt_ReturnValue) == 0x000048, "Member 'BP_ArtBook_C_ShowTOC::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_ShowTOC, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'BP_ArtBook_C_ShowTOC::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BP_ArtBook.BP_ArtBook_C.HideControlBars
// 0x0008 (0x0008 - 0x0000)
struct BP_ArtBook_C_HideControlBars final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArtBook_C_HideControlBars) == 0x000008, "Wrong alignment on BP_ArtBook_C_HideControlBars");
static_assert(sizeof(BP_ArtBook_C_HideControlBars) == 0x000008, "Wrong size on BP_ArtBook_C_HideControlBars");
static_assert(offsetof(BP_ArtBook_C_HideControlBars, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'BP_ArtBook_C_HideControlBars::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BP_ArtBook.BP_ArtBook_C.ShowControlBars
// 0x0010 (0x0010 - 0x0000)
struct BP_ArtBook_C_ShowControlBars final
{
public:
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArtBook_C_ShowControlBars) == 0x000008, "Wrong alignment on BP_ArtBook_C_ShowControlBars");
static_assert(sizeof(BP_ArtBook_C_ShowControlBars) == 0x000010, "Wrong size on BP_ArtBook_C_ShowControlBars");
static_assert(offsetof(BP_ArtBook_C_ShowControlBars, CallFunc_Less_FloatFloat_ReturnValue) == 0x000000, "Member 'BP_ArtBook_C_ShowControlBars::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_ShowControlBars, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'BP_ArtBook_C_ShowControlBars::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BP_ArtBook.BP_ArtBook_C.BtnHotkeyRBClicked
// 0x0001 (0x0001 - 0x0000)
struct BP_ArtBook_C_BtnHotkeyRBClicked final
{
public:
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ArtBook_C_BtnHotkeyRBClicked) == 0x000001, "Wrong alignment on BP_ArtBook_C_BtnHotkeyRBClicked");
static_assert(sizeof(BP_ArtBook_C_BtnHotkeyRBClicked) == 0x000001, "Wrong size on BP_ArtBook_C_BtnHotkeyRBClicked");
static_assert(offsetof(BP_ArtBook_C_BtnHotkeyRBClicked, CallFunc_IsActive_ReturnValue) == 0x000000, "Member 'BP_ArtBook_C_BtnHotkeyRBClicked::CallFunc_IsActive_ReturnValue' has a wrong offset!");

// Function BP_ArtBook.BP_ArtBook_C.BtnHotkeyLBClicked
// 0x0001 (0x0001 - 0x0000)
struct BP_ArtBook_C_BtnHotkeyLBClicked final
{
public:
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ArtBook_C_BtnHotkeyLBClicked) == 0x000001, "Wrong alignment on BP_ArtBook_C_BtnHotkeyLBClicked");
static_assert(sizeof(BP_ArtBook_C_BtnHotkeyLBClicked) == 0x000001, "Wrong size on BP_ArtBook_C_BtnHotkeyLBClicked");
static_assert(offsetof(BP_ArtBook_C_BtnHotkeyLBClicked, CallFunc_IsActive_ReturnValue) == 0x000000, "Member 'BP_ArtBook_C_BtnHotkeyLBClicked::CallFunc_IsActive_ReturnValue' has a wrong offset!");

// Function BP_ArtBook.BP_ArtBook_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_ArtBook_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArtBook_C_Tick) == 0x000004, "Wrong alignment on BP_ArtBook_C_Tick");
static_assert(sizeof(BP_ArtBook_C_Tick) == 0x00003C, "Wrong size on BP_ArtBook_C_Tick");
static_assert(offsetof(BP_ArtBook_C_Tick, MyGeometry) == 0x000000, "Member 'BP_ArtBook_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_ArtBook_C_Tick::InDeltaTime' has a wrong offset!");

// Function BP_ArtBook.BP_ArtBook_C.OnShow
// 0x0004 (0x0004 - 0x0000)
struct BP_ArtBook_C_OnShow final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArtBook_C_OnShow) == 0x000004, "Wrong alignment on BP_ArtBook_C_OnShow");
static_assert(sizeof(BP_ArtBook_C_OnShow) == 0x000004, "Wrong size on BP_ArtBook_C_OnShow");
static_assert(offsetof(BP_ArtBook_C_OnShow, AnimDuration) == 0x000000, "Member 'BP_ArtBook_C_OnShow::AnimDuration' has a wrong offset!");

// Function BP_ArtBook.BP_ArtBook_C.OnHide
// 0x0004 (0x0004 - 0x0000)
struct BP_ArtBook_C_OnHide final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArtBook_C_OnHide) == 0x000004, "Wrong alignment on BP_ArtBook_C_OnHide");
static_assert(sizeof(BP_ArtBook_C_OnHide) == 0x000004, "Wrong size on BP_ArtBook_C_OnHide");
static_assert(offsetof(BP_ArtBook_C_OnHide, AnimDuration) == 0x000000, "Member 'BP_ArtBook_C_OnHide::AnimDuration' has a wrong offset!");

// Function BP_ArtBook.BP_ArtBook_C.OnSetPage
// 0x0020 (0x0020 - 0x0000)
struct BP_ArtBook_C_OnSetPage final
{
public:
	class FText                                   InPageNumber;                                      // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         InCurrentPage;                                     // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMaxPage;                                         // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArtBook_C_OnSetPage) == 0x000008, "Wrong alignment on BP_ArtBook_C_OnSetPage");
static_assert(sizeof(BP_ArtBook_C_OnSetPage) == 0x000020, "Wrong size on BP_ArtBook_C_OnSetPage");
static_assert(offsetof(BP_ArtBook_C_OnSetPage, InPageNumber) == 0x000000, "Member 'BP_ArtBook_C_OnSetPage::InPageNumber' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_OnSetPage, InCurrentPage) == 0x000018, "Member 'BP_ArtBook_C_OnSetPage::InCurrentPage' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_OnSetPage, InMaxPage) == 0x00001C, "Member 'BP_ArtBook_C_OnSetPage::InMaxPage' has a wrong offset!");

// Function BP_ArtBook.BP_ArtBook_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct BP_ArtBook_C_CustomEvent_0 final
{
public:
	class UBP_Options_Button_C*                   OptionsButton;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArtBook_C_CustomEvent_0) == 0x000008, "Wrong alignment on BP_ArtBook_C_CustomEvent_0");
static_assert(sizeof(BP_ArtBook_C_CustomEvent_0) == 0x000008, "Wrong size on BP_ArtBook_C_CustomEvent_0");
static_assert(offsetof(BP_ArtBook_C_CustomEvent_0, OptionsButton) == 0x000000, "Member 'BP_ArtBook_C_CustomEvent_0::OptionsButton' has a wrong offset!");

// Function BP_ArtBook.BP_ArtBook_C.ExecuteUbergraph_BP_ArtBook
// 0x0138 (0x0138 - 0x0000)
struct BP_ArtBook_C_ExecuteUbergraph_BP_ArtBook final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x002C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue_2;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBP_Options_Button_C* OptionsButton)> K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x005C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue_3;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0074(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration_1;                       // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue;         // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration;                         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue_1;       // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_InPageNumber;                         // 0x00D8(0x0018)(ConstParm)
	int32                                         K2Node_Event_InCurrentPage;                        // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InMaxPage;                            // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Options_Button_C*                   K2Node_CustomEvent_OptionsButton;                  // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0100(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_GetIndex_ReturnValue;                     // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Options_Button_C*                   K2Node_DynamicCast_AsBP_Options_Button;            // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArtBook_C_ExecuteUbergraph_BP_ArtBook) == 0x000008, "Wrong alignment on BP_ArtBook_C_ExecuteUbergraph_BP_ArtBook");
static_assert(sizeof(BP_ArtBook_C_ExecuteUbergraph_BP_ArtBook) == 0x000138, "Wrong size on BP_ArtBook_C_ExecuteUbergraph_BP_ArtBook");
static_assert(offsetof(BP_ArtBook_C_ExecuteUbergraph_BP_ArtBook, EntryPoint) == 0x000000, "Member 'BP_ArtBook_C_ExecuteUbergraph_BP_ArtBook::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_ExecuteUbergraph_BP_ArtBook, Temp_delegate_Variable) == 0x000004, "Member 'BP_ArtBook_C_ExecuteUbergraph_BP_ArtBook::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_ArtBook_C_ExecuteUbergraph_BP_ArtBook, Temp_delegate_Variable_1) == 0x000014, "Member 'BP_ArtBook_C_ExecuteUbergraph_BP_ArtBook::Temp_delegate_Variable_1' has a wrong offset!");
