#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BountyBoard_BountyNote

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_BountyBoard_BountyNote.BP_BountyBoard_BountyNote_C
// 0x0098 (0x0330 - 0x0298)
class UBP_BountyBoard_BountyNote_C final : public UBountyBoardNoteUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CompletedAnim;                                     // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SelectionAnim;                                     // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                ButtonFrame;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FrameNormal;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FrameSelected;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FrameSelectionGlow;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FrameUnlockGlow;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FrameUnlockHighlight;                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconAccepted;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconCompleted;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             TextureAvailableUp;                                // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             TextureAvailableSelected;                          // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             TextureCompletedUp;                                // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             TextureCompletedSelected;                          // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             TextureHighlight;                                  // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             TextureSelectionGlow;                              // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             TextureCompletedSelectionGlow;                     // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsCompleted;                                       // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          IsAccepted;                                        // 0x0329(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BP_BountyBoard_BountyNote(int32 EntryPoint);
	void BndEvt__BP_BountyBoard_BountyNote_ButtonFrame_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void OnSetCompleted(bool bInCompleted, bool bInPlayCompleteAnim);
	void OnSetAccepted(bool bInAccepted);
	void OnUnfocused(bool bAnimate);
	void OnFocused(bool bAnimate);
	void PreConstruct(bool IsDesignTime);
	void SetTextures();
	void SetAccepted(bool InAccepted);
	void PlayCompletedAnim();
	void CompleteAnimFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BountyBoard_BountyNote_C">();
	}
	static class UBP_BountyBoard_BountyNote_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BountyBoard_BountyNote_C>();
	}
};
static_assert(alignof(UBP_BountyBoard_BountyNote_C) == 0x000008, "Wrong alignment on UBP_BountyBoard_BountyNote_C");
static_assert(sizeof(UBP_BountyBoard_BountyNote_C) == 0x000330, "Wrong size on UBP_BountyBoard_BountyNote_C");
static_assert(offsetof(UBP_BountyBoard_BountyNote_C, UberGraphFrame) == 0x000298, "Member 'UBP_BountyBoard_BountyNote_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_BountyBoard_BountyNote_C, CompletedAnim) == 0x0002A0, "Member 'UBP_BountyBoard_BountyNote_C::CompletedAnim' has a wrong offset!");
static_assert(offsetof(UBP_BountyBoard_BountyNote_C, SelectionAnim) == 0x0002A8, "Member 'UBP_BountyBoard_BountyNote_C::SelectionAnim' has a wrong offset!");
static_assert(offsetof(UBP_BountyBoard_BountyNote_C, ButtonFrame) == 0x0002B0, "Member 'UBP_BountyBoard_BountyNote_C::ButtonFrame' has a wrong offset!");
static_assert(offsetof(UBP_BountyBoard_BountyNote_C, FrameNormal) == 0x0002B8, "Member 'UBP_BountyBoard_BountyNote_C::FrameNormal' has a wrong offset!");
static_assert(offsetof(UBP_BountyBoard_BountyNote_C, FrameSelected) == 0x0002C0, "Member 'UBP_BountyBoard_BountyNote_C::FrameSelected' has a wrong offset!");
static_assert(offsetof(UBP_BountyBoard_BountyNote_C, FrameSelectionGlow) == 0x0002C8, "Member 'UBP_BountyBoard_BountyNote_C::FrameSelectionGlow' has a wrong offset!");
static_assert(offsetof(UBP_BountyBoard_BountyNote_C, FrameUnlockGlow) == 0x0002D0, "Member 'UBP_BountyBoard_BountyNote_C::FrameUnlockGlow' has a wrong offset!");
static_assert(offsetof(UBP_BountyBoard_BountyNote_C, FrameUnlockHighlight) == 0x0002D8, "Member 'UBP_BountyBoard_BountyNote_C::FrameUnlockHighlight' has a wrong offset!");
static_assert(offsetof(UBP_BountyBoard_BountyNote_C, IconAccepted) == 0x0002E0, "Member 'UBP_BountyBoard_BountyNote_C::IconAccepted' has a wrong offset!");
static_assert(offsetof(UBP_BountyBoard_BountyNote_C, IconCompleted) == 0x0002E8, "Member 'UBP_BountyBoard_BountyNote_C::IconCompleted' has a wrong offset!");
static_assert(offsetof(UBP_BountyBoard_BountyNote_C, TextureAvailableUp) == 0x0002F0, "Member 'UBP_BountyBoard_BountyNote_C::TextureAvailableUp' has a wrong offset!");
static_assert(offsetof(UBP_BountyBoard_BountyNote_C, TextureAvailableSelected) == 0x0002F8, "Member 'UBP_BountyBoard_BountyNote_C::TextureAvailableSelected' has a wrong offset!");
static_assert(offsetof(UBP_BountyBoard_BountyNote_C, TextureCompletedUp) == 0x000300, "Member 'UBP_BountyBoard_BountyNote_C::TextureCompletedUp' has a wrong offset!");
static_assert(offsetof(UBP_BountyBoard_BountyNote_C, TextureCompletedSelected) == 0x000308, "Member 'UBP_BountyBoard_BountyNote_C::TextureCompletedSelected' has a wrong offset!");
static_assert(offsetof(UBP_BountyBoard_BountyNote_C, TextureHighlight) == 0x000310, "Member 'UBP_BountyBoard_BountyNote_C::TextureHighlight' has a wrong offset!");
static_assert(offsetof(UBP_BountyBoard_BountyNote_C, TextureSelectionGlow) == 0x000318, "Member 'UBP_BountyBoard_BountyNote_C::TextureSelectionGlow' has a wrong offset!");
static_assert(offsetof(UBP_BountyBoard_BountyNote_C, TextureCompletedSelectionGlow) == 0x000320, "Member 'UBP_BountyBoard_BountyNote_C::TextureCompletedSelectionGlow' has a wrong offset!");
static_assert(offsetof(UBP_BountyBoard_BountyNote_C, IsCompleted) == 0x000328, "Member 'UBP_BountyBoard_BountyNote_C::IsCompleted' has a wrong offset!");
static_assert(offsetof(UBP_BountyBoard_BountyNote_C, IsAccepted) == 0x000329, "Member 'UBP_BountyBoard_BountyNote_C::IsAccepted' has a wrong offset!");

}

