#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Brawler_PushAbility

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_Brawler_PushAbility.BP_Brawler_PushAbility_C.ExecuteUbergraph_BP_Brawler_PushAbility
// 0x0058 (0x0058 - 0x0000)
struct BP_Brawler_PushAbility_C_ExecuteUbergraph_BP_Brawler_PushAbility final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_BPGetCurrentPushObject_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ObjectToString_ReturnValue;          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Brawler_PushAbility_C_ExecuteUbergraph_BP_Brawler_PushAbility) == 0x000008, "Wrong alignment on BP_Brawler_PushAbility_C_ExecuteUbergraph_BP_Brawler_PushAbility");
static_assert(sizeof(BP_Brawler_PushAbility_C_ExecuteUbergraph_BP_Brawler_PushAbility) == 0x000058, "Wrong size on BP_Brawler_PushAbility_C_ExecuteUbergraph_BP_Brawler_PushAbility");
static_assert(offsetof(BP_Brawler_PushAbility_C_ExecuteUbergraph_BP_Brawler_PushAbility, EntryPoint) == 0x000000, "Member 'BP_Brawler_PushAbility_C_ExecuteUbergraph_BP_Brawler_PushAbility::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Brawler_PushAbility_C_ExecuteUbergraph_BP_Brawler_PushAbility, Temp_delegate_Variable) == 0x000004, "Member 'BP_Brawler_PushAbility_C_ExecuteUbergraph_BP_Brawler_PushAbility::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Brawler_PushAbility_C_ExecuteUbergraph_BP_Brawler_PushAbility, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_Brawler_PushAbility_C_ExecuteUbergraph_BP_Brawler_PushAbility::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Brawler_PushAbility_C_ExecuteUbergraph_BP_Brawler_PushAbility, CallFunc_PostEvent_ReturnValue) == 0x000024, "Member 'BP_Brawler_PushAbility_C_ExecuteUbergraph_BP_Brawler_PushAbility::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Brawler_PushAbility_C_ExecuteUbergraph_BP_Brawler_PushAbility, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'BP_Brawler_PushAbility_C_ExecuteUbergraph_BP_Brawler_PushAbility::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Brawler_PushAbility_C_ExecuteUbergraph_BP_Brawler_PushAbility, CallFunc_BPGetCurrentPushObject_ReturnValue) == 0x000038, "Member 'BP_Brawler_PushAbility_C_ExecuteUbergraph_BP_Brawler_PushAbility::CallFunc_BPGetCurrentPushObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Brawler_PushAbility_C_ExecuteUbergraph_BP_Brawler_PushAbility, CallFunc_Conv_ObjectToString_ReturnValue) == 0x000040, "Member 'BP_Brawler_PushAbility_C_ExecuteUbergraph_BP_Brawler_PushAbility::CallFunc_Conv_ObjectToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Brawler_PushAbility_C_ExecuteUbergraph_BP_Brawler_PushAbility, CallFunc_Contains_ReturnValue) == 0x000050, "Member 'BP_Brawler_PushAbility_C_ExecuteUbergraph_BP_Brawler_PushAbility::CallFunc_Contains_ReturnValue' has a wrong offset!");

}

