#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Branween_Disguise

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Dudley_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Branween_Disguise.BP_Branween_Disguise_C
// 0x0028 (0x0840 - 0x0818)
class ABP_Branween_Disguise_C final : public ABP_Dudley_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Branween_Disguise_C;             // 0x0818(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_SpeechBubbleComponent_C*            BP_SpeechBubbleComponent1;                         // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Reveal_Emissive_CFBB6F3A4A19A4E1C57F31A9F6CD16DA;  // 0x0828(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Reveal_Dissolve_CFBB6F3A4A19A4E1C57F31A9F6CD16DA;  // 0x082C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Reveal__Direction_CFBB6F3A4A19A4E1C57F31A9F6CD16DA; // 0x0830(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_831[0x7];                                      // 0x0831(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Reveal;                                            // 0x0838(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Reveal__FinishedFunc();
	void Reveal__UpdateFunc();
	void RevealVFX();
	void ExecuteUbergraph_BP_Branween_Disguise(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Branween_Disguise_C">();
	}
	static class ABP_Branween_Disguise_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Branween_Disguise_C>();
	}
};
static_assert(alignof(ABP_Branween_Disguise_C) == 0x000008, "Wrong alignment on ABP_Branween_Disguise_C");
static_assert(sizeof(ABP_Branween_Disguise_C) == 0x000840, "Wrong size on ABP_Branween_Disguise_C");
static_assert(offsetof(ABP_Branween_Disguise_C, UberGraphFrame_BP_Branween_Disguise_C) == 0x000818, "Member 'ABP_Branween_Disguise_C::UberGraphFrame_BP_Branween_Disguise_C' has a wrong offset!");
static_assert(offsetof(ABP_Branween_Disguise_C, BP_SpeechBubbleComponent1) == 0x000820, "Member 'ABP_Branween_Disguise_C::BP_SpeechBubbleComponent1' has a wrong offset!");
static_assert(offsetof(ABP_Branween_Disguise_C, Reveal_Emissive_CFBB6F3A4A19A4E1C57F31A9F6CD16DA) == 0x000828, "Member 'ABP_Branween_Disguise_C::Reveal_Emissive_CFBB6F3A4A19A4E1C57F31A9F6CD16DA' has a wrong offset!");
static_assert(offsetof(ABP_Branween_Disguise_C, Reveal_Dissolve_CFBB6F3A4A19A4E1C57F31A9F6CD16DA) == 0x00082C, "Member 'ABP_Branween_Disguise_C::Reveal_Dissolve_CFBB6F3A4A19A4E1C57F31A9F6CD16DA' has a wrong offset!");
static_assert(offsetof(ABP_Branween_Disguise_C, Reveal__Direction_CFBB6F3A4A19A4E1C57F31A9F6CD16DA) == 0x000830, "Member 'ABP_Branween_Disguise_C::Reveal__Direction_CFBB6F3A4A19A4E1C57F31A9F6CD16DA' has a wrong offset!");
static_assert(offsetof(ABP_Branween_Disguise_C, Reveal) == 0x000838, "Member 'ABP_Branween_Disguise_C::Reveal' has a wrong offset!");

}

