#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_boonsHunt_Bear_VisualEntity

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_boonsHunt_Bear_VisualEntity.BP_boonsHunt_Bear_VisualEntity_C.ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity
// 0x0034 (0x0034 - 0x0000)
struct BP_boonsHunt_Bear_VisualEntity_C_ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BPGetDuration_ReturnValue;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BPGetRemainingTime_ReturnValue;           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_boonsHunt_Bear_VisualEntity_C_ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity) == 0x000004, "Wrong alignment on BP_boonsHunt_Bear_VisualEntity_C_ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity");
static_assert(sizeof(BP_boonsHunt_Bear_VisualEntity_C_ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity) == 0x000034, "Wrong size on BP_boonsHunt_Bear_VisualEntity_C_ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity");
static_assert(offsetof(BP_boonsHunt_Bear_VisualEntity_C_ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_boonsHunt_Bear_VisualEntity_C_ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_boonsHunt_Bear_VisualEntity_C_ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity, Temp_delegate_Variable) == 0x000004, "Member 'BP_boonsHunt_Bear_VisualEntity_C_ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_boonsHunt_Bear_VisualEntity_C_ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BP_boonsHunt_Bear_VisualEntity_C_ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_boonsHunt_Bear_VisualEntity_C_ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity, CallFunc_BPGetDuration_ReturnValue) == 0x000018, "Member 'BP_boonsHunt_Bear_VisualEntity_C_ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity::CallFunc_BPGetDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_boonsHunt_Bear_VisualEntity_C_ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity, CallFunc_BPGetRemainingTime_ReturnValue) == 0x00001C, "Member 'BP_boonsHunt_Bear_VisualEntity_C_ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity::CallFunc_BPGetRemainingTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_boonsHunt_Bear_VisualEntity_C_ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_boonsHunt_Bear_VisualEntity_C_ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_boonsHunt_Bear_VisualEntity_C_ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'BP_boonsHunt_Bear_VisualEntity_C_ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_boonsHunt_Bear_VisualEntity_C_ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity, CallFunc_Add_FloatFloat_ReturnValue) == 0x000028, "Member 'BP_boonsHunt_Bear_VisualEntity_C_ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_boonsHunt_Bear_VisualEntity_C_ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity, CallFunc_PostAkEvent_ReturnValue) == 0x00002C, "Member 'BP_boonsHunt_Bear_VisualEntity_C_ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_boonsHunt_Bear_VisualEntity_C_ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000030, "Member 'BP_boonsHunt_Bear_VisualEntity_C_ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");

// Function BP_boonsHunt_Bear_VisualEntity.BP_boonsHunt_Bear_VisualEntity_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_boonsHunt_Bear_VisualEntity_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_boonsHunt_Bear_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_boonsHunt_Bear_VisualEntity_C_ReceiveTick");
static_assert(sizeof(BP_boonsHunt_Bear_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong size on BP_boonsHunt_Bear_VisualEntity_C_ReceiveTick");
static_assert(offsetof(BP_boonsHunt_Bear_VisualEntity_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_boonsHunt_Bear_VisualEntity_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_boonsHunt_Bear_VisualEntity.BP_boonsHunt_Bear_VisualEntity_C.SetBoonAbility
// 0x0038 (0x0038 - 0x0000)
struct BP_boonsHunt_Bear_VisualEntity_C_SetBoonAbility final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEmptyPassiveAbility*                   K2Node_DynamicCast_AsEmpty_Passive_Ability;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_boonsHunt_Bear_VisualEntity_C_SetBoonAbility) == 0x000008, "Wrong alignment on BP_boonsHunt_Bear_VisualEntity_C_SetBoonAbility");
static_assert(sizeof(BP_boonsHunt_Bear_VisualEntity_C_SetBoonAbility) == 0x000038, "Wrong size on BP_boonsHunt_Bear_VisualEntity_C_SetBoonAbility");
static_assert(offsetof(BP_boonsHunt_Bear_VisualEntity_C_SetBoonAbility, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_boonsHunt_Bear_VisualEntity_C_SetBoonAbility::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_boonsHunt_Bear_VisualEntity_C_SetBoonAbility, K2Node_DynamicCast_AsCharacter_Base) == 0x000008, "Member 'BP_boonsHunt_Bear_VisualEntity_C_SetBoonAbility::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_boonsHunt_Bear_VisualEntity_C_SetBoonAbility, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_boonsHunt_Bear_VisualEntity_C_SetBoonAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_boonsHunt_Bear_VisualEntity_C_SetBoonAbility, CallFunc_GetAbilityController_ReturnValue) == 0x000018, "Member 'BP_boonsHunt_Bear_VisualEntity_C_SetBoonAbility::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_boonsHunt_Bear_VisualEntity_C_SetBoonAbility, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000020, "Member 'BP_boonsHunt_Bear_VisualEntity_C_SetBoonAbility::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_boonsHunt_Bear_VisualEntity_C_SetBoonAbility, K2Node_DynamicCast_AsEmpty_Passive_Ability) == 0x000028, "Member 'BP_boonsHunt_Bear_VisualEntity_C_SetBoonAbility::K2Node_DynamicCast_AsEmpty_Passive_Ability' has a wrong offset!");
static_assert(offsetof(BP_boonsHunt_Bear_VisualEntity_C_SetBoonAbility, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_boonsHunt_Bear_VisualEntity_C_SetBoonAbility::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

