#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BlackSmithCart_CS_Ox_2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BlackSmithCart_CS_Ox_2.BP_BlackSmithCart_CS_Ox_2_C
// 0x0050 (0x0828 - 0x07D8)
class ABP_BlackSmithCart_CS_Ox_2_C final : public AActorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_Ox_Dust;                                        // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGroomComponent*                        Groom1;                                            // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGroomComponent*                        Groom2;                                            // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SpeechBubbleComponent_C*            BP_SpeechBubbleComponent;                          // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CameraSphere;                                      // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTriggerBoxComponent*                   TriggerBox;                                        // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_BlackSmithCart_CS_Ox_2(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BlackSmithCart_CS_Ox_2_C">();
	}
	static class ABP_BlackSmithCart_CS_Ox_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BlackSmithCart_CS_Ox_2_C>();
	}
};
static_assert(alignof(ABP_BlackSmithCart_CS_Ox_2_C) == 0x000008, "Wrong alignment on ABP_BlackSmithCart_CS_Ox_2_C");
static_assert(sizeof(ABP_BlackSmithCart_CS_Ox_2_C) == 0x000828, "Wrong size on ABP_BlackSmithCart_CS_Ox_2_C");
static_assert(offsetof(ABP_BlackSmithCart_CS_Ox_2_C, UberGraphFrame) == 0x0007D8, "Member 'ABP_BlackSmithCart_CS_Ox_2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BlackSmithCart_CS_Ox_2_C, NS_Ox_Dust) == 0x0007E0, "Member 'ABP_BlackSmithCart_CS_Ox_2_C::NS_Ox_Dust' has a wrong offset!");
static_assert(offsetof(ABP_BlackSmithCart_CS_Ox_2_C, Groom1) == 0x0007E8, "Member 'ABP_BlackSmithCart_CS_Ox_2_C::Groom1' has a wrong offset!");
static_assert(offsetof(ABP_BlackSmithCart_CS_Ox_2_C, Groom2) == 0x0007F0, "Member 'ABP_BlackSmithCart_CS_Ox_2_C::Groom2' has a wrong offset!");
static_assert(offsetof(ABP_BlackSmithCart_CS_Ox_2_C, BP_SpeechBubbleComponent) == 0x0007F8, "Member 'ABP_BlackSmithCart_CS_Ox_2_C::BP_SpeechBubbleComponent' has a wrong offset!");
static_assert(offsetof(ABP_BlackSmithCart_CS_Ox_2_C, Ak) == 0x000800, "Member 'ABP_BlackSmithCart_CS_Ox_2_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_BlackSmithCart_CS_Ox_2_C, CameraSphere) == 0x000808, "Member 'ABP_BlackSmithCart_CS_Ox_2_C::CameraSphere' has a wrong offset!");
static_assert(offsetof(ABP_BlackSmithCart_CS_Ox_2_C, SkeletalMesh) == 0x000810, "Member 'ABP_BlackSmithCart_CS_Ox_2_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_BlackSmithCart_CS_Ox_2_C, TriggerBox) == 0x000818, "Member 'ABP_BlackSmithCart_CS_Ox_2_C::TriggerBox' has a wrong offset!");
static_assert(offsetof(ABP_BlackSmithCart_CS_Ox_2_C, DefaultSceneRoot) == 0x000820, "Member 'ABP_BlackSmithCart_CS_Ox_2_C::DefaultSceneRoot' has a wrong offset!");

}

