#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BladeDance_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BladeDance_VisualEntity.BP_BladeDance_VisualEntity_C
// 0x0030 (0x0380 - 0x0350)
class ABP_BladeDance_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_BladeDance_PC_End;                              // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_GDD_9EDEF4AD4FEA87C731199FAA673A6655;   // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Radius_9EDEF4AD4FEA87C731199FAA673A6655; // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_9EDEF4AD4FEA87C731199FAA673A6655; // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OwnerChar;                                         // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BladeDance_VisualEntity(int32 EntryPoint);
	void OnKill();
	void VisualEntityConstructionFinished();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BladeDance_VisualEntity_C">();
	}
	static class ABP_BladeDance_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BladeDance_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_BladeDance_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_BladeDance_VisualEntity_C");
static_assert(sizeof(ABP_BladeDance_VisualEntity_C) == 0x000380, "Wrong size on ABP_BladeDance_VisualEntity_C");
static_assert(offsetof(ABP_BladeDance_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_BladeDance_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BladeDance_VisualEntity_C, NS_BladeDance_PC_End) == 0x000358, "Member 'ABP_BladeDance_VisualEntity_C::NS_BladeDance_PC_End' has a wrong offset!");
static_assert(offsetof(ABP_BladeDance_VisualEntity_C, Timeline_0_GDD_9EDEF4AD4FEA87C731199FAA673A6655) == 0x000360, "Member 'ABP_BladeDance_VisualEntity_C::Timeline_0_GDD_9EDEF4AD4FEA87C731199FAA673A6655' has a wrong offset!");
static_assert(offsetof(ABP_BladeDance_VisualEntity_C, Timeline_0_Radius_9EDEF4AD4FEA87C731199FAA673A6655) == 0x000364, "Member 'ABP_BladeDance_VisualEntity_C::Timeline_0_Radius_9EDEF4AD4FEA87C731199FAA673A6655' has a wrong offset!");
static_assert(offsetof(ABP_BladeDance_VisualEntity_C, Timeline_0__Direction_9EDEF4AD4FEA87C731199FAA673A6655) == 0x000368, "Member 'ABP_BladeDance_VisualEntity_C::Timeline_0__Direction_9EDEF4AD4FEA87C731199FAA673A6655' has a wrong offset!");
static_assert(offsetof(ABP_BladeDance_VisualEntity_C, Timeline_0) == 0x000370, "Member 'ABP_BladeDance_VisualEntity_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_BladeDance_VisualEntity_C, OwnerChar) == 0x000378, "Member 'ABP_BladeDance_VisualEntity_C::OwnerChar' has a wrong offset!");

}

