#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BlackSmithCart_CS

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BlackSmithCart_CS.BP_BlackSmithCart_CS_C
// 0x0060 (0x0838 - 0x07D8)
class ABP_BlackSmithCart_CS_C final : public AActorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_Cart_Dust_BR;                                   // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Cart_Dust_BL;                                   // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Cart_Dust_FR;                                   // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Cart_Dust_FL;                                   // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Cart_Lantern;                                   // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SpeechBubbleComponent_C*            BP_SpeechBubbleComponent;                          // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CameraSphere;                                      // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTriggerBoxComponent*                   TriggerBox;                                        // 0x0828(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0830(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_BlackSmithCart_CS(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BlackSmithCart_CS_C">();
	}
	static class ABP_BlackSmithCart_CS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BlackSmithCart_CS_C>();
	}
};
static_assert(alignof(ABP_BlackSmithCart_CS_C) == 0x000008, "Wrong alignment on ABP_BlackSmithCart_CS_C");
static_assert(sizeof(ABP_BlackSmithCart_CS_C) == 0x000838, "Wrong size on ABP_BlackSmithCart_CS_C");
static_assert(offsetof(ABP_BlackSmithCart_CS_C, UberGraphFrame) == 0x0007D8, "Member 'ABP_BlackSmithCart_CS_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BlackSmithCart_CS_C, NS_Cart_Dust_BR) == 0x0007E0, "Member 'ABP_BlackSmithCart_CS_C::NS_Cart_Dust_BR' has a wrong offset!");
static_assert(offsetof(ABP_BlackSmithCart_CS_C, NS_Cart_Dust_BL) == 0x0007E8, "Member 'ABP_BlackSmithCart_CS_C::NS_Cart_Dust_BL' has a wrong offset!");
static_assert(offsetof(ABP_BlackSmithCart_CS_C, NS_Cart_Dust_FR) == 0x0007F0, "Member 'ABP_BlackSmithCart_CS_C::NS_Cart_Dust_FR' has a wrong offset!");
static_assert(offsetof(ABP_BlackSmithCart_CS_C, NS_Cart_Dust_FL) == 0x0007F8, "Member 'ABP_BlackSmithCart_CS_C::NS_Cart_Dust_FL' has a wrong offset!");
static_assert(offsetof(ABP_BlackSmithCart_CS_C, NS_Cart_Lantern) == 0x000800, "Member 'ABP_BlackSmithCart_CS_C::NS_Cart_Lantern' has a wrong offset!");
static_assert(offsetof(ABP_BlackSmithCart_CS_C, BP_SpeechBubbleComponent) == 0x000808, "Member 'ABP_BlackSmithCart_CS_C::BP_SpeechBubbleComponent' has a wrong offset!");
static_assert(offsetof(ABP_BlackSmithCart_CS_C, Ak) == 0x000810, "Member 'ABP_BlackSmithCart_CS_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_BlackSmithCart_CS_C, CameraSphere) == 0x000818, "Member 'ABP_BlackSmithCart_CS_C::CameraSphere' has a wrong offset!");
static_assert(offsetof(ABP_BlackSmithCart_CS_C, SkeletalMesh) == 0x000820, "Member 'ABP_BlackSmithCart_CS_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_BlackSmithCart_CS_C, TriggerBox) == 0x000828, "Member 'ABP_BlackSmithCart_CS_C::TriggerBox' has a wrong offset!");
static_assert(offsetof(ABP_BlackSmithCart_CS_C, DefaultSceneRoot) == 0x000830, "Member 'ABP_BlackSmithCart_CS_C::DefaultSceneRoot' has a wrong offset!");

}

