#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BlackSmithNPC

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_BlackSmithNPC.BP_BlackSmithNPC_C.BPShowMiniMapIcon
// 0x0002 (0x0002 - 0x0000)
struct BP_BlackSmithNPC_C_BPShowMiniMapIcon final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGlobalBool_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BlackSmithNPC_C_BPShowMiniMapIcon) == 0x000001, "Wrong alignment on BP_BlackSmithNPC_C_BPShowMiniMapIcon");
static_assert(sizeof(BP_BlackSmithNPC_C_BPShowMiniMapIcon) == 0x000002, "Wrong size on BP_BlackSmithNPC_C_BPShowMiniMapIcon");
static_assert(offsetof(BP_BlackSmithNPC_C_BPShowMiniMapIcon, Result) == 0x000000, "Member 'BP_BlackSmithNPC_C_BPShowMiniMapIcon::Result' has a wrong offset!");
static_assert(offsetof(BP_BlackSmithNPC_C_BPShowMiniMapIcon, CallFunc_GetGlobalBool_ReturnValue) == 0x000001, "Member 'BP_BlackSmithNPC_C_BPShowMiniMapIcon::CallFunc_GetGlobalBool_ReturnValue' has a wrong offset!");

// Function BP_BlackSmithNPC.BP_BlackSmithNPC_C.OnVfxEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_BlackSmithNPC_C_OnVfxEvent final
{
public:
	class FName                                   VfxEventType;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BlackSmithNPC_C_OnVfxEvent) == 0x000004, "Wrong alignment on BP_BlackSmithNPC_C_OnVfxEvent");
static_assert(sizeof(BP_BlackSmithNPC_C_OnVfxEvent) == 0x000008, "Wrong size on BP_BlackSmithNPC_C_OnVfxEvent");
static_assert(offsetof(BP_BlackSmithNPC_C_OnVfxEvent, VfxEventType) == 0x000000, "Member 'BP_BlackSmithNPC_C_OnVfxEvent::VfxEventType' has a wrong offset!");

// Function BP_BlackSmithNPC.BP_BlackSmithNPC_C.VisualVolumeEnter
// 0x0008 (0x0008 - 0x0000)
struct BP_BlackSmithNPC_C_VisualVolumeEnter final
{
public:
	class ALevelVisualVolume*                     Volume;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BlackSmithNPC_C_VisualVolumeEnter) == 0x000008, "Wrong alignment on BP_BlackSmithNPC_C_VisualVolumeEnter");
static_assert(sizeof(BP_BlackSmithNPC_C_VisualVolumeEnter) == 0x000008, "Wrong size on BP_BlackSmithNPC_C_VisualVolumeEnter");
static_assert(offsetof(BP_BlackSmithNPC_C_VisualVolumeEnter, Volume) == 0x000000, "Member 'BP_BlackSmithNPC_C_VisualVolumeEnter::Volume' has a wrong offset!");

// Function BP_BlackSmithNPC.BP_BlackSmithNPC_C.ExecuteUbergraph_BP_BlackSmithNPC
// 0x0098 (0x0098 - 0x0000)
struct BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_VfxEventType;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelVisualVolume*                     K2Node_CustomEvent_Volume;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetGameMode_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Blacksmith_Anim_C*                  K2Node_DynamicCast_AsBP_Blacksmith_Anim;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Mount_Anim_C*                       K2Node_DynamicCast_AsBP_Mount_Anim;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInCaravan_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ALevelVisualVolume* Volume)> K2Node_CreateDelegate_OutputDelegate;              // 0x0084(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC) == 0x000008, "Wrong alignment on BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC");
static_assert(sizeof(BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC) == 0x000098, "Wrong size on BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC");
static_assert(offsetof(BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC, EntryPoint) == 0x000000, "Member 'BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000004, "Member 'BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC, K2Node_Event_VfxEventType) == 0x000010, "Member 'BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC::K2Node_Event_VfxEventType' has a wrong offset!");
static_assert(offsetof(BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC, CallFunc_Add_VectorVector_ReturnValue) == 0x000018, "Member 'BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC, K2Node_SwitchName_CmpSuccess) == 0x000024, "Member 'BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000028, "Member 'BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC, K2Node_CustomEvent_Volume) == 0x000030, "Member 'BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC::K2Node_CustomEvent_Volume' has a wrong offset!");
static_assert(offsetof(BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC, CallFunc_GetGameMode_ReturnValue) == 0x000038, "Member 'BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000040, "Member 'BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC, CallFunc_GetAnimInstance_ReturnValue) == 0x000048, "Member 'BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC, K2Node_DynamicCast_AsBP_Blacksmith_Anim) == 0x000050, "Member 'BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC::K2Node_DynamicCast_AsBP_Blacksmith_Anim' has a wrong offset!");
static_assert(offsetof(BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000060, "Member 'BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000068, "Member 'BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC, K2Node_DynamicCast_AsBP_Mount_Anim) == 0x000070, "Member 'BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC::K2Node_DynamicCast_AsBP_Mount_Anim' has a wrong offset!");
static_assert(offsetof(BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00007C, "Member 'BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC, CallFunc_IsInCaravan_ReturnValue) == 0x000080, "Member 'BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC::CallFunc_IsInCaravan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC, K2Node_CreateDelegate_OutputDelegate) == 0x000084, "Member 'BP_BlackSmithNPC_C_ExecuteUbergraph_BP_BlackSmithNPC::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

}

