#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BreakableProps

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "S_BreakableProps_structs.hpp"
#include "man_structs.hpp"


namespace SDK::Params
{

// Function BP_BreakableProps.BP_BreakableProps_C.ExecuteUbergraph_BP_BreakableProps
// 0x04D0 (0x04D0 - 0x0000)
struct BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	class AActorSoul*                             K2Node_CustomEvent_Source;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActorSoul*                             K2Node_CustomEvent_Target;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           K2Node_CustomEvent_Ability;                        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimID*                                K2Node_CustomEvent_Anim;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_effectiveDamage;                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageValue                           K2Node_CustomEvent_OriginalDamageValue;            // 0x0070(0x0138)(ContainsInstancedReference)
	struct FDamageValue                           K2Node_CustomEvent_DamageValue;                    // 0x01A8(0x0138)(ContainsInstancedReference)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x02E0(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0328(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0338(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0360(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue;               // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0378(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0388(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x0398(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x03B0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x03F0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0400(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0418(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0438(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0444(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x046C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x046D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46E[0x2];                                      // 0x046E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0488(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0490(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C[0x4];                                      // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityBase*                           CallFunc_BPAddAbility_ReturnValue;                 // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionUnitVector_ReturnValue;       // 0x04A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x04B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActorSoul* Source, class AActorSoul* Target, class UAbilityBase* Ability, class UAnimID* Anim, float effectiveDamage, const struct FDamageValue& OriginalDamageValue, const struct FDamageValue& DamageValue)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x04C0(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps) == 0x000008, "Wrong alignment on BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps");
static_assert(sizeof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps) == 0x0004D0, "Wrong size on BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, EntryPoint) == 0x000000, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, K2Node_CustomEvent_Source) == 0x000048, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::K2Node_CustomEvent_Source' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, K2Node_CustomEvent_Target) == 0x000050, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, K2Node_CustomEvent_Ability) == 0x000058, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::K2Node_CustomEvent_Ability' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, K2Node_CustomEvent_Anim) == 0x000060, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::K2Node_CustomEvent_Anim' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, K2Node_CustomEvent_effectiveDamage) == 0x000068, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::K2Node_CustomEvent_effectiveDamage' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, K2Node_CustomEvent_OriginalDamageValue) == 0x000070, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::K2Node_CustomEvent_OriginalDamageValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, K2Node_CustomEvent_DamageValue) == 0x0001A8, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::K2Node_CustomEvent_DamageValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, K2Node_MakeStruct_FormatArgumentData_1) == 0x0002E0, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000320, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, K2Node_MakeArray_Array) == 0x000328, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_Format_ReturnValue) == 0x000338, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_Conv_TextToString_ReturnValue) == 0x000350, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, Temp_delegate_Variable) == 0x000360, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_GetManGameMode_ReturnValue) == 0x000370, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_GetManGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, K2Node_CreateDelegate_OutputDelegate) == 0x000378, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000388, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_Conv_BoolToText_ReturnValue) == 0x000398, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_Conv_BoolToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, K2Node_MakeStruct_FormatArgumentData_2) == 0x0003B0, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, K2Node_MakeArray_Array_1) == 0x0003F0, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_Format_ReturnValue_1) == 0x000400, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000418, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_PostAkEvent_ReturnValue) == 0x000428, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_GetPlayerPawn_ReturnValue) == 0x000430, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000438, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000444, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_BreakVector_X) == 0x000450, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_BreakVector_Y) == 0x000454, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_BreakVector_Z) == 0x000458, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_BreakVector_X_1) == 0x00045C, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_BreakVector_Y_1) == 0x000460, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_BreakVector_Z_1) == 0x000464, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000468, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00046C, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00046D, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000470, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000474, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_SelectFloat_ReturnValue) == 0x000478, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_Subtract_FloatFloat_ReturnValue_3) == 0x00047C, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_Subtract_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_SelectFloat_ReturnValue_1) == 0x000480, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_GetAbilityController_ReturnValue) == 0x000488, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_MakeVector_ReturnValue) == 0x000490, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_BPAddAbility_ReturnValue) == 0x0004A0, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_BPAddAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_GetDirectionUnitVector_ReturnValue) == 0x0004A8, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_GetDirectionUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, CallFunc_MakeVector_ReturnValue_1) == 0x0004B4, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps, K2Node_CreateDelegate_OutputDelegate_1) == 0x0004C0, "Member 'BP_BreakableProps_C_ExecuteUbergraph_BP_BreakableProps::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function BP_BreakableProps.BP_BreakableProps_C.DamageTaken
// 0x0298 (0x0298 - 0x0000)
struct BP_BreakableProps_C_DamageTaken final
{
public:
	class AActorSoul*                             Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActorSoul*                             Target;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           Ability;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimID*                                Anim;                                              // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         effectiveDamage;                                   // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageValue                           OriginalDamageValue;                               // 0x0028(0x0138)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FDamageValue                           DamageValue;                                       // 0x0160(0x0138)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_BreakableProps_C_DamageTaken) == 0x000008, "Wrong alignment on BP_BreakableProps_C_DamageTaken");
static_assert(sizeof(BP_BreakableProps_C_DamageTaken) == 0x000298, "Wrong size on BP_BreakableProps_C_DamageTaken");
static_assert(offsetof(BP_BreakableProps_C_DamageTaken, Source) == 0x000000, "Member 'BP_BreakableProps_C_DamageTaken::Source' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_DamageTaken, Target) == 0x000008, "Member 'BP_BreakableProps_C_DamageTaken::Target' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_DamageTaken, Ability) == 0x000010, "Member 'BP_BreakableProps_C_DamageTaken::Ability' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_DamageTaken, Anim) == 0x000018, "Member 'BP_BreakableProps_C_DamageTaken::Anim' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_DamageTaken, effectiveDamage) == 0x000020, "Member 'BP_BreakableProps_C_DamageTaken::effectiveDamage' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_DamageTaken, OriginalDamageValue) == 0x000028, "Member 'BP_BreakableProps_C_DamageTaken::OriginalDamageValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_DamageTaken, DamageValue) == 0x000160, "Member 'BP_BreakableProps_C_DamageTaken::DamageValue' has a wrong offset!");

// Function BP_BreakableProps.BP_BreakableProps_C.UserConstructionScript
// 0x0070 (0x0070 - 0x0000)
struct BP_BreakableProps_C_UserConstructionScript final
{
public:
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue_1;            // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Vector_GetAbs_ReturnValue;                // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BreakableProps_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_BreakableProps_C_UserConstructionScript");
static_assert(sizeof(BP_BreakableProps_C_UserConstructionScript) == 0x000070, "Wrong size on BP_BreakableProps_C_UserConstructionScript");
static_assert(offsetof(BP_BreakableProps_C_UserConstructionScript, CallFunc_Concat_StrStr_ReturnValue) == 0x000000, "Member 'BP_BreakableProps_C_UserConstructionScript::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_UserConstructionScript, CallFunc_GetObjectName_ReturnValue) == 0x000010, "Member 'BP_BreakableProps_C_UserConstructionScript::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_UserConstructionScript, CallFunc_GetActorScale3D_ReturnValue) == 0x000020, "Member 'BP_BreakableProps_C_UserConstructionScript::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_UserConstructionScript, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000030, "Member 'BP_BreakableProps_C_UserConstructionScript::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000040, "Member 'BP_BreakableProps_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000044, "Member 'BP_BreakableProps_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000048, "Member 'BP_BreakableProps_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_UserConstructionScript, CallFunc_Less_FloatFloat_ReturnValue) == 0x00004C, "Member 'BP_BreakableProps_C_UserConstructionScript::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_UserConstructionScript, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x00004D, "Member 'BP_BreakableProps_C_UserConstructionScript::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_UserConstructionScript, CallFunc_Less_FloatFloat_ReturnValue_2) == 0x00004E, "Member 'BP_BreakableProps_C_UserConstructionScript::CallFunc_Less_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_UserConstructionScript, CallFunc_GetActorScale3D_ReturnValue_1) == 0x000050, "Member 'BP_BreakableProps_C_UserConstructionScript::CallFunc_GetActorScale3D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_UserConstructionScript, CallFunc_BooleanOR_ReturnValue) == 0x00005C, "Member 'BP_BreakableProps_C_UserConstructionScript::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_UserConstructionScript, CallFunc_Vector_GetAbs_ReturnValue) == 0x000060, "Member 'BP_BreakableProps_C_UserConstructionScript::CallFunc_Vector_GetAbs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_UserConstructionScript, CallFunc_BooleanOR_ReturnValue_1) == 0x00006C, "Member 'BP_BreakableProps_C_UserConstructionScript::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function BP_BreakableProps.BP_BreakableProps_C.SnapToGroundZ
// 0x0220 (0x0220 - 0x0000)
struct BP_BreakableProps_C_SnapToGroundZ final
{
public:
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0000(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0058(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_1;                          // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0190(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BreakableProps_C_SnapToGroundZ) == 0x000008, "Wrong alignment on BP_BreakableProps_C_SnapToGroundZ");
static_assert(sizeof(BP_BreakableProps_C_SnapToGroundZ) == 0x000220, "Wrong size on BP_BreakableProps_C_SnapToGroundZ");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, Temp_object_Variable) == 0x000000, "Member 'BP_BreakableProps_C_SnapToGroundZ::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_GetActorBounds_Origin) == 0x000010, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_GetActorBounds_BoxExtent) == 0x00001C, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_BreakVector_X) == 0x000034, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_BreakVector_Y) == 0x000038, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_BreakVector_Z) == 0x00003C, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000040, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00004C, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_LineTraceSingle_OutHit) == 0x000058, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_LineTraceSingle_ReturnValue) == 0x0000E0, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_BreakVector_X_1) == 0x0000E4, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_BreakVector_Y_1) == 0x0000E8, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_BreakVector_Z_1) == 0x0000EC, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_BreakHitResult_bBlockingHit) == 0x0000F0, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000F1, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_BreakHitResult_Time) == 0x0000F4, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_BreakHitResult_Distance) == 0x0000F8, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_BreakHitResult_Location) == 0x0000FC, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_BreakHitResult_ImpactPoint) == 0x000108, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_BreakHitResult_Normal) == 0x000114, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_BreakHitResult_ImpactNormal) == 0x000120, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_BreakHitResult_PhysMat) == 0x000130, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_BreakHitResult_HitActor) == 0x000138, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_BreakHitResult_HitComponent) == 0x000140, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_BreakHitResult_HitBoneName) == 0x000148, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_BreakHitResult_HitItem) == 0x000150, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_BreakHitResult_ElementIndex) == 0x000154, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_BreakHitResult_FaceIndex) == 0x000158, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_BreakHitResult_TraceStart) == 0x00015C, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_BreakHitResult_TraceEnd) == 0x000168, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_BreakVector_X_2) == 0x000174, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_BreakVector_Y_2) == 0x000178, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_BreakVector_Z_2) == 0x00017C, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_Add_FloatFloat_ReturnValue) == 0x000180, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_MakeVector_ReturnValue) == 0x000184, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000190, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SnapToGroundZ, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000218, "Member 'BP_BreakableProps_C_SnapToGroundZ::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

// Function BP_BreakableProps.BP_BreakableProps_C.SetupAndActivateParticle
// 0x00C0 (0x00C0 - 0x0000)
struct BP_BreakableProps_C_SetupAndActivateParticle final
{
public:
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrawlerHero_C*                      K2Node_DynamicCast_AsBP_Brawler_Hero;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0030(0x0080)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x00B0(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_BreakableProps_C_SetupAndActivateParticle) == 0x000010, "Wrong alignment on BP_BreakableProps_C_SetupAndActivateParticle");
static_assert(sizeof(BP_BreakableProps_C_SetupAndActivateParticle) == 0x0000C0, "Wrong size on BP_BreakableProps_C_SetupAndActivateParticle");
static_assert(offsetof(BP_BreakableProps_C_SetupAndActivateParticle, CallFunc_GetPlayerPawn_ReturnValue) == 0x000000, "Member 'BP_BreakableProps_C_SetupAndActivateParticle::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SetupAndActivateParticle, K2Node_DynamicCast_AsBP_Brawler_Hero) == 0x000008, "Member 'BP_BreakableProps_C_SetupAndActivateParticle::K2Node_DynamicCast_AsBP_Brawler_Hero' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SetupAndActivateParticle, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_BreakableProps_C_SetupAndActivateParticle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SetupAndActivateParticle, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000014, "Member 'BP_BreakableProps_C_SetupAndActivateParticle::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SetupAndActivateParticle, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000020, "Member 'BP_BreakableProps_C_SetupAndActivateParticle::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SetupAndActivateParticle, K2Node_MakeStruct_ParticleSysParam) == 0x000030, "Member 'BP_BreakableProps_C_SetupAndActivateParticle::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SetupAndActivateParticle, K2Node_MakeArray_Array) == 0x0000B0, "Member 'BP_BreakableProps_C_SetupAndActivateParticle::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_BreakableProps.BP_BreakableProps_C.SelectPropFromDT
// 0x0120 (0x0120 - 0x0000)
struct BP_BreakableProps_C_SelectPropFromDT final
{
public:
	class FName                                   RowName;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_BreakableProps                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x00B0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System;               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_2;         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          K2Node_DynamicCast_AsAk_Audio_Event;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDamageTakenVFXDataAsset*               K2Node_DynamicCast_AsDamage_Taken_VFXData_Asset;   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_3;         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDestructibleMesh*                      K2Node_DynamicCast_AsDestructible_Mesh;            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BreakableProps_C_SelectPropFromDT) == 0x000008, "Wrong alignment on BP_BreakableProps_C_SelectPropFromDT");
static_assert(sizeof(BP_BreakableProps_C_SelectPropFromDT) == 0x000120, "Wrong size on BP_BreakableProps_C_SelectPropFromDT");
static_assert(offsetof(BP_BreakableProps_C_SelectPropFromDT, RowName) == 0x000000, "Member 'BP_BreakableProps_C_SelectPropFromDT::RowName' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SelectPropFromDT, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'BP_BreakableProps_C_SelectPropFromDT::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SelectPropFromDT, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000B8, "Member 'BP_BreakableProps_C_SelectPropFromDT::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SelectPropFromDT, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x0000B9, "Member 'BP_BreakableProps_C_SelectPropFromDT::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SelectPropFromDT, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0000C0, "Member 'BP_BreakableProps_C_SelectPropFromDT::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SelectPropFromDT, K2Node_DynamicCast_AsNiagara_System) == 0x0000C8, "Member 'BP_BreakableProps_C_SelectPropFromDT::K2Node_DynamicCast_AsNiagara_System' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SelectPropFromDT, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'BP_BreakableProps_C_SelectPropFromDT::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SelectPropFromDT, CallFunc_LoadAsset_Blocking_ReturnValue_1) == 0x0000D8, "Member 'BP_BreakableProps_C_SelectPropFromDT::CallFunc_LoadAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SelectPropFromDT, CallFunc_LoadAsset_Blocking_ReturnValue_2) == 0x0000E0, "Member 'BP_BreakableProps_C_SelectPropFromDT::CallFunc_LoadAsset_Blocking_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SelectPropFromDT, K2Node_DynamicCast_AsAk_Audio_Event) == 0x0000E8, "Member 'BP_BreakableProps_C_SelectPropFromDT::K2Node_DynamicCast_AsAk_Audio_Event' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SelectPropFromDT, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'BP_BreakableProps_C_SelectPropFromDT::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SelectPropFromDT, K2Node_DynamicCast_AsDamage_Taken_VFXData_Asset) == 0x0000F8, "Member 'BP_BreakableProps_C_SelectPropFromDT::K2Node_DynamicCast_AsDamage_Taken_VFXData_Asset' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SelectPropFromDT, K2Node_DynamicCast_bSuccess_2) == 0x000100, "Member 'BP_BreakableProps_C_SelectPropFromDT::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SelectPropFromDT, CallFunc_LoadAsset_Blocking_ReturnValue_3) == 0x000108, "Member 'BP_BreakableProps_C_SelectPropFromDT::CallFunc_LoadAsset_Blocking_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SelectPropFromDT, K2Node_DynamicCast_AsDestructible_Mesh) == 0x000110, "Member 'BP_BreakableProps_C_SelectPropFromDT::K2Node_DynamicCast_AsDestructible_Mesh' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_C_SelectPropFromDT, K2Node_DynamicCast_bSuccess_3) == 0x000118, "Member 'BP_BreakableProps_C_SelectPropFromDT::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

// Function BP_BreakableProps.BP_BreakableProps_C.SetupMaterial
// 0x000C (0x000C - 0x0000)
struct BP_BreakableProps_C_SetupMaterial final
{
public:
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BreakableProps_C_SetupMaterial) == 0x000004, "Wrong alignment on BP_BreakableProps_C_SetupMaterial");
static_assert(sizeof(BP_BreakableProps_C_SetupMaterial) == 0x00000C, "Wrong size on BP_BreakableProps_C_SetupMaterial");
static_assert(offsetof(BP_BreakableProps_C_SetupMaterial, CallFunc_MakeVector_ReturnValue) == 0x000000, "Member 'BP_BreakableProps_C_SetupMaterial::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function BP_BreakableProps.BP_BreakableProps_C.Break
// 0x00A8 (0x00A8 - 0x0000)
struct BP_BreakableProps_C_Break final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
