#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BasicImpFireballEntropic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BasicImpFireballEntropic.BP_BasicImpFireballEntropic_C
// 0x0060 (0x1B20 - 0x1AC0)
class ABP_BasicImpFireballEntropic_C : public AEnemyCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1AC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_EntropyEnemy_Die;                               // 0x1AC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_EntropyInsideMesh_C*                BP_EntropyInsideMesh;                              // 0x1AD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_EntropicEnemy;                                  // 0x1AD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TR_CurrentAction;                                  // 0x1AE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDestructibleComponent*                 DM_amorf;                                          // 0x1AE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_HPBarWidgetComponent_C*             BP_HPBarWidgetComponent;                           // 0x1AF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                HitBox;                                            // 0x1AF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                LegHitBox;                                         // 0x1B00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule1;                                      // 0x1B08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FadeSpeed;                                         // 0x1B10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeValue;                                         // 0x1B14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BasicImpFireballEntropic(int32 EntryPoint);
	void OnKilled(class UObject* Killer, class UAbilityController* KillerAbilityController);
	void BPPostBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BasicImpFireballEntropic_C">();
	}
	static class ABP_BasicImpFireballEntropic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BasicImpFireballEntropic_C>();
	}
};
static_assert(alignof(ABP_BasicImpFireballEntropic_C) == 0x000010, "Wrong alignment on ABP_BasicImpFireballEntropic_C");
static_assert(sizeof(ABP_BasicImpFireballEntropic_C) == 0x001B20, "Wrong size on ABP_BasicImpFireballEntropic_C");
static_assert(offsetof(ABP_BasicImpFireballEntropic_C, UberGraphFrame) == 0x001AC0, "Member 'ABP_BasicImpFireballEntropic_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpFireballEntropic_C, NS_EntropyEnemy_Die) == 0x001AC8, "Member 'ABP_BasicImpFireballEntropic_C::NS_EntropyEnemy_Die' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpFireballEntropic_C, BP_EntropyInsideMesh) == 0x001AD0, "Member 'ABP_BasicImpFireballEntropic_C::BP_EntropyInsideMesh' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpFireballEntropic_C, NS_EntropicEnemy) == 0x001AD8, "Member 'ABP_BasicImpFireballEntropic_C::NS_EntropicEnemy' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpFireballEntropic_C, TR_CurrentAction) == 0x001AE0, "Member 'ABP_BasicImpFireballEntropic_C::TR_CurrentAction' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpFireballEntropic_C, DM_amorf) == 0x001AE8, "Member 'ABP_BasicImpFireballEntropic_C::DM_amorf' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpFireballEntropic_C, BP_HPBarWidgetComponent) == 0x001AF0, "Member 'ABP_BasicImpFireballEntropic_C::BP_HPBarWidgetComponent' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpFireballEntropic_C, HitBox) == 0x001AF8, "Member 'ABP_BasicImpFireballEntropic_C::HitBox' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpFireballEntropic_C, LegHitBox) == 0x001B00, "Member 'ABP_BasicImpFireballEntropic_C::LegHitBox' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpFireballEntropic_C, HurtCapsule1) == 0x001B08, "Member 'ABP_BasicImpFireballEntropic_C::HurtCapsule1' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpFireballEntropic_C, FadeSpeed) == 0x001B10, "Member 'ABP_BasicImpFireballEntropic_C::FadeSpeed' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpFireballEntropic_C, FadeValue) == 0x001B14, "Member 'ABP_BasicImpFireballEntropic_C::FadeValue' has a wrong offset!");

}

