#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BrawlerInventoryVisual

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BrawlerInventoryVisual.BP_BrawlerInventoryVisual_C.ExecuteUbergraph_BP_BrawlerInventoryVisual
// 0x00A8 (0x00A8 - 0x0000)
struct BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x000D(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x000E(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x000F(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x0010(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x0011(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x0012(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x001C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_8;                              // 0x001E(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_9;                              // 0x001F(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_10;                             // 0x0020(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UInventorySlot* InventorySlot)> K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Get_Item_1;                         // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventorySlot*                         K2Node_CustomEvent_InventorySlot;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPersistentHeroData*                    CallFunc_GetPersistentHeroData_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventory*                             CallFunc_GetHeroInventory_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BrawlerInventory_C*                 K2Node_DynamicCast_AsBP_Brawler_Inventory;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_2;                         // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_11;                             // 0x0095(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual) == 0x000008, "Wrong alignment on BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual");
static_assert(sizeof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual) == 0x0000A8, "Wrong size on BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, EntryPoint) == 0x000000, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, Temp_bool_Variable) == 0x00000C, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, Temp_bool_Variable_1) == 0x00000D, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, Temp_bool_Variable_2) == 0x00000E, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, Temp_bool_Variable_3) == 0x00000F, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, Temp_bool_Variable_4) == 0x000010, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, Temp_bool_Variable_5) == 0x000011, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, Temp_bool_Variable_6) == 0x000012, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, CallFunc_IsValid_ReturnValue) == 0x000013, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, CallFunc_Array_Length_ReturnValue_1) == 0x000018, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, Temp_bool_Variable_7) == 0x00001C, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, CallFunc_Less_IntInt_ReturnValue) == 0x00001D, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, Temp_bool_Variable_8) == 0x00001E, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, Temp_bool_Variable_9) == 0x00001F, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, Temp_bool_Variable_10) == 0x000020, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::Temp_bool_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, Temp_int_Loop_Counter_Variable_1) == 0x000034, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, CallFunc_Less_IntInt_ReturnValue_1) == 0x000038, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, CallFunc_Add_IntInt_ReturnValue_1) == 0x00003C, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, Temp_int_Array_Index_Variable) == 0x000040, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, Temp_int_Array_Index_Variable_1) == 0x000044, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, CallFunc_Array_Get_Item_1) == 0x000049, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, K2Node_SwitchInteger_CmpSuccess) == 0x00004A, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, K2Node_SwitchInteger_CmpSuccess_1) == 0x00004B, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, K2Node_CustomEvent_InventorySlot) == 0x000050, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::K2Node_CustomEvent_InventorySlot' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, CallFunc_GetManGameMode_ReturnValue) == 0x000058, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::CallFunc_GetManGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, CallFunc_GetPersistentHeroData_ReturnValue) == 0x000060, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::CallFunc_GetPersistentHeroData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, K2Node_SwitchEnum_CmpSuccess) == 0x000068, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, CallFunc_IsValid_ReturnValue_1) == 0x000069, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, CallFunc_GetHeroInventory_ReturnValue) == 0x000070, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::CallFunc_GetHeroInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, CallFunc_IsValid_ReturnValue_2) == 0x000078, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, K2Node_DynamicCast_AsBP_Brawler_Inventory) == 0x000080, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::K2Node_DynamicCast_AsBP_Brawler_Inventory' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, CallFunc_IsValid_ReturnValue_3) == 0x000089, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, CallFunc_Array_Get_Item_2) == 0x00008C, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, K2Node_SwitchName_CmpSuccess) == 0x000094, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, Temp_bool_Variable_11) == 0x000095, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::Temp_bool_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual, K2Node_CreateDelegate_OutputDelegate_1) == 0x000098, "Member 'BP_BrawlerInventoryVisual_C_ExecuteUbergraph_BP_BrawlerInventoryVisual::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function BP_BrawlerInventoryVisual.BP_BrawlerInventoryVisual_C.OnUpdateSlot_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BP_BrawlerInventoryVisual_C_OnUpdateSlot_Event_0 final
{
public:
	class UInventorySlot*                         InventorySlot;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BrawlerInventoryVisual_C_OnUpdateSlot_Event_0) == 0x000008, "Wrong alignment on BP_BrawlerInventoryVisual_C_OnUpdateSlot_Event_0");
static_assert(sizeof(BP_BrawlerInventoryVisual_C_OnUpdateSlot_Event_0) == 0x000008, "Wrong size on BP_BrawlerInventoryVisual_C_OnUpdateSlot_Event_0");
static_assert(offsetof(BP_BrawlerInventoryVisual_C_OnUpdateSlot_Event_0, InventorySlot) == 0x000000, "Member 'BP_BrawlerInventoryVisual_C_OnUpdateSlot_Event_0::InventorySlot' has a wrong offset!");

}

