#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BossScreen

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "man_structs.hpp"


namespace SDK::Params
{

// Function BP_BossScreen.BP_BossScreen_C.ExecuteUbergraph_BP_BossScreen
// 0x0080 (0x0080 - 0x0000)
struct BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration_1;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue;         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue_1;       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDemoMode                                     CallFunc_GetDemoMode_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EDemoMode                                     CallFunc_GetDemoMode_ReturnValue_1;                // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EDemoMode                                     CallFunc_GetDemoMode_ReturnValue_2;                // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EDemoMode                                     CallFunc_GetDemoMode_ReturnValue_3;                // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen) == 0x000008, "Wrong alignment on BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen");
static_assert(sizeof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen) == 0x000080, "Wrong size on BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen");
static_assert(offsetof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen, EntryPoint) == 0x000000, "Member 'BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen, K2Node_Event_MyGeometry) == 0x000004, "Member 'BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen, K2Node_Event_AnimDuration_1) == 0x000040, "Member 'BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen::K2Node_Event_AnimDuration_1' has a wrong offset!");
static_assert(offsetof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen, CallFunc_GetAnimPlaybackSpeed_ReturnValue) == 0x000044, "Member 'BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen::CallFunc_GetAnimPlaybackSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen, K2Node_Event_AnimDuration) == 0x000048, "Member 'BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen::K2Node_Event_AnimDuration' has a wrong offset!");
static_assert(offsetof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen, CallFunc_GetAnimPlaybackSpeed_ReturnValue_1) == 0x000058, "Member 'BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen::CallFunc_GetAnimPlaybackSpeed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen, CallFunc_PlayAnimation_ReturnValue_1) == 0x000060, "Member 'BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen, CallFunc_GetDemoMode_ReturnValue) == 0x000068, "Member 'BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen::CallFunc_GetDemoMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000069, "Member 'BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00006A, "Member 'BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00006B, "Member 'BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen, CallFunc_BooleanOR_ReturnValue) == 0x00006C, "Member 'BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00006D, "Member 'BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen, CallFunc_BooleanOR_ReturnValue_1) == 0x00006E, "Member 'BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen, CallFunc_BooleanOR_ReturnValue_2) == 0x00006F, "Member 'BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen, CallFunc_IsActive_ReturnValue) == 0x000070, "Member 'BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen, CallFunc_GetDemoMode_ReturnValue_1) == 0x000071, "Member 'BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen::CallFunc_GetDemoMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000072, "Member 'BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x000073, "Member 'BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen, CallFunc_BooleanOR_ReturnValue_3) == 0x000074, "Member 'BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen, CallFunc_GetDemoMode_ReturnValue_2) == 0x000075, "Member 'BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen::CallFunc_GetDemoMode_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x000076, "Member 'BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen, CallFunc_GetDemoMode_ReturnValue_3) == 0x000077, "Member 'BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen::CallFunc_GetDemoMode_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen, CallFunc_EqualEqual_ByteByte_ReturnValue_7) == 0x000078, "Member 'BP_BossScreen_C_ExecuteUbergraph_BP_BossScreen::CallFunc_EqualEqual_ByteByte_ReturnValue_7' has a wrong offset!");

// Function BP_BossScreen.BP_BossScreen_C.OnHide
// 0x0004 (0x0004 - 0x0000)
struct BP_BossScreen_C_OnHide final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BossScreen_C_OnHide) == 0x000004, "Wrong alignment on BP_BossScreen_C_OnHide");
static_assert(sizeof(BP_BossScreen_C_OnHide) == 0x000004, "Wrong size on BP_BossScreen_C_OnHide");
static_assert(offsetof(BP_BossScreen_C_OnHide, AnimDuration) == 0x000000, "Member 'BP_BossScreen_C_OnHide::AnimDuration' has a wrong offset!");

// Function BP_BossScreen.BP_BossScreen_C.OnShow
// 0x0004 (0x0004 - 0x0000)
struct BP_BossScreen_C_OnShow final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BossScreen_C_OnShow) == 0x000004, "Wrong alignment on BP_BossScreen_C_OnShow");
static_assert(sizeof(BP_BossScreen_C_OnShow) == 0x000004, "Wrong size on BP_BossScreen_C_OnShow");
static_assert(offsetof(BP_BossScreen_C_OnShow, AnimDuration) == 0x000000, "Member 'BP_BossScreen_C_OnShow::AnimDuration' has a wrong offset!");

// Function BP_BossScreen.BP_BossScreen_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_BossScreen_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BossScreen_C_Tick) == 0x000004, "Wrong alignment on BP_BossScreen_C_Tick");
static_assert(sizeof(BP_BossScreen_C_Tick) == 0x00003C, "Wrong size on BP_BossScreen_C_Tick");
static_assert(offsetof(BP_BossScreen_C_Tick, MyGeometry) == 0x000000, "Member 'BP_BossScreen_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_BossScreen_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_BossScreen_C_Tick::InDeltaTime' has a wrong offset!");

}

