#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BlackSmithCart_CS_A011_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_BlackSmithCart_CS_A011_Anim.BP_BlackSmithCart_CS_A011_Anim_C
// 0x03B0 (0x0A50 - 0x06A0)
class UBP_BlackSmithCart_CS_A011_Anim_C final : public UAnimInstanceBase
{
public:
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x06D8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0720(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x07A0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x07E8(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x08A8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0A00(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0A28(0x0028)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_BP_BlackSmithCart_CS_A011_Anim(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BlackSmithCart_CS_A011_Anim_C">();
	}
	static class UBP_BlackSmithCart_CS_A011_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BlackSmithCart_CS_A011_Anim_C>();
	}
};
static_assert(alignof(UBP_BlackSmithCart_CS_A011_Anim_C) == 0x000010, "Wrong alignment on UBP_BlackSmithCart_CS_A011_Anim_C");
static_assert(sizeof(UBP_BlackSmithCart_CS_A011_Anim_C) == 0x000A50, "Wrong size on UBP_BlackSmithCart_CS_A011_Anim_C");
static_assert(offsetof(UBP_BlackSmithCart_CS_A011_Anim_C, UberGraphFrame) == 0x0006A0, "Member 'UBP_BlackSmithCart_CS_A011_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_BlackSmithCart_CS_A011_Anim_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UBP_BlackSmithCart_CS_A011_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_BlackSmithCart_CS_A011_Anim_C, AnimGraphNode_Slot_1) == 0x0006D8, "Member 'UBP_BlackSmithCart_CS_A011_Anim_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UBP_BlackSmithCart_CS_A011_Anim_C, AnimGraphNode_SequencePlayer) == 0x000720, "Member 'UBP_BlackSmithCart_CS_A011_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBP_BlackSmithCart_CS_A011_Anim_C, AnimGraphNode_Slot) == 0x0007A0, "Member 'UBP_BlackSmithCart_CS_A011_Anim_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UBP_BlackSmithCart_CS_A011_Anim_C, AnimGraphNode_LayeredBoneBlend) == 0x0007E8, "Member 'UBP_BlackSmithCart_CS_A011_Anim_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UBP_BlackSmithCart_CS_A011_Anim_C, AnimGraphNode_SaveCachedPose) == 0x0008A8, "Member 'UBP_BlackSmithCart_CS_A011_Anim_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UBP_BlackSmithCart_CS_A011_Anim_C, AnimGraphNode_UseCachedPose_1) == 0x000A00, "Member 'UBP_BlackSmithCart_CS_A011_Anim_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UBP_BlackSmithCart_CS_A011_Anim_C, AnimGraphNode_UseCachedPose) == 0x000A28, "Member 'UBP_BlackSmithCart_CS_A011_Anim_C::AnimGraphNode_UseCachedPose' has a wrong offset!");

}

