#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BladeDanceImpact_VE

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BladeDanceImpact_VE.BP_BladeDanceImpact_VE_C
// 0x0020 (0x0370 - 0x0350)
class ABP_BladeDanceImpact_VE_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara2;                                          // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara1;                                          // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BladeDanceImpact_VE(int32 EntryPoint);
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BladeDanceImpact_VE_C">();
	}
	static class ABP_BladeDanceImpact_VE_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BladeDanceImpact_VE_C>();
	}
};
static_assert(alignof(ABP_BladeDanceImpact_VE_C) == 0x000008, "Wrong alignment on ABP_BladeDanceImpact_VE_C");
static_assert(sizeof(ABP_BladeDanceImpact_VE_C) == 0x000370, "Wrong size on ABP_BladeDanceImpact_VE_C");
static_assert(offsetof(ABP_BladeDanceImpact_VE_C, UberGraphFrame) == 0x000350, "Member 'ABP_BladeDanceImpact_VE_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BladeDanceImpact_VE_C, Niagara2) == 0x000358, "Member 'ABP_BladeDanceImpact_VE_C::Niagara2' has a wrong offset!");
static_assert(offsetof(ABP_BladeDanceImpact_VE_C, Niagara1) == 0x000360, "Member 'ABP_BladeDanceImpact_VE_C::Niagara1' has a wrong offset!");
static_assert(offsetof(ABP_BladeDanceImpact_VE_C, Niagara) == 0x000368, "Member 'ABP_BladeDanceImpact_VE_C::Niagara' has a wrong offset!");

}

