#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BrawlerSprint

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BrawlerSprint.BP_BrawlerSprint_C.ExecuteUbergraph_BP_BrawlerSprint
// 0x0020 (0x0020 - 0x0000)
struct BP_BrawlerSprint_C_ExecuteUbergraph_BP_BrawlerSprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetActor_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackComponent*                CallFunc_SpawnForceFeedbackAttached_ReturnValue;   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BrawlerSprint_C_ExecuteUbergraph_BP_BrawlerSprint) == 0x000008, "Wrong alignment on BP_BrawlerSprint_C_ExecuteUbergraph_BP_BrawlerSprint");
static_assert(sizeof(BP_BrawlerSprint_C_ExecuteUbergraph_BP_BrawlerSprint) == 0x000020, "Wrong size on BP_BrawlerSprint_C_ExecuteUbergraph_BP_BrawlerSprint");
static_assert(offsetof(BP_BrawlerSprint_C_ExecuteUbergraph_BP_BrawlerSprint, EntryPoint) == 0x000000, "Member 'BP_BrawlerSprint_C_ExecuteUbergraph_BP_BrawlerSprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BrawlerSprint_C_ExecuteUbergraph_BP_BrawlerSprint, CallFunc_GetActor_ReturnValue) == 0x000008, "Member 'BP_BrawlerSprint_C_ExecuteUbergraph_BP_BrawlerSprint::CallFunc_GetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerSprint_C_ExecuteUbergraph_BP_BrawlerSprint, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000010, "Member 'BP_BrawlerSprint_C_ExecuteUbergraph_BP_BrawlerSprint::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerSprint_C_ExecuteUbergraph_BP_BrawlerSprint, CallFunc_SpawnForceFeedbackAttached_ReturnValue) == 0x000018, "Member 'BP_BrawlerSprint_C_ExecuteUbergraph_BP_BrawlerSprint::CallFunc_SpawnForceFeedbackAttached_ReturnValue' has a wrong offset!");

}

