#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BestiaryUpdatedNotification

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EPickupNotificationTypes_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_BestiaryUpdatedNotification.BP_BestiaryUpdatedNotification_C
// 0x0050 (0x02B0 - 0x0260)
class UBP_BestiaryUpdatedNotification_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HidePanel;                                         // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowPanel;                                         // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Bg;                                                // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_1;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VFX;                                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           HideTimerHandle;                                   // 0x02A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EPickupNotificationTypes                      PickupType;                                        // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Showing;                                           // 0x02A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSmallScreen;                                     // 0x02AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BP_BestiaryUpdatedNotification(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void ShowNotification(float Timeout);
	void HideNotification();
	void ToggleSmallScreen(bool InIsSmallScreen);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BestiaryUpdatedNotification_C">();
	}
	static class UBP_BestiaryUpdatedNotification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BestiaryUpdatedNotification_C>();
	}
};
static_assert(alignof(UBP_BestiaryUpdatedNotification_C) == 0x000008, "Wrong alignment on UBP_BestiaryUpdatedNotification_C");
static_assert(sizeof(UBP_BestiaryUpdatedNotification_C) == 0x0002B0, "Wrong size on UBP_BestiaryUpdatedNotification_C");
static_assert(offsetof(UBP_BestiaryUpdatedNotification_C, UberGraphFrame) == 0x000260, "Member 'UBP_BestiaryUpdatedNotification_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_BestiaryUpdatedNotification_C, HidePanel) == 0x000268, "Member 'UBP_BestiaryUpdatedNotification_C::HidePanel' has a wrong offset!");
static_assert(offsetof(UBP_BestiaryUpdatedNotification_C, ShowPanel) == 0x000270, "Member 'UBP_BestiaryUpdatedNotification_C::ShowPanel' has a wrong offset!");
static_assert(offsetof(UBP_BestiaryUpdatedNotification_C, Bg) == 0x000278, "Member 'UBP_BestiaryUpdatedNotification_C::Bg' has a wrong offset!");
static_assert(offsetof(UBP_BestiaryUpdatedNotification_C, Icon) == 0x000280, "Member 'UBP_BestiaryUpdatedNotification_C::Icon' has a wrong offset!");
static_assert(offsetof(UBP_BestiaryUpdatedNotification_C, Name_0) == 0x000288, "Member 'UBP_BestiaryUpdatedNotification_C::Name_0' has a wrong offset!");
static_assert(offsetof(UBP_BestiaryUpdatedNotification_C, Overlay_1) == 0x000290, "Member 'UBP_BestiaryUpdatedNotification_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(UBP_BestiaryUpdatedNotification_C, VFX) == 0x000298, "Member 'UBP_BestiaryUpdatedNotification_C::VFX' has a wrong offset!");
static_assert(offsetof(UBP_BestiaryUpdatedNotification_C, HideTimerHandle) == 0x0002A0, "Member 'UBP_BestiaryUpdatedNotification_C::HideTimerHandle' has a wrong offset!");
static_assert(offsetof(UBP_BestiaryUpdatedNotification_C, PickupType) == 0x0002A8, "Member 'UBP_BestiaryUpdatedNotification_C::PickupType' has a wrong offset!");
static_assert(offsetof(UBP_BestiaryUpdatedNotification_C, Showing) == 0x0002A9, "Member 'UBP_BestiaryUpdatedNotification_C::Showing' has a wrong offset!");
static_assert(offsetof(UBP_BestiaryUpdatedNotification_C, IsSmallScreen) == 0x0002AA, "Member 'UBP_BestiaryUpdatedNotification_C::IsSmallScreen' has a wrong offset!");

}

