#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BossScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_BossScreen.BP_BossScreen_C
// 0x0070 (0x0528 - 0x04B8)
class UBP_BossScreen_C final : public UBossScreenUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundBlur*                        BgBlur;                                            // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BgImage;                                           // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BottomScreenFrame;                                 // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyA;                                        // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyHoldX;                                    // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyHoldY;                                    // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Caption_Store;                                     // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Caption_ThankYou;                                  // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ContentFrame;                                      // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_1;                                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                StoreBtn;                                          // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BossScreen(int32 EntryPoint);
	void BndEvt__BP_BossScreen_StoreBtn_K2Node_ComponentBoundEvent_2_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__BP_BossScreen_StoreBtn_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__BtnHotkeyA_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void OnGamepadAEvent();
	void OnHide(float AnimDuration);
	void OnShow(float AnimDuration);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BossScreen_C">();
	}
	static class UBP_BossScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BossScreen_C>();
	}
};
static_assert(alignof(UBP_BossScreen_C) == 0x000008, "Wrong alignment on UBP_BossScreen_C");
static_assert(sizeof(UBP_BossScreen_C) == 0x000528, "Wrong size on UBP_BossScreen_C");
static_assert(offsetof(UBP_BossScreen_C, UberGraphFrame) == 0x0004B8, "Member 'UBP_BossScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_BossScreen_C, FadeOutAnim) == 0x0004C0, "Member 'UBP_BossScreen_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_BossScreen_C, FadeInAnim) == 0x0004C8, "Member 'UBP_BossScreen_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_BossScreen_C, BgBlur) == 0x0004D0, "Member 'UBP_BossScreen_C::BgBlur' has a wrong offset!");
static_assert(offsetof(UBP_BossScreen_C, BgImage) == 0x0004D8, "Member 'UBP_BossScreen_C::BgImage' has a wrong offset!");
static_assert(offsetof(UBP_BossScreen_C, BottomScreenFrame) == 0x0004E0, "Member 'UBP_BossScreen_C::BottomScreenFrame' has a wrong offset!");
static_assert(offsetof(UBP_BossScreen_C, BtnHotkeyA) == 0x0004E8, "Member 'UBP_BossScreen_C::BtnHotkeyA' has a wrong offset!");
static_assert(offsetof(UBP_BossScreen_C, BtnHotkeyHoldX) == 0x0004F0, "Member 'UBP_BossScreen_C::BtnHotkeyHoldX' has a wrong offset!");
static_assert(offsetof(UBP_BossScreen_C, BtnHotkeyHoldY) == 0x0004F8, "Member 'UBP_BossScreen_C::BtnHotkeyHoldY' has a wrong offset!");
static_assert(offsetof(UBP_BossScreen_C, Caption_Store) == 0x000500, "Member 'UBP_BossScreen_C::Caption_Store' has a wrong offset!");
static_assert(offsetof(UBP_BossScreen_C, Caption_ThankYou) == 0x000508, "Member 'UBP_BossScreen_C::Caption_ThankYou' has a wrong offset!");
static_assert(offsetof(UBP_BossScreen_C, ContentFrame) == 0x000510, "Member 'UBP_BossScreen_C::ContentFrame' has a wrong offset!");
static_assert(offsetof(UBP_BossScreen_C, SizeBox_1) == 0x000518, "Member 'UBP_BossScreen_C::SizeBox_1' has a wrong offset!");
static_assert(offsetof(UBP_BossScreen_C, StoreBtn) == 0x000520, "Member 'UBP_BossScreen_C::StoreBtn' has a wrong offset!");

}

