#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BasicImpClawEntropic

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BasicImpClawEntropic.BP_BasicImpClawEntropic_C.ExecuteUbergraph_BP_BasicImpClawEntropic
// 0x0040 (0x0040 - 0x0000)
struct BP_BasicImpClawEntropic_C_ExecuteUbergraph_BP_BasicImpClawEntropic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Killer, class UAbilityController* KillerAbilityController)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPIsAlive_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Killer;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     K2Node_CustomEvent_KillerAbilityController;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BasicImpClawEntropic_C_ExecuteUbergraph_BP_BasicImpClawEntropic) == 0x000008, "Wrong alignment on BP_BasicImpClawEntropic_C_ExecuteUbergraph_BP_BasicImpClawEntropic");
static_assert(sizeof(BP_BasicImpClawEntropic_C_ExecuteUbergraph_BP_BasicImpClawEntropic) == 0x000040, "Wrong size on BP_BasicImpClawEntropic_C_ExecuteUbergraph_BP_BasicImpClawEntropic");
static_assert(offsetof(BP_BasicImpClawEntropic_C_ExecuteUbergraph_BP_BasicImpClawEntropic, EntryPoint) == 0x000000, "Member 'BP_BasicImpClawEntropic_C_ExecuteUbergraph_BP_BasicImpClawEntropic::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BasicImpClawEntropic_C_ExecuteUbergraph_BP_BasicImpClawEntropic, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_BasicImpClawEntropic_C_ExecuteUbergraph_BP_BasicImpClawEntropic::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BasicImpClawEntropic_C_ExecuteUbergraph_BP_BasicImpClawEntropic, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'BP_BasicImpClawEntropic_C_ExecuteUbergraph_BP_BasicImpClawEntropic::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_BasicImpClawEntropic_C_ExecuteUbergraph_BP_BasicImpClawEntropic, CallFunc_BPIsAlive_ReturnValue) == 0x000018, "Member 'BP_BasicImpClawEntropic_C_ExecuteUbergraph_BP_BasicImpClawEntropic::CallFunc_BPIsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BasicImpClawEntropic_C_ExecuteUbergraph_BP_BasicImpClawEntropic, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00001C, "Member 'BP_BasicImpClawEntropic_C_ExecuteUbergraph_BP_BasicImpClawEntropic::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BasicImpClawEntropic_C_ExecuteUbergraph_BP_BasicImpClawEntropic, CallFunc_Add_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_BasicImpClawEntropic_C_ExecuteUbergraph_BP_BasicImpClawEntropic::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BasicImpClawEntropic_C_ExecuteUbergraph_BP_BasicImpClawEntropic, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000024, "Member 'BP_BasicImpClawEntropic_C_ExecuteUbergraph_BP_BasicImpClawEntropic::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BasicImpClawEntropic_C_ExecuteUbergraph_BP_BasicImpClawEntropic, K2Node_CustomEvent_Killer) == 0x000028, "Member 'BP_BasicImpClawEntropic_C_ExecuteUbergraph_BP_BasicImpClawEntropic::K2Node_CustomEvent_Killer' has a wrong offset!");
static_assert(offsetof(BP_BasicImpClawEntropic_C_ExecuteUbergraph_BP_BasicImpClawEntropic, K2Node_CustomEvent_KillerAbilityController) == 0x000030, "Member 'BP_BasicImpClawEntropic_C_ExecuteUbergraph_BP_BasicImpClawEntropic::K2Node_CustomEvent_KillerAbilityController' has a wrong offset!");
static_assert(offsetof(BP_BasicImpClawEntropic_C_ExecuteUbergraph_BP_BasicImpClawEntropic, CallFunc_GetAbilityController_ReturnValue) == 0x000038, "Member 'BP_BasicImpClawEntropic_C_ExecuteUbergraph_BP_BasicImpClawEntropic::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");

// Function BP_BasicImpClawEntropic.BP_BasicImpClawEntropic_C.OnKilled
// 0x0010 (0x0010 - 0x0000)
struct BP_BasicImpClawEntropic_C_OnKilled final
{
public:
	class UObject*                                Killer;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     KillerAbilityController;                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BasicImpClawEntropic_C_OnKilled) == 0x000008, "Wrong alignment on BP_BasicImpClawEntropic_C_OnKilled");
static_assert(sizeof(BP_BasicImpClawEntropic_C_OnKilled) == 0x000010, "Wrong size on BP_BasicImpClawEntropic_C_OnKilled");
static_assert(offsetof(BP_BasicImpClawEntropic_C_OnKilled, Killer) == 0x000000, "Member 'BP_BasicImpClawEntropic_C_OnKilled::Killer' has a wrong offset!");
static_assert(offsetof(BP_BasicImpClawEntropic_C_OnKilled, KillerAbilityController) == 0x000008, "Member 'BP_BasicImpClawEntropic_C_OnKilled::KillerAbilityController' has a wrong offset!");

// Function BP_BasicImpClawEntropic.BP_BasicImpClawEntropic_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_BasicImpClawEntropic_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BasicImpClawEntropic_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_BasicImpClawEntropic_C_ReceiveTick");
static_assert(sizeof(BP_BasicImpClawEntropic_C_ReceiveTick) == 0x000004, "Wrong size on BP_BasicImpClawEntropic_C_ReceiveTick");
static_assert(offsetof(BP_BasicImpClawEntropic_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_BasicImpClawEntropic_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

