#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BloodTrance_ActiveAbility

#include "Basic.hpp"

#include "man_structs.hpp"


namespace SDK::Params
{

// Function BP_BloodTrance_ActiveAbility.BP_BloodTrance_ActiveAbility_C.ExecuteUbergraph_BP_BloodTrance_ActiveAbility
// 0x0070 (0x0070 - 0x0000)
struct BP_BloodTrance_ActiveAbility_C_ExecuteUbergraph_BP_BloodTrance_ActiveAbility final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMandragoraGameMode*                    CallFunc_GetGameMode_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_CustomName;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimEventParam                        K2Node_CustomEvent_AnimEventParam;                 // 0x0020(0x0030)(NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityBase*                           K2Node_CustomEvent_pAbility;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BloodTrance_ActiveAbility_C_ExecuteUbergraph_BP_BloodTrance_ActiveAbility) == 0x000008, "Wrong alignment on BP_BloodTrance_ActiveAbility_C_ExecuteUbergraph_BP_BloodTrance_ActiveAbility");
static_assert(sizeof(BP_BloodTrance_ActiveAbility_C_ExecuteUbergraph_BP_BloodTrance_ActiveAbility) == 0x000070, "Wrong size on BP_BloodTrance_ActiveAbility_C_ExecuteUbergraph_BP_BloodTrance_ActiveAbility");
static_assert(offsetof(BP_BloodTrance_ActiveAbility_C_ExecuteUbergraph_BP_BloodTrance_ActiveAbility, EntryPoint) == 0x000000, "Member 'BP_BloodTrance_ActiveAbility_C_ExecuteUbergraph_BP_BloodTrance_ActiveAbility::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BloodTrance_ActiveAbility_C_ExecuteUbergraph_BP_BloodTrance_ActiveAbility, CallFunc_GetGameMode_ReturnValue) == 0x000008, "Member 'BP_BloodTrance_ActiveAbility_C_ExecuteUbergraph_BP_BloodTrance_ActiveAbility::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodTrance_ActiveAbility_C_ExecuteUbergraph_BP_BloodTrance_ActiveAbility, K2Node_Event_CustomName) == 0x000010, "Member 'BP_BloodTrance_ActiveAbility_C_ExecuteUbergraph_BP_BloodTrance_ActiveAbility::K2Node_Event_CustomName' has a wrong offset!");
static_assert(offsetof(BP_BloodTrance_ActiveAbility_C_ExecuteUbergraph_BP_BloodTrance_ActiveAbility, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000018, "Member 'BP_BloodTrance_ActiveAbility_C_ExecuteUbergraph_BP_BloodTrance_ActiveAbility::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodTrance_ActiveAbility_C_ExecuteUbergraph_BP_BloodTrance_ActiveAbility, K2Node_CustomEvent_AnimEventParam) == 0x000020, "Member 'BP_BloodTrance_ActiveAbility_C_ExecuteUbergraph_BP_BloodTrance_ActiveAbility::K2Node_CustomEvent_AnimEventParam' has a wrong offset!");
static_assert(offsetof(BP_BloodTrance_ActiveAbility_C_ExecuteUbergraph_BP_BloodTrance_ActiveAbility, K2Node_SwitchName_CmpSuccess) == 0x000050, "Member 'BP_BloodTrance_ActiveAbility_C_ExecuteUbergraph_BP_BloodTrance_ActiveAbility::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BloodTrance_ActiveAbility_C_ExecuteUbergraph_BP_BloodTrance_ActiveAbility, K2Node_CustomEvent_pAbility) == 0x000058, "Member 'BP_BloodTrance_ActiveAbility_C_ExecuteUbergraph_BP_BloodTrance_ActiveAbility::K2Node_CustomEvent_pAbility' has a wrong offset!");
static_assert(offsetof(BP_BloodTrance_ActiveAbility_C_ExecuteUbergraph_BP_BloodTrance_ActiveAbility, CallFunc_GetObjectClass_ReturnValue) == 0x000060, "Member 'BP_BloodTrance_ActiveAbility_C_ExecuteUbergraph_BP_BloodTrance_ActiveAbility::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodTrance_ActiveAbility_C_ExecuteUbergraph_BP_BloodTrance_ActiveAbility, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000068, "Member 'BP_BloodTrance_ActiveAbility_C_ExecuteUbergraph_BP_BloodTrance_ActiveAbility::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");

// Function BP_BloodTrance_ActiveAbility.BP_BloodTrance_ActiveAbility_C.OnAbilityEnd
// 0x0008 (0x0008 - 0x0000)
struct BP_BloodTrance_ActiveAbility_C_OnAbilityEnd final
{
public:
	class UAbilityBase*                           pAbility;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BloodTrance_ActiveAbility_C_OnAbilityEnd) == 0x000008, "Wrong alignment on BP_BloodTrance_ActiveAbility_C_OnAbilityEnd");
static_assert(sizeof(BP_BloodTrance_ActiveAbility_C_OnAbilityEnd) == 0x000008, "Wrong size on BP_BloodTrance_ActiveAbility_C_OnAbilityEnd");
static_assert(offsetof(BP_BloodTrance_ActiveAbility_C_OnAbilityEnd, pAbility) == 0x000000, "Member 'BP_BloodTrance_ActiveAbility_C_OnAbilityEnd::pAbility' has a wrong offset!");

// Function BP_BloodTrance_ActiveAbility.BP_BloodTrance_ActiveAbility_C.OnAnimationEvent
// 0x0030 (0x0030 - 0x0000)
struct BP_BloodTrance_ActiveAbility_C_OnAnimationEvent final
{
public:
	struct FAnimEventParam                        AnimEventParam;                                    // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_BloodTrance_ActiveAbility_C_OnAnimationEvent) == 0x000008, "Wrong alignment on BP_BloodTrance_ActiveAbility_C_OnAnimationEvent");
static_assert(sizeof(BP_BloodTrance_ActiveAbility_C_OnAnimationEvent) == 0x000030, "Wrong size on BP_BloodTrance_ActiveAbility_C_OnAnimationEvent");
static_assert(offsetof(BP_BloodTrance_ActiveAbility_C_OnAnimationEvent, AnimEventParam) == 0x000000, "Member 'BP_BloodTrance_ActiveAbility_C_OnAnimationEvent::AnimEventParam' has a wrong offset!");

// Function BP_BloodTrance_ActiveAbility.BP_BloodTrance_ActiveAbility_C.BPAbilityCustomEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_BloodTrance_ActiveAbility_C_BPAbilityCustomEvent final
{
public:
	class FName                                   CustomName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BloodTrance_ActiveAbility_C_BPAbilityCustomEvent) == 0x000004, "Wrong alignment on BP_BloodTrance_ActiveAbility_C_BPAbilityCustomEvent");
static_assert(sizeof(BP_BloodTrance_ActiveAbility_C_BPAbilityCustomEvent) == 0x000008, "Wrong size on BP_BloodTrance_ActiveAbility_C_BPAbilityCustomEvent");
static_assert(offsetof(BP_BloodTrance_ActiveAbility_C_BPAbilityCustomEvent, CustomName) == 0x000000, "Member 'BP_BloodTrance_ActiveAbility_C_BPAbilityCustomEvent::CustomName' has a wrong offset!");

}

