#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Brawler_SpeechBubbleControl

#include "Basic.hpp"

#include "man_structs.hpp"


namespace SDK::Params
{

// Function BP_Brawler_SpeechBubbleControl.BP_Brawler_SpeechBubbleControl_C.ExecuteUbergraph_BP_Brawler_SpeechBubbleControl
// 0x0238 (0x0238 - 0x0000)
struct BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EStatusEffectChange Change, EStatusEffectType StatusType, class AActor* SourceEntity, int32 StackNum)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     K2Node_CustomEvent_Source;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     K2Node_CustomEvent_Bullet;                         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     K2Node_CustomEvent_Target;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           K2Node_CustomEvent_Ability;                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_effectiveDamage;                // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageValue                           K2Node_CustomEvent_DamageValue;                    // 0x0050(0x0138)(ContainsInstancedReference)
	class AActor*                                 CallFunc_GetActor_ReturnValue;                     // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrawlerHero_C*                      K2Node_DynamicCast_AsBP_Brawler_Hero;              // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PeriodicSteamTrap_Passive_C*        K2Node_DynamicCast_AsBP_Periodic_Steam_Trap_Passive; // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SpringTrapDamage_C*                 K2Node_DynamicCast_AsBP_Spring_Trap_Damage;        // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C3[0x5];                                      // 0x01C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBase*                         CallFunc_GetCharacter_ReturnValue;                 // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStatusEffectController*                CallFunc_GetStatusEffectController_ReturnValue;    // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAbilityController* Source, class UAbilityController* Bullet, class UAbilityController* Target, class UAbilityBase* Ability, float effectiveDamage, const struct FDamageValue& DamageValue)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x01D8(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetActor_ReturnValue_1;                   // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrawlerHero_C*                      K2Node_DynamicCast_AsBP_Brawler_Hero_1;            // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EStatusEffectChange                           K2Node_CustomEvent_Change;                         // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStatusEffectType                             K2Node_CustomEvent_StatusType;                     // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FB[0x5];                                      // 0x01FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_SourceEntity;                   // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_StackNum;                       // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetActor_ReturnValue_2;                   // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetActor_ReturnValue_3;                   // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrawlerHero_C*                      K2Node_DynamicCast_AsBP_Brawler_Hero_2;            // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl) == 0x000008, "Wrong alignment on BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl");
static_assert(sizeof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl) == 0x000238, "Wrong size on BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, EntryPoint) == 0x000000, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, Temp_bool_Has_Been_Initd_Variable_1) == 0x000006, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, Temp_bool_IsClosed_Variable_1) == 0x000018, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, Temp_bool_Has_Been_Initd_Variable_2) == 0x000019, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, Temp_bool_IsClosed_Variable_2) == 0x00001A, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, CallFunc_GetAbilityController_ReturnValue) == 0x000020, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, K2Node_CustomEvent_Source) == 0x000028, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::K2Node_CustomEvent_Source' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, K2Node_CustomEvent_Bullet) == 0x000030, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::K2Node_CustomEvent_Bullet' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, K2Node_CustomEvent_Target) == 0x000038, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, K2Node_CustomEvent_Ability) == 0x000040, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::K2Node_CustomEvent_Ability' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, K2Node_CustomEvent_effectiveDamage) == 0x000048, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::K2Node_CustomEvent_effectiveDamage' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, K2Node_CustomEvent_DamageValue) == 0x000050, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::K2Node_CustomEvent_DamageValue' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, CallFunc_GetActor_ReturnValue) == 0x000188, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::CallFunc_GetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000190, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, K2Node_DynamicCast_AsBP_Brawler_Hero) == 0x000198, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::K2Node_DynamicCast_AsBP_Brawler_Hero' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, K2Node_DynamicCast_bSuccess) == 0x0001A0, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, K2Node_DynamicCast_AsBP_Periodic_Steam_Trap_Passive) == 0x0001A8, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::K2Node_DynamicCast_AsBP_Periodic_Steam_Trap_Passive' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, K2Node_DynamicCast_bSuccess_1) == 0x0001B0, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, K2Node_DynamicCast_AsBP_Spring_Trap_Damage) == 0x0001B8, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::K2Node_DynamicCast_AsBP_Spring_Trap_Damage' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, K2Node_DynamicCast_bSuccess_2) == 0x0001C0, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, CallFunc_IsValid_ReturnValue) == 0x0001C1, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, CallFunc_BooleanAND_ReturnValue) == 0x0001C2, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, CallFunc_GetCharacter_ReturnValue) == 0x0001C8, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, CallFunc_GetStatusEffectController_ReturnValue) == 0x0001D0, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::CallFunc_GetStatusEffectController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001D8, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, CallFunc_GetActor_ReturnValue_1) == 0x0001E8, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::CallFunc_GetActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, K2Node_DynamicCast_AsBP_Brawler_Hero_1) == 0x0001F0, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::K2Node_DynamicCast_AsBP_Brawler_Hero_1' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, K2Node_DynamicCast_bSuccess_3) == 0x0001F8, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, K2Node_CustomEvent_Change) == 0x0001F9, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::K2Node_CustomEvent_Change' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, K2Node_CustomEvent_StatusType) == 0x0001FA, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::K2Node_CustomEvent_StatusType' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, K2Node_CustomEvent_SourceEntity) == 0x000200, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::K2Node_CustomEvent_SourceEntity' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, K2Node_CustomEvent_StackNum) == 0x000208, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::K2Node_CustomEvent_StackNum' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, CallFunc_GetActor_ReturnValue_2) == 0x000210, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::CallFunc_GetActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000218, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, CallFunc_GetActor_ReturnValue_3) == 0x000220, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::CallFunc_GetActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, K2Node_DynamicCast_AsBP_Brawler_Hero_2) == 0x000228, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::K2Node_DynamicCast_AsBP_Brawler_Hero_2' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl, K2Node_DynamicCast_bSuccess_4) == 0x000230, "Member 'BP_Brawler_SpeechBubbleControl_C_ExecuteUbergraph_BP_Brawler_SpeechBubbleControl::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");

// Function BP_Brawler_SpeechBubbleControl.BP_Brawler_SpeechBubbleControl_C.OnStatusEffectChange
// 0x0018 (0x0018 - 0x0000)
struct BP_Brawler_SpeechBubbleControl_C_OnStatusEffectChange final
{
public:
	EStatusEffectChange                           Change;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStatusEffectType                             StatusType;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SourceEntity;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StackNum_0;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Brawler_SpeechBubbleControl_C_OnStatusEffectChange) == 0x000008, "Wrong alignment on BP_Brawler_SpeechBubbleControl_C_OnStatusEffectChange");
static_assert(sizeof(BP_Brawler_SpeechBubbleControl_C_OnStatusEffectChange) == 0x000018, "Wrong size on BP_Brawler_SpeechBubbleControl_C_OnStatusEffectChange");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_OnStatusEffectChange, Change) == 0x000000, "Member 'BP_Brawler_SpeechBubbleControl_C_OnStatusEffectChange::Change' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_OnStatusEffectChange, StatusType) == 0x000001, "Member 'BP_Brawler_SpeechBubbleControl_C_OnStatusEffectChange::StatusType' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_OnStatusEffectChange, SourceEntity) == 0x000008, "Member 'BP_Brawler_SpeechBubbleControl_C_OnStatusEffectChange::SourceEntity' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_OnStatusEffectChange, StackNum_0) == 0x000010, "Member 'BP_Brawler_SpeechBubbleControl_C_OnStatusEffectChange::StackNum_0' has a wrong offset!");

// Function BP_Brawler_SpeechBubbleControl.BP_Brawler_SpeechBubbleControl_C.TrapDamage
// 0x0160 (0x0160 - 0x0000)
struct BP_Brawler_SpeechBubbleControl_C_TrapDamage final
{
public:
	class UAbilityController*                     Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     Bullet;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     Target_0;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           Ability;                                           // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         effectiveDamage;                                   // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageValue                           DamageValue;                                       // 0x0028(0x0138)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_Brawler_SpeechBubbleControl_C_TrapDamage) == 0x000008, "Wrong alignment on BP_Brawler_SpeechBubbleControl_C_TrapDamage");
static_assert(sizeof(BP_Brawler_SpeechBubbleControl_C_TrapDamage) == 0x000160, "Wrong size on BP_Brawler_SpeechBubbleControl_C_TrapDamage");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_TrapDamage, Source) == 0x000000, "Member 'BP_Brawler_SpeechBubbleControl_C_TrapDamage::Source' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_TrapDamage, Bullet) == 0x000008, "Member 'BP_Brawler_SpeechBubbleControl_C_TrapDamage::Bullet' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_TrapDamage, Target_0) == 0x000010, "Member 'BP_Brawler_SpeechBubbleControl_C_TrapDamage::Target_0' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_TrapDamage, Ability) == 0x000018, "Member 'BP_Brawler_SpeechBubbleControl_C_TrapDamage::Ability' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_TrapDamage, effectiveDamage) == 0x000020, "Member 'BP_Brawler_SpeechBubbleControl_C_TrapDamage::effectiveDamage' has a wrong offset!");
static_assert(offsetof(BP_Brawler_SpeechBubbleControl_C_TrapDamage, DamageValue) == 0x000028, "Member 'BP_Brawler_SpeechBubbleControl_C_TrapDamage::DamageValue' has a wrong offset!");

}

