#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BasicImp_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "man_classes.hpp"
#include "KawaiiPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_BasicImp_Anim.BP_BasicImp_Anim_C
// 0x1450 (0x1AF0 - 0x06A0)
class UBP_BasicImp_Anim_C final : public UAnimInstanceBase
{
public:
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0030)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x06D8(0x00C8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x07A0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x07C0(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_4;                  // 0x07E0(0x00E8)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x08C8(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0970(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x09F0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0A70(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0AF0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0BF8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0D00(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0E08(0x0108)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x0F10(0x00E8)()
	uint8                                         Pad_FF8[0x8];                                      // 0x0FF8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x1000(0x0250)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x1250(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x12D0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x12F8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x1378(0x0030)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x13A8(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1450(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x14D0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x1550(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x1580(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1630(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x16B0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x16F8(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x1720(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1808(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x1838(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1920(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1950(0x00B0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x1A00(0x00E8)()
	float                                         TurnRate;                                          // 0x1AE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChargeUp;                                          // 0x1AEC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_BasicImp_Anim(int32 EntryPoint);
	void AnimNotify_ChargeDown();
	void AnimNotify_ChargeUp();
	void OnFacingChanged(bool bForced);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_BasicImp_Anim_AnimGraphNode_TransitionResult_3DC3D4384AA457BA6E21D99F8C9EABBC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_BasicImp_Anim_AnimGraphNode_ModifyBone_C3C7EBE7442F3040AF254A8B6BDBFC49();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_BasicImp_Anim_AnimGraphNode_ModifyBone_40D557E84E7C36AB2540D688EC4FC39F();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_BasicImp_Anim_AnimGraphNode_ModifyBone_79F979D74434DDEFAECF02AC9D788D55();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_BasicImp_Anim_AnimGraphNode_ModifyBone_D7BA37354870DA1753737EB31B34A45B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_BasicImp_Anim_AnimGraphNode_TransitionResult_F3D0C290426DEC274A0D03BB6659AA16();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BasicImp_Anim_C">();
	}
	static class UBP_BasicImp_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BasicImp_Anim_C>();
	}
};
static_assert(alignof(UBP_BasicImp_Anim_C) == 0x000010, "Wrong alignment on UBP_BasicImp_Anim_C");
static_assert(sizeof(UBP_BasicImp_Anim_C) == 0x001AF0, "Wrong size on UBP_BasicImp_Anim_C");
static_assert(offsetof(UBP_BasicImp_Anim_C, UberGraphFrame) == 0x0006A0, "Member 'UBP_BasicImp_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_ApplyAdditive) == 0x0006D8, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_LocalToComponentSpace) == 0x0007A0, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_ComponentToLocalSpace) == 0x0007C0, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_BlendSpacePlayer_4) == 0x0007E0, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_BlendSpacePlayer_4' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_BlendListByInt) == 0x0008C8, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_SequencePlayer_7) == 0x000970, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_SequencePlayer_6) == 0x0009F0, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_SequencePlayer_5) == 0x000A70, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_ModifyBone_3) == 0x000AF0, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_ModifyBone_2) == 0x000BF8, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_ModifyBone_1) == 0x000D00, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_ModifyBone) == 0x000E08, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_BlendSpacePlayer_3) == 0x000F10, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_BlendSpacePlayer_3' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_KawaiiPhysics) == 0x001000, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_SequencePlayer_4) == 0x001250, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_TransitionResult_1) == 0x0012D0, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_SequencePlayer_3) == 0x0012F8, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_StateResult_3) == 0x001378, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_BlendListByBool) == 0x0013A8, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_SequencePlayer_2) == 0x001450, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_SequencePlayer_1) == 0x0014D0, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_StateResult_2) == 0x001550, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_StateMachine_1) == 0x001580, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_SequencePlayer) == 0x001630, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_Slot) == 0x0016B0, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_TransitionResult) == 0x0016F8, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_BlendSpacePlayer_2) == 0x001720, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_BlendSpacePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_StateResult_1) == 0x001808, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_BlendSpacePlayer_1) == 0x001838, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_StateResult) == 0x001920, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_StateMachine) == 0x001950, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, AnimGraphNode_BlendSpacePlayer) == 0x001A00, "Member 'UBP_BasicImp_Anim_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, TurnRate) == 0x001AE8, "Member 'UBP_BasicImp_Anim_C::TurnRate' has a wrong offset!");
static_assert(offsetof(UBP_BasicImp_Anim_C, ChargeUp) == 0x001AEC, "Member 'UBP_BasicImp_Anim_C::ChargeUp' has a wrong offset!");

}

