#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Branween

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Dudley_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Branween.BP_Branween_C
// 0x0018 (0x0830 - 0x0818)
class ABP_Branween_C final : public ABP_Dudley_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Branween_C;                      // 0x0818(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Reveal_Value_7F79252B4A83777B1EBBFB831772D8CE;     // 0x0820(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Reveal__Direction_7F79252B4A83777B1EBBFB831772D8CE; // 0x0824(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_825[0x3];                                      // 0x0825(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Reveal;                                            // 0x0828(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Reveal__FinishedFunc();
	void Reveal__UpdateFunc();
	void RevealVFX();
	void ExecuteUbergraph_BP_Branween(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Branween_C">();
	}
	static class ABP_Branween_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Branween_C>();
	}
};
static_assert(alignof(ABP_Branween_C) == 0x000008, "Wrong alignment on ABP_Branween_C");
static_assert(sizeof(ABP_Branween_C) == 0x000830, "Wrong size on ABP_Branween_C");
static_assert(offsetof(ABP_Branween_C, UberGraphFrame_BP_Branween_C) == 0x000818, "Member 'ABP_Branween_C::UberGraphFrame_BP_Branween_C' has a wrong offset!");
static_assert(offsetof(ABP_Branween_C, Reveal_Value_7F79252B4A83777B1EBBFB831772D8CE) == 0x000820, "Member 'ABP_Branween_C::Reveal_Value_7F79252B4A83777B1EBBFB831772D8CE' has a wrong offset!");
static_assert(offsetof(ABP_Branween_C, Reveal__Direction_7F79252B4A83777B1EBBFB831772D8CE) == 0x000824, "Member 'ABP_Branween_C::Reveal__Direction_7F79252B4A83777B1EBBFB831772D8CE' has a wrong offset!");
static_assert(offsetof(ABP_Branween_C, Reveal) == 0x000828, "Member 'ABP_Branween_C::Reveal' has a wrong offset!");

}

