#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BreakableProps_Crate

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BreakableProps_Crate.BP_BreakableProps_Crate_C.ExecuteUbergraph_BP_BreakableProps_Crate
// 0x0038 (0x0038 - 0x0000)
struct BP_BreakableProps_Crate_C_ExecuteUbergraph_BP_BreakableProps_Crate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BreakableProps_Crate_C_ExecuteUbergraph_BP_BreakableProps_Crate) == 0x000008, "Wrong alignment on BP_BreakableProps_Crate_C_ExecuteUbergraph_BP_BreakableProps_Crate");
static_assert(sizeof(BP_BreakableProps_Crate_C_ExecuteUbergraph_BP_BreakableProps_Crate) == 0x000038, "Wrong size on BP_BreakableProps_Crate_C_ExecuteUbergraph_BP_BreakableProps_Crate");
static_assert(offsetof(BP_BreakableProps_Crate_C_ExecuteUbergraph_BP_BreakableProps_Crate, EntryPoint) == 0x000000, "Member 'BP_BreakableProps_Crate_C_ExecuteUbergraph_BP_BreakableProps_Crate::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_Crate_C_ExecuteUbergraph_BP_BreakableProps_Crate, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000004, "Member 'BP_BreakableProps_Crate_C_ExecuteUbergraph_BP_BreakableProps_Crate::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_Crate_C_ExecuteUbergraph_BP_BreakableProps_Crate, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'BP_BreakableProps_Crate_C_ExecuteUbergraph_BP_BreakableProps_Crate::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_Crate_C_ExecuteUbergraph_BP_BreakableProps_Crate, CallFunc_Conv_StringToName_ReturnValue) == 0x000018, "Member 'BP_BreakableProps_Crate_C_ExecuteUbergraph_BP_BreakableProps_Crate::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_Crate_C_ExecuteUbergraph_BP_BreakableProps_Crate, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000020, "Member 'BP_BreakableProps_Crate_C_ExecuteUbergraph_BP_BreakableProps_Crate::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_Crate_C_ExecuteUbergraph_BP_BreakableProps_Crate, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000030, "Member 'BP_BreakableProps_Crate_C_ExecuteUbergraph_BP_BreakableProps_Crate::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");

// Function BP_BreakableProps_Crate.BP_BreakableProps_Crate_C.UserConstructionScript
// 0x0038 (0x0038 - 0x0000)
struct BP_BreakableProps_Crate_C_UserConstructionScript final
{
public:
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BreakableProps_Crate_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_BreakableProps_Crate_C_UserConstructionScript");
static_assert(sizeof(BP_BreakableProps_Crate_C_UserConstructionScript) == 0x000038, "Wrong size on BP_BreakableProps_Crate_C_UserConstructionScript");
static_assert(offsetof(BP_BreakableProps_Crate_C_UserConstructionScript, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000000, "Member 'BP_BreakableProps_Crate_C_UserConstructionScript::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_Crate_C_UserConstructionScript, CallFunc_Conv_StringToName_ReturnValue) == 0x000010, "Member 'BP_BreakableProps_Crate_C_UserConstructionScript::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_Crate_C_UserConstructionScript, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000018, "Member 'BP_BreakableProps_Crate_C_UserConstructionScript::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_Crate_C_UserConstructionScript, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000028, "Member 'BP_BreakableProps_Crate_C_UserConstructionScript::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableProps_Crate_C_UserConstructionScript, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000030, "Member 'BP_BreakableProps_Crate_C_UserConstructionScript::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

}

