#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BackersPlate_Statue

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_BackersPlate_Statue.BP_BackersPlate_Statue_C
// 0x0080 (0x0540 - 0x04C0)
class UBP_BackersPlate_Statue_C final : public UInfoScreenUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur;                                    // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BottomScreenFrame;                                 // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Statue_Textblock_C*    BP_BackersPlate_Statue_Textblock;                  // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Statue_Textblock_C*    BP_BackersPlate_Statue_Textblock_1;                // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Statue_Textblock_C*    BP_BackersPlate_Statue_Textblock_2;                // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Statue_Textblock_C*    BP_BackersPlate_Statue_Textblock_3;                // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Statue_Textblock_C*    BP_BackersPlate_Statue_Textblock_4;                // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Statue_Textblock_C*    BP_BackersPlate_Statue_Textblock_5;                // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Statue_Textblock_C*    BP_BackersPlate_Statue_Textblock_6;                // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyB;                                        // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Container;                                         // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ParchmentTexture;                                  // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TopScreenFrame;                                    // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BackersPlate_Statue(int32 EntryPoint);
	void OnSetData(class UInfoScreentDataAsset* InInfoScreenData);
	void BndEvt__BtnHotkeyA2_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnHide(float AnimDuration);
	void OnShow(float AnimDuration);
	void OnGamepadBEvent();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void Init(TArray<class FText>& InTextArray);
	void BtnHotkeyBClicked();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BackersPlate_Statue_C">();
	}
	static class UBP_BackersPlate_Statue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BackersPlate_Statue_C>();
	}
};
static_assert(alignof(UBP_BackersPlate_Statue_C) == 0x000008, "Wrong alignment on UBP_BackersPlate_Statue_C");
static_assert(sizeof(UBP_BackersPlate_Statue_C) == 0x000540, "Wrong size on UBP_BackersPlate_Statue_C");
static_assert(offsetof(UBP_BackersPlate_Statue_C, UberGraphFrame) == 0x0004C0, "Member 'UBP_BackersPlate_Statue_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Statue_C, FadeOutAnim) == 0x0004C8, "Member 'UBP_BackersPlate_Statue_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Statue_C, FadeInAnim) == 0x0004D0, "Member 'UBP_BackersPlate_Statue_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Statue_C, BackgroundBlur) == 0x0004D8, "Member 'UBP_BackersPlate_Statue_C::BackgroundBlur' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Statue_C, BottomScreenFrame) == 0x0004E0, "Member 'UBP_BackersPlate_Statue_C::BottomScreenFrame' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Statue_C, BP_BackersPlate_Statue_Textblock) == 0x0004E8, "Member 'UBP_BackersPlate_Statue_C::BP_BackersPlate_Statue_Textblock' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Statue_C, BP_BackersPlate_Statue_Textblock_1) == 0x0004F0, "Member 'UBP_BackersPlate_Statue_C::BP_BackersPlate_Statue_Textblock_1' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Statue_C, BP_BackersPlate_Statue_Textblock_2) == 0x0004F8, "Member 'UBP_BackersPlate_Statue_C::BP_BackersPlate_Statue_Textblock_2' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Statue_C, BP_BackersPlate_Statue_Textblock_3) == 0x000500, "Member 'UBP_BackersPlate_Statue_C::BP_BackersPlate_Statue_Textblock_3' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Statue_C, BP_BackersPlate_Statue_Textblock_4) == 0x000508, "Member 'UBP_BackersPlate_Statue_C::BP_BackersPlate_Statue_Textblock_4' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Statue_C, BP_BackersPlate_Statue_Textblock_5) == 0x000510, "Member 'UBP_BackersPlate_Statue_C::BP_BackersPlate_Statue_Textblock_5' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Statue_C, BP_BackersPlate_Statue_Textblock_6) == 0x000518, "Member 'UBP_BackersPlate_Statue_C::BP_BackersPlate_Statue_Textblock_6' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Statue_C, BtnHotkeyB) == 0x000520, "Member 'UBP_BackersPlate_Statue_C::BtnHotkeyB' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Statue_C, Container) == 0x000528, "Member 'UBP_BackersPlate_Statue_C::Container' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Statue_C, ParchmentTexture) == 0x000530, "Member 'UBP_BackersPlate_Statue_C::ParchmentTexture' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Statue_C, TopScreenFrame) == 0x000538, "Member 'UBP_BackersPlate_Statue_C::TopScreenFrame' has a wrong offset!");

}

