#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BrawlerGhostTrail_VisualEntity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BrawlerGhostTrail_VisualEntity.BP_BrawlerGhostTrail_VisualEntity_C.ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity
// 0x0210 (0x0210 - 0x0000)
struct BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSlotMeshComponent_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0048(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	class ABP_BrawlerHero_C*                      K2Node_DynamicCast_AsBP_Brawler_Hero;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPoseableMeshComponent*                 CallFunc_AddComponentByClass_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPoseableMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x00D0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0158(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_GetSlotMeshComponents_ReturnValue;        // 0x01E8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity) == 0x000010, "Wrong alignment on BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity");
static_assert(sizeof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity) == 0x000210, "Wrong size on BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, Temp_int_Array_Index_Variable_2) == 0x00001C, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, CallFunc_GetSlotMeshComponent_ReturnValue) == 0x000028, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::CallFunc_GetSlotMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000030, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x00003C, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, CallFunc_GetMaterials_ReturnValue) == 0x000048, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000060, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, K2Node_DynamicCast_AsBP_Brawler_Hero) == 0x0000A0, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::K2Node_DynamicCast_AsBP_Brawler_Hero' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, CallFunc_AddComponentByClass_ReturnValue) == 0x0000B0, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, CallFunc_Array_Add_ReturnValue) == 0x0000B8, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, CallFunc_Array_Length_ReturnValue_1) == 0x0000C8, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000CC, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0000D0, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000158, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, Temp_int_Loop_Counter_Variable_2) == 0x0001E0, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, CallFunc_IsValid_ReturnValue_1) == 0x0001E4, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, CallFunc_GetSlotMeshComponents_ReturnValue) == 0x0001E8, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::CallFunc_GetSlotMeshComponents_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, CallFunc_Array_Length_ReturnValue_2) == 0x0001F8, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001FC, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, CallFunc_Less_IntInt_ReturnValue_2) == 0x000200, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, CallFunc_Array_Length_ReturnValue_3) == 0x000204, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000208, "Member 'BP_BrawlerGhostTrail_VisualEntity_C_ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

}

