#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BrawlerBloodBuildup_VisualEntity

#include "Basic.hpp"

#include "S_BrawlerBloodstainArea_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "E_BrawlerBloodstainArea_structs.hpp"
#include "S_BrawlerBloodstainAreaNiagaraParams_structs.hpp"


namespace SDK::Params
{

// Function BP_BrawlerBloodBuildup_VisualEntity.BP_BrawlerBloodBuildup_VisualEntity_C.ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity
// 0x0128 (0x0128 - 0x0000)
struct BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_DamagePosition;                       // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_SplashRadius;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Stage;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDamageTakenVFXDataAsset*               K2Node_Event_BloodSourceAsset;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_BrawlerBloodstainArea               CallFunc_Array_Get_Item;                           // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventorySlot*                         K2Node_CustomEvent_InventorySlot;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0098(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class UInventorySlot* InventorySlot)> K2Node_CreateDelegate_OutputDelegate;              // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity) == 0x000008, "Wrong alignment on BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity");
static_assert(sizeof(BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity) == 0x000128, "Wrong size on BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity, K2Node_Event_DamagePosition) == 0x000008, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity::K2Node_Event_DamagePosition' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity, K2Node_Event_SplashRadius) == 0x000014, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity::K2Node_Event_SplashRadius' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity, K2Node_Event_Stage) == 0x000018, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity::K2Node_Event_Stage' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity, K2Node_Event_BloodSourceAsset) == 0x000020, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity::K2Node_Event_BloodSourceAsset' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity, CallFunc_Map_Length_ReturnValue) == 0x00002C, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000048, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity, CallFunc_Array_Length_ReturnValue_1) == 0x00004C, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity, K2Node_CustomEvent_InventorySlot) == 0x000050, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity::K2Node_CustomEvent_InventorySlot' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000060, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity, K2Node_SwitchEnum_CmpSuccess) == 0x000070, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity, CallFunc_Conv_StringToText_ReturnValue) == 0x000078, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity, K2Node_MakeStruct_FormatArgumentData) == 0x000098, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity, K2Node_MakeArray_Array) == 0x0000D8, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity, CallFunc_Add_IntInt_ReturnValue) == 0x0000E8, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity, CallFunc_Format_ReturnValue) == 0x0000F0, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity, CallFunc_Conv_TextToString_ReturnValue) == 0x000108, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity, K2Node_CreateDelegate_OutputDelegate) == 0x000118, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_ExecuteUbergraph_BP_BrawlerBloodBuildup_VisualEntity::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_BrawlerBloodBuildup_VisualEntity.BP_BrawlerBloodBuildup_VisualEntity_C.OnSlotUpdated
// 0x0008 (0x0008 - 0x0000)
struct BP_BrawlerBloodBuildup_VisualEntity_C_OnSlotUpdated final
{
public:
	class UInventorySlot*                         InventorySlot;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BrawlerBloodBuildup_VisualEntity_C_OnSlotUpdated) == 0x000008, "Wrong alignment on BP_BrawlerBloodBuildup_VisualEntity_C_OnSlotUpdated");
static_assert(sizeof(BP_BrawlerBloodBuildup_VisualEntity_C_OnSlotUpdated) == 0x000008, "Wrong size on BP_BrawlerBloodBuildup_VisualEntity_C_OnSlotUpdated");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_OnSlotUpdated, InventorySlot) == 0x000000, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_OnSlotUpdated::InventorySlot' has a wrong offset!");

// Function BP_BrawlerBloodBuildup_VisualEntity.BP_BrawlerBloodBuildup_VisualEntity_C.BloodStainBuildupPostConstructionFinished
// 0x0020 (0x0020 - 0x0000)
struct BP_BrawlerBloodBuildup_VisualEntity_C_BloodStainBuildupPostConstructionFinished final
{
public:
	struct FVector                                DamagePosition_0;                                  // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SplashRadius_0;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stage_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDamageTakenVFXDataAsset*               BloodSourceAsset_0;                                // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BrawlerBloodBuildup_VisualEntity_C_BloodStainBuildupPostConstructionFinished) == 0x000008, "Wrong alignment on BP_BrawlerBloodBuildup_VisualEntity_C_BloodStainBuildupPostConstructionFinished");
static_assert(sizeof(BP_BrawlerBloodBuildup_VisualEntity_C_BloodStainBuildupPostConstructionFinished) == 0x000020, "Wrong size on BP_BrawlerBloodBuildup_VisualEntity_C_BloodStainBuildupPostConstructionFinished");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_BloodStainBuildupPostConstructionFinished, DamagePosition_0) == 0x000000, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_BloodStainBuildupPostConstructionFinished::DamagePosition_0' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_BloodStainBuildupPostConstructionFinished, SplashRadius_0) == 0x00000C, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_BloodStainBuildupPostConstructionFinished::SplashRadius_0' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_BloodStainBuildupPostConstructionFinished, Stage_0) == 0x000010, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_BloodStainBuildupPostConstructionFinished::Stage_0' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_BloodStainBuildupPostConstructionFinished, BloodSourceAsset_0) == 0x000018, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_BloodStainBuildupPostConstructionFinished::BloodSourceAsset_0' has a wrong offset!");

// Function BP_BrawlerBloodBuildup_VisualEntity.BP_BrawlerBloodBuildup_VisualEntity_C.AddAndInitializeNiagaraComponents
// 0x0300 (0x0300 - 0x0000)
struct BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents final
{
public:
	bool                                          bHead;                                             // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FinalRadius;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FinalSpawnAmount;                                  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DebugString;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bHeadFound;                                        // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SKCounter;                                         // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CurrentSkeletalMesh;                               // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CurrentNiagaraComp;                                // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0040(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_AddComponent_ReturnValue;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0084(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0098(0x0018)()
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_1;          // 0x00B0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0108(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0148(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0158(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0168(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0180(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_2;          // 0x0218(0x0018)()
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0238(0x0040)(HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0280(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0290(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_GetSlotMeshComponents_ReturnValue;        // 0x02D8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents) == 0x000010, "Wrong alignment on BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents");
static_assert(sizeof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents) == 0x000300, "Wrong size on BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, bHead) == 0x000000, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::bHead' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, FinalRadius) == 0x000004, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::FinalRadius' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, FinalSpawnAmount) == 0x000008, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::FinalSpawnAmount' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, DebugString) == 0x000010, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::DebugString' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, bHeadFound) == 0x000020, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::bHeadFound' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, SKCounter) == 0x000024, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::SKCounter' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CurrentSkeletalMesh) == 0x000028, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CurrentSkeletalMesh' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CurrentNiagaraComp) == 0x000030, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CurrentNiagaraComp' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, Temp_struct_Variable) == 0x000040, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_AddComponent_ReturnValue) == 0x000070, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00007C, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, Temp_int_Loop_Counter_Variable) == 0x000080, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000084, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_Add_IntInt_ReturnValue) == 0x000094, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000098, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_Conv_ObjectToText_ReturnValue_1) == 0x0000B0, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_Conv_ObjectToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, K2Node_MakeStruct_FormatArgumentData) == 0x0000C8, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, K2Node_MakeStruct_FormatArgumentData_1) == 0x000108, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, K2Node_MakeArray_Array) == 0x000148, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, K2Node_MakeArray_Array_1) == 0x000158, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_Format_ReturnValue) == 0x000168, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_Format_ReturnValue_1) == 0x000180, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_Conv_TextToString_ReturnValue) == 0x000198, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0001A8, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0001B8, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_Multiply_IntFloat_ReturnValue) == 0x0001BC, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_SelectFloat_ReturnValue) == 0x0001C0, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_Concat_StrStr_ReturnValue) == 0x0001C8, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0001D8, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0001E8, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0001F8, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000208, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_Conv_ObjectToText_ReturnValue_2) == 0x000218, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_Conv_ObjectToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000230, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, K2Node_MakeStruct_FormatArgumentData_2) == 0x000238, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_Add_FloatFloat_ReturnValue) == 0x000278, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, K2Node_MakeArray_Array_2) == 0x000280, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_Format_ReturnValue_2) == 0x000290, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_Conv_TextToString_ReturnValue_2) == 0x0002A8, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0002B8, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_Not_PreBool_ReturnValue) == 0x0002C8, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, Temp_int_Array_Index_Variable) == 0x0002CC, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_Array_Add_ReturnValue) == 0x0002D0, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0002D4, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_GetSlotMeshComponents_ReturnValue) == 0x0002D8, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_GetSlotMeshComponents_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_Array_Get_Item) == 0x0002E8, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_Array_Length_ReturnValue_1) == 0x0002F0, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents, CallFunc_Less_IntInt_ReturnValue) == 0x0002F4, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddAndInitializeNiagaraComponents::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_BrawlerBloodBuildup_VisualEntity.BP_BrawlerBloodBuildup_VisualEntity_C.PopulateBloodstainAreas
// 0x01D8 (0x01D8 - 0x0000)
struct BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas final
{
public:
	E_BrawlerBloodstainArea                       CurrentArea;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0040(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0098(0x0040)(HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F0(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<E_BrawlerBloodstainArea>               CallFunc_Map_Keys_Keys;                            // 0x0120(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0130(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0148(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_AddBloodStainArea_bSuccess;               // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0190(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01A0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas) == 0x000008, "Wrong alignment on BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas");
static_assert(sizeof(BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas) == 0x0001D8, "Wrong size on BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas, CurrentArea) == 0x000000, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas::CurrentArea' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000018, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000040, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas, K2Node_MakeStruct_FormatArgumentData) == 0x000058, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas, K2Node_MakeStruct_FormatArgumentData_1) == 0x000098, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas, Temp_int_Variable) == 0x0000D8, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas, K2Node_MakeArray_Array) == 0x0000E0, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas, CallFunc_Format_ReturnValue) == 0x0000F0, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas, CallFunc_Add_IntInt_ReturnValue) == 0x000108, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas, CallFunc_Conv_TextToString_ReturnValue) == 0x000110, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas, CallFunc_Map_Keys_Keys) == 0x000120, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000130, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas, K2Node_MakeStruct_FormatArgumentData_2) == 0x000148, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas, CallFunc_AddBloodStainArea_bSuccess) == 0x000188, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas::CallFunc_AddBloodStainArea_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas, K2Node_MakeArray_Array_1) == 0x000190, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas, CallFunc_Format_ReturnValue_1) == 0x0001A0, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0001B8, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas, CallFunc_Map_Length_ReturnValue) == 0x0001C8, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001CC, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001D0, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_PopulateBloodstainAreas::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_BrawlerBloodBuildup_VisualEntity.BP_BrawlerBloodBuildup_VisualEntity_C.AddBloodStainArea
// 0x01B8 (0x01B8 - 0x0000)
struct BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea final
{
public:
	E_BrawlerBloodstainArea                       BloodStainArea;                                    // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CurrentSkeletalMesh;                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0020(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0090(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0118(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0130(0x0040)(HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_CheckSlotMeshComponent_SlotMeshComponent; // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSlotMeshComponent_bIsValid;          // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0180(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0190(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea) == 0x000008, "Wrong alignment on BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea");
static_assert(sizeof(BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea) == 0x0001B8, "Wrong size on BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea, BloodStainArea) == 0x000000, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea::BloodStainArea' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea, bSuccess) == 0x000001, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea::bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea, CurrentSkeletalMesh) == 0x000008, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea::CurrentSkeletalMesh' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000010, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000020, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea, K2Node_MakeStruct_FormatArgumentData_1) == 0x000090, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea, K2Node_MakeArray_Array) == 0x0000D0, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea, CallFunc_Conv_TextToString_ReturnValue) == 0x0000F8, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000108, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000118, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea, K2Node_MakeStruct_FormatArgumentData_2) == 0x000130, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea, CallFunc_CheckSlotMeshComponent_SlotMeshComponent) == 0x000170, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea::CallFunc_CheckSlotMeshComponent_SlotMeshComponent' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea, CallFunc_CheckSlotMeshComponent_bIsValid) == 0x000178, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea::CallFunc_CheckSlotMeshComponent_bIsValid' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea, K2Node_MakeArray_Array_1) == 0x000180, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea, CallFunc_Format_ReturnValue_1) == 0x000190, "Member 'BP_BrawlerBloodBuildup_VisualEntity_C_AddBloodStainArea::CallFunc_Format_ReturnValue_1' has a wrong offset!");
