#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Branween_CS_A025_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_Branween_CS_A025_Anim.BP_Branween_CS_A025_Anim_C
// 0x0370 (0x0A10 - 0x06A0)
class UBP_Branween_CS_A025_Anim_C final : public UAnimInstanceBase
{
public:
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x06D8(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0758(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x07A0(0x0080)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x0820(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x08C8(0x0080)()
	struct FAnimNode_MirrorBones                  AnimGraphNode_MirrorBones;                         // 0x0948(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0990(0x0080)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_BP_Branween_CS_A025_Anim(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Branween_CS_A025_Anim_C">();
	}
	static class UBP_Branween_CS_A025_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Branween_CS_A025_Anim_C>();
	}
};
static_assert(alignof(UBP_Branween_CS_A025_Anim_C) == 0x000010, "Wrong alignment on UBP_Branween_CS_A025_Anim_C");
static_assert(sizeof(UBP_Branween_CS_A025_Anim_C) == 0x000A10, "Wrong size on UBP_Branween_CS_A025_Anim_C");
static_assert(offsetof(UBP_Branween_CS_A025_Anim_C, UberGraphFrame) == 0x0006A0, "Member 'UBP_Branween_CS_A025_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Branween_CS_A025_Anim_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UBP_Branween_CS_A025_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_Branween_CS_A025_Anim_C, AnimGraphNode_SequencePlayer_3) == 0x0006D8, "Member 'UBP_Branween_CS_A025_Anim_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UBP_Branween_CS_A025_Anim_C, AnimGraphNode_Slot) == 0x000758, "Member 'UBP_Branween_CS_A025_Anim_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UBP_Branween_CS_A025_Anim_C, AnimGraphNode_SequencePlayer_2) == 0x0007A0, "Member 'UBP_Branween_CS_A025_Anim_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_Branween_CS_A025_Anim_C, AnimGraphNode_BlendListByInt) == 0x000820, "Member 'UBP_Branween_CS_A025_Anim_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UBP_Branween_CS_A025_Anim_C, AnimGraphNode_SequencePlayer_1) == 0x0008C8, "Member 'UBP_Branween_CS_A025_Anim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_Branween_CS_A025_Anim_C, AnimGraphNode_MirrorBones) == 0x000948, "Member 'UBP_Branween_CS_A025_Anim_C::AnimGraphNode_MirrorBones' has a wrong offset!");
static_assert(offsetof(UBP_Branween_CS_A025_Anim_C, AnimGraphNode_SequencePlayer) == 0x000990, "Member 'UBP_Branween_CS_A025_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");

}

