#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_boonsHunt_Bear_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_boonsHunt_Bear_VisualEntity.BP_boonsHunt_Bear_VisualEntity_C
// 0x0030 (0x0380 - 0x0350)
class ABP_boonsHunt_Bear_VisualEntity_C : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UEmptyPassiveAbility*                   BoonAbility;                                       // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 BoonClass;                                         // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimerAdjustment;                                   // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_boonsHunt_Bear_VisualEntity(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void OnKill();
	void VisualEntityConstructionFinished();
	void SetBoonAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_boonsHunt_Bear_VisualEntity_C">();
	}
	static class ABP_boonsHunt_Bear_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_boonsHunt_Bear_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_boonsHunt_Bear_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_boonsHunt_Bear_VisualEntity_C");
static_assert(sizeof(ABP_boonsHunt_Bear_VisualEntity_C) == 0x000380, "Wrong size on ABP_boonsHunt_Bear_VisualEntity_C");
static_assert(offsetof(ABP_boonsHunt_Bear_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_boonsHunt_Bear_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_boonsHunt_Bear_VisualEntity_C, Ak) == 0x000358, "Member 'ABP_boonsHunt_Bear_VisualEntity_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_boonsHunt_Bear_VisualEntity_C, Niagara) == 0x000360, "Member 'ABP_boonsHunt_Bear_VisualEntity_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_boonsHunt_Bear_VisualEntity_C, BoonAbility) == 0x000368, "Member 'ABP_boonsHunt_Bear_VisualEntity_C::BoonAbility' has a wrong offset!");
static_assert(offsetof(ABP_boonsHunt_Bear_VisualEntity_C, BoonClass) == 0x000370, "Member 'ABP_boonsHunt_Bear_VisualEntity_C::BoonClass' has a wrong offset!");
static_assert(offsetof(ABP_boonsHunt_Bear_VisualEntity_C, TimerAdjustment) == 0x000378, "Member 'ABP_boonsHunt_Bear_VisualEntity_C::TimerAdjustment' has a wrong offset!");

}

