#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BrawlerRollAbility

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BrawlerRollAbility.BP_BrawlerRollAbility_C.ExecuteUbergraph_BP_BrawlerRollAbility
// 0x0038 (0x0038 - 0x0000)
struct BP_BrawlerRollAbility_C_ExecuteUbergraph_BP_BrawlerRollAbility final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetActor_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackComponent*                CallFunc_SpawnForceFeedbackAttached_ReturnValue;   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceFeedbackComponent*                CallFunc_SpawnForceFeedbackAttached_ReturnValue_1; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackComponent*                CallFunc_SpawnForceFeedbackAttached_ReturnValue_2; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BrawlerRollAbility_C_ExecuteUbergraph_BP_BrawlerRollAbility) == 0x000008, "Wrong alignment on BP_BrawlerRollAbility_C_ExecuteUbergraph_BP_BrawlerRollAbility");
static_assert(sizeof(BP_BrawlerRollAbility_C_ExecuteUbergraph_BP_BrawlerRollAbility) == 0x000038, "Wrong size on BP_BrawlerRollAbility_C_ExecuteUbergraph_BP_BrawlerRollAbility");
static_assert(offsetof(BP_BrawlerRollAbility_C_ExecuteUbergraph_BP_BrawlerRollAbility, EntryPoint) == 0x000000, "Member 'BP_BrawlerRollAbility_C_ExecuteUbergraph_BP_BrawlerRollAbility::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BrawlerRollAbility_C_ExecuteUbergraph_BP_BrawlerRollAbility, CallFunc_GetActor_ReturnValue) == 0x000008, "Member 'BP_BrawlerRollAbility_C_ExecuteUbergraph_BP_BrawlerRollAbility::CallFunc_GetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerRollAbility_C_ExecuteUbergraph_BP_BrawlerRollAbility, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000010, "Member 'BP_BrawlerRollAbility_C_ExecuteUbergraph_BP_BrawlerRollAbility::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerRollAbility_C_ExecuteUbergraph_BP_BrawlerRollAbility, CallFunc_SpawnForceFeedbackAttached_ReturnValue) == 0x000018, "Member 'BP_BrawlerRollAbility_C_ExecuteUbergraph_BP_BrawlerRollAbility::CallFunc_SpawnForceFeedbackAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerRollAbility_C_ExecuteUbergraph_BP_BrawlerRollAbility, CallFunc_BooleanOR_ReturnValue) == 0x000020, "Member 'BP_BrawlerRollAbility_C_ExecuteUbergraph_BP_BrawlerRollAbility::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerRollAbility_C_ExecuteUbergraph_BP_BrawlerRollAbility, CallFunc_SpawnForceFeedbackAttached_ReturnValue_1) == 0x000028, "Member 'BP_BrawlerRollAbility_C_ExecuteUbergraph_BP_BrawlerRollAbility::CallFunc_SpawnForceFeedbackAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrawlerRollAbility_C_ExecuteUbergraph_BP_BrawlerRollAbility, CallFunc_SpawnForceFeedbackAttached_ReturnValue_2) == 0x000030, "Member 'BP_BrawlerRollAbility_C_ExecuteUbergraph_BP_BrawlerRollAbility::CallFunc_SpawnForceFeedbackAttached_ReturnValue_2' has a wrong offset!");

}

