#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BasicImpFireballEntropic_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "man_classes.hpp"
#include "KawaiiPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_BasicImpFireballEntropic_Anim.BP_BasicImpFireballEntropic_Anim_C
// 0x0C80 (0x1320 - 0x06A0)
class UBP_BasicImpFireballEntropic_Anim_C final : public UAnimInstanceBase
{
public:
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0030)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x06D8(0x00C8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x07A0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x07C0(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x07E0(0x00E8)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x08C8(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0970(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x09F0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0A70(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0AF0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0BF8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0D00(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0E08(0x0108)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0F10(0x00E8)()
	uint8                                         Pad_FF8[0x8];                                      // 0x0FF8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x1000(0x0250)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1250(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x12D0(0x0048)()
	float                                         TurnRate;                                          // 0x1318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChargeUp;                                          // 0x131C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_BasicImpFireballEntropic_Anim(int32 EntryPoint);
	void AnimNotify_ChargeDown();
	void AnimNotify_ChargeUp();
	void OnFacingChanged(bool bForced);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_BasicImpFireballEntropic_Anim_AnimGraphNode_ModifyBone_B7121E044CED0171AF704EA0E3C31FE2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_BasicImpFireballEntropic_Anim_AnimGraphNode_ModifyBone_12B9DC7F45564EA430FEC2BF5F023249();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_BasicImpFireballEntropic_Anim_AnimGraphNode_ModifyBone_636D44794605F1FD4B0D858E01C22E8F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_BasicImpFireballEntropic_Anim_AnimGraphNode_ModifyBone_5330ED6048A190C8D330F1B429FA75B2();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BasicImpFireballEntropic_Anim_C">();
	}
	static class UBP_BasicImpFireballEntropic_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BasicImpFireballEntropic_Anim_C>();
	}
};
static_assert(alignof(UBP_BasicImpFireballEntropic_Anim_C) == 0x000010, "Wrong alignment on UBP_BasicImpFireballEntropic_Anim_C");
static_assert(sizeof(UBP_BasicImpFireballEntropic_Anim_C) == 0x001320, "Wrong size on UBP_BasicImpFireballEntropic_Anim_C");
static_assert(offsetof(UBP_BasicImpFireballEntropic_Anim_C, UberGraphFrame) == 0x0006A0, "Member 'UBP_BasicImpFireballEntropic_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpFireballEntropic_Anim_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UBP_BasicImpFireballEntropic_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpFireballEntropic_Anim_C, AnimGraphNode_ApplyAdditive) == 0x0006D8, "Member 'UBP_BasicImpFireballEntropic_Anim_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpFireballEntropic_Anim_C, AnimGraphNode_LocalToComponentSpace) == 0x0007A0, "Member 'UBP_BasicImpFireballEntropic_Anim_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpFireballEntropic_Anim_C, AnimGraphNode_ComponentToLocalSpace) == 0x0007C0, "Member 'UBP_BasicImpFireballEntropic_Anim_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpFireballEntropic_Anim_C, AnimGraphNode_BlendSpacePlayer_1) == 0x0007E0, "Member 'UBP_BasicImpFireballEntropic_Anim_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpFireballEntropic_Anim_C, AnimGraphNode_BlendListByInt) == 0x0008C8, "Member 'UBP_BasicImpFireballEntropic_Anim_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpFireballEntropic_Anim_C, AnimGraphNode_SequencePlayer_3) == 0x000970, "Member 'UBP_BasicImpFireballEntropic_Anim_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpFireballEntropic_Anim_C, AnimGraphNode_SequencePlayer_2) == 0x0009F0, "Member 'UBP_BasicImpFireballEntropic_Anim_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpFireballEntropic_Anim_C, AnimGraphNode_SequencePlayer_1) == 0x000A70, "Member 'UBP_BasicImpFireballEntropic_Anim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpFireballEntropic_Anim_C, AnimGraphNode_ModifyBone_3) == 0x000AF0, "Member 'UBP_BasicImpFireballEntropic_Anim_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpFireballEntropic_Anim_C, AnimGraphNode_ModifyBone_2) == 0x000BF8, "Member 'UBP_BasicImpFireballEntropic_Anim_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpFireballEntropic_Anim_C, AnimGraphNode_ModifyBone_1) == 0x000D00, "Member 'UBP_BasicImpFireballEntropic_Anim_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpFireballEntropic_Anim_C, AnimGraphNode_ModifyBone) == 0x000E08, "Member 'UBP_BasicImpFireballEntropic_Anim_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpFireballEntropic_Anim_C, AnimGraphNode_BlendSpacePlayer) == 0x000F10, "Member 'UBP_BasicImpFireballEntropic_Anim_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpFireballEntropic_Anim_C, AnimGraphNode_KawaiiPhysics) == 0x001000, "Member 'UBP_BasicImpFireballEntropic_Anim_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpFireballEntropic_Anim_C, AnimGraphNode_SequencePlayer) == 0x001250, "Member 'UBP_BasicImpFireballEntropic_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpFireballEntropic_Anim_C, AnimGraphNode_Slot) == 0x0012D0, "Member 'UBP_BasicImpFireballEntropic_Anim_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpFireballEntropic_Anim_C, TurnRate) == 0x001318, "Member 'UBP_BasicImpFireballEntropic_Anim_C::TurnRate' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpFireballEntropic_Anim_C, ChargeUp) == 0x00131C, "Member 'UBP_BasicImpFireballEntropic_Anim_C::ChargeUp' has a wrong offset!");

}

