#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BasicImpClawEntropic_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "man_classes.hpp"
#include "KawaiiPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_BasicImpClawEntropic_Anim.BP_BasicImpClawEntropic_Anim_C
// 0x0F70 (0x1610 - 0x06A0)
class UBP_BasicImpClawEntropic_Anim_C final : public UAnimInstanceBase
{
public:
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0030)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x06D8(0x00C8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x07A0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x07C0(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x07E0(0x00E8)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x08C8(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0970(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x09F0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0A70(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0AF0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0BF8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0D00(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0E08(0x0108)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x0F10(0x0250)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x1160(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x11E0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1208(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1288(0x0030)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x12B8(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1360(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x13E0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1460(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1490(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1540(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x15C0(0x0048)()
	float                                         TurnRate;                                          // 0x1608(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChargeUp;                                          // 0x160C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_BasicImpClawEntropic_Anim(int32 EntryPoint);
	void AnimNotify_ChargeDown();
	void AnimNotify_ChargeUp();
	void OnFacingChanged(bool bForced);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_BasicImpClawEntropic_Anim_AnimGraphNode_ModifyBone_6B7FD3684148028115B6439813A60CB9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_BasicImpClawEntropic_Anim_AnimGraphNode_ModifyBone_0B38B76D4655CC11C53239ADB6D8B6B0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_BasicImpClawEntropic_Anim_AnimGraphNode_ModifyBone_08DFA75442692E9CE1F745B7BFF25447();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_BasicImpClawEntropic_Anim_AnimGraphNode_ModifyBone_F548F50845AA557C31CABBAC0EB31D02();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_BasicImpClawEntropic_Anim_AnimGraphNode_TransitionResult_13F0AA9C4B75B4781A9246A0C37003AD();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BasicImpClawEntropic_Anim_C">();
	}
	static class UBP_BasicImpClawEntropic_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BasicImpClawEntropic_Anim_C>();
	}
};
static_assert(alignof(UBP_BasicImpClawEntropic_Anim_C) == 0x000010, "Wrong alignment on UBP_BasicImpClawEntropic_Anim_C");
static_assert(sizeof(UBP_BasicImpClawEntropic_Anim_C) == 0x001610, "Wrong size on UBP_BasicImpClawEntropic_Anim_C");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, UberGraphFrame) == 0x0006A0, "Member 'UBP_BasicImpClawEntropic_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UBP_BasicImpClawEntropic_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, AnimGraphNode_ApplyAdditive) == 0x0006D8, "Member 'UBP_BasicImpClawEntropic_Anim_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, AnimGraphNode_LocalToComponentSpace) == 0x0007A0, "Member 'UBP_BasicImpClawEntropic_Anim_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, AnimGraphNode_ComponentToLocalSpace) == 0x0007C0, "Member 'UBP_BasicImpClawEntropic_Anim_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, AnimGraphNode_BlendSpacePlayer) == 0x0007E0, "Member 'UBP_BasicImpClawEntropic_Anim_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, AnimGraphNode_BlendListByInt) == 0x0008C8, "Member 'UBP_BasicImpClawEntropic_Anim_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, AnimGraphNode_SequencePlayer_7) == 0x000970, "Member 'UBP_BasicImpClawEntropic_Anim_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, AnimGraphNode_SequencePlayer_6) == 0x0009F0, "Member 'UBP_BasicImpClawEntropic_Anim_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, AnimGraphNode_SequencePlayer_5) == 0x000A70, "Member 'UBP_BasicImpClawEntropic_Anim_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, AnimGraphNode_ModifyBone_3) == 0x000AF0, "Member 'UBP_BasicImpClawEntropic_Anim_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, AnimGraphNode_ModifyBone_2) == 0x000BF8, "Member 'UBP_BasicImpClawEntropic_Anim_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, AnimGraphNode_ModifyBone_1) == 0x000D00, "Member 'UBP_BasicImpClawEntropic_Anim_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, AnimGraphNode_ModifyBone) == 0x000E08, "Member 'UBP_BasicImpClawEntropic_Anim_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, AnimGraphNode_KawaiiPhysics) == 0x000F10, "Member 'UBP_BasicImpClawEntropic_Anim_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, AnimGraphNode_SequencePlayer_4) == 0x001160, "Member 'UBP_BasicImpClawEntropic_Anim_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, AnimGraphNode_TransitionResult) == 0x0011E0, "Member 'UBP_BasicImpClawEntropic_Anim_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, AnimGraphNode_SequencePlayer_3) == 0x001208, "Member 'UBP_BasicImpClawEntropic_Anim_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, AnimGraphNode_StateResult_1) == 0x001288, "Member 'UBP_BasicImpClawEntropic_Anim_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, AnimGraphNode_BlendListByBool) == 0x0012B8, "Member 'UBP_BasicImpClawEntropic_Anim_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, AnimGraphNode_SequencePlayer_2) == 0x001360, "Member 'UBP_BasicImpClawEntropic_Anim_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, AnimGraphNode_SequencePlayer_1) == 0x0013E0, "Member 'UBP_BasicImpClawEntropic_Anim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, AnimGraphNode_StateResult) == 0x001460, "Member 'UBP_BasicImpClawEntropic_Anim_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, AnimGraphNode_StateMachine) == 0x001490, "Member 'UBP_BasicImpClawEntropic_Anim_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, AnimGraphNode_SequencePlayer) == 0x001540, "Member 'UBP_BasicImpClawEntropic_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, AnimGraphNode_Slot) == 0x0015C0, "Member 'UBP_BasicImpClawEntropic_Anim_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, TurnRate) == 0x001608, "Member 'UBP_BasicImpClawEntropic_Anim_C::TurnRate' has a wrong offset!");
static_assert(offsetof(UBP_BasicImpClawEntropic_Anim_C, ChargeUp) == 0x00160C, "Member 'UBP_BasicImpClawEntropic_Anim_C::ChargeUp' has a wrong offset!");

}

