#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BrawlerGhostTrail_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BrawlerGhostTrail_VisualEntity.BP_BrawlerGhostTrail_VisualEntity_C
// 0x0030 (0x0380 - 0x0350)
class ABP_BrawlerGhostTrail_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_BrawlerHero_C*                      OwnerAsBrawlerHero;                                // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UPoseableMeshComponent*>         PoseableMeshComponents;                            // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UMaterial*                              Material;                                          // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GhostLifetime;                                     // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BrawlerGhostTrail_VisualEntity(int32 EntryPoint);
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BrawlerGhostTrail_VisualEntity_C">();
	}
	static class ABP_BrawlerGhostTrail_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BrawlerGhostTrail_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_BrawlerGhostTrail_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_BrawlerGhostTrail_VisualEntity_C");
static_assert(sizeof(ABP_BrawlerGhostTrail_VisualEntity_C) == 0x000380, "Wrong size on ABP_BrawlerGhostTrail_VisualEntity_C");
static_assert(offsetof(ABP_BrawlerGhostTrail_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_BrawlerGhostTrail_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BrawlerGhostTrail_VisualEntity_C, OwnerAsBrawlerHero) == 0x000358, "Member 'ABP_BrawlerGhostTrail_VisualEntity_C::OwnerAsBrawlerHero' has a wrong offset!");
static_assert(offsetof(ABP_BrawlerGhostTrail_VisualEntity_C, PoseableMeshComponents) == 0x000360, "Member 'ABP_BrawlerGhostTrail_VisualEntity_C::PoseableMeshComponents' has a wrong offset!");
static_assert(offsetof(ABP_BrawlerGhostTrail_VisualEntity_C, Material) == 0x000370, "Member 'ABP_BrawlerGhostTrail_VisualEntity_C::Material' has a wrong offset!");
static_assert(offsetof(ABP_BrawlerGhostTrail_VisualEntity_C, GhostLifetime) == 0x000378, "Member 'ABP_BrawlerGhostTrail_VisualEntity_C::GhostLifetime' has a wrong offset!");

}

