#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BackersPlate_Gravestone_Textblock

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_BackersPlate_Gravestone_Textblock.BP_BackersPlate_Gravestone_Textblock_C
// 0x0028 (0x0288 - 0x0260)
class UBP_BackersPlate_Gravestone_Textblock_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0270(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BP_BackersPlate_Gravestone_Textblock(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BackersPlate_Gravestone_Textblock_C">();
	}
	static class UBP_BackersPlate_Gravestone_Textblock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BackersPlate_Gravestone_Textblock_C>();
	}
};
static_assert(alignof(UBP_BackersPlate_Gravestone_Textblock_C) == 0x000008, "Wrong alignment on UBP_BackersPlate_Gravestone_Textblock_C");
static_assert(sizeof(UBP_BackersPlate_Gravestone_Textblock_C) == 0x000288, "Wrong size on UBP_BackersPlate_Gravestone_Textblock_C");
static_assert(offsetof(UBP_BackersPlate_Gravestone_Textblock_C, UberGraphFrame) == 0x000260, "Member 'UBP_BackersPlate_Gravestone_Textblock_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_Textblock_C, TextBlock) == 0x000268, "Member 'UBP_BackersPlate_Gravestone_Textblock_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_Textblock_C, Text) == 0x000270, "Member 'UBP_BackersPlate_Gravestone_Textblock_C::Text' has a wrong offset!");

}

