#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BearTrapProjectile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BearTrapProjectile.BP_BearTrapProjectile_C
// 0x0048 (0x0B68 - 0x0B20)
class ABP_BearTrapProjectile_C : public ABearTrapProjectile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_BearTrap_Opened;                                // 0x0B28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      VFXProjectileTrail;                                // 0x0B30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0B38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0B40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         AlignTimeline_Alpha_7C9C42954416A7207D2F23B15B0BB7B3; // 0x0B48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            AlignTimeline__Direction_7C9C42954416A7207D2F23B15B0BB7B3; // 0x0B4C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4D[0x3];                                      // 0x0B4D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     AlignTimeline;                                     // 0x0B50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OldRot;                                            // 0x0B58(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          WasClosed;                                         // 0x0B64(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_BearTrapProjectile(int32 EntryPoint);
	void OnVfxEvent(class FName VfxEventType);
	void BPPostBeginPlay();
	void ReceiveDestroyed();
	void AlignTimeline__UpdateFunc();
	void AlignTimeline__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BearTrapProjectile_C">();
	}
	static class ABP_BearTrapProjectile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BearTrapProjectile_C>();
	}
};
static_assert(alignof(ABP_BearTrapProjectile_C) == 0x000008, "Wrong alignment on ABP_BearTrapProjectile_C");
static_assert(sizeof(ABP_BearTrapProjectile_C) == 0x000B68, "Wrong size on ABP_BearTrapProjectile_C");
static_assert(offsetof(ABP_BearTrapProjectile_C, UberGraphFrame) == 0x000B20, "Member 'ABP_BearTrapProjectile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BearTrapProjectile_C, NS_BearTrap_Opened) == 0x000B28, "Member 'ABP_BearTrapProjectile_C::NS_BearTrap_Opened' has a wrong offset!");
static_assert(offsetof(ABP_BearTrapProjectile_C, VFXProjectileTrail) == 0x000B30, "Member 'ABP_BearTrapProjectile_C::VFXProjectileTrail' has a wrong offset!");
static_assert(offsetof(ABP_BearTrapProjectile_C, Ak) == 0x000B38, "Member 'ABP_BearTrapProjectile_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_BearTrapProjectile_C, SkeletalMesh) == 0x000B40, "Member 'ABP_BearTrapProjectile_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_BearTrapProjectile_C, AlignTimeline_Alpha_7C9C42954416A7207D2F23B15B0BB7B3) == 0x000B48, "Member 'ABP_BearTrapProjectile_C::AlignTimeline_Alpha_7C9C42954416A7207D2F23B15B0BB7B3' has a wrong offset!");
static_assert(offsetof(ABP_BearTrapProjectile_C, AlignTimeline__Direction_7C9C42954416A7207D2F23B15B0BB7B3) == 0x000B4C, "Member 'ABP_BearTrapProjectile_C::AlignTimeline__Direction_7C9C42954416A7207D2F23B15B0BB7B3' has a wrong offset!");
static_assert(offsetof(ABP_BearTrapProjectile_C, AlignTimeline) == 0x000B50, "Member 'ABP_BearTrapProjectile_C::AlignTimeline' has a wrong offset!");
static_assert(offsetof(ABP_BearTrapProjectile_C, OldRot) == 0x000B58, "Member 'ABP_BearTrapProjectile_C::OldRot' has a wrong offset!");
static_assert(offsetof(ABP_BearTrapProjectile_C, WasClosed) == 0x000B64, "Member 'ABP_BearTrapProjectile_C::WasClosed' has a wrong offset!");

}

