#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BrawlerInventory

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BrawlerInventory.BP_BrawlerInventory_C.ExecuteUbergraph_BP_BrawlerInventory
// 0x0040 (0x0040 - 0x0000)
struct BP_BrawlerInventory_C_ExecuteUbergraph_BP_BrawlerInventory final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UInventorySlot*                         K2Node_Event_SourceSlot;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventorySlot*                         K2Node_Event_DestinationSlot;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManQuestManager*                       CallFunc_GetQuestManager_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManQuest*                              CallFunc_AddQuest_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMapFragmentItemAbility*                K2Node_DynamicCast_AsMap_Fragment_Item_Ability;    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasQuest_ReturnValue;                     // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BrawlerInventory_C_ExecuteUbergraph_BP_BrawlerInventory) == 0x000008, "Wrong alignment on BP_BrawlerInventory_C_ExecuteUbergraph_BP_BrawlerInventory");
static_assert(sizeof(BP_BrawlerInventory_C_ExecuteUbergraph_BP_BrawlerInventory) == 0x000040, "Wrong size on BP_BrawlerInventory_C_ExecuteUbergraph_BP_BrawlerInventory");
static_assert(offsetof(BP_BrawlerInventory_C_ExecuteUbergraph_BP_BrawlerInventory, EntryPoint) == 0x000000, "Member 'BP_BrawlerInventory_C_ExecuteUbergraph_BP_BrawlerInventory::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventory_C_ExecuteUbergraph_BP_BrawlerInventory, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'BP_BrawlerInventory_C_ExecuteUbergraph_BP_BrawlerInventory::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventory_C_ExecuteUbergraph_BP_BrawlerInventory, K2Node_Event_SourceSlot) == 0x000010, "Member 'BP_BrawlerInventory_C_ExecuteUbergraph_BP_BrawlerInventory::K2Node_Event_SourceSlot' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventory_C_ExecuteUbergraph_BP_BrawlerInventory, K2Node_Event_DestinationSlot) == 0x000018, "Member 'BP_BrawlerInventory_C_ExecuteUbergraph_BP_BrawlerInventory::K2Node_Event_DestinationSlot' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventory_C_ExecuteUbergraph_BP_BrawlerInventory, CallFunc_GetQuestManager_ReturnValue) == 0x000020, "Member 'BP_BrawlerInventory_C_ExecuteUbergraph_BP_BrawlerInventory::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventory_C_ExecuteUbergraph_BP_BrawlerInventory, CallFunc_AddQuest_ReturnValue) == 0x000028, "Member 'BP_BrawlerInventory_C_ExecuteUbergraph_BP_BrawlerInventory::CallFunc_AddQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventory_C_ExecuteUbergraph_BP_BrawlerInventory, K2Node_DynamicCast_AsMap_Fragment_Item_Ability) == 0x000030, "Member 'BP_BrawlerInventory_C_ExecuteUbergraph_BP_BrawlerInventory::K2Node_DynamicCast_AsMap_Fragment_Item_Ability' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventory_C_ExecuteUbergraph_BP_BrawlerInventory, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_BrawlerInventory_C_ExecuteUbergraph_BP_BrawlerInventory::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventory_C_ExecuteUbergraph_BP_BrawlerInventory, CallFunc_HasQuest_ReturnValue) == 0x000039, "Member 'BP_BrawlerInventory_C_ExecuteUbergraph_BP_BrawlerInventory::CallFunc_HasQuest_ReturnValue' has a wrong offset!");

// Function BP_BrawlerInventory.BP_BrawlerInventory_C.BPOnItemSlotChanged
// 0x0010 (0x0010 - 0x0000)
struct BP_BrawlerInventory_C_BPOnItemSlotChanged final
{
public:
	class UInventorySlot*                         SourceSlot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventorySlot*                         DestinationSlot;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BrawlerInventory_C_BPOnItemSlotChanged) == 0x000008, "Wrong alignment on BP_BrawlerInventory_C_BPOnItemSlotChanged");
static_assert(sizeof(BP_BrawlerInventory_C_BPOnItemSlotChanged) == 0x000010, "Wrong size on BP_BrawlerInventory_C_BPOnItemSlotChanged");
static_assert(offsetof(BP_BrawlerInventory_C_BPOnItemSlotChanged, SourceSlot) == 0x000000, "Member 'BP_BrawlerInventory_C_BPOnItemSlotChanged::SourceSlot' has a wrong offset!");
static_assert(offsetof(BP_BrawlerInventory_C_BPOnItemSlotChanged, DestinationSlot) == 0x000008, "Member 'BP_BrawlerInventory_C_BPOnItemSlotChanged::DestinationSlot' has a wrong offset!");

}

