#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BasicImpClawEntropic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BasicImpClawEntropic.BP_BasicImpClawEntropic_C
// 0x0090 (0x1B50 - 0x1AC0)
class ABP_BasicImpClawEntropic_C : public AEnemyCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1AC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_EntropyEnemy_Die;                               // 0x1AC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_EntropyInsideMesh_C*                BP_EntropyInsideMesh;                              // 0x1AD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_EntropicEnemy;                                  // 0x1AD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule_Tail;                                  // 0x1AE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule_Arm2;                                  // 0x1AE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule_Arm1;                                  // 0x1AF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule_Leg4;                                  // 0x1AF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule_Leg3;                                  // 0x1B00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule_Leg2;                                  // 0x1B08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule_Leg1;                                  // 0x1B10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule_Head;                                  // 0x1B18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                HitBoxLeft;                                        // 0x1B20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TR_CurrentAction;                                  // 0x1B28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               LivingVFX;                                         // 0x1B30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_HPBarWidgetComponent_C*             BP_HPBarWidgetComponent;                           // 0x1B38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule;                                       // 0x1B40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FadeSpeed;                                         // 0x1B48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeValue;                                         // 0x1B4C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BasicImpClawEntropic(int32 EntryPoint);
	void OnKilled(class UObject* Killer, class UAbilityController* KillerAbilityController);
	void BPPostBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BasicImpClawEntropic_C">();
	}
	static class ABP_BasicImpClawEntropic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BasicImpClawEntropic_C>();
	}
};
static_assert(alignof(ABP_BasicImpClawEntropic_C) == 0x000010, "Wrong alignment on ABP_BasicImpClawEntropic_C");
static_assert(sizeof(ABP_BasicImpClawEntropic_C) == 0x001B50, "Wrong size on ABP_BasicImpClawEntropic_C");
static_assert(offsetof(ABP_BasicImpClawEntropic_C, UberGraphFrame) == 0x001AC0, "Member 'ABP_BasicImpClawEntropic_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpClawEntropic_C, NS_EntropyEnemy_Die) == 0x001AC8, "Member 'ABP_BasicImpClawEntropic_C::NS_EntropyEnemy_Die' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpClawEntropic_C, BP_EntropyInsideMesh) == 0x001AD0, "Member 'ABP_BasicImpClawEntropic_C::BP_EntropyInsideMesh' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpClawEntropic_C, NS_EntropicEnemy) == 0x001AD8, "Member 'ABP_BasicImpClawEntropic_C::NS_EntropicEnemy' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpClawEntropic_C, HurtCapsule_Tail) == 0x001AE0, "Member 'ABP_BasicImpClawEntropic_C::HurtCapsule_Tail' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpClawEntropic_C, HurtCapsule_Arm2) == 0x001AE8, "Member 'ABP_BasicImpClawEntropic_C::HurtCapsule_Arm2' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpClawEntropic_C, HurtCapsule_Arm1) == 0x001AF0, "Member 'ABP_BasicImpClawEntropic_C::HurtCapsule_Arm1' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpClawEntropic_C, HurtCapsule_Leg4) == 0x001AF8, "Member 'ABP_BasicImpClawEntropic_C::HurtCapsule_Leg4' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpClawEntropic_C, HurtCapsule_Leg3) == 0x001B00, "Member 'ABP_BasicImpClawEntropic_C::HurtCapsule_Leg3' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpClawEntropic_C, HurtCapsule_Leg2) == 0x001B08, "Member 'ABP_BasicImpClawEntropic_C::HurtCapsule_Leg2' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpClawEntropic_C, HurtCapsule_Leg1) == 0x001B10, "Member 'ABP_BasicImpClawEntropic_C::HurtCapsule_Leg1' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpClawEntropic_C, HurtCapsule_Head) == 0x001B18, "Member 'ABP_BasicImpClawEntropic_C::HurtCapsule_Head' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpClawEntropic_C, HitBoxLeft) == 0x001B20, "Member 'ABP_BasicImpClawEntropic_C::HitBoxLeft' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpClawEntropic_C, TR_CurrentAction) == 0x001B28, "Member 'ABP_BasicImpClawEntropic_C::TR_CurrentAction' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpClawEntropic_C, LivingVFX) == 0x001B30, "Member 'ABP_BasicImpClawEntropic_C::LivingVFX' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpClawEntropic_C, BP_HPBarWidgetComponent) == 0x001B38, "Member 'ABP_BasicImpClawEntropic_C::BP_HPBarWidgetComponent' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpClawEntropic_C, HurtCapsule) == 0x001B40, "Member 'ABP_BasicImpClawEntropic_C::HurtCapsule' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpClawEntropic_C, FadeSpeed) == 0x001B48, "Member 'ABP_BasicImpClawEntropic_C::FadeSpeed' has a wrong offset!");
static_assert(offsetof(ABP_BasicImpClawEntropic_C, FadeValue) == 0x001B4C, "Member 'ABP_BasicImpClawEntropic_C::FadeValue' has a wrong offset!");

}

