#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Branween

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Branween.BP_Branween_C.ExecuteUbergraph_BP_Branween
// 0x0020 (0x0020 - 0x0000)
struct BP_Branween_C_ExecuteUbergraph_BP_Branween final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGlobalBool_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Branween_C_ExecuteUbergraph_BP_Branween) == 0x000008, "Wrong alignment on BP_Branween_C_ExecuteUbergraph_BP_Branween");
static_assert(sizeof(BP_Branween_C_ExecuteUbergraph_BP_Branween) == 0x000020, "Wrong size on BP_Branween_C_ExecuteUbergraph_BP_Branween");
static_assert(offsetof(BP_Branween_C_ExecuteUbergraph_BP_Branween, EntryPoint) == 0x000000, "Member 'BP_Branween_C_ExecuteUbergraph_BP_Branween::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Branween_C_ExecuteUbergraph_BP_Branween, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000004, "Member 'BP_Branween_C_ExecuteUbergraph_BP_Branween::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Branween_C_ExecuteUbergraph_BP_Branween, CallFunc_GetGlobalBool_ReturnValue) == 0x000010, "Member 'BP_Branween_C_ExecuteUbergraph_BP_Branween::CallFunc_GetGlobalBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Branween_C_ExecuteUbergraph_BP_Branween, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000018, "Member 'BP_Branween_C_ExecuteUbergraph_BP_Branween::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

}

