#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BrawlerInventory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BrawlerInventory.BP_BrawlerInventory_C
// 0x0038 (0x03B8 - 0x0380)
class UBP_BrawlerInventory_C final : public UInventory
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<bool>                                  ThrallSlots;                                       // 0x0388(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	TMulticastInlineDelegate<void()>              DInventoryVisualSaveLoad;                          // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<bool>                                  ShadowPyreSlots;                                   // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)

public:
	void ExecuteUbergraph_BP_BrawlerInventory(int32 EntryPoint);
	void BPPostSaveLoaded();
	void BPOnItemSlotChanged(class UInventorySlot* SourceSlot, class UInventorySlot* DestinationSlot);
	void InventoryVisualSaveLoad();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BrawlerInventory_C">();
	}
	static class UBP_BrawlerInventory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BrawlerInventory_C>();
	}
};
static_assert(alignof(UBP_BrawlerInventory_C) == 0x000008, "Wrong alignment on UBP_BrawlerInventory_C");
static_assert(sizeof(UBP_BrawlerInventory_C) == 0x0003B8, "Wrong size on UBP_BrawlerInventory_C");
static_assert(offsetof(UBP_BrawlerInventory_C, UberGraphFrame) == 0x000380, "Member 'UBP_BrawlerInventory_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_BrawlerInventory_C, ThrallSlots) == 0x000388, "Member 'UBP_BrawlerInventory_C::ThrallSlots' has a wrong offset!");
static_assert(offsetof(UBP_BrawlerInventory_C, DInventoryVisualSaveLoad) == 0x000398, "Member 'UBP_BrawlerInventory_C::DInventoryVisualSaveLoad' has a wrong offset!");
static_assert(offsetof(UBP_BrawlerInventory_C, ShadowPyreSlots) == 0x0003A8, "Member 'UBP_BrawlerInventory_C::ShadowPyreSlots' has a wrong offset!");

}

