#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BallLightningProjectile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BallLightningProjectile.BP_BallLightningProjectile_C
// 0x0030 (0x0E60 - 0x0E30)
class ABP_BallLightningProjectile_C final : public ABallLightningProjectile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHitBox*                                HitBoxAOE;                                         // 0x0E38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Warden_BallLightning_Beam;                      // 0x0E40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UManBoxComponent*                       ManProjectileEnviormentalCollider;                 // 0x0E48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         HitActors;                                         // 0x0E50(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_BallLightningProjectile(int32 EntryPoint);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void BPDamageCausedEvent_Event_0(class UAbilityController* Source, class UAbilityController* Bullet, class UAbilityController* Target, class UAbilityBase* Ability, float effectiveDamage, const struct FDamageValue& DamageValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BallLightningProjectile_C">();
	}
	static class ABP_BallLightningProjectile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BallLightningProjectile_C>();
	}
};
static_assert(alignof(ABP_BallLightningProjectile_C) == 0x000008, "Wrong alignment on ABP_BallLightningProjectile_C");
static_assert(sizeof(ABP_BallLightningProjectile_C) == 0x000E60, "Wrong size on ABP_BallLightningProjectile_C");
static_assert(offsetof(ABP_BallLightningProjectile_C, UberGraphFrame) == 0x000E30, "Member 'ABP_BallLightningProjectile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BallLightningProjectile_C, HitBoxAOE) == 0x000E38, "Member 'ABP_BallLightningProjectile_C::HitBoxAOE' has a wrong offset!");
static_assert(offsetof(ABP_BallLightningProjectile_C, NS_Warden_BallLightning_Beam) == 0x000E40, "Member 'ABP_BallLightningProjectile_C::NS_Warden_BallLightning_Beam' has a wrong offset!");
static_assert(offsetof(ABP_BallLightningProjectile_C, ManProjectileEnviormentalCollider) == 0x000E48, "Member 'ABP_BallLightningProjectile_C::ManProjectileEnviormentalCollider' has a wrong offset!");
static_assert(offsetof(ABP_BallLightningProjectile_C, HitActors) == 0x000E50, "Member 'ABP_BallLightningProjectile_C::HitActors' has a wrong offset!");

}

