#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BackersPlate_Gravestone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_BackersPlate_Gravestone.BP_BackersPlate_Gravestone_C
// 0x01E0 (0x06A0 - 0x04C0)
class UBP_BackersPlate_Gravestone_C final : public UInfoScreenUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur;                                    // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BottomScreenFrame;                                 // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock;              // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_1;            // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_2;            // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_3;            // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_4;            // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_5;            // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_6;            // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_7;            // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_8;            // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_9;            // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_10;           // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_11;           // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_12;           // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_13;           // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_14;           // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_15;           // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_16;           // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_17;           // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_18;           // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_19;           // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_20;           // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_21;           // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_22;           // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_23;           // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_24;           // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_25;           // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_26;           // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_27;           // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_28;           // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_29;           // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_30;           // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_31;           // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_32;           // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_33;           // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_34;           // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_35;           // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_36;           // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_37;           // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_38;           // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_39;           // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_40;           // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_41;           // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_42;           // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_43;           // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_44;           // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_45;           // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_46;           // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_47;           // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_48;           // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BackersPlate_Gravestone_Textblock_C* BP_BackersPlate_Gravestone_Textblock_49;           // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyB;                                        // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ContainerLeft;                                     // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ContainerRight;                                    // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ParchmentTexture;                                  // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TopScreenFrame;                                    // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BackersPlate_Gravestone(int32 EntryPoint);
	void OnSetData(class UInfoScreentDataAsset* InInfoScreenData);
	void BndEvt__BtnHotkeyA2_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnHide(float AnimDuration);
	void OnShow(float AnimDuration);
	void OnGamepadBEvent();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void InitLeft(TArray<class FText>& InTextArray);
	void BtnHotkeyBClicked();
	void InitRight(TArray<class FText>& InTextArray);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BackersPlate_Gravestone_C">();
	}
	static class UBP_BackersPlate_Gravestone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BackersPlate_Gravestone_C>();
	}
};
static_assert(alignof(UBP_BackersPlate_Gravestone_C) == 0x000008, "Wrong alignment on UBP_BackersPlate_Gravestone_C");
static_assert(sizeof(UBP_BackersPlate_Gravestone_C) == 0x0006A0, "Wrong size on UBP_BackersPlate_Gravestone_C");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, UberGraphFrame) == 0x0004C0, "Member 'UBP_BackersPlate_Gravestone_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, FadeOutAnim) == 0x0004C8, "Member 'UBP_BackersPlate_Gravestone_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, FadeInAnim) == 0x0004D0, "Member 'UBP_BackersPlate_Gravestone_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BackgroundBlur) == 0x0004D8, "Member 'UBP_BackersPlate_Gravestone_C::BackgroundBlur' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BottomScreenFrame) == 0x0004E0, "Member 'UBP_BackersPlate_Gravestone_C::BottomScreenFrame' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock) == 0x0004E8, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_1) == 0x0004F0, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_1' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_2) == 0x0004F8, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_2' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_3) == 0x000500, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_3' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_4) == 0x000508, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_4' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_5) == 0x000510, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_5' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_6) == 0x000518, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_6' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_7) == 0x000520, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_7' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_8) == 0x000528, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_8' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_9) == 0x000530, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_9' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_10) == 0x000538, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_10' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_11) == 0x000540, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_11' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_12) == 0x000548, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_12' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_13) == 0x000550, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_13' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_14) == 0x000558, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_14' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_15) == 0x000560, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_15' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_16) == 0x000568, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_16' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_17) == 0x000570, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_17' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_18) == 0x000578, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_18' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_19) == 0x000580, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_19' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_20) == 0x000588, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_20' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_21) == 0x000590, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_21' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_22) == 0x000598, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_22' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_23) == 0x0005A0, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_23' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_24) == 0x0005A8, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_24' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_25) == 0x0005B0, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_25' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_26) == 0x0005B8, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_26' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_27) == 0x0005C0, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_27' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_28) == 0x0005C8, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_28' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_29) == 0x0005D0, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_29' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_30) == 0x0005D8, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_30' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_31) == 0x0005E0, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_31' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_32) == 0x0005E8, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_32' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_33) == 0x0005F0, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_33' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_34) == 0x0005F8, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_34' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_35) == 0x000600, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_35' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_36) == 0x000608, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_36' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_37) == 0x000610, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_37' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_38) == 0x000618, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_38' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_39) == 0x000620, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_39' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_40) == 0x000628, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_40' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_41) == 0x000630, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_41' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_42) == 0x000638, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_42' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_43) == 0x000640, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_43' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_44) == 0x000648, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_44' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_45) == 0x000650, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_45' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_46) == 0x000658, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_46' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_47) == 0x000660, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_47' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_48) == 0x000668, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_48' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BP_BackersPlate_Gravestone_Textblock_49) == 0x000670, "Member 'UBP_BackersPlate_Gravestone_C::BP_BackersPlate_Gravestone_Textblock_49' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, BtnHotkeyB) == 0x000678, "Member 'UBP_BackersPlate_Gravestone_C::BtnHotkeyB' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, ContainerLeft) == 0x000680, "Member 'UBP_BackersPlate_Gravestone_C::ContainerLeft' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, ContainerRight) == 0x000688, "Member 'UBP_BackersPlate_Gravestone_C::ContainerRight' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, ParchmentTexture) == 0x000690, "Member 'UBP_BackersPlate_Gravestone_C::ParchmentTexture' has a wrong offset!");
static_assert(offsetof(UBP_BackersPlate_Gravestone_C, TopScreenFrame) == 0x000698, "Member 'UBP_BackersPlate_Gravestone_C::TopScreenFrame' has a wrong offset!");

}

