#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BreakableWall

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "S_DestructibleWalls_structs.hpp"
#include "man_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_BreakableWall.BP_BreakableWall_C.ExecuteUbergraph_BP_BreakableWall
// 0x0440 (0x0440 - 0x0000)
struct BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActorSoul*                             K2Node_CustomEvent_Source;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActorSoul*                             K2Node_CustomEvent_Target;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           K2Node_CustomEvent_Ability;                        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimID*                                K2Node_CustomEvent_Anim;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_effectiveDamage;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageValue                           K2Node_CustomEvent_OriginalDamageValue;            // 0x0060(0x0138)(ContainsInstancedReference)
	struct FDamageValue                           K2Node_CustomEvent_DamageValue;                    // 0x0198(0x0138)(ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_Instant;                        // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x02D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x02D4(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x02E4(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Killer;                         // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     K2Node_CustomEvent_KillerAbilityController;        // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Killer, class UAbilityController* KillerAbilityController)> K2Node_CreateDelegate_OutputDelegate;              // 0x0308(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_GetHurtLocationAndRadius_Location;        // 0x0318(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHurtLocationAndRadius_Radius;          // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetHurtLocationAndRadius_Location_1;      // 0x0328(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHurtLocationAndRadius_Radius_1;        // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetHurtLocationAndRadius_Location_2;      // 0x0338(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHurtLocationAndRadius_Radius_2;        // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A[0x2];                                      // 0x034A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AStaticMeshActor*                       CallFunc_Array_Get_Item;                           // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0360(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetHiddenWallMaterialParameters_Success;  // 0x036A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetHiddenWallMaterialParameters_Success_1; // 0x036B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActorSoul* Source, class AActorSoul* Target, class UAbilityBase* Ability, class UAnimID* Anim, float effectiveDamage, const struct FDamageValue& OriginalDamageValue, const struct FDamageValue& DamageValue)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0374(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0388(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x03A0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x03E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x03F0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0408(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetHiddenWallMaterialParameters_Success_2; // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       CallFunc_Array_Get_Item_1;                         // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x042C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x042D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42E[0x2];                                      // 0x042E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_fog_fx_C*                           CallFunc_Array_Get_Item_2;                         // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x043C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall) == 0x000008, "Wrong alignment on BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall");
static_assert(sizeof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall) == 0x000440, "Wrong size on BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, EntryPoint) == 0x000000, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, Temp_bool_Has_Been_Initd_Variable) == 0x000010, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, Temp_bool_IsClosed_Variable) == 0x000020, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, Temp_bool_Has_Been_Initd_Variable_1) == 0x000021, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, Temp_int_Loop_Counter_Variable_2) == 0x000024, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_Add_IntInt_ReturnValue_2) == 0x000028, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, Temp_int_Array_Index_Variable_2) == 0x00002C, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, Temp_bool_IsClosed_Variable_1) == 0x000030, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, K2Node_CustomEvent_Source) == 0x000038, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::K2Node_CustomEvent_Source' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, K2Node_CustomEvent_Target) == 0x000040, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, K2Node_CustomEvent_Ability) == 0x000048, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::K2Node_CustomEvent_Ability' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, K2Node_CustomEvent_Anim) == 0x000050, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::K2Node_CustomEvent_Anim' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, K2Node_CustomEvent_effectiveDamage) == 0x000058, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::K2Node_CustomEvent_effectiveDamage' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, K2Node_CustomEvent_OriginalDamageValue) == 0x000060, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::K2Node_CustomEvent_OriginalDamageValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, K2Node_CustomEvent_DamageValue) == 0x000198, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::K2Node_CustomEvent_DamageValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, K2Node_CustomEvent_Instant) == 0x0002D0, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::K2Node_CustomEvent_Instant' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x0002D1, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0002D2, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x0002D3, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, Temp_delegate_Variable) == 0x0002D4, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, Temp_delegate_Variable_1) == 0x0002E4, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, K2Node_CustomEvent_Killer) == 0x0002F8, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::K2Node_CustomEvent_Killer' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, K2Node_CustomEvent_KillerAbilityController) == 0x000300, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::K2Node_CustomEvent_KillerAbilityController' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, K2Node_CreateDelegate_OutputDelegate) == 0x000308, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_GetHurtLocationAndRadius_Location) == 0x000318, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_GetHurtLocationAndRadius_Location' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_GetHurtLocationAndRadius_Radius) == 0x000324, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_GetHurtLocationAndRadius_Radius' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_GetHurtLocationAndRadius_Location_1) == 0x000328, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_GetHurtLocationAndRadius_Location_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_GetHurtLocationAndRadius_Radius_1) == 0x000334, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_GetHurtLocationAndRadius_Radius_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_GetHurtLocationAndRadius_Location_2) == 0x000338, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_GetHurtLocationAndRadius_Location_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_GetHurtLocationAndRadius_Radius_2) == 0x000344, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_GetHurtLocationAndRadius_Radius_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_IsValid_ReturnValue) == 0x000348, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_Not_PreBool_ReturnValue) == 0x000349, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00034C, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_Array_Get_Item) == 0x000350, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_Array_Length_ReturnValue) == 0x000358, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000360, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_Less_IntInt_ReturnValue) == 0x000368, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, Temp_bool_Has_Been_Initd_Variable_2) == 0x000369, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_SetHiddenWallMaterialParameters_Success) == 0x00036A, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_SetHiddenWallMaterialParameters_Success' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_SetHiddenWallMaterialParameters_Success_1) == 0x00036B, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_SetHiddenWallMaterialParameters_Success_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_PostAkEvent_ReturnValue) == 0x00036C, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_PostAkEvent_ReturnValue_1) == 0x000370, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, K2Node_CreateDelegate_OutputDelegate_1) == 0x000374, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000388, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, K2Node_MakeStruct_FormatArgumentData) == 0x0003A0, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, K2Node_MakeArray_Array) == 0x0003E0, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_Format_ReturnValue) == 0x0003F0, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_Conv_TextToString_ReturnValue) == 0x000408, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_SetHiddenWallMaterialParameters_Success_2) == 0x000418, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_SetHiddenWallMaterialParameters_Success_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_Array_Get_Item_1) == 0x000420, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_Array_Length_ReturnValue_1) == 0x000428, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_Less_IntInt_ReturnValue_1) == 0x00042C, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, Temp_bool_IsClosed_Variable_2) == 0x00042D, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_Array_Get_Item_2) == 0x000430, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_Array_Length_ReturnValue_2) == 0x000438, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall, CallFunc_Less_IntInt_ReturnValue_2) == 0x00043C, "Member 'BP_BreakableWall_C_ExecuteUbergraph_BP_BreakableWall::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function BP_BreakableWall.BP_BreakableWall_C.OnKilled
// 0x0010 (0x0010 - 0x0000)
struct BP_BreakableWall_C_OnKilled final
{
public:
	class UObject*                                Killer;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     KillerAbilityController;                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BreakableWall_C_OnKilled) == 0x000008, "Wrong alignment on BP_BreakableWall_C_OnKilled");
static_assert(sizeof(BP_BreakableWall_C_OnKilled) == 0x000010, "Wrong size on BP_BreakableWall_C_OnKilled");
static_assert(offsetof(BP_BreakableWall_C_OnKilled, Killer) == 0x000000, "Member 'BP_BreakableWall_C_OnKilled::Killer' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_OnKilled, KillerAbilityController) == 0x000008, "Member 'BP_BreakableWall_C_OnKilled::KillerAbilityController' has a wrong offset!");

// Function BP_BreakableWall.BP_BreakableWall_C.Fade
// 0x0001 (0x0001 - 0x0000)
struct BP_BreakableWall_C_Fade final
{
public:
	bool                                          Instant;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BreakableWall_C_Fade) == 0x000001, "Wrong alignment on BP_BreakableWall_C_Fade");
static_assert(sizeof(BP_BreakableWall_C_Fade) == 0x000001, "Wrong size on BP_BreakableWall_C_Fade");
static_assert(offsetof(BP_BreakableWall_C_Fade, Instant) == 0x000000, "Member 'BP_BreakableWall_C_Fade::Instant' has a wrong offset!");

// Function BP_BreakableWall.BP_BreakableWall_C.DamageTaken
// 0x0298 (0x0298 - 0x0000)
struct BP_BreakableWall_C_DamageTaken final
{
public:
	class AActorSoul*                             Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActorSoul*                             Target;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           Ability;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimID*                                Anim;                                              // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         effectiveDamage;                                   // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageValue                           OriginalDamageValue;                               // 0x0028(0x0138)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FDamageValue                           DamageValue;                                       // 0x0160(0x0138)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_BreakableWall_C_DamageTaken) == 0x000008, "Wrong alignment on BP_BreakableWall_C_DamageTaken");
static_assert(sizeof(BP_BreakableWall_C_DamageTaken) == 0x000298, "Wrong size on BP_BreakableWall_C_DamageTaken");
static_assert(offsetof(BP_BreakableWall_C_DamageTaken, Source) == 0x000000, "Member 'BP_BreakableWall_C_DamageTaken::Source' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_DamageTaken, Target) == 0x000008, "Member 'BP_BreakableWall_C_DamageTaken::Target' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_DamageTaken, Ability) == 0x000010, "Member 'BP_BreakableWall_C_DamageTaken::Ability' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_DamageTaken, Anim) == 0x000018, "Member 'BP_BreakableWall_C_DamageTaken::Anim' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_DamageTaken, effectiveDamage) == 0x000020, "Member 'BP_BreakableWall_C_DamageTaken::effectiveDamage' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_DamageTaken, OriginalDamageValue) == 0x000028, "Member 'BP_BreakableWall_C_DamageTaken::OriginalDamageValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_DamageTaken, DamageValue) == 0x000160, "Member 'BP_BreakableWall_C_DamageTaken::DamageValue' has a wrong offset!");

// Function BP_BreakableWall.BP_BreakableWall_C.UserConstructionScript
// 0x0040 (0x0040 - 0x0000)
struct BP_BreakableWall_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetHurtLocationAndRadius_Location;        // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHurtLocationAndRadius_Radius;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetHurtLocationAndRadius_Location_1;      // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHurtLocationAndRadius_Radius_1;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetHurtLocationAndRadius_Location_2;      // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHurtLocationAndRadius_Radius_2;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BreakableWall_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_BreakableWall_C_UserConstructionScript");
static_assert(sizeof(BP_BreakableWall_C_UserConstructionScript) == 0x000040, "Wrong size on BP_BreakableWall_C_UserConstructionScript");
static_assert(offsetof(BP_BreakableWall_C_UserConstructionScript, CallFunc_BooleanOR_ReturnValue) == 0x000000, "Member 'BP_BreakableWall_C_UserConstructionScript::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_UserConstructionScript, CallFunc_GetHurtLocationAndRadius_Location) == 0x000004, "Member 'BP_BreakableWall_C_UserConstructionScript::CallFunc_GetHurtLocationAndRadius_Location' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_UserConstructionScript, CallFunc_GetHurtLocationAndRadius_Radius) == 0x000010, "Member 'BP_BreakableWall_C_UserConstructionScript::CallFunc_GetHurtLocationAndRadius_Radius' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_UserConstructionScript, CallFunc_GetHurtLocationAndRadius_Location_1) == 0x000014, "Member 'BP_BreakableWall_C_UserConstructionScript::CallFunc_GetHurtLocationAndRadius_Location_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_UserConstructionScript, CallFunc_GetHurtLocationAndRadius_Radius_1) == 0x000020, "Member 'BP_BreakableWall_C_UserConstructionScript::CallFunc_GetHurtLocationAndRadius_Radius_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_UserConstructionScript, CallFunc_BooleanOR_ReturnValue_1) == 0x000024, "Member 'BP_BreakableWall_C_UserConstructionScript::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_UserConstructionScript, CallFunc_GetHurtLocationAndRadius_Location_2) == 0x000028, "Member 'BP_BreakableWall_C_UserConstructionScript::CallFunc_GetHurtLocationAndRadius_Location_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_UserConstructionScript, CallFunc_GetHurtLocationAndRadius_Radius_2) == 0x000034, "Member 'BP_BreakableWall_C_UserConstructionScript::CallFunc_GetHurtLocationAndRadius_Radius_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_UserConstructionScript, CallFunc_K2_SetTimer_ReturnValue) == 0x000038, "Member 'BP_BreakableWall_C_UserConstructionScript::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function BP_BreakableWall.BP_BreakableWall_C.SetSupportOffsets
// 0x0140 (0x0140 - 0x0000)
struct BP_BreakableWall_C_SetSupportOffsets final
{
public:
	class UStaticMeshComponent*                   Support;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Scale;                                             // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x002C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x00B4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_BreakableWall_C_SetSupportOffsets) == 0x000008, "Wrong alignment on BP_BreakableWall_C_SetSupportOffsets");
static_assert(sizeof(BP_BreakableWall_C_SetSupportOffsets) == 0x000140, "Wrong size on BP_BreakableWall_C_SetSupportOffsets");
static_assert(offsetof(BP_BreakableWall_C_SetSupportOffsets, Support) == 0x000000, "Member 'BP_BreakableWall_C_SetSupportOffsets::Support' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_SetSupportOffsets, Location) == 0x000008, "Member 'BP_BreakableWall_C_SetSupportOffsets::Location' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_SetSupportOffsets, Scale) == 0x000014, "Member 'BP_BreakableWall_C_SetSupportOffsets::Scale' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_SetSupportOffsets, Rotation) == 0x000020, "Member 'BP_BreakableWall_C_SetSupportOffsets::Rotation' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_SetSupportOffsets, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x00002C, "Member 'BP_BreakableWall_C_SetSupportOffsets::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_SetSupportOffsets, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0000B4, "Member 'BP_BreakableWall_C_SetSupportOffsets::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

// Function BP_BreakableWall.BP_BreakableWall_C.GetHurtLocationAndRadius
// 0x0148 (0x0148 - 0x0000)
struct BP_BreakableWall_C_GetHurtLocationAndRadius final
{
public:
	int32                                         N;                                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetHurtLocationRelative_ReturnValue;      // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_2;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetHurtLocationRelative_ReturnValue_1;    // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_2;                           // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BreakableWall_C_GetHurtLocationAndRadius) == 0x000008, "Wrong alignment on BP_BreakableWall_C_GetHurtLocationAndRadius");
static_assert(sizeof(BP_BreakableWall_C_GetHurtLocationAndRadius) == 0x000148, "Wrong size on BP_BreakableWall_C_GetHurtLocationAndRadius");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, N) == 0x000000, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::N' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, Location) == 0x000004, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::Location' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, Radius) == 0x000010, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::Radius' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, Temp_bool_Variable) == 0x000014, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, Temp_bool_Variable_1) == 0x000015, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, Temp_int_Variable) == 0x000018, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, Temp_struct_Variable) == 0x00001C, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, Temp_struct_Variable_1) == 0x00002C, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, Temp_struct_Variable_2) == 0x00003C, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, Temp_struct_Variable_3) == 0x00004C, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00005C, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000068, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_GetPlayerPawn_ReturnValue) == 0x000078, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_GetHurtLocationRelative_ReturnValue) == 0x000080, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_GetHurtLocationRelative_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_IsValid_ReturnValue) == 0x00008C, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000090, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_BooleanAND_ReturnValue) == 0x000098, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_IsValid_ReturnValue_1) == 0x000099, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_BooleanAND_ReturnValue_1) == 0x00009A, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x00009C, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_BreakVector_X) == 0x0000A8, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_BreakVector_Y) == 0x0000AC, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_BreakVector_Z) == 0x0000B0, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_BreakVector_X_1) == 0x0000B4, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_BreakVector_Y_1) == 0x0000B8, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_BreakVector_Z_1) == 0x0000BC, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_GetPlayerPawn_ReturnValue_2) == 0x0000C0, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_GetPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0000C8, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_BreakVector_X_2) == 0x0000D4, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_BreakVector_Y_2) == 0x0000D8, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_BreakVector_Z_2) == 0x0000DC, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000E0, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_SelectFloat_ReturnValue) == 0x0000E4, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_GetHurtLocationRelative_ReturnValue_1) == 0x0000E8, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_GetHurtLocationRelative_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000F4, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_MakeVector_ReturnValue) == 0x0000F8, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, K2Node_Select_Default) == 0x000104, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, K2Node_Select_Default_1) == 0x000110, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_Add_VectorVector_ReturnValue) == 0x000120, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, K2Node_Select_Default_2) == 0x00012C, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_BreakableWall_C_GetHurtLocationAndRadius, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000138, "Member 'BP_BreakableWall_C_GetHurtLocationAndRadius::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");

// Function BP_BreakableWall.BP_BreakableWall_C.SetHurtLocationAndRadius
// 0x00A8 (0x00A8 - 0x0000)
struct BP_BreakableWall_C_SetHurtLocationAndRadius final
{
public:
	int32                                         N;                                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
