#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Blacksmith_CS_A007_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_Blacksmith_CS_A007_Anim.BP_Blacksmith_CS_A007_Anim_C
// 0x0350 (0x0A40 - 0x06F0)
class UBP_Blacksmith_CS_A007_Anim_C final : public UNpcAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06F8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0728(0x0080)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x07A8(0x00A8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0850(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0898(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0940(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x09C0(0x0080)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_BP_Blacksmith_CS_A007_Anim(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Blacksmith_CS_A007_Anim_C">();
	}
	static class UBP_Blacksmith_CS_A007_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Blacksmith_CS_A007_Anim_C>();
	}
};
static_assert(alignof(UBP_Blacksmith_CS_A007_Anim_C) == 0x000010, "Wrong alignment on UBP_Blacksmith_CS_A007_Anim_C");
static_assert(sizeof(UBP_Blacksmith_CS_A007_Anim_C) == 0x000A40, "Wrong size on UBP_Blacksmith_CS_A007_Anim_C");
static_assert(offsetof(UBP_Blacksmith_CS_A007_Anim_C, UberGraphFrame) == 0x0006F0, "Member 'UBP_Blacksmith_CS_A007_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Blacksmith_CS_A007_Anim_C, AnimGraphNode_Root) == 0x0006F8, "Member 'UBP_Blacksmith_CS_A007_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_Blacksmith_CS_A007_Anim_C, AnimGraphNode_SequencePlayer_2) == 0x000728, "Member 'UBP_Blacksmith_CS_A007_Anim_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_Blacksmith_CS_A007_Anim_C, AnimGraphNode_BlendListByInt) == 0x0007A8, "Member 'UBP_Blacksmith_CS_A007_Anim_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UBP_Blacksmith_CS_A007_Anim_C, AnimGraphNode_Slot) == 0x000850, "Member 'UBP_Blacksmith_CS_A007_Anim_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UBP_Blacksmith_CS_A007_Anim_C, AnimGraphNode_BlendListByBool) == 0x000898, "Member 'UBP_Blacksmith_CS_A007_Anim_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UBP_Blacksmith_CS_A007_Anim_C, AnimGraphNode_SequencePlayer_1) == 0x000940, "Member 'UBP_Blacksmith_CS_A007_Anim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_Blacksmith_CS_A007_Anim_C, AnimGraphNode_SequencePlayer) == 0x0009C0, "Member 'UBP_Blacksmith_CS_A007_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");

}

