#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BearTrapProjectile

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BearTrapProjectile.BP_BearTrapProjectile_C.ExecuteUbergraph_BP_BearTrapProjectile
// 0x0140 (0x0140 - 0x0000)
struct BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x003C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_C4[0xC];                                       // 0x00C4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSurfaceTypeSystemAtLocation_ReturnValue; // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SpawnSurfaceTypeSystemAtLocation_bSuccess; // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue;               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue_1;             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue_1;          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_VfxEventType;                         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile) == 0x000010, "Wrong alignment on BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile");
static_assert(sizeof(BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile) == 0x000140, "Wrong size on BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile");
static_assert(offsetof(BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile, EntryPoint) == 0x000000, "Member 'BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000004, "Member 'BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile, CallFunc_PostEventAtLocation_ReturnValue) == 0x000010, "Member 'BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile, Temp_delegate_Variable) == 0x000014, "Member 'BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile, CallFunc_RLerp_ReturnValue) == 0x000024, "Member 'BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000030, "Member 'BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x00003C, "Member 'BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile, CallFunc_MakeTransform_ReturnValue) == 0x0000D0, "Member 'BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile, CallFunc_SpawnSurfaceTypeSystemAtLocation_ReturnValue) == 0x000100, "Member 'BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile::CallFunc_SpawnSurfaceTypeSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile, CallFunc_SpawnSurfaceTypeSystemAtLocation_bSuccess) == 0x000108, "Member 'BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile::CallFunc_SpawnSurfaceTypeSystemAtLocation_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile, CallFunc_GetManGameMode_ReturnValue) == 0x000110, "Member 'BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile::CallFunc_GetManGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000118, "Member 'BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile, CallFunc_GetManGameMode_ReturnValue_1) == 0x000120, "Member 'BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile::CallFunc_GetManGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile, CallFunc_SpawnVisualEntity_ReturnValue_1) == 0x000128, "Member 'BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile::CallFunc_SpawnVisualEntity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile, K2Node_Event_VfxEventType) == 0x000130, "Member 'BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile::K2Node_Event_VfxEventType' has a wrong offset!");
static_assert(offsetof(BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile, K2Node_SwitchName_CmpSuccess) == 0x000138, "Member 'BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile, CallFunc_PostAkEvent_ReturnValue) == 0x00013C, "Member 'BP_BearTrapProjectile_C_ExecuteUbergraph_BP_BearTrapProjectile::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

// Function BP_BearTrapProjectile.BP_BearTrapProjectile_C.OnVfxEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_BearTrapProjectile_C_OnVfxEvent final
{
public:
	class FName                                   VfxEventType;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BearTrapProjectile_C_OnVfxEvent) == 0x000004, "Wrong alignment on BP_BearTrapProjectile_C_OnVfxEvent");
static_assert(sizeof(BP_BearTrapProjectile_C_OnVfxEvent) == 0x000008, "Wrong size on BP_BearTrapProjectile_C_OnVfxEvent");
static_assert(offsetof(BP_BearTrapProjectile_C_OnVfxEvent, VfxEventType) == 0x000000, "Member 'BP_BearTrapProjectile_C_OnVfxEvent::VfxEventType' has a wrong offset!");

}

