#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosTentaclesSlowEffect

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ChaosTentaclesSlowEffect.BP_ChaosTentaclesSlowEffect_C.ExecuteUbergraph_BP_ChaosTentaclesSlowEffect
// 0x0050 (0x0050 - 0x0000)
struct BP_ChaosTentaclesSlowEffect_C_ExecuteUbergraph_BP_ChaosTentaclesSlowEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetGameMode_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetInstigatorAbility_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue_1;       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ChaosTentacles_Beam_VisualEntity_C* K2Node_DynamicCast_AsBP_Chaos_Tentacles_Beam_Visual_Entity; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ChaosTentaclesSlowEffect_C_ExecuteUbergraph_BP_ChaosTentaclesSlowEffect) == 0x000008, "Wrong alignment on BP_ChaosTentaclesSlowEffect_C_ExecuteUbergraph_BP_ChaosTentaclesSlowEffect");
static_assert(sizeof(BP_ChaosTentaclesSlowEffect_C_ExecuteUbergraph_BP_ChaosTentaclesSlowEffect) == 0x000050, "Wrong size on BP_ChaosTentaclesSlowEffect_C_ExecuteUbergraph_BP_ChaosTentaclesSlowEffect");
static_assert(offsetof(BP_ChaosTentaclesSlowEffect_C_ExecuteUbergraph_BP_ChaosTentaclesSlowEffect, EntryPoint) == 0x000000, "Member 'BP_ChaosTentaclesSlowEffect_C_ExecuteUbergraph_BP_ChaosTentaclesSlowEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ChaosTentaclesSlowEffect_C_ExecuteUbergraph_BP_ChaosTentaclesSlowEffect, CallFunc_GetAbilityController_ReturnValue) == 0x000008, "Member 'BP_ChaosTentaclesSlowEffect_C_ExecuteUbergraph_BP_ChaosTentaclesSlowEffect::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosTentaclesSlowEffect_C_ExecuteUbergraph_BP_ChaosTentaclesSlowEffect, CallFunc_GetGameMode_ReturnValue) == 0x000010, "Member 'BP_ChaosTentaclesSlowEffect_C_ExecuteUbergraph_BP_ChaosTentaclesSlowEffect::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosTentaclesSlowEffect_C_ExecuteUbergraph_BP_ChaosTentaclesSlowEffect, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_ChaosTentaclesSlowEffect_C_ExecuteUbergraph_BP_ChaosTentaclesSlowEffect::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosTentaclesSlowEffect_C_ExecuteUbergraph_BP_ChaosTentaclesSlowEffect, CallFunc_BPGetInstigatorAbility_ReturnValue) == 0x000020, "Member 'BP_ChaosTentaclesSlowEffect_C_ExecuteUbergraph_BP_ChaosTentaclesSlowEffect::CallFunc_BPGetInstigatorAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosTentaclesSlowEffect_C_ExecuteUbergraph_BP_ChaosTentaclesSlowEffect, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000028, "Member 'BP_ChaosTentaclesSlowEffect_C_ExecuteUbergraph_BP_ChaosTentaclesSlowEffect::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosTentaclesSlowEffect_C_ExecuteUbergraph_BP_ChaosTentaclesSlowEffect, CallFunc_GetAbilityController_ReturnValue_1) == 0x000030, "Member 'BP_ChaosTentaclesSlowEffect_C_ExecuteUbergraph_BP_ChaosTentaclesSlowEffect::CallFunc_GetAbilityController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosTentaclesSlowEffect_C_ExecuteUbergraph_BP_ChaosTentaclesSlowEffect, K2Node_DynamicCast_AsBP_Chaos_Tentacles_Beam_Visual_Entity) == 0x000038, "Member 'BP_ChaosTentaclesSlowEffect_C_ExecuteUbergraph_BP_ChaosTentaclesSlowEffect::K2Node_DynamicCast_AsBP_Chaos_Tentacles_Beam_Visual_Entity' has a wrong offset!");
static_assert(offsetof(BP_ChaosTentaclesSlowEffect_C_ExecuteUbergraph_BP_ChaosTentaclesSlowEffect, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_ChaosTentaclesSlowEffect_C_ExecuteUbergraph_BP_ChaosTentaclesSlowEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ChaosTentaclesSlowEffect_C_ExecuteUbergraph_BP_ChaosTentaclesSlowEffect, CallFunc_GetOwner_ReturnValue_1) == 0x000048, "Member 'BP_ChaosTentaclesSlowEffect_C_ExecuteUbergraph_BP_ChaosTentaclesSlowEffect::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");

}

