#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaoticEnergiesMelee_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ChaoticEnergiesMelee_VisualEntity.BP_ChaoticEnergiesMelee_VisualEntity_C
// 0x0028 (0x03B8 - 0x0390)
class ABP_ChaoticEnergiesMelee_VisualEntity_C final : public AMeshSamplingVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_ChaoticEnergies_SingleFire;                     // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_ChaoticEnergiesFlash_24F74311447E3F0CA27F1FAF4E7026FB; // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_24F74311447E3F0CA27F1FAF4E7026FB; // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A5[0x3];                                      // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrawlerHero_C*                      Brother;                                           // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity(int32 EntryPoint);
	void VisualEntityConstructionFinished();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ChaoticEnergiesMelee_VisualEntity_C">();
	}
	static class ABP_ChaoticEnergiesMelee_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ChaoticEnergiesMelee_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_ChaoticEnergiesMelee_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_ChaoticEnergiesMelee_VisualEntity_C");
static_assert(sizeof(ABP_ChaoticEnergiesMelee_VisualEntity_C) == 0x0003B8, "Wrong size on ABP_ChaoticEnergiesMelee_VisualEntity_C");
static_assert(offsetof(ABP_ChaoticEnergiesMelee_VisualEntity_C, UberGraphFrame) == 0x000390, "Member 'ABP_ChaoticEnergiesMelee_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ChaoticEnergiesMelee_VisualEntity_C, NS_ChaoticEnergies_SingleFire) == 0x000398, "Member 'ABP_ChaoticEnergiesMelee_VisualEntity_C::NS_ChaoticEnergies_SingleFire' has a wrong offset!");
static_assert(offsetof(ABP_ChaoticEnergiesMelee_VisualEntity_C, Timeline_0_ChaoticEnergiesFlash_24F74311447E3F0CA27F1FAF4E7026FB) == 0x0003A0, "Member 'ABP_ChaoticEnergiesMelee_VisualEntity_C::Timeline_0_ChaoticEnergiesFlash_24F74311447E3F0CA27F1FAF4E7026FB' has a wrong offset!");
static_assert(offsetof(ABP_ChaoticEnergiesMelee_VisualEntity_C, Timeline_0__Direction_24F74311447E3F0CA27F1FAF4E7026FB) == 0x0003A4, "Member 'ABP_ChaoticEnergiesMelee_VisualEntity_C::Timeline_0__Direction_24F74311447E3F0CA27F1FAF4E7026FB' has a wrong offset!");
static_assert(offsetof(ABP_ChaoticEnergiesMelee_VisualEntity_C, Timeline_0) == 0x0003A8, "Member 'ABP_ChaoticEnergiesMelee_VisualEntity_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_ChaoticEnergiesMelee_VisualEntity_C, Brother) == 0x0003B0, "Member 'ABP_ChaoticEnergiesMelee_VisualEntity_C::Brother' has a wrong offset!");

}

