#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CopperPlate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_CopperPlate.BP_CopperPlate_C
// 0x0088 (0x0548 - 0x04C0)
class UBP_CopperPlate_C final : public UInfoScreenUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutTextAnim;                                   // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInTextAnim;                                    // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur;                                    // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BgTexture_1;                                       // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BgTexture2;                                        // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BottomScreenFrame;                                 // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyB;                                        // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CaptionText;                                       // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ConversationPanel;                                 // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NoteTexture;                                       // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TopScreenFrame;                                    // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FString>                         CaptionStrings;                                    // 0x0530(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CaptionIndex;                                      // 0x0540(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CopperPlate(int32 EntryPoint);
	void OnSetData(class UInfoScreentDataAsset* InInfoScreenData);
	void BndEvt__BtnHotkeyA2_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnHide(float AnimDuration);
	void OnShow(float AnimDuration);
	void OnGamepadBEvent();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void Init(class UInfoScreentDataAsset* InInfoScreenData);
	void FadeInText();
	void FadeOutText();
	void ResetTextAnim();
	void BtnHotkeyBClicked();
	void SetCaptionText(int32 InCaptionIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CopperPlate_C">();
	}
	static class UBP_CopperPlate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CopperPlate_C>();
	}
};
static_assert(alignof(UBP_CopperPlate_C) == 0x000008, "Wrong alignment on UBP_CopperPlate_C");
static_assert(sizeof(UBP_CopperPlate_C) == 0x000548, "Wrong size on UBP_CopperPlate_C");
static_assert(offsetof(UBP_CopperPlate_C, UberGraphFrame) == 0x0004C0, "Member 'UBP_CopperPlate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_CopperPlate_C, FadeOutTextAnim) == 0x0004C8, "Member 'UBP_CopperPlate_C::FadeOutTextAnim' has a wrong offset!");
static_assert(offsetof(UBP_CopperPlate_C, FadeInTextAnim) == 0x0004D0, "Member 'UBP_CopperPlate_C::FadeInTextAnim' has a wrong offset!");
static_assert(offsetof(UBP_CopperPlate_C, FadeOutAnim) == 0x0004D8, "Member 'UBP_CopperPlate_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_CopperPlate_C, FadeInAnim) == 0x0004E0, "Member 'UBP_CopperPlate_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_CopperPlate_C, BackgroundBlur) == 0x0004E8, "Member 'UBP_CopperPlate_C::BackgroundBlur' has a wrong offset!");
static_assert(offsetof(UBP_CopperPlate_C, BgTexture_1) == 0x0004F0, "Member 'UBP_CopperPlate_C::BgTexture_1' has a wrong offset!");
static_assert(offsetof(UBP_CopperPlate_C, BgTexture2) == 0x0004F8, "Member 'UBP_CopperPlate_C::BgTexture2' has a wrong offset!");
static_assert(offsetof(UBP_CopperPlate_C, BottomScreenFrame) == 0x000500, "Member 'UBP_CopperPlate_C::BottomScreenFrame' has a wrong offset!");
static_assert(offsetof(UBP_CopperPlate_C, BtnHotkeyB) == 0x000508, "Member 'UBP_CopperPlate_C::BtnHotkeyB' has a wrong offset!");
static_assert(offsetof(UBP_CopperPlate_C, CaptionText) == 0x000510, "Member 'UBP_CopperPlate_C::CaptionText' has a wrong offset!");
static_assert(offsetof(UBP_CopperPlate_C, ConversationPanel) == 0x000518, "Member 'UBP_CopperPlate_C::ConversationPanel' has a wrong offset!");
static_assert(offsetof(UBP_CopperPlate_C, NoteTexture) == 0x000520, "Member 'UBP_CopperPlate_C::NoteTexture' has a wrong offset!");
static_assert(offsetof(UBP_CopperPlate_C, TopScreenFrame) == 0x000528, "Member 'UBP_CopperPlate_C::TopScreenFrame' has a wrong offset!");
static_assert(offsetof(UBP_CopperPlate_C, CaptionStrings) == 0x000530, "Member 'UBP_CopperPlate_C::CaptionStrings' has a wrong offset!");
static_assert(offsetof(UBP_CopperPlate_C, CaptionIndex) == 0x000540, "Member 'UBP_CopperPlate_C::CaptionIndex' has a wrong offset!");

}

