#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaoticEnergiesReady_VisualEntity

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ChaoticEnergiesReady_VisualEntity.BP_ChaoticEnergiesReady_VisualEntity_C.ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity
// 0x00A8 (0x00A8 - 0x0000)
struct BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_GetSlotMeshComponents_ReturnValue;        // 0x0020(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetChaoticEnergiesDefaults_CE_Color;      // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetChaoticEnergiesDefaults_CE_NormalCheck; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         CallFunc_GetSlotMeshComponents_ReturnValue_1;      // 0x0080(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_1;                         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity) == 0x000008, "Wrong alignment on BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity");
static_assert(sizeof(BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity) == 0x0000A8, "Wrong size on BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity");
static_assert(offsetof(BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity, Temp_delegate_Variable) == 0x000004, "Member 'BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity, CallFunc_PostAkEvent_ReturnValue) == 0x000014, "Member 'BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity, CallFunc_GetSlotMeshComponents_ReturnValue) == 0x000020, "Member 'BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity::CallFunc_GetSlotMeshComponents_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity, Temp_int_Array_Index_Variable) == 0x000034, "Member 'BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity, Temp_int_Array_Index_Variable_1) == 0x000038, "Member 'BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity, Temp_int_Loop_Counter_Variable_1) == 0x000050, "Member 'BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity, CallFunc_Add_IntInt_ReturnValue_1) == 0x000058, "Member 'BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity, CallFunc_GetChaoticEnergiesDefaults_CE_Color) == 0x00005C, "Member 'BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity::CallFunc_GetChaoticEnergiesDefaults_CE_Color' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity, CallFunc_GetChaoticEnergiesDefaults_CE_NormalCheck) == 0x00006C, "Member 'BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity::CallFunc_GetChaoticEnergiesDefaults_CE_NormalCheck' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000074, "Member 'BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity, CallFunc_GetSlotMeshComponents_ReturnValue_1) == 0x000080, "Member 'BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity::CallFunc_GetSlotMeshComponents_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity, CallFunc_Array_Length_ReturnValue_1) == 0x000090, "Member 'BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity, CallFunc_Array_Get_Item_1) == 0x000098, "Member 'BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A0, "Member 'BP_ChaoticEnergiesReady_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesReady_VisualEntity::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

}

