#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CorruptedWisp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CorruptedWisp.BP_CorruptedWisp_C
// 0x0040 (0x1B00 - 0x1AC0)
class ABP_CorruptedWisp_C final : public AEnemyCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1AC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_EntropyEnemy_Die;                               // 0x1AC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_VoidRatEntropic_SummonCorruptedWisp;            // 0x1AD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_HPBarWidgetComponent_C*             BP_HPBarWidgetComponent;                           // 0x1AD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule;                                       // 0x1AE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TR_CurrentAction;                                  // 0x1AE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      WispNiagaraVFX;                                    // 0x1AF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CorruptedWisp(int32 EntryPoint);
	void BPDamageTakenEvent_Event_0(class AActorSoul* Source, class AActorSoul* Target, class UAbilityBase* Ability, class UAnimID* Anim, float effectiveDamage, const struct FDamageValue& OriginalDamageValue, const struct FDamageValue& DamageValue);
	void OnKilled(class UObject* Killer, class UAbilityController* KillerAbilityController);
	void BPPostBeginPlay();
	void OnVfxEvent(class FName VfxEventType);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CorruptedWisp_C">();
	}
	static class ABP_CorruptedWisp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CorruptedWisp_C>();
	}
};
static_assert(alignof(ABP_CorruptedWisp_C) == 0x000010, "Wrong alignment on ABP_CorruptedWisp_C");
static_assert(sizeof(ABP_CorruptedWisp_C) == 0x001B00, "Wrong size on ABP_CorruptedWisp_C");
static_assert(offsetof(ABP_CorruptedWisp_C, UberGraphFrame) == 0x001AC0, "Member 'ABP_CorruptedWisp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CorruptedWisp_C, NS_EntropyEnemy_Die) == 0x001AC8, "Member 'ABP_CorruptedWisp_C::NS_EntropyEnemy_Die' has a wrong offset!");
static_assert(offsetof(ABP_CorruptedWisp_C, NS_VoidRatEntropic_SummonCorruptedWisp) == 0x001AD0, "Member 'ABP_CorruptedWisp_C::NS_VoidRatEntropic_SummonCorruptedWisp' has a wrong offset!");
static_assert(offsetof(ABP_CorruptedWisp_C, BP_HPBarWidgetComponent) == 0x001AD8, "Member 'ABP_CorruptedWisp_C::BP_HPBarWidgetComponent' has a wrong offset!");
static_assert(offsetof(ABP_CorruptedWisp_C, HurtCapsule) == 0x001AE0, "Member 'ABP_CorruptedWisp_C::HurtCapsule' has a wrong offset!");
static_assert(offsetof(ABP_CorruptedWisp_C, TR_CurrentAction) == 0x001AE8, "Member 'ABP_CorruptedWisp_C::TR_CurrentAction' has a wrong offset!");
static_assert(offsetof(ABP_CorruptedWisp_C, WispNiagaraVFX) == 0x001AF0, "Member 'ABP_CorruptedWisp_C::WispNiagaraVFX' has a wrong offset!");

}

