#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CasterImpDie

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CasterImpDie.BP_CasterImpDie_C.ExecuteUbergraph_BP_CasterImpDie
// 0x0410 (0x0410 - 0x0000)
struct BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UActorComponent*>                CallFunc_GetComponentsByTag_ReturnValue;           // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         K2Node_Event_DeltaTime;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         K2Node_DynamicCast_AsMesh_Component;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddWorldOffset_SweepHitResult;         // 0x0084(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UActorComponent*>                CallFunc_GetComponentsByTag_ReturnValue_1;         // 0x0168(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_Array_Get_Item_1;                         // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDestructibleComponent*                 K2Node_DynamicCast_AsDestructible_Component;       // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BE[0x2];                                      // 0x01BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_5;             // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_6;             // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_3;          // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_7;             // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_4;                          // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_4;                          // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_4;                          // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeToRange_ReturnValue;             // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x026C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x027C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_8;             // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0314(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_4;        // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0334(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddLocalOffset_SweepHitResult;         // 0x0340(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_2;              // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x03D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_5;                          // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_5;                          // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_5;                          // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_5;        // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeToRange_ReturnValue_1;           // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_2;                     // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_9;             // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x03FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x0408(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie) == 0x000008, "Wrong alignment on BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie");
static_assert(sizeof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie) == 0x000410, "Wrong size on BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, EntryPoint) == 0x000000, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000004, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_BreakVector_X) == 0x000010, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_BreakVector_Y) == 0x000014, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_BreakVector_Z) == 0x000018, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_GetComponentsByTag_ReturnValue) == 0x000028, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, K2Node_Event_DeltaTime) == 0x000038, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Add_FloatFloat_ReturnValue) == 0x000040, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_RandomFloatInRange_ReturnValue) == 0x000044, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, Temp_int_Array_Index_Variable_1) == 0x000048, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, K2Node_DynamicCast_AsMesh_Component) == 0x000058, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::K2Node_DynamicCast_AsMesh_Component' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000064, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000070, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, Temp_bool_IsClosed_Variable) == 0x000074, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000078, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00007C, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, Temp_bool_Has_Been_Initd_Variable) == 0x000080, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_K2_AddWorldOffset_SweepHitResult) == 0x000084, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_K2_AddWorldOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x00010C, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_MakeVector_ReturnValue) == 0x000118, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_BreakVector_X_1) == 0x000124, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_BreakVector_Y_1) == 0x000128, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_BreakVector_Z_1) == 0x00012C, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000130, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000134, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000138, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x000144, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_GetPlayerPawn_ReturnValue) == 0x000148, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_GetOwner_ReturnValue_1) == 0x000150, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000158, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_GetComponentsByTag_ReturnValue_1) == 0x000168, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_GetComponentsByTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_BreakVector_X_2) == 0x000178, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_BreakVector_Y_2) == 0x00017C, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_BreakVector_Z_2) == 0x000180, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Array_Get_Item_1) == 0x000188, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000190, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, K2Node_DynamicCast_AsDestructible_Component) == 0x000198, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::K2Node_DynamicCast_AsDestructible_Component' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, K2Node_DynamicCast_bSuccess_1) == 0x0001A0, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Array_Length_ReturnValue_1) == 0x0001A4, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Less_IntInt_ReturnValue) == 0x0001A8, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x0001AC, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, Temp_int_Loop_Counter_Variable_1) == 0x0001B8, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, Temp_bool_Has_Been_Initd_Variable_1) == 0x0001BC, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001BD, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001C0, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, Temp_int_Variable) == 0x0001C4, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x0001C8, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Multiply_IntFloat_ReturnValue_2) == 0x0001CC, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Multiply_IntFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x0001D0, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x0001D4, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Add_FloatFloat_ReturnValue_4) == 0x0001D8, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Add_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Add_FloatFloat_ReturnValue_5) == 0x0001DC, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Add_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Add_FloatFloat_ReturnValue_6) == 0x0001E0, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Add_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Multiply_IntFloat_ReturnValue_3) == 0x0001E4, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Multiply_IntFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001E8, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Add_FloatFloat_ReturnValue_7) == 0x0001EC, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Add_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_MakeRotator_ReturnValue) == 0x0001F0, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001FC, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000200, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_K2_GetComponentLocation_ReturnValue_3) == 0x000208, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_K2_GetComponentLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000214, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_BreakVector_X_3) == 0x000220, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_BreakVector_Y_3) == 0x000224, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_BreakVector_Z_3) == 0x000228, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_BreakVector_X_4) == 0x00022C, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_BreakVector_Y_4) == 0x000230, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_BreakVector_Y_4' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_BreakVector_Z_4) == 0x000234, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_BreakVector_Z_4' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, Temp_bool_IsClosed_Variable_1) == 0x000238, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x00023C, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_NormalizeToRange_ReturnValue) == 0x000240, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_NormalizeToRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_FClamp_ReturnValue) == 0x000244, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000248, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_MakeVector_ReturnValue_1) == 0x00024C, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000258, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Add_VectorVector_ReturnValue) == 0x00025C, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000268, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_MakeRotator_ReturnValue_1) == 0x00026C, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000278, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x00027C, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000304, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000308, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_FClamp_ReturnValue_1) == 0x00030C, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Add_FloatFloat_ReturnValue_8) == 0x000310, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Add_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_MakeVector_ReturnValue_2) == 0x000314, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x000320, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000324, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x000328, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Subtract_FloatFloat_ReturnValue_3) == 0x00032C, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Subtract_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Subtract_FloatFloat_ReturnValue_4) == 0x000330, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Subtract_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_MakeVector_ReturnValue_3) == 0x000334, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_K2_AddLocalOffset_SweepHitResult) == 0x000340, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_K2_AddLocalOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_GetPlayerPawn_ReturnValue_2) == 0x0003C8, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_GetPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0003D0, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_BreakVector_X_5) == 0x0003DC, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_BreakVector_X_5' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_BreakVector_Y_5) == 0x0003E0, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_BreakVector_Y_5' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_BreakVector_Z_5) == 0x0003E4, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_BreakVector_Z_5' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Subtract_FloatFloat_ReturnValue_5) == 0x0003E8, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Subtract_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_NormalizeToRange_ReturnValue_1) == 0x0003EC, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_NormalizeToRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_FClamp_ReturnValue_2) == 0x0003F0, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Multiply_FloatFloat_ReturnValue_7) == 0x0003F4, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Multiply_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_Add_FloatFloat_ReturnValue_9) == 0x0003F8, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_Add_FloatFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_MakeVector_ReturnValue_4) == 0x0003FC, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_MakeVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x000408, "Member 'BP_CasterImpDie_C_ExecuteUbergraph_BP_CasterImpDie::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");

// Function BP_CasterImpDie.BP_CasterImpDie_C.BPTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CasterImpDie_C_BPTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CasterImpDie_C_BPTick) == 0x000004, "Wrong alignment on BP_CasterImpDie_C_BPTick");
static_assert(sizeof(BP_CasterImpDie_C_BPTick) == 0x000004, "Wrong size on BP_CasterImpDie_C_BPTick");
static_assert(offsetof(BP_CasterImpDie_C_BPTick, DeltaTime) == 0x000000, "Member 'BP_CasterImpDie_C_BPTick::DeltaTime' has a wrong offset!");

}

