#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CinematicGhost

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CinematicGhost.BP_CinematicGhost_C.ExecuteUbergraph_BP_CinematicGhost
// 0x0048 (0x0048 - 0x0000)
struct BP_CinematicGhost_C_ExecuteUbergraph_BP_CinematicGhost final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrawlerHero_C*                      K2Node_DynamicCast_AsBP_Brawler_Hero;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActorBase*                             K2Node_DynamicCast_AsActor_Base;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicGhost_C_ExecuteUbergraph_BP_CinematicGhost) == 0x000008, "Wrong alignment on BP_CinematicGhost_C_ExecuteUbergraph_BP_CinematicGhost");
static_assert(sizeof(BP_CinematicGhost_C_ExecuteUbergraph_BP_CinematicGhost) == 0x000048, "Wrong size on BP_CinematicGhost_C_ExecuteUbergraph_BP_CinematicGhost");
static_assert(offsetof(BP_CinematicGhost_C_ExecuteUbergraph_BP_CinematicGhost, EntryPoint) == 0x000000, "Member 'BP_CinematicGhost_C_ExecuteUbergraph_BP_CinematicGhost::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ExecuteUbergraph_BP_CinematicGhost, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_CinematicGhost_C_ExecuteUbergraph_BP_CinematicGhost::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ExecuteUbergraph_BP_CinematicGhost, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'BP_CinematicGhost_C_ExecuteUbergraph_BP_CinematicGhost::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ExecuteUbergraph_BP_CinematicGhost, K2Node_DynamicCast_AsBP_Brawler_Hero) == 0x000018, "Member 'BP_CinematicGhost_C_ExecuteUbergraph_BP_CinematicGhost::K2Node_DynamicCast_AsBP_Brawler_Hero' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ExecuteUbergraph_BP_CinematicGhost, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_CinematicGhost_C_ExecuteUbergraph_BP_CinematicGhost::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ExecuteUbergraph_BP_CinematicGhost, CallFunc_GetOwner_ReturnValue_1) == 0x000028, "Member 'BP_CinematicGhost_C_ExecuteUbergraph_BP_CinematicGhost::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ExecuteUbergraph_BP_CinematicGhost, K2Node_DynamicCast_AsActor_Base) == 0x000030, "Member 'BP_CinematicGhost_C_ExecuteUbergraph_BP_CinematicGhost::K2Node_DynamicCast_AsActor_Base' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ExecuteUbergraph_BP_CinematicGhost, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_CinematicGhost_C_ExecuteUbergraph_BP_CinematicGhost::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ExecuteUbergraph_BP_CinematicGhost, CallFunc_GetComponentByClass_ReturnValue) == 0x000040, "Member 'BP_CinematicGhost_C_ExecuteUbergraph_BP_CinematicGhost::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function BP_CinematicGhost.BP_CinematicGhost_C.OverrideMaterials
// 0x0001 (0x0001 - 0x0000)
struct BP_CinematicGhost_C_OverrideMaterials final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CinematicGhost_C_OverrideMaterials) == 0x000001, "Wrong alignment on BP_CinematicGhost_C_OverrideMaterials");
static_assert(sizeof(BP_CinematicGhost_C_OverrideMaterials) == 0x000001, "Wrong size on BP_CinematicGhost_C_OverrideMaterials");
static_assert(offsetof(BP_CinematicGhost_C_OverrideMaterials, On) == 0x000000, "Member 'BP_CinematicGhost_C_OverrideMaterials::On' has a wrong offset!");

// Function BP_CinematicGhost.BP_CinematicGhost_C.ToggleMaterials
// 0x0160 (0x0160 - 0x0000)
struct BP_CinematicGhost_C_ToggleMaterials final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CurrentSlotMesh;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0068(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue_1;               // 0x0090(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ModelActor_C*                       K2Node_DynamicCast_AsBP_Model_Actor;               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ModelActor_C*                       K2Node_DynamicCast_AsBP_Model_Actor_1;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue_2;               // 0x00D0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceConstant*              CallFunc_Array_Get_Item_2;                         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue_3;               // 0x00F8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_3;                         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         CallFunc_GetSlotMeshComponents_ReturnValue;        // 0x0120(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_4;                         // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_GetSlotMeshComponents_ReturnValue_1;      // 0x0140(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_5;                         // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CinematicGhost_C_ToggleMaterials) == 0x000008, "Wrong alignment on BP_CinematicGhost_C_ToggleMaterials");
static_assert(sizeof(BP_CinematicGhost_C_ToggleMaterials) == 0x000160, "Wrong size on BP_CinematicGhost_C_ToggleMaterials");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, On) == 0x000000, "Member 'BP_CinematicGhost_C_ToggleMaterials::On' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CurrentSlotMesh) == 0x000008, "Member 'BP_CinematicGhost_C_ToggleMaterials::CurrentSlotMesh' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_CinematicGhost_C_ToggleMaterials::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_CinematicGhost_C_ToggleMaterials::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, Temp_int_Array_Index_Variable_1) == 0x000020, "Member 'BP_CinematicGhost_C_ToggleMaterials::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, Temp_int_Loop_Counter_Variable_1) == 0x000024, "Member 'BP_CinematicGhost_C_ToggleMaterials::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, Temp_int_Loop_Counter_Variable_2) == 0x00002C, "Member 'BP_CinematicGhost_C_ToggleMaterials::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, Temp_int_Loop_Counter_Variable_3) == 0x000030, "Member 'BP_CinematicGhost_C_ToggleMaterials::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_Add_IntInt_ReturnValue_2) == 0x000034, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_Add_IntInt_ReturnValue_3) == 0x000038, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, Temp_int_Array_Index_Variable_2) == 0x00003C, "Member 'BP_CinematicGhost_C_ToggleMaterials::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, Temp_int_Loop_Counter_Variable_4) == 0x000040, "Member 'BP_CinematicGhost_C_ToggleMaterials::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_Add_IntInt_ReturnValue_4) == 0x000044, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, Temp_int_Array_Index_Variable_3) == 0x000048, "Member 'BP_CinematicGhost_C_ToggleMaterials::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_IsValid_ReturnValue_1) == 0x00004C, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, Temp_int_Loop_Counter_Variable_5) == 0x000050, "Member 'BP_CinematicGhost_C_ToggleMaterials::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_Add_IntInt_ReturnValue_5) == 0x000054, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, Temp_int_Array_Index_Variable_4) == 0x000058, "Member 'BP_CinematicGhost_C_ToggleMaterials::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, Temp_int_Array_Index_Variable_5) == 0x00005C, "Member 'BP_CinematicGhost_C_ToggleMaterials::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_GetMaterials_ReturnValue) == 0x000068, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_IsValid_ReturnValue_2) == 0x00007C, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_Less_IntInt_ReturnValue) == 0x00007D, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_Array_Get_Item_1) == 0x000080, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000088, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_GetMaterials_ReturnValue_1) == 0x000090, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_GetMaterials_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_Array_Length_ReturnValue_1) == 0x0000A0, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A4, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_GetAbilityController_ReturnValue) == 0x0000A8, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, K2Node_DynamicCast_AsBP_Model_Actor) == 0x0000B0, "Member 'BP_CinematicGhost_C_ToggleMaterials::K2Node_DynamicCast_AsBP_Model_Actor' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'BP_CinematicGhost_C_ToggleMaterials::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, K2Node_DynamicCast_AsBP_Model_Actor_1) == 0x0000C0, "Member 'BP_CinematicGhost_C_ToggleMaterials::K2Node_DynamicCast_AsBP_Model_Actor_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'BP_CinematicGhost_C_ToggleMaterials::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_GetMaterials_ReturnValue_2) == 0x0000D0, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_GetMaterials_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_Array_Length_ReturnValue_2) == 0x0000E0, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000E4, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_Array_Get_Item_2) == 0x0000E8, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_NotEqual_ObjectObject_ReturnValue_1) == 0x0000F0, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_NotEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_GetMaterials_ReturnValue_3) == 0x0000F8, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_GetMaterials_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_Array_Length_ReturnValue_3) == 0x000108, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_Less_IntInt_ReturnValue_3) == 0x00010C, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_Add_IntInt_ReturnValue_6) == 0x000110, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, Temp_int_Variable) == 0x000114, "Member 'BP_CinematicGhost_C_ToggleMaterials::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_Array_Get_Item_3) == 0x000118, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_GetSlotMeshComponents_ReturnValue) == 0x000120, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_GetSlotMeshComponents_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_Array_Get_Item_4) == 0x000130, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_Array_Length_ReturnValue_4) == 0x000138, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_Less_IntInt_ReturnValue_4) == 0x00013C, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_GetSlotMeshComponents_ReturnValue_1) == 0x000140, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_GetSlotMeshComponents_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_Array_Get_Item_5) == 0x000150, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_Array_Length_ReturnValue_5) == 0x000158, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_ToggleMaterials, CallFunc_Less_IntInt_ReturnValue_5) == 0x00015C, "Member 'BP_CinematicGhost_C_ToggleMaterials::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");

// Function BP_CinematicGhost.BP_CinematicGhost_C.StoreDynamicMaterials
// 0x0150 (0x0150 - 0x0000)
struct BP_CinematicGhost_C_StoreDynamicMaterials final
{
public:
	class UMeshComponent*                         MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       StoreInto;                                         // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0018(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0040)(HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic;    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B8(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0110(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicGhost_C_StoreDynamicMaterials) == 0x000008, "Wrong alignment on BP_CinematicGhost_C_StoreDynamicMaterials");
static_assert(sizeof(BP_CinematicGhost_C_StoreDynamicMaterials) == 0x000150, "Wrong size on BP_CinematicGhost_C_StoreDynamicMaterials");
static_assert(offsetof(BP_CinematicGhost_C_StoreDynamicMaterials, MeshComp) == 0x000000, "Member 'BP_CinematicGhost_C_StoreDynamicMaterials::MeshComp' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreDynamicMaterials, StoreInto) == 0x000008, "Member 'BP_CinematicGhost_C_StoreDynamicMaterials::StoreInto' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreDynamicMaterials, CallFunc_GetMaterials_ReturnValue) == 0x000018, "Member 'BP_CinematicGhost_C_StoreDynamicMaterials::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreDynamicMaterials, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_CinematicGhost_C_StoreDynamicMaterials::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreDynamicMaterials, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'BP_CinematicGhost_C_StoreDynamicMaterials::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreDynamicMaterials, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_CinematicGhost_C_StoreDynamicMaterials::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreDynamicMaterials, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'BP_CinematicGhost_C_StoreDynamicMaterials::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreDynamicMaterials, K2Node_DynamicCast_AsMaterial_Instance_Dynamic) == 0x000078, "Member 'BP_CinematicGhost_C_StoreDynamicMaterials::K2Node_DynamicCast_AsMaterial_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreDynamicMaterials, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'BP_CinematicGhost_C_StoreDynamicMaterials::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreDynamicMaterials, Temp_int_Loop_Counter_Variable) == 0x000084, "Member 'BP_CinematicGhost_C_StoreDynamicMaterials::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreDynamicMaterials, CallFunc_GetDisplayName_ReturnValue) == 0x000088, "Member 'BP_CinematicGhost_C_StoreDynamicMaterials::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreDynamicMaterials, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'BP_CinematicGhost_C_StoreDynamicMaterials::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreDynamicMaterials, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A0, "Member 'BP_CinematicGhost_C_StoreDynamicMaterials::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreDynamicMaterials, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B8, "Member 'BP_CinematicGhost_C_StoreDynamicMaterials::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreDynamicMaterials, CallFunc_Add_IntInt_ReturnValue) == 0x0000F8, "Member 'BP_CinematicGhost_C_StoreDynamicMaterials::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreDynamicMaterials, K2Node_MakeArray_Array) == 0x000100, "Member 'BP_CinematicGhost_C_StoreDynamicMaterials::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreDynamicMaterials, CallFunc_Format_ReturnValue) == 0x000110, "Member 'BP_CinematicGhost_C_StoreDynamicMaterials::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreDynamicMaterials, CallFunc_Conv_TextToString_ReturnValue) == 0x000128, "Member 'BP_CinematicGhost_C_StoreDynamicMaterials::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreDynamicMaterials, CallFunc_Concat_StrStr_ReturnValue) == 0x000138, "Member 'BP_CinematicGhost_C_StoreDynamicMaterials::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreDynamicMaterials, CallFunc_Array_Add_ReturnValue) == 0x000148, "Member 'BP_CinematicGhost_C_StoreDynamicMaterials::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_CinematicGhost.BP_CinematicGhost_C.StoreConstantMaterials
// 0x0148 (0x0148 - 0x0000)
struct BP_CinematicGhost_C_StoreConstantMaterials final
{
public:
	class UMeshComponent*                         MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceConstant*>      StoreInto;                                         // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0018(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceConstant*              K2Node_DynamicCast_AsMaterial_Instance_Constant;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0078(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0110(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicGhost_C_StoreConstantMaterials) == 0x000008, "Wrong alignment on BP_CinematicGhost_C_StoreConstantMaterials");
static_assert(sizeof(BP_CinematicGhost_C_StoreConstantMaterials) == 0x000148, "Wrong size on BP_CinematicGhost_C_StoreConstantMaterials");
static_assert(offsetof(BP_CinematicGhost_C_StoreConstantMaterials, MeshComp) == 0x000000, "Member 'BP_CinematicGhost_C_StoreConstantMaterials::MeshComp' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreConstantMaterials, StoreInto) == 0x000008, "Member 'BP_CinematicGhost_C_StoreConstantMaterials::StoreInto' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreConstantMaterials, CallFunc_GetMaterials_ReturnValue) == 0x000018, "Member 'BP_CinematicGhost_C_StoreConstantMaterials::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreConstantMaterials, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_CinematicGhost_C_StoreConstantMaterials::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreConstantMaterials, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'BP_CinematicGhost_C_StoreConstantMaterials::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreConstantMaterials, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_CinematicGhost_C_StoreConstantMaterials::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreConstantMaterials, K2Node_DynamicCast_AsMaterial_Instance_Constant) == 0x000038, "Member 'BP_CinematicGhost_C_StoreConstantMaterials::K2Node_DynamicCast_AsMaterial_Instance_Constant' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreConstantMaterials, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_CinematicGhost_C_StoreConstantMaterials::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreConstantMaterials, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'BP_CinematicGhost_C_StoreConstantMaterials::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreConstantMaterials, CallFunc_GetDisplayName_ReturnValue) == 0x000048, "Member 'BP_CinematicGhost_C_StoreConstantMaterials::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreConstantMaterials, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'BP_CinematicGhost_C_StoreConstantMaterials::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreConstantMaterials, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'BP_CinematicGhost_C_StoreConstantMaterials::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreConstantMaterials, K2Node_MakeStruct_FormatArgumentData) == 0x000078, "Member 'BP_CinematicGhost_C_StoreConstantMaterials::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreConstantMaterials, CallFunc_Add_IntInt_ReturnValue) == 0x0000B8, "Member 'BP_CinematicGhost_C_StoreConstantMaterials::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreConstantMaterials, CallFunc_Array_Add_ReturnValue) == 0x0000BC, "Member 'BP_CinematicGhost_C_StoreConstantMaterials::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreConstantMaterials, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C0, "Member 'BP_CinematicGhost_C_StoreConstantMaterials::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreConstantMaterials, K2Node_MakeArray_Array) == 0x000100, "Member 'BP_CinematicGhost_C_StoreConstantMaterials::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreConstantMaterials, CallFunc_Format_ReturnValue) == 0x000110, "Member 'BP_CinematicGhost_C_StoreConstantMaterials::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreConstantMaterials, CallFunc_Conv_TextToString_ReturnValue) == 0x000128, "Member 'BP_CinematicGhost_C_StoreConstantMaterials::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_StoreConstantMaterials, CallFunc_Concat_StrStr_ReturnValue) == 0x000138, "Member 'BP_CinematicGhost_C_StoreConstantMaterials::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function BP_CinematicGhost.BP_CinematicGhost_C.PrintDebug
// 0x0018 (0x0018 - 0x0000)
struct BP_CinematicGhost_C_PrintDebug final
{
public:
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CinematicGhost_C_PrintDebug) == 0x000008, "Wrong alignment on BP_CinematicGhost_C_PrintDebug");
static_assert(sizeof(BP_CinematicGhost_C_PrintDebug) == 0x000018, "Wrong size on BP_CinematicGhost_C_PrintDebug");
static_assert(offsetof(BP_CinematicGhost_C_PrintDebug, CallFunc_Concat_StrStr_ReturnValue) == 0x000000, "Member 'BP_CinematicGhost_C_PrintDebug::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicGhost_C_PrintDebug, CallFunc_IsEmpty_ReturnValue) == 0x000010, "Member 'BP_CinematicGhost_C_PrintDebug::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");

}

