#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CasterImp_FireballImpact_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CasterImp_FireballImpact_VisualEntity.BP_CasterImp_FireballImpact_VisualEntity_C
// 0x0040 (0x0390 - 0x0350)
class ABP_CasterImp_FireballImpact_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               FireballImpact;                                    // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         GlowRadius;                                        // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SparkRadius;                                       // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistortionRadius;                                  // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FlameRadius;                                       // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FlamesSize;                                        // 0x0370(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DamageSize;                                        // 0x037C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExplosionSize;                                     // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CasterImp_FireballImpact_VisualEntity(int32 EntryPoint);
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CasterImp_FireballImpact_VisualEntity_C">();
	}
	static class ABP_CasterImp_FireballImpact_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CasterImp_FireballImpact_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_CasterImp_FireballImpact_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_CasterImp_FireballImpact_VisualEntity_C");
static_assert(sizeof(ABP_CasterImp_FireballImpact_VisualEntity_C) == 0x000390, "Wrong size on ABP_CasterImp_FireballImpact_VisualEntity_C");
static_assert(offsetof(ABP_CasterImp_FireballImpact_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_CasterImp_FireballImpact_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_FireballImpact_VisualEntity_C, FireballImpact) == 0x000358, "Member 'ABP_CasterImp_FireballImpact_VisualEntity_C::FireballImpact' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_FireballImpact_VisualEntity_C, GlowRadius) == 0x000360, "Member 'ABP_CasterImp_FireballImpact_VisualEntity_C::GlowRadius' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_FireballImpact_VisualEntity_C, SparkRadius) == 0x000364, "Member 'ABP_CasterImp_FireballImpact_VisualEntity_C::SparkRadius' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_FireballImpact_VisualEntity_C, DistortionRadius) == 0x000368, "Member 'ABP_CasterImp_FireballImpact_VisualEntity_C::DistortionRadius' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_FireballImpact_VisualEntity_C, FlameRadius) == 0x00036C, "Member 'ABP_CasterImp_FireballImpact_VisualEntity_C::FlameRadius' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_FireballImpact_VisualEntity_C, FlamesSize) == 0x000370, "Member 'ABP_CasterImp_FireballImpact_VisualEntity_C::FlamesSize' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_FireballImpact_VisualEntity_C, DamageSize) == 0x00037C, "Member 'ABP_CasterImp_FireballImpact_VisualEntity_C::DamageSize' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_FireballImpact_VisualEntity_C, ExplosionSize) == 0x000388, "Member 'ABP_CasterImp_FireballImpact_VisualEntity_C::ExplosionSize' has a wrong offset!");

}

