#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosVortexReward_VisualEntity

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ChaosVortexReward_VisualEntity.BP_ChaosVortexReward_VisualEntity_C.ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity
// 0x0028 (0x0028 - 0x0000)
struct BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AManLootActor*                          K2Node_DynamicCast_AsMan_Loot_Actor;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_2;      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_3;      // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_4;      // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_5;      // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity) == 0x000008, "Wrong alignment on BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity");
static_assert(sizeof(BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity) == 0x000028, "Wrong size on BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity");
static_assert(offsetof(BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity, K2Node_DynamicCast_AsMan_Loot_Actor) == 0x000010, "Member 'BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity::K2Node_DynamicCast_AsMan_Loot_Actor' has a wrong offset!");
static_assert(offsetof(BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x00001A, "Member 'BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x00001B, "Member 'BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity, CallFunc_EqualEqual_ClassClass_ReturnValue_2) == 0x00001C, "Member 'BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity::CallFunc_EqualEqual_ClassClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity, CallFunc_EqualEqual_ClassClass_ReturnValue_3) == 0x00001D, "Member 'BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity::CallFunc_EqualEqual_ClassClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity, CallFunc_EqualEqual_ClassClass_ReturnValue_4) == 0x00001E, "Member 'BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity::CallFunc_EqualEqual_ClassClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity, CallFunc_EqualEqual_ClassClass_ReturnValue_5) == 0x00001F, "Member 'BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity::CallFunc_EqualEqual_ClassClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000020, "Member 'BP_ChaosVortexReward_VisualEntity_C_ExecuteUbergraph_BP_ChaosVortexReward_VisualEntity::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

}

