#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CreateCharacter_TextSelector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_CreateCharacter_TextSelector.BP_CreateCharacter_TextSelector_C
// 0x00E8 (0x0368 - 0x0280)
class UBP_CreateCharacter_TextSelector_C final : public UCreateCharacterSelUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NextSlotAnim;                                      // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PreviousSlotAnim;                                  // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FocusedAnim;                                       // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Bg;                                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                BtnLeft;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnLeftHighlight;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                BtnRight;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnRightHighlight;                                 // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonFrame;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_over;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_sel;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_up;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            LeftHotkey;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             OptionText;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            RightHotkey;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBoxLeftHotkey;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBoxRightHotkey;                               // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleText;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   CategoryTitle;                                     // 0x0320(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         SelectedIndex;                                     // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(int32 SelectedIndex, bool bChangeByUser)> SelectionChanged;                                  // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class FText>                           OptionsArray;                                      // 0x0350(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          Enabled;                                           // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSmallScreen;                                     // 0x0361(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ToggleSmallScreen(bool InIsSmallScreen);
	void ToggleEnabled(bool InIsEnabled);
	void BtnNextClicked();
	void BtnPreviousClicked();
	void UpdateSlots();
	void SetFocused(bool InIsFocused, bool PlayAnim);
	void Init(TArray<class FText>& InOptionsArray, int32 InSelectedIndex);
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void OnFocused(bool bAnimate);
	void OnUnfocused(bool bAnimate);
	void BndEvt__BP_CreateCharacter_TextSelector_BtnLeft_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_CreateCharacter_TextSelector_BtnRight_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void OnSetFocusAnim(bool bInFocused);
	void OnSetEnabled(bool bInEnabled);
	void ExecuteUbergraph_BP_CreateCharacter_TextSelector(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CreateCharacter_TextSelector_C">();
	}
	static class UBP_CreateCharacter_TextSelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CreateCharacter_TextSelector_C>();
	}
};
static_assert(alignof(UBP_CreateCharacter_TextSelector_C) == 0x000008, "Wrong alignment on UBP_CreateCharacter_TextSelector_C");
static_assert(sizeof(UBP_CreateCharacter_TextSelector_C) == 0x000368, "Wrong size on UBP_CreateCharacter_TextSelector_C");
static_assert(offsetof(UBP_CreateCharacter_TextSelector_C, UberGraphFrame) == 0x000280, "Member 'UBP_CreateCharacter_TextSelector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_CreateCharacter_TextSelector_C, HoverAnim) == 0x000288, "Member 'UBP_CreateCharacter_TextSelector_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UBP_CreateCharacter_TextSelector_C, NextSlotAnim) == 0x000290, "Member 'UBP_CreateCharacter_TextSelector_C::NextSlotAnim' has a wrong offset!");
static_assert(offsetof(UBP_CreateCharacter_TextSelector_C, PreviousSlotAnim) == 0x000298, "Member 'UBP_CreateCharacter_TextSelector_C::PreviousSlotAnim' has a wrong offset!");
static_assert(offsetof(UBP_CreateCharacter_TextSelector_C, FocusedAnim) == 0x0002A0, "Member 'UBP_CreateCharacter_TextSelector_C::FocusedAnim' has a wrong offset!");
static_assert(offsetof(UBP_CreateCharacter_TextSelector_C, Bg) == 0x0002A8, "Member 'UBP_CreateCharacter_TextSelector_C::Bg' has a wrong offset!");
static_assert(offsetof(UBP_CreateCharacter_TextSelector_C, BtnLeft) == 0x0002B0, "Member 'UBP_CreateCharacter_TextSelector_C::BtnLeft' has a wrong offset!");
static_assert(offsetof(UBP_CreateCharacter_TextSelector_C, BtnLeftHighlight) == 0x0002B8, "Member 'UBP_CreateCharacter_TextSelector_C::BtnLeftHighlight' has a wrong offset!");
static_assert(offsetof(UBP_CreateCharacter_TextSelector_C, BtnRight) == 0x0002C0, "Member 'UBP_CreateCharacter_TextSelector_C::BtnRight' has a wrong offset!");
static_assert(offsetof(UBP_CreateCharacter_TextSelector_C, BtnRightHighlight) == 0x0002C8, "Member 'UBP_CreateCharacter_TextSelector_C::BtnRightHighlight' has a wrong offset!");
static_assert(offsetof(UBP_CreateCharacter_TextSelector_C, ButtonFrame) == 0x0002D0, "Member 'UBP_CreateCharacter_TextSelector_C::ButtonFrame' has a wrong offset!");
static_assert(offsetof(UBP_CreateCharacter_TextSelector_C, Frame_over) == 0x0002D8, "Member 'UBP_CreateCharacter_TextSelector_C::Frame_over' has a wrong offset!");
static_assert(offsetof(UBP_CreateCharacter_TextSelector_C, Frame_sel) == 0x0002E0, "Member 'UBP_CreateCharacter_TextSelector_C::Frame_sel' has a wrong offset!");
static_assert(offsetof(UBP_CreateCharacter_TextSelector_C, Frame_up) == 0x0002E8, "Member 'UBP_CreateCharacter_TextSelector_C::Frame_up' has a wrong offset!");
static_assert(offsetof(UBP_CreateCharacter_TextSelector_C, LeftHotkey) == 0x0002F0, "Member 'UBP_CreateCharacter_TextSelector_C::LeftHotkey' has a wrong offset!");
static_assert(offsetof(UBP_CreateCharacter_TextSelector_C, OptionText) == 0x0002F8, "Member 'UBP_CreateCharacter_TextSelector_C::OptionText' has a wrong offset!");
static_assert(offsetof(UBP_CreateCharacter_TextSelector_C, RightHotkey) == 0x000300, "Member 'UBP_CreateCharacter_TextSelector_C::RightHotkey' has a wrong offset!");
static_assert(offsetof(UBP_CreateCharacter_TextSelector_C, ScaleBoxLeftHotkey) == 0x000308, "Member 'UBP_CreateCharacter_TextSelector_C::ScaleBoxLeftHotkey' has a wrong offset!");
static_assert(offsetof(UBP_CreateCharacter_TextSelector_C, ScaleBoxRightHotkey) == 0x000310, "Member 'UBP_CreateCharacter_TextSelector_C::ScaleBoxRightHotkey' has a wrong offset!");
static_assert(offsetof(UBP_CreateCharacter_TextSelector_C, TitleText) == 0x000318, "Member 'UBP_CreateCharacter_TextSelector_C::TitleText' has a wrong offset!");
static_assert(offsetof(UBP_CreateCharacter_TextSelector_C, CategoryTitle) == 0x000320, "Member 'UBP_CreateCharacter_TextSelector_C::CategoryTitle' has a wrong offset!");
static_assert(offsetof(UBP_CreateCharacter_TextSelector_C, SelectedIndex) == 0x000338, "Member 'UBP_CreateCharacter_TextSelector_C::SelectedIndex' has a wrong offset!");
static_assert(offsetof(UBP_CreateCharacter_TextSelector_C, SelectionChanged) == 0x000340, "Member 'UBP_CreateCharacter_TextSelector_C::SelectionChanged' has a wrong offset!");
static_assert(offsetof(UBP_CreateCharacter_TextSelector_C, OptionsArray) == 0x000350, "Member 'UBP_CreateCharacter_TextSelector_C::OptionsArray' has a wrong offset!");
static_assert(offsetof(UBP_CreateCharacter_TextSelector_C, Enabled) == 0x000360, "Member 'UBP_CreateCharacter_TextSelector_C::Enabled' has a wrong offset!");
static_assert(offsetof(UBP_CreateCharacter_TextSelector_C, IsSmallScreen) == 0x000361, "Member 'UBP_CreateCharacter_TextSelector_C::IsSmallScreen' has a wrong offset!");

}

