#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ControlledExplosion_Charge_VisualEntity

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ControlledExplosion_Charge_VisualEntity.BP_ControlledExplosion_Charge_VisualEntity_C.ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity
// 0x0088 (0x0088 - 0x0000)
struct BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_GetSlotMeshComponents_ReturnValue;        // 0x0008(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x001C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrawlerHero_C*                      K2Node_DynamicCast_AsBP_Brawler_Hero;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue;    // 0x006C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity) == 0x000008, "Wrong alignment on BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity");
static_assert(sizeof(BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity) == 0x000088, "Wrong size on BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity");
static_assert(offsetof(BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity, CallFunc_GetSlotMeshComponents_ReturnValue) == 0x000008, "Member 'BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity::CallFunc_GetSlotMeshComponents_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity, Temp_delegate_Variable) == 0x00001C, "Member 'BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity, CallFunc_PostEvent_ReturnValue) == 0x00002C, "Member 'BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity, Temp_int_Array_Index_Variable) == 0x000030, "Member 'BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity, K2Node_DynamicCast_AsBP_Brawler_Hero) == 0x000050, "Member 'BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity::K2Node_DynamicCast_AsBP_Brawler_Hero' has a wrong offset!");
static_assert(offsetof(BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity, CallFunc_LinearColorLerp_ReturnValue) == 0x00005C, "Member 'BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity, CallFunc_Multiply_LinearColorFloat_ReturnValue) == 0x00006C, "Member 'BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity::CallFunc_Multiply_LinearColorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x00007C, "Member 'BP_ControlledExplosion_Charge_VisualEntity_C_ExecuteUbergraph_BP_ControlledExplosion_Charge_VisualEntity::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");

}

