#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CasterImp_BlinkReappear_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CasterImp_BlinkReappear_VisualEntity.BP_CasterImp_BlinkReappear_VisualEntity_C
// 0x0020 (0x0370 - 0x0350)
class ABP_CasterImp_BlinkReappear_VisualEntity_C : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Reappear;                                          // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_Dissolve_3B2A02554E6078BE71F6768B0D299A63; // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_3B2A02554E6078BE71F6768B0D299A63; // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CasterImp_BlinkReappear_VisualEntity(int32 EntryPoint);
	void VisualEntityConstructionFinished();
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CasterImp_BlinkReappear_VisualEntity_C">();
	}
	static class ABP_CasterImp_BlinkReappear_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CasterImp_BlinkReappear_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_CasterImp_BlinkReappear_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_CasterImp_BlinkReappear_VisualEntity_C");
static_assert(sizeof(ABP_CasterImp_BlinkReappear_VisualEntity_C) == 0x000370, "Wrong size on ABP_CasterImp_BlinkReappear_VisualEntity_C");
static_assert(offsetof(ABP_CasterImp_BlinkReappear_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_CasterImp_BlinkReappear_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_BlinkReappear_VisualEntity_C, Reappear) == 0x000358, "Member 'ABP_CasterImp_BlinkReappear_VisualEntity_C::Reappear' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_BlinkReappear_VisualEntity_C, Timeline_1_Dissolve_3B2A02554E6078BE71F6768B0D299A63) == 0x000360, "Member 'ABP_CasterImp_BlinkReappear_VisualEntity_C::Timeline_1_Dissolve_3B2A02554E6078BE71F6768B0D299A63' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_BlinkReappear_VisualEntity_C, Timeline_1__Direction_3B2A02554E6078BE71F6768B0D299A63) == 0x000364, "Member 'ABP_CasterImp_BlinkReappear_VisualEntity_C::Timeline_1__Direction_3B2A02554E6078BE71F6768B0D299A63' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_BlinkReappear_VisualEntity_C, Timeline_1) == 0x000368, "Member 'ABP_CasterImp_BlinkReappear_VisualEntity_C::Timeline_1' has a wrong offset!");

}

