#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CheckboxButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_CheckboxButton.BP_CheckboxButton_C
// 0x00D8 (0x03A8 - 0x02D0)
class UBP_CheckboxButton_C final : public UOptionsButtonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FocusAnim;                                         // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                ButtonFrame;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Caption;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Check;                                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                FrameOver;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                FrameSel;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                FrameUp;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayBtn;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   CaptionText;                                       // 0x0328(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnHovered;                                         // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUnhovered;                                       // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnPressed;                                         // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnReleased;                                        // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnFocus;                                           // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsChecked;                                         // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ToggleChecked(bool InIsChecked);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature();
	void OnClickedButton();
	void OnFocused(bool bAnimate);
	void OnUnfocused(bool bAnimate);
	void OnSetDisplayName(const class FText& InDisplayName);
	void ExecuteUbergraph_BP_CheckboxButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CheckboxButton_C">();
	}
	static class UBP_CheckboxButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CheckboxButton_C>();
	}
};
static_assert(alignof(UBP_CheckboxButton_C) == 0x000008, "Wrong alignment on UBP_CheckboxButton_C");
static_assert(sizeof(UBP_CheckboxButton_C) == 0x0003A8, "Wrong size on UBP_CheckboxButton_C");
static_assert(offsetof(UBP_CheckboxButton_C, UberGraphFrame) == 0x0002D0, "Member 'UBP_CheckboxButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_CheckboxButton_C, HoverAnim) == 0x0002D8, "Member 'UBP_CheckboxButton_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UBP_CheckboxButton_C, FocusAnim) == 0x0002E0, "Member 'UBP_CheckboxButton_C::FocusAnim' has a wrong offset!");
static_assert(offsetof(UBP_CheckboxButton_C, ButtonFrame) == 0x0002E8, "Member 'UBP_CheckboxButton_C::ButtonFrame' has a wrong offset!");
static_assert(offsetof(UBP_CheckboxButton_C, Caption) == 0x0002F0, "Member 'UBP_CheckboxButton_C::Caption' has a wrong offset!");
static_assert(offsetof(UBP_CheckboxButton_C, Check) == 0x0002F8, "Member 'UBP_CheckboxButton_C::Check' has a wrong offset!");
static_assert(offsetof(UBP_CheckboxButton_C, FrameOver) == 0x000300, "Member 'UBP_CheckboxButton_C::FrameOver' has a wrong offset!");
static_assert(offsetof(UBP_CheckboxButton_C, FrameSel) == 0x000308, "Member 'UBP_CheckboxButton_C::FrameSel' has a wrong offset!");
static_assert(offsetof(UBP_CheckboxButton_C, FrameUp) == 0x000310, "Member 'UBP_CheckboxButton_C::FrameUp' has a wrong offset!");
static_assert(offsetof(UBP_CheckboxButton_C, Overlay_0) == 0x000318, "Member 'UBP_CheckboxButton_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UBP_CheckboxButton_C, OverlayBtn) == 0x000320, "Member 'UBP_CheckboxButton_C::OverlayBtn' has a wrong offset!");
static_assert(offsetof(UBP_CheckboxButton_C, CaptionText) == 0x000328, "Member 'UBP_CheckboxButton_C::CaptionText' has a wrong offset!");
static_assert(offsetof(UBP_CheckboxButton_C, OnClicked) == 0x000340, "Member 'UBP_CheckboxButton_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UBP_CheckboxButton_C, OnHovered) == 0x000350, "Member 'UBP_CheckboxButton_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UBP_CheckboxButton_C, OnUnhovered) == 0x000360, "Member 'UBP_CheckboxButton_C::OnUnhovered' has a wrong offset!");
static_assert(offsetof(UBP_CheckboxButton_C, OnPressed) == 0x000370, "Member 'UBP_CheckboxButton_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UBP_CheckboxButton_C, OnReleased) == 0x000380, "Member 'UBP_CheckboxButton_C::OnReleased' has a wrong offset!");
static_assert(offsetof(UBP_CheckboxButton_C, OnFocus) == 0x000390, "Member 'UBP_CheckboxButton_C::OnFocus' has a wrong offset!");
static_assert(offsetof(UBP_CheckboxButton_C, IsChecked) == 0x0003A0, "Member 'UBP_CheckboxButton_C::IsChecked' has a wrong offset!");

}

