#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Cook

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_VendorActor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Cook.BP_Cook_C
// 0x0048 (0x08E8 - 0x08A0)
class ABP_Cook_C final : public ABP_VendorActor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Cook_C;                          // 0x08A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x08A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTriggerBoxComponent*                   TriggerBox;                                        // 0x08B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CameraSphere;                                      // 0x08B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMiniMapActorComponent*                 MiniMapActor;                                      // 0x08C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Cook;                                           // 0x08C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        NotifMarker;                                       // 0x08D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SpeechBubbleComponent_C*            BP_SpeechBubbleComponent;                          // 0x08D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_InteractPrompWidgetComponent_C*     BP_InteractPrompWidgetComponent;                   // 0x08E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void VisualVolumeEnter(class ALevelVisualVolume* Volume);
	void ExecuteUbergraph_BP_Cook(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Cook_C">();
	}
	static class ABP_Cook_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Cook_C>();
	}
};
static_assert(alignof(ABP_Cook_C) == 0x000008, "Wrong alignment on ABP_Cook_C");
static_assert(sizeof(ABP_Cook_C) == 0x0008E8, "Wrong size on ABP_Cook_C");
static_assert(offsetof(ABP_Cook_C, UberGraphFrame_BP_Cook_C) == 0x0008A0, "Member 'ABP_Cook_C::UberGraphFrame_BP_Cook_C' has a wrong offset!");
static_assert(offsetof(ABP_Cook_C, Ak) == 0x0008A8, "Member 'ABP_Cook_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_Cook_C, TriggerBox) == 0x0008B0, "Member 'ABP_Cook_C::TriggerBox' has a wrong offset!");
static_assert(offsetof(ABP_Cook_C, CameraSphere) == 0x0008B8, "Member 'ABP_Cook_C::CameraSphere' has a wrong offset!");
static_assert(offsetof(ABP_Cook_C, MiniMapActor) == 0x0008C0, "Member 'ABP_Cook_C::MiniMapActor' has a wrong offset!");
static_assert(offsetof(ABP_Cook_C, SK_Cook) == 0x0008C8, "Member 'ABP_Cook_C::SK_Cook' has a wrong offset!");
static_assert(offsetof(ABP_Cook_C, NotifMarker) == 0x0008D0, "Member 'ABP_Cook_C::NotifMarker' has a wrong offset!");
static_assert(offsetof(ABP_Cook_C, BP_SpeechBubbleComponent) == 0x0008D8, "Member 'ABP_Cook_C::BP_SpeechBubbleComponent' has a wrong offset!");
static_assert(offsetof(ABP_Cook_C, BP_InteractPrompWidgetComponent) == 0x0008E0, "Member 'ABP_Cook_C::BP_InteractPrompWidgetComponent' has a wrong offset!");

}

