#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosBeam_VisualEntity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ChaosBeam_VisualEntity.BP_ChaosBeam_VisualEntity_C.ExecuteUbergraph_BP_ChaosBeam_VisualEntity
// 0x00C0 (0x00C0 - 0x0000)
struct BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastBeamEndPoint_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue_1;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_ChaosBeam_ActiveAbility_C*          K2Node_DynamicCast_AsBP_Chaos_Beam_Active_Ability; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName CustomName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_GetLastBeamStartPoint_ReturnValue;        // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastBeamEndPoint_ReturnValue_1;        // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAbilityUpgradeUnlocked_ReturnValue;     // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_CustomName;                     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetDamagedEntities_ReturnValue;           // 0x0098(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLastBeamStartPoint_ReturnValue_1;      // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity) == 0x000008, "Wrong alignment on BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity");
static_assert(sizeof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity) == 0x0000C0, "Wrong size on BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity, CallFunc_GetAttachParentActor_ReturnValue) == 0x000008, "Member 'BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity, CallFunc_GetLastBeamEndPoint_ReturnValue) == 0x000010, "Member 'BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity::CallFunc_GetLastBeamEndPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity, CallFunc_GetAttachParentActor_ReturnValue_1) == 0x000020, "Member 'BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity::CallFunc_GetAttachParentActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity, K2Node_Event_DeltaSeconds) == 0x000028, "Member 'BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity, CallFunc_IsValid_ReturnValue_1) == 0x00002C, "Member 'BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity, K2Node_DynamicCast_AsCharacter_Base) == 0x000030, "Member 'BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity, CallFunc_GetAbilityController_ReturnValue) == 0x000040, "Member 'BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000048, "Member 'BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity, K2Node_DynamicCast_AsBP_Chaos_Beam_Active_Ability) == 0x000050, "Member 'BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity::K2Node_DynamicCast_AsBP_Chaos_Beam_Active_Ability' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity, CallFunc_IsValid_ReturnValue_2) == 0x000059, "Member 'BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity, CallFunc_IsValid_ReturnValue_3) == 0x00005A, "Member 'BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity, K2Node_CreateDelegate_OutputDelegate) == 0x00005C, "Member 'BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity, CallFunc_GetLastBeamStartPoint_ReturnValue) == 0x00006C, "Member 'BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity::CallFunc_GetLastBeamStartPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity, CallFunc_GetLastBeamEndPoint_ReturnValue_1) == 0x000078, "Member 'BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity::CallFunc_GetLastBeamEndPoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity, CallFunc_IsAbilityUpgradeUnlocked_ReturnValue) == 0x000084, "Member 'BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity::CallFunc_IsAbilityUpgradeUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity, K2Node_CustomEvent_CustomName) == 0x000088, "Member 'BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity::K2Node_CustomEvent_CustomName' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000090, "Member 'BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity, CallFunc_GetDamagedEntities_ReturnValue) == 0x000098, "Member 'BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity::CallFunc_GetDamagedEntities_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000AC, "Member 'BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity, CallFunc_GetLastBeamStartPoint_ReturnValue_1) == 0x0000B0, "Member 'BP_ChaosBeam_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeam_VisualEntity::CallFunc_GetLastBeamStartPoint_ReturnValue_1' has a wrong offset!");

// Function BP_ChaosBeam_VisualEntity.BP_ChaosBeam_VisualEntity_C.EventOnCustomEvent_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BP_ChaosBeam_VisualEntity_C_EventOnCustomEvent_Event_0 final
{
public:
	class FName                                   CustomName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ChaosBeam_VisualEntity_C_EventOnCustomEvent_Event_0) == 0x000004, "Wrong alignment on BP_ChaosBeam_VisualEntity_C_EventOnCustomEvent_Event_0");
static_assert(sizeof(BP_ChaosBeam_VisualEntity_C_EventOnCustomEvent_Event_0) == 0x000008, "Wrong size on BP_ChaosBeam_VisualEntity_C_EventOnCustomEvent_Event_0");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_EventOnCustomEvent_Event_0, CustomName) == 0x000000, "Member 'BP_ChaosBeam_VisualEntity_C_EventOnCustomEvent_Event_0::CustomName' has a wrong offset!");

// Function BP_ChaosBeam_VisualEntity.BP_ChaosBeam_VisualEntity_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ChaosBeam_VisualEntity_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ChaosBeam_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ChaosBeam_VisualEntity_C_ReceiveTick");
static_assert(sizeof(BP_ChaosBeam_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong size on BP_ChaosBeam_VisualEntity_C_ReceiveTick");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ChaosBeam_VisualEntity_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ChaosBeam_VisualEntity.BP_ChaosBeam_VisualEntity_C.GetOffsetDirection
// 0x0030 (0x0030 - 0x0000)
struct BP_ChaosBeam_VisualEntity_C_GetOffsetDirection final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastBeamEndPoint_ReturnValue;          // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastBeamStartPoint_ReturnValue;        // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionUnitVector_ReturnValue;       // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ChaosBeam_VisualEntity_C_GetOffsetDirection) == 0x000004, "Wrong alignment on BP_ChaosBeam_VisualEntity_C_GetOffsetDirection");
static_assert(sizeof(BP_ChaosBeam_VisualEntity_C_GetOffsetDirection) == 0x000030, "Wrong size on BP_ChaosBeam_VisualEntity_C_GetOffsetDirection");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_GetOffsetDirection, ReturnValue) == 0x000000, "Member 'BP_ChaosBeam_VisualEntity_C_GetOffsetDirection::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_GetOffsetDirection, CallFunc_GetLastBeamEndPoint_ReturnValue) == 0x00000C, "Member 'BP_ChaosBeam_VisualEntity_C_GetOffsetDirection::CallFunc_GetLastBeamEndPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_GetOffsetDirection, CallFunc_GetLastBeamStartPoint_ReturnValue) == 0x000018, "Member 'BP_ChaosBeam_VisualEntity_C_GetOffsetDirection::CallFunc_GetLastBeamStartPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeam_VisualEntity_C_GetOffsetDirection, CallFunc_GetDirectionUnitVector_ReturnValue) == 0x000024, "Member 'BP_ChaosBeam_VisualEntity_C_GetOffsetDirection::CallFunc_GetDirectionUnitVector_ReturnValue' has a wrong offset!");

}

