#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosBeam_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ChaosBeam_VisualEntity.BP_ChaosBeam_VisualEntity_C
// 0x0028 (0x0378 - 0x0350)
class ABP_ChaosBeam_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      BurningTick;                                       // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ChaosBeam_ActiveAbility_C*          BeamAbilityInstance;                               // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset;                                            // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ChaosBeam_VisualEntity(int32 EntryPoint);
	void EventOnCustomEvent_Event_0(class FName CustomName);
	void OnKill();
	void VisualEntityConstructionFinished();
	void ReceiveTick(float DeltaSeconds);
	struct FVector GetOffsetDirection();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ChaosBeam_VisualEntity_C">();
	}
	static class ABP_ChaosBeam_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ChaosBeam_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_ChaosBeam_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_ChaosBeam_VisualEntity_C");
static_assert(sizeof(ABP_ChaosBeam_VisualEntity_C) == 0x000378, "Wrong size on ABP_ChaosBeam_VisualEntity_C");
static_assert(offsetof(ABP_ChaosBeam_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_ChaosBeam_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ChaosBeam_VisualEntity_C, BurningTick) == 0x000358, "Member 'ABP_ChaosBeam_VisualEntity_C::BurningTick' has a wrong offset!");
static_assert(offsetof(ABP_ChaosBeam_VisualEntity_C, Niagara) == 0x000360, "Member 'ABP_ChaosBeam_VisualEntity_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_ChaosBeam_VisualEntity_C, BeamAbilityInstance) == 0x000368, "Member 'ABP_ChaosBeam_VisualEntity_C::BeamAbilityInstance' has a wrong offset!");
static_assert(offsetof(ABP_ChaosBeam_VisualEntity_C, Offset) == 0x000370, "Member 'ABP_ChaosBeam_VisualEntity_C::Offset' has a wrong offset!");

}

