#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaoticRemnants_Actor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_ChaoticRemnants_Actor.BP_ChaoticRemnants_Actor_C.ExecuteUbergraph_BP_ChaoticRemnants_Actor
// 0x01C8 (0x01C8 - 0x0000)
struct BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_4;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_5;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0048(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0058(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0068(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable_1;                               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x00A0(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHeroBase*                              K2Node_DynamicCast_AsHero_Base;                    // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByName_ReturnValue;           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ChaoticRemnants_Passive_C*          K2Node_DynamicCast_AsBP_Chaotic_Remnants_Passive;  // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityBase*                           CallFunc_BPGetAbilityByName_ReturnValue_1;         // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHeroBase*                              K2Node_DynamicCast_AsHero_Base_1;                  // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue_1;       // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue_1;        // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ChaoticRemnants_Passive_C*          K2Node_DynamicCast_AsBP_Chaotic_Remnants_Passive_1; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x01AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B6[0x2];                                      // 0x01B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_1;                           // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor) == 0x000008, "Wrong alignment on BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor");
static_assert(sizeof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor) == 0x0001C8, "Wrong size on BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, EntryPoint) == 0x000000, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000004, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, Temp_name_Variable) == 0x000010, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, CallFunc_PostEventAtLocation_ReturnValue) == 0x000018, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, Temp_name_Variable_1) == 0x00001C, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, Temp_name_Variable_2) == 0x000024, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, Temp_int_Variable) == 0x00002C, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, Temp_name_Variable_3) == 0x000030, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, Temp_name_Variable_4) == 0x000038, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, Temp_name_Variable_5) == 0x000040, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::Temp_name_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, Temp_delegate_Variable) == 0x000048, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, Temp_delegate_Variable_1) == 0x000058, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, Temp_delegate_Variable_2) == 0x000068, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, Temp_int_Variable_1) == 0x000078, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, CallFunc_PostAkEvent_ReturnValue) == 0x00007C, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000080, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, K2Node_ComponentBoundEvent_OtherActor) == 0x000088, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, K2Node_ComponentBoundEvent_OtherComp) == 0x000090, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000098, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, K2Node_ComponentBoundEvent_bFromSweep) == 0x00009C, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, K2Node_ComponentBoundEvent_SweepResult) == 0x0000A0, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, K2Node_DynamicCast_AsHero_Base) == 0x000128, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::K2Node_DynamicCast_AsHero_Base' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, CallFunc_GetAbilityController_ReturnValue) == 0x000138, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, CallFunc_BPGetAbilityByName_ReturnValue) == 0x000140, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::CallFunc_BPGetAbilityByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000148, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, CallFunc_IsValid_ReturnValue) == 0x000150, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, K2Node_DynamicCast_AsBP_Chaotic_Remnants_Passive) == 0x000158, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::K2Node_DynamicCast_AsBP_Chaotic_Remnants_Passive' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, K2Node_DynamicCast_bSuccess_1) == 0x000160, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, CallFunc_BPGetAbilityByName_ReturnValue_1) == 0x000168, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::CallFunc_BPGetAbilityByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000170, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, K2Node_DynamicCast_AsHero_Base_1) == 0x000178, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::K2Node_DynamicCast_AsHero_Base_1' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, K2Node_DynamicCast_bSuccess_2) == 0x000180, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, CallFunc_GetAbilityController_ReturnValue_1) == 0x000188, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::CallFunc_GetAbilityController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, CallFunc_BPGetAbilityByClass_ReturnValue_1) == 0x000190, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::CallFunc_BPGetAbilityByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, CallFunc_IsValid_ReturnValue_1) == 0x000198, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, K2Node_DynamicCast_AsBP_Chaotic_Remnants_Passive_1) == 0x0001A0, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::K2Node_DynamicCast_AsBP_Chaotic_Remnants_Passive_1' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, K2Node_DynamicCast_bSuccess_3) == 0x0001A8, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, K2Node_Select_Default) == 0x0001AC, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, CallFunc_Greater_IntInt_ReturnValue) == 0x0001B4, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, CallFunc_Less_IntInt_ReturnValue) == 0x0001B5, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, K2Node_Select_Default_1) == 0x0001B8, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, CallFunc_PostAkEvent_ReturnValue_1) == 0x0001C0, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor, CallFunc_PostAkEvent_ReturnValue_2) == 0x0001C4, "Member 'BP_ChaoticRemnants_Actor_C_ExecuteUbergraph_BP_ChaoticRemnants_Actor::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");

// Function BP_ChaoticRemnants_Actor.BP_ChaoticRemnants_Actor_C.BndEvt__BP_ChaoticRemnants_Actor_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_ChaoticRemnants_Actor_C_BndEvt__BP_ChaoticRemnants_Actor_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ChaoticRemnants_Actor_C_BndEvt__BP_ChaoticRemnants_Actor_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_ChaoticRemnants_Actor_C_BndEvt__BP_ChaoticRemnants_Actor_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_ChaoticRemnants_Actor_C_BndEvt__BP_ChaoticRemnants_Actor_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_ChaoticRemnants_Actor_C_BndEvt__BP_ChaoticRemnants_Actor_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_BndEvt__BP_ChaoticRemnants_Actor_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_ChaoticRemnants_Actor_C_BndEvt__BP_ChaoticRemnants_Actor_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_BndEvt__BP_ChaoticRemnants_Actor_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_ChaoticRemnants_Actor_C_BndEvt__BP_ChaoticRemnants_Actor_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_BndEvt__BP_ChaoticRemnants_Actor_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_ChaoticRemnants_Actor_C_BndEvt__BP_ChaoticRemnants_Actor_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_BndEvt__BP_ChaoticRemnants_Actor_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_ChaoticRemnants_Actor_C_BndEvt__BP_ChaoticRemnants_Actor_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_BndEvt__BP_ChaoticRemnants_Actor_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_ChaoticRemnants_Actor_C_BndEvt__BP_ChaoticRemnants_Actor_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRemnants_Actor_C_BndEvt__BP_ChaoticRemnants_Actor_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_ChaoticRemnants_Actor_C_BndEvt__BP_ChaoticRemnants_Actor_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

}

