#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Cook_Anim

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_Cook_Anim.BP_Cook_Anim_C
// 0x1DA0 (0x2490 - 0x06F0)
class UBP_Cook_Anim_C final : public UNpcAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06F8(0x0030)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x0728(0x00A8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0x07D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x07F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x0820(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x0848(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x0870(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x0898(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x08C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x08E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x0910(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x0938(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x0960(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x0988(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0x0A08(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x0A38(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0x0AB8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x0AE8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x0B68(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_6;                  // 0x0B98(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x0C80(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x0CB0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x0D30(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x0D60(0x00B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x0E10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x0E38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x0E60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x0E88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x0EB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x0ED8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x0F00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x0F28(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x0F50(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x0FD0(0x0030)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_5;                     // 0x1000(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_5;                  // 0x10C8(0x00E8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x11B0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x1230(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_4;                  // 0x1260(0x00E8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0x1348(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x1410(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x1490(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x14C0(0x00E8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0x15A8(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x1670(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x16F0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x1720(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x17A0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x17D0(0x00B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x1880(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x18A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x18D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x18F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x1920(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x1948(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x1970(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x1998(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x19C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x19E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x1A10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x1A38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x1A60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x1A88(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x1AB0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x1B30(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x1B60(0x00E8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x1C48(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x1D10(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x1D90(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1DC0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x1E40(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x1E70(0x00E8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x1F58(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x2020(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x20A0(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x20D0(0x00E8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x21B8(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x2280(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x2300(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x2330(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x23B0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x23E0(0x00B0)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Cook_Anim_AnimGraphNode_TransitionResult_7DE21DD845D4FD5DEBC28D968046E221();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Cook_Anim_AnimGraphNode_TransitionResult_47B7151949000BFA898E7EBB8F2EBA6D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Cook_Anim_AnimGraphNode_TransitionResult_A9F18E3346C97776820668ABC8FE6937();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Cook_Anim_AnimGraphNode_TransitionResult_A3B7CDE84FB50C406FC973B4BE8B7E79();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Cook_Anim_AnimGraphNode_TransitionResult_B3B3AE1B436A55224219A7B17FDA5FD1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Cook_Anim_AnimGraphNode_TransitionResult_BA611B4E44F13B243C24BEAF3669962C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Cook_Anim_AnimGraphNode_TransitionResult_A6033C4D4FFE12228424EEAFCB1D0491();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Cook_Anim_AnimGraphNode_TransitionResult_26B7434C4D1D3ECD83F00BB47AAFF2E9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Cook_Anim_AnimGraphNode_TransitionResult_B5726DDC4E5CE5A563CFECB240625227();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Cook_Anim_AnimGraphNode_TransitionResult_ED572EF64B6CDD8A36AA78ABCD7EDE98();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Cook_Anim_AnimGraphNode_TransitionResult_FD6CAF2748F1629486E410AE64E7F822();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Cook_Anim_AnimGraphNode_TransitionResult_B51C57E14C4A8763A14343B95AA83647();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Cook_Anim_AnimGraphNode_TransitionResult_E5A273FB443FD5D85495D3B2CEE50324();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Cook_Anim_AnimGraphNode_TransitionResult_3D8366904627E3BC42166B9FEF1CED79();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Cook_Anim_AnimGraphNode_TransitionResult_97BA3BFD427FACDA949AAAB4F501339B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Cook_Anim_AnimGraphNode_TransitionResult_49461243449440A97A1618B6F2644145();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Cook_Anim_AnimGraphNode_TransitionResult_10E3A8D14B7D195635DA32A2E61AFAFE();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Cook_Anim_AnimGraphNode_TransitionResult_C9557D6C466596E3762F25B1CA1AB7AD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Cook_Anim_AnimGraphNode_TransitionResult_8716444045DDABC4A2BC509324DF09BB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Cook_Anim_AnimGraphNode_TransitionResult_00FCE29A4CC5BA0B05326898A2DD87AA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Cook_Anim_AnimGraphNode_TransitionResult_ADC9AFEC445B718DF5919991E0AC1573();
	void ExecuteUbergraph_BP_Cook_Anim(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Cook_Anim_C">();
	}
	static class UBP_Cook_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Cook_Anim_C>();
	}
};
static_assert(alignof(UBP_Cook_Anim_C) == 0x000010, "Wrong alignment on UBP_Cook_Anim_C");
static_assert(sizeof(UBP_Cook_Anim_C) == 0x002490, "Wrong size on UBP_Cook_Anim_C");
static_assert(offsetof(UBP_Cook_Anim_C, UberGraphFrame) == 0x0006F0, "Member 'UBP_Cook_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_Root) == 0x0006F8, "Member 'UBP_Cook_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_BlendListByInt) == 0x000728, "Member 'UBP_Cook_Anim_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_32) == 0x0007D0, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_32' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_31) == 0x0007F8, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_31' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_30) == 0x000820, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_30' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_29) == 0x000848, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_29' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_28) == 0x000870, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_28' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_27) == 0x000898, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_27' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_26) == 0x0008C0, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_26' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_25) == 0x0008E8, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_25' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_24) == 0x000910, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_24' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_23) == 0x000938, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_23' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_22) == 0x000960, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_22' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_SequencePlayer_14) == 0x000988, "Member 'UBP_Cook_Anim_C::AnimGraphNode_SequencePlayer_14' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_StateResult_15) == 0x000A08, "Member 'UBP_Cook_Anim_C::AnimGraphNode_StateResult_15' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_SequencePlayer_13) == 0x000A38, "Member 'UBP_Cook_Anim_C::AnimGraphNode_SequencePlayer_13' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_StateResult_14) == 0x000AB8, "Member 'UBP_Cook_Anim_C::AnimGraphNode_StateResult_14' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_SequencePlayer_12) == 0x000AE8, "Member 'UBP_Cook_Anim_C::AnimGraphNode_SequencePlayer_12' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_StateResult_13) == 0x000B68, "Member 'UBP_Cook_Anim_C::AnimGraphNode_StateResult_13' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_BlendSpacePlayer_6) == 0x000B98, "Member 'UBP_Cook_Anim_C::AnimGraphNode_BlendSpacePlayer_6' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_StateResult_12) == 0x000C80, "Member 'UBP_Cook_Anim_C::AnimGraphNode_StateResult_12' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_SequencePlayer_11) == 0x000CB0, "Member 'UBP_Cook_Anim_C::AnimGraphNode_SequencePlayer_11' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_StateResult_11) == 0x000D30, "Member 'UBP_Cook_Anim_C::AnimGraphNode_StateResult_11' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_StateMachine_2) == 0x000D60, "Member 'UBP_Cook_Anim_C::AnimGraphNode_StateMachine_2' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_21) == 0x000E10, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_21' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_20) == 0x000E38, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_20' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_19) == 0x000E60, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_19' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_18) == 0x000E88, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_18' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_17) == 0x000EB0, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_17' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_16) == 0x000ED8, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_16' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_15) == 0x000F00, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_15' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_14) == 0x000F28, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_14' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_SequencePlayer_10) == 0x000F50, "Member 'UBP_Cook_Anim_C::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_StateResult_10) == 0x000FD0, "Member 'UBP_Cook_Anim_C::AnimGraphNode_StateResult_10' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_ApplyAdditive_5) == 0x001000, "Member 'UBP_Cook_Anim_C::AnimGraphNode_ApplyAdditive_5' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_BlendSpacePlayer_5) == 0x0010C8, "Member 'UBP_Cook_Anim_C::AnimGraphNode_BlendSpacePlayer_5' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_SequencePlayer_9) == 0x0011B0, "Member 'UBP_Cook_Anim_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_StateResult_9) == 0x001230, "Member 'UBP_Cook_Anim_C::AnimGraphNode_StateResult_9' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_BlendSpacePlayer_4) == 0x001260, "Member 'UBP_Cook_Anim_C::AnimGraphNode_BlendSpacePlayer_4' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_ApplyAdditive_4) == 0x001348, "Member 'UBP_Cook_Anim_C::AnimGraphNode_ApplyAdditive_4' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_SequencePlayer_8) == 0x001410, "Member 'UBP_Cook_Anim_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_StateResult_8) == 0x001490, "Member 'UBP_Cook_Anim_C::AnimGraphNode_StateResult_8' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_BlendSpacePlayer_3) == 0x0014C0, "Member 'UBP_Cook_Anim_C::AnimGraphNode_BlendSpacePlayer_3' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_ApplyAdditive_3) == 0x0015A8, "Member 'UBP_Cook_Anim_C::AnimGraphNode_ApplyAdditive_3' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_SequencePlayer_7) == 0x001670, "Member 'UBP_Cook_Anim_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_StateResult_7) == 0x0016F0, "Member 'UBP_Cook_Anim_C::AnimGraphNode_StateResult_7' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_SequencePlayer_6) == 0x001720, "Member 'UBP_Cook_Anim_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_StateResult_6) == 0x0017A0, "Member 'UBP_Cook_Anim_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_StateMachine_1) == 0x0017D0, "Member 'UBP_Cook_Anim_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_13) == 0x001880, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_13' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_12) == 0x0018A8, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_12' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_11) == 0x0018D0, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_11' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_10) == 0x0018F8, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_9) == 0x001920, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_8) == 0x001948, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_7) == 0x001970, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_6) == 0x001998, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_5) == 0x0019C0, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_4) == 0x0019E8, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_3) == 0x001A10, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_2) == 0x001A38, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult_1) == 0x001A60, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_TransitionResult) == 0x001A88, "Member 'UBP_Cook_Anim_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_SequencePlayer_5) == 0x001AB0, "Member 'UBP_Cook_Anim_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_StateResult_5) == 0x001B30, "Member 'UBP_Cook_Anim_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_BlendSpacePlayer_2) == 0x001B60, "Member 'UBP_Cook_Anim_C::AnimGraphNode_BlendSpacePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_ApplyAdditive_2) == 0x001C48, "Member 'UBP_Cook_Anim_C::AnimGraphNode_ApplyAdditive_2' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_SequencePlayer_4) == 0x001D10, "Member 'UBP_Cook_Anim_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_StateResult_4) == 0x001D90, "Member 'UBP_Cook_Anim_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_SequencePlayer_3) == 0x001DC0, "Member 'UBP_Cook_Anim_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_StateResult_3) == 0x001E40, "Member 'UBP_Cook_Anim_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_BlendSpacePlayer_1) == 0x001E70, "Member 'UBP_Cook_Anim_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_ApplyAdditive_1) == 0x001F58, "Member 'UBP_Cook_Anim_C::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_SequencePlayer_2) == 0x002020, "Member 'UBP_Cook_Anim_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_StateResult_2) == 0x0020A0, "Member 'UBP_Cook_Anim_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_BlendSpacePlayer) == 0x0020D0, "Member 'UBP_Cook_Anim_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_ApplyAdditive) == 0x0021B8, "Member 'UBP_Cook_Anim_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_SequencePlayer_1) == 0x002280, "Member 'UBP_Cook_Anim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_StateResult_1) == 0x002300, "Member 'UBP_Cook_Anim_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_SequencePlayer) == 0x002330, "Member 'UBP_Cook_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_StateResult) == 0x0023B0, "Member 'UBP_Cook_Anim_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UBP_Cook_Anim_C, AnimGraphNode_StateMachine) == 0x0023E0, "Member 'UBP_Cook_Anim_C::AnimGraphNode_StateMachine' has a wrong offset!");

}

