#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CasterImp_BlinkReappear_VisualEntity

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CasterImp_BlinkReappear_VisualEntity.BP_CasterImp_BlinkReappear_VisualEntity_C.ExecuteUbergraph_BP_CasterImp_BlinkReappear_VisualEntity
// 0x0020 (0x0020 - 0x0000)
struct BP_CasterImp_BlinkReappear_VisualEntity_C_ExecuteUbergraph_BP_CasterImp_BlinkReappear_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CasterImp_C*                        K2Node_DynamicCast_AsBP_Caster_Imp;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CasterImp_BlinkReappear_VisualEntity_C_ExecuteUbergraph_BP_CasterImp_BlinkReappear_VisualEntity) == 0x000008, "Wrong alignment on BP_CasterImp_BlinkReappear_VisualEntity_C_ExecuteUbergraph_BP_CasterImp_BlinkReappear_VisualEntity");
static_assert(sizeof(BP_CasterImp_BlinkReappear_VisualEntity_C_ExecuteUbergraph_BP_CasterImp_BlinkReappear_VisualEntity) == 0x000020, "Wrong size on BP_CasterImp_BlinkReappear_VisualEntity_C_ExecuteUbergraph_BP_CasterImp_BlinkReappear_VisualEntity");
static_assert(offsetof(BP_CasterImp_BlinkReappear_VisualEntity_C_ExecuteUbergraph_BP_CasterImp_BlinkReappear_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_CasterImp_BlinkReappear_VisualEntity_C_ExecuteUbergraph_BP_CasterImp_BlinkReappear_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CasterImp_BlinkReappear_VisualEntity_C_ExecuteUbergraph_BP_CasterImp_BlinkReappear_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_CasterImp_BlinkReappear_VisualEntity_C_ExecuteUbergraph_BP_CasterImp_BlinkReappear_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CasterImp_BlinkReappear_VisualEntity_C_ExecuteUbergraph_BP_CasterImp_BlinkReappear_VisualEntity, K2Node_DynamicCast_AsBP_Caster_Imp) == 0x000010, "Member 'BP_CasterImp_BlinkReappear_VisualEntity_C_ExecuteUbergraph_BP_CasterImp_BlinkReappear_VisualEntity::K2Node_DynamicCast_AsBP_Caster_Imp' has a wrong offset!");
static_assert(offsetof(BP_CasterImp_BlinkReappear_VisualEntity_C_ExecuteUbergraph_BP_CasterImp_BlinkReappear_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_CasterImp_BlinkReappear_VisualEntity_C_ExecuteUbergraph_BP_CasterImp_BlinkReappear_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

