#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosBeamStart_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ChaosBeamStart_VisualEntity.BP_ChaosBeamStart_VisualEntity_C
// 0x0030 (0x0380 - 0x0350)
class ABP_ChaosBeamStart_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      BurningTick;                                       // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Start;                                             // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ChaosBeam_ActiveAbility_C*          BeamAbilityInstance;                               // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      ActiveNiagara;                                     // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity(int32 EntryPoint);
	void EventOnCustomEvent_Event_0(class FName CustomName);
	void OnKill();
	void VisualEntityConstructionFinished();
	void ReceiveTick(float DeltaSeconds);
	void ChooseNiagareSystem(class AActor* InHitActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ChaosBeamStart_VisualEntity_C">();
	}
	static class ABP_ChaosBeamStart_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ChaosBeamStart_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_ChaosBeamStart_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_ChaosBeamStart_VisualEntity_C");
static_assert(sizeof(ABP_ChaosBeamStart_VisualEntity_C) == 0x000380, "Wrong size on ABP_ChaosBeamStart_VisualEntity_C");
static_assert(offsetof(ABP_ChaosBeamStart_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_ChaosBeamStart_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ChaosBeamStart_VisualEntity_C, BurningTick) == 0x000358, "Member 'ABP_ChaosBeamStart_VisualEntity_C::BurningTick' has a wrong offset!");
static_assert(offsetof(ABP_ChaosBeamStart_VisualEntity_C, Arrow) == 0x000360, "Member 'ABP_ChaosBeamStart_VisualEntity_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_ChaosBeamStart_VisualEntity_C, Start) == 0x000368, "Member 'ABP_ChaosBeamStart_VisualEntity_C::Start' has a wrong offset!");
static_assert(offsetof(ABP_ChaosBeamStart_VisualEntity_C, BeamAbilityInstance) == 0x000370, "Member 'ABP_ChaosBeamStart_VisualEntity_C::BeamAbilityInstance' has a wrong offset!");
static_assert(offsetof(ABP_ChaosBeamStart_VisualEntity_C, ActiveNiagara) == 0x000378, "Member 'ABP_ChaosBeamStart_VisualEntity_C::ActiveNiagara' has a wrong offset!");

}

