#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Crow_Trigger

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Crow_Trigger.BP_Crow_Trigger_C.ExecuteUbergraph_BP_Crow_Trigger
// 0x0090 (0x0090 - 0x0000)
struct BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Crow_C*                             CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger) == 0x000008, "Wrong alignment on BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger");
static_assert(sizeof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger) == 0x000090, "Wrong size on BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, EntryPoint) == 0x000000, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, CallFunc_Add_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, CallFunc_RandomFloatInRange_ReturnValue) == 0x000014, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, Temp_bool_IsClosed_Variable) == 0x00001C, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, Temp_bool_Has_Been_Initd_Variable) == 0x00001D, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, K2Node_Event_OtherActor) == 0x000020, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000028, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000030, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x00003C, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, CallFunc_BreakVector_X) == 0x000048, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, CallFunc_BreakVector_Y) == 0x00004C, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, CallFunc_BreakVector_Z) == 0x000050, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, CallFunc_BreakVector_X_1) == 0x000054, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, CallFunc_BreakVector_Y_1) == 0x000058, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, CallFunc_BreakVector_Z_1) == 0x00005C, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000060, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000061, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, CallFunc_Array_Get_Item) == 0x000068, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, CallFunc_IsValid_ReturnValue) == 0x000074, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, CallFunc_Less_IntInt_ReturnValue) == 0x000075, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000078, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00007C, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000080, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000084, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000088, "Member 'BP_Crow_Trigger_C_ExecuteUbergraph_BP_Crow_Trigger::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");

// Function BP_Crow_Trigger.BP_Crow_Trigger_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_Crow_Trigger_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Crow_Trigger_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_Crow_Trigger_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_Crow_Trigger_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_Crow_Trigger_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_Crow_Trigger_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_Crow_Trigger_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

}

