#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CraftSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_CraftSlot.BP_CraftSlot_C
// 0x0160 (0x0478 - 0x0318)
class UBP_CraftSlot_C final : public UVendorCraftSlotUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ErrorAnim;                                         // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideNewItemIcon;                                   // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowNewItemIcon;                                   // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       EquipStateAnim;                                    // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SelectAnim;                                        // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                ButtonFrame;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CaptionCapacity;                                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CaptionQuantity;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CaptionSlash;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Category;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         CountBox;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CraftableCount;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EquippedIcon;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Active;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Bg;                                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_EquipState;                                  // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Highlight;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Hovered;                                     // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Normal;                                      // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Select;                                      // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Selected;                                    // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconImage;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               IconOverlay;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               IndicatorSlot;                                     // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NewItemIcon;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Requirement;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_1;                                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnHovered;                                         // 0x0410(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUnhovered;                                       // 0x0420(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnReleased;                                        // 0x0430(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnPressed;                                         // 0x0440(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsActive;                                          // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnUnfocus;                                         // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UMaterialInstanceDynamic*               MaterialInstanceDynamic;                           // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSoldItem;                                        // 0x0470(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_CraftSlot(int32 EntryPoint);
	void OnHighlighted(bool bHighlighted, bool bAnimate);
	void OnSetMaxCraftableNum(const class FText& InMaxCraftableNum, bool bInIsUnavailable);
	void OnSetItemType(const class FText& InItemType);
	void OnSetItemRequirements(const class FText& InItemRequirements);
	void OnToggleEmptySlot(bool bInEmptySlot, EItemSlot InSlotType);
	void OnTemporaryEnchantIconsChanged(const TArray<class UTexture2D*>& InTemporaryEnchantIcons);
	void OnPermanentEnchantIconsChanged(const TArray<class UTexture2D*>& InPermanentEnchantIcons);
	void OnUnfocused(bool bAnimate);
	void OnFocused(bool bAnimate);
	void OnToggleSoldItem(bool bInSoldItem);
	void OnInitialized();
	void OnStackNumChanged(int32 InStackNum, int32 InMaxStackNum, bool bInIsStackable);
	void OnToggleEquipped(bool bInIsEquipped);
	void OnSetCountdown(float ElapsedCooldownPercent, const class FText& TimeLeft);
	void OnToggleNewItemWarning(bool bInVisible, bool bInAnimate);
	void OnSetEquipState(bool bEquipState);
	void OnPlayFocusedAnim();
	void OnToggleUnavailable(bool bUnavailable, bool bUnavailableByResource);
	void Construct();
	void OnSetSlot(class UManItemSlotBase* InManItemSlotBase, class UItemAbility* InItemAbility);
	void OnToggleSelected(bool bSelected);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void SetActive();
	void SetInactive();
	void Set_Slot(class UItemAbility* InItemAbility);
	void SetCount(int32 Quantity, int32 CAPACITY, bool Stackable);
	void UpdateDetailsView();
	void ToggleEquipped(bool Equipped);
	void ToggleSelected(bool Selected);
	void ToggleCanEquipped(bool CanEquipped);
	void ToggleUnavailable(bool Unavailable, bool UnavailableByResource);
	void ToggleNewItemWarning(bool InVisible, bool InAnimate);
	void SetCountdown(float PercentLeft, const class FText& TimeLeft);
	void ToggleSoldItem(bool InSoldItem);
	void Toggle_Empty(bool InIsEmpty, EItemSlot InItemSlotType);
	void ErrorHighlight();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CraftSlot_C">();
	}
	static class UBP_CraftSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CraftSlot_C>();
	}
};
static_assert(alignof(UBP_CraftSlot_C) == 0x000008, "Wrong alignment on UBP_CraftSlot_C");
static_assert(sizeof(UBP_CraftSlot_C) == 0x000478, "Wrong size on UBP_CraftSlot_C");
static_assert(offsetof(UBP_CraftSlot_C, UberGraphFrame) == 0x000318, "Member 'UBP_CraftSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, ErrorAnim) == 0x000320, "Member 'UBP_CraftSlot_C::ErrorAnim' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, HoverAnim) == 0x000328, "Member 'UBP_CraftSlot_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, HideNewItemIcon) == 0x000330, "Member 'UBP_CraftSlot_C::HideNewItemIcon' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, ShowNewItemIcon) == 0x000338, "Member 'UBP_CraftSlot_C::ShowNewItemIcon' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, EquipStateAnim) == 0x000340, "Member 'UBP_CraftSlot_C::EquipStateAnim' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, SelectAnim) == 0x000348, "Member 'UBP_CraftSlot_C::SelectAnim' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, ButtonFrame) == 0x000350, "Member 'UBP_CraftSlot_C::ButtonFrame' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, CaptionCapacity) == 0x000358, "Member 'UBP_CraftSlot_C::CaptionCapacity' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, CaptionQuantity) == 0x000360, "Member 'UBP_CraftSlot_C::CaptionQuantity' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, CaptionSlash) == 0x000368, "Member 'UBP_CraftSlot_C::CaptionSlash' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, Category) == 0x000370, "Member 'UBP_CraftSlot_C::Category' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, CountBox) == 0x000378, "Member 'UBP_CraftSlot_C::CountBox' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, CraftableCount) == 0x000380, "Member 'UBP_CraftSlot_C::CraftableCount' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, EquippedIcon) == 0x000388, "Member 'UBP_CraftSlot_C::EquippedIcon' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, Frame_Active) == 0x000390, "Member 'UBP_CraftSlot_C::Frame_Active' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, Frame_Bg) == 0x000398, "Member 'UBP_CraftSlot_C::Frame_Bg' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, Frame_EquipState) == 0x0003A0, "Member 'UBP_CraftSlot_C::Frame_EquipState' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, Frame_Highlight) == 0x0003A8, "Member 'UBP_CraftSlot_C::Frame_Highlight' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, Frame_Hovered) == 0x0003B0, "Member 'UBP_CraftSlot_C::Frame_Hovered' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, Frame_Normal) == 0x0003B8, "Member 'UBP_CraftSlot_C::Frame_Normal' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, Frame_Select) == 0x0003C0, "Member 'UBP_CraftSlot_C::Frame_Select' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, Frame_Selected) == 0x0003C8, "Member 'UBP_CraftSlot_C::Frame_Selected' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, IconImage) == 0x0003D0, "Member 'UBP_CraftSlot_C::IconImage' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, IconOverlay) == 0x0003D8, "Member 'UBP_CraftSlot_C::IconOverlay' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, IndicatorSlot) == 0x0003E0, "Member 'UBP_CraftSlot_C::IndicatorSlot' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, Name_0) == 0x0003E8, "Member 'UBP_CraftSlot_C::Name_0' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, NewItemIcon) == 0x0003F0, "Member 'UBP_CraftSlot_C::NewItemIcon' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, Overlay_0) == 0x0003F8, "Member 'UBP_CraftSlot_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, Requirement) == 0x000400, "Member 'UBP_CraftSlot_C::Requirement' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, ScaleBox_1) == 0x000408, "Member 'UBP_CraftSlot_C::ScaleBox_1' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, OnHovered) == 0x000410, "Member 'UBP_CraftSlot_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, OnUnhovered) == 0x000420, "Member 'UBP_CraftSlot_C::OnUnhovered' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, OnReleased) == 0x000430, "Member 'UBP_CraftSlot_C::OnReleased' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, OnPressed) == 0x000440, "Member 'UBP_CraftSlot_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, IsActive) == 0x000450, "Member 'UBP_CraftSlot_C::IsActive' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, OnUnfocus) == 0x000458, "Member 'UBP_CraftSlot_C::OnUnfocus' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, MaterialInstanceDynamic) == 0x000468, "Member 'UBP_CraftSlot_C::MaterialInstanceDynamic' has a wrong offset!");
static_assert(offsetof(UBP_CraftSlot_C, IsSoldItem) == 0x000470, "Member 'UBP_CraftSlot_C::IsSoldItem' has a wrong offset!");

}

