#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosSparksIdleVisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ChaosSparksIdleVisualEntity.BP_ChaosSparksIdleVisualEntity_C
// 0x0020 (0x0370 - 0x0350)
class ABP_ChaosSparksIdleVisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      IdleTimeoutPuck;                                   // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Idle;                                              // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          SparkMoveRequest;                                  // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_ChaosSparksIdleVisualEntity(int32 EntryPoint);
	void VisualEntityConstructionFinished();
	void OnKill();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ChaosSparksIdleVisualEntity_C">();
	}
	static class ABP_ChaosSparksIdleVisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ChaosSparksIdleVisualEntity_C>();
	}
};
static_assert(alignof(ABP_ChaosSparksIdleVisualEntity_C) == 0x000008, "Wrong alignment on ABP_ChaosSparksIdleVisualEntity_C");
static_assert(sizeof(ABP_ChaosSparksIdleVisualEntity_C) == 0x000370, "Wrong size on ABP_ChaosSparksIdleVisualEntity_C");
static_assert(offsetof(ABP_ChaosSparksIdleVisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_ChaosSparksIdleVisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ChaosSparksIdleVisualEntity_C, IdleTimeoutPuck) == 0x000358, "Member 'ABP_ChaosSparksIdleVisualEntity_C::IdleTimeoutPuck' has a wrong offset!");
static_assert(offsetof(ABP_ChaosSparksIdleVisualEntity_C, Idle) == 0x000360, "Member 'ABP_ChaosSparksIdleVisualEntity_C::Idle' has a wrong offset!");
static_assert(offsetof(ABP_ChaosSparksIdleVisualEntity_C, SparkMoveRequest) == 0x000368, "Member 'ABP_ChaosSparksIdleVisualEntity_C::SparkMoveRequest' has a wrong offset!");

}

