#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ConsecrationActor

#include "Basic.hpp"

#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ConsecrationActor.BP_ConsecrationActor_C
// 0x0020 (0x07F8 - 0x07D8)
class ABP_ConsecrationActor_C final : public AActorBase
{
public:
	class USceneComponent*                        VFXPos;                                            // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                HitBox;                                            // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SignedSummonIndex;                                 // 0x07F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ConsecrationActor_C">();
	}
	static class ABP_ConsecrationActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ConsecrationActor_C>();
	}
};
static_assert(alignof(ABP_ConsecrationActor_C) == 0x000008, "Wrong alignment on ABP_ConsecrationActor_C");
static_assert(sizeof(ABP_ConsecrationActor_C) == 0x0007F8, "Wrong size on ABP_ConsecrationActor_C");
static_assert(offsetof(ABP_ConsecrationActor_C, VFXPos) == 0x0007D8, "Member 'ABP_ConsecrationActor_C::VFXPos' has a wrong offset!");
static_assert(offsetof(ABP_ConsecrationActor_C, HitBox) == 0x0007E0, "Member 'ABP_ConsecrationActor_C::HitBox' has a wrong offset!");
static_assert(offsetof(ABP_ConsecrationActor_C, DefaultSceneRoot) == 0x0007E8, "Member 'ABP_ConsecrationActor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ConsecrationActor_C, SignedSummonIndex) == 0x0007F0, "Member 'ABP_ConsecrationActor_C::SignedSummonIndex' has a wrong offset!");

}

