#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CasterImp_AbilityController

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_CasterImp_AbilityController.BP_CasterImp_AbilityController_C.ExecuteUbergraph_BP_CasterImp_AbilityController
// 0x0050 (0x0050 - 0x0000)
struct BP_CasterImp_AbilityController_C_ExecuteUbergraph_BP_CasterImp_AbilityController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEnemyCharacter*                        K2Node_DynamicCast_AsEnemy_Character;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float preHealth, float postHealth)> K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x002C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_preHealth;                      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_postHealth;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CasterImp_AbilityController_C_ExecuteUbergraph_BP_CasterImp_AbilityController) == 0x000008, "Wrong alignment on BP_CasterImp_AbilityController_C_ExecuteUbergraph_BP_CasterImp_AbilityController");
static_assert(sizeof(BP_CasterImp_AbilityController_C_ExecuteUbergraph_BP_CasterImp_AbilityController) == 0x000050, "Wrong size on BP_CasterImp_AbilityController_C_ExecuteUbergraph_BP_CasterImp_AbilityController");
static_assert(offsetof(BP_CasterImp_AbilityController_C_ExecuteUbergraph_BP_CasterImp_AbilityController, EntryPoint) == 0x000000, "Member 'BP_CasterImp_AbilityController_C_ExecuteUbergraph_BP_CasterImp_AbilityController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CasterImp_AbilityController_C_ExecuteUbergraph_BP_CasterImp_AbilityController, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_CasterImp_AbilityController_C_ExecuteUbergraph_BP_CasterImp_AbilityController::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CasterImp_AbilityController_C_ExecuteUbergraph_BP_CasterImp_AbilityController, K2Node_DynamicCast_AsEnemy_Character) == 0x000010, "Member 'BP_CasterImp_AbilityController_C_ExecuteUbergraph_BP_CasterImp_AbilityController::K2Node_DynamicCast_AsEnemy_Character' has a wrong offset!");
static_assert(offsetof(BP_CasterImp_AbilityController_C_ExecuteUbergraph_BP_CasterImp_AbilityController, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_CasterImp_AbilityController_C_ExecuteUbergraph_BP_CasterImp_AbilityController::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CasterImp_AbilityController_C_ExecuteUbergraph_BP_CasterImp_AbilityController, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BP_CasterImp_AbilityController_C_ExecuteUbergraph_BP_CasterImp_AbilityController::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CasterImp_AbilityController_C_ExecuteUbergraph_BP_CasterImp_AbilityController, Temp_delegate_Variable) == 0x00002C, "Member 'BP_CasterImp_AbilityController_C_ExecuteUbergraph_BP_CasterImp_AbilityController::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_CasterImp_AbilityController_C_ExecuteUbergraph_BP_CasterImp_AbilityController, CallFunc_PostAkEvent_ReturnValue) == 0x00003C, "Member 'BP_CasterImp_AbilityController_C_ExecuteUbergraph_BP_CasterImp_AbilityController::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CasterImp_AbilityController_C_ExecuteUbergraph_BP_CasterImp_AbilityController, K2Node_CustomEvent_preHealth) == 0x000040, "Member 'BP_CasterImp_AbilityController_C_ExecuteUbergraph_BP_CasterImp_AbilityController::K2Node_CustomEvent_preHealth' has a wrong offset!");
static_assert(offsetof(BP_CasterImp_AbilityController_C_ExecuteUbergraph_BP_CasterImp_AbilityController, K2Node_CustomEvent_postHealth) == 0x000044, "Member 'BP_CasterImp_AbilityController_C_ExecuteUbergraph_BP_CasterImp_AbilityController::K2Node_CustomEvent_postHealth' has a wrong offset!");
static_assert(offsetof(BP_CasterImp_AbilityController_C_ExecuteUbergraph_BP_CasterImp_AbilityController, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000048, "Member 'BP_CasterImp_AbilityController_C_ExecuteUbergraph_BP_CasterImp_AbilityController::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_CasterImp_AbilityController.BP_CasterImp_AbilityController_C.OnHealthChangedEvent_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BP_CasterImp_AbilityController_C_OnHealthChangedEvent_Event_0 final
{
public:
	float                                         preHealth;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         postHealth;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CasterImp_AbilityController_C_OnHealthChangedEvent_Event_0) == 0x000004, "Wrong alignment on BP_CasterImp_AbilityController_C_OnHealthChangedEvent_Event_0");
static_assert(sizeof(BP_CasterImp_AbilityController_C_OnHealthChangedEvent_Event_0) == 0x000008, "Wrong size on BP_CasterImp_AbilityController_C_OnHealthChangedEvent_Event_0");
static_assert(offsetof(BP_CasterImp_AbilityController_C_OnHealthChangedEvent_Event_0, preHealth) == 0x000000, "Member 'BP_CasterImp_AbilityController_C_OnHealthChangedEvent_Event_0::preHealth' has a wrong offset!");
static_assert(offsetof(BP_CasterImp_AbilityController_C_OnHealthChangedEvent_Event_0, postHealth) == 0x000004, "Member 'BP_CasterImp_AbilityController_C_OnHealthChangedEvent_Event_0::postHealth' has a wrong offset!");

}

