#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CopperPlate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_CopperPlate.BP_CopperPlate_C.ExecuteUbergraph_BP_CopperPlate
// 0x0088 (0x0088 - 0x0000)
struct BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInfoScreentDataAsset*                  K2Node_Event_InInfoScreenData;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_AnimDuration_1;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_AnimDuration;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue_1;       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0048(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate) == 0x000008, "Wrong alignment on BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate");
static_assert(sizeof(BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate) == 0x000088, "Wrong size on BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate");
static_assert(offsetof(BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate, EntryPoint) == 0x000000, "Member 'BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate, K2Node_Event_InInfoScreenData) == 0x000008, "Member 'BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate::K2Node_Event_InInfoScreenData' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate, K2Node_Event_IsDesignTime) == 0x000010, "Member 'BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate, K2Node_Event_AnimDuration_1) == 0x000014, "Member 'BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate::K2Node_Event_AnimDuration_1' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate, CallFunc_GetAnimPlaybackSpeed_ReturnValue) == 0x000018, "Member 'BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate::CallFunc_GetAnimPlaybackSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate, K2Node_Event_AnimDuration) == 0x000038, "Member 'BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate::K2Node_Event_AnimDuration' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate, CallFunc_GetAnimPlaybackSpeed_ReturnValue_1) == 0x00003C, "Member 'BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate::CallFunc_GetAnimPlaybackSpeed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate, CallFunc_PlayAnimation_ReturnValue_1) == 0x000040, "Member 'BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate, K2Node_Event_MyGeometry) == 0x000048, "Member 'BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate, K2Node_Event_InDeltaTime) == 0x000080, "Member 'BP_CopperPlate_C_ExecuteUbergraph_BP_CopperPlate::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function BP_CopperPlate.BP_CopperPlate_C.OnSetData
// 0x0008 (0x0008 - 0x0000)
struct BP_CopperPlate_C_OnSetData final
{
public:
	class UInfoScreentDataAsset*                  InInfoScreenData;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CopperPlate_C_OnSetData) == 0x000008, "Wrong alignment on BP_CopperPlate_C_OnSetData");
static_assert(sizeof(BP_CopperPlate_C_OnSetData) == 0x000008, "Wrong size on BP_CopperPlate_C_OnSetData");
static_assert(offsetof(BP_CopperPlate_C_OnSetData, InInfoScreenData) == 0x000000, "Member 'BP_CopperPlate_C_OnSetData::InInfoScreenData' has a wrong offset!");

// Function BP_CopperPlate.BP_CopperPlate_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_CopperPlate_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CopperPlate_C_Tick) == 0x000004, "Wrong alignment on BP_CopperPlate_C_Tick");
static_assert(sizeof(BP_CopperPlate_C_Tick) == 0x00003C, "Wrong size on BP_CopperPlate_C_Tick");
static_assert(offsetof(BP_CopperPlate_C_Tick, MyGeometry) == 0x000000, "Member 'BP_CopperPlate_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_CopperPlate_C_Tick::InDeltaTime' has a wrong offset!");

// Function BP_CopperPlate.BP_CopperPlate_C.OnHide
// 0x0004 (0x0004 - 0x0000)
struct BP_CopperPlate_C_OnHide final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CopperPlate_C_OnHide) == 0x000004, "Wrong alignment on BP_CopperPlate_C_OnHide");
static_assert(sizeof(BP_CopperPlate_C_OnHide) == 0x000004, "Wrong size on BP_CopperPlate_C_OnHide");
static_assert(offsetof(BP_CopperPlate_C_OnHide, AnimDuration) == 0x000000, "Member 'BP_CopperPlate_C_OnHide::AnimDuration' has a wrong offset!");

// Function BP_CopperPlate.BP_CopperPlate_C.OnShow
// 0x0004 (0x0004 - 0x0000)
struct BP_CopperPlate_C_OnShow final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CopperPlate_C_OnShow) == 0x000004, "Wrong alignment on BP_CopperPlate_C_OnShow");
static_assert(sizeof(BP_CopperPlate_C_OnShow) == 0x000004, "Wrong size on BP_CopperPlate_C_OnShow");
static_assert(offsetof(BP_CopperPlate_C_OnShow, AnimDuration) == 0x000000, "Member 'BP_CopperPlate_C_OnShow::AnimDuration' has a wrong offset!");

// Function BP_CopperPlate.BP_CopperPlate_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_CopperPlate_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CopperPlate_C_PreConstruct) == 0x000001, "Wrong alignment on BP_CopperPlate_C_PreConstruct");
static_assert(sizeof(BP_CopperPlate_C_PreConstruct) == 0x000001, "Wrong size on BP_CopperPlate_C_PreConstruct");
static_assert(offsetof(BP_CopperPlate_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_CopperPlate_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_CopperPlate.BP_CopperPlate_C.Init
// 0x0030 (0x0030 - 0x0000)
struct BP_CopperPlate_C_Init final
{
public:
	class UInfoScreentDataAsset*                  InInfoScreenData;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue;               // 0x0020(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_CopperPlate_C_Init) == 0x000008, "Wrong alignment on BP_CopperPlate_C_Init");
static_assert(sizeof(BP_CopperPlate_C_Init) == 0x000030, "Wrong size on BP_CopperPlate_C_Init");
static_assert(offsetof(BP_CopperPlate_C_Init, InInfoScreenData) == 0x000000, "Member 'BP_CopperPlate_C_Init::InInfoScreenData' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_Init, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_CopperPlate_C_Init::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_Init, CallFunc_Conv_TextToString_ReturnValue) == 0x000010, "Member 'BP_CopperPlate_C_Init::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_Init, CallFunc_ParseIntoArray_ReturnValue) == 0x000020, "Member 'BP_CopperPlate_C_Init::CallFunc_ParseIntoArray_ReturnValue' has a wrong offset!");

// Function BP_CopperPlate.BP_CopperPlate_C.FadeInText
// 0x0020 (0x0020 - 0x0000)
struct BP_CopperPlate_C_FadeInText final
{
public:
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CopperPlate_C_FadeInText) == 0x000008, "Wrong alignment on BP_CopperPlate_C_FadeInText");
static_assert(sizeof(BP_CopperPlate_C_FadeInText) == 0x000020, "Wrong size on BP_CopperPlate_C_FadeInText");
static_assert(offsetof(BP_CopperPlate_C_FadeInText, CallFunc_K2_SetTimer_ReturnValue) == 0x000000, "Member 'BP_CopperPlate_C_FadeInText::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_FadeInText, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'BP_CopperPlate_C_FadeInText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_FadeInText, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'BP_CopperPlate_C_FadeInText::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_FadeInText, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'BP_CopperPlate_C_FadeInText::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_FadeInText, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'BP_CopperPlate_C_FadeInText::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_CopperPlate.BP_CopperPlate_C.FadeOutText
// 0x0020 (0x0020 - 0x0000)
struct BP_CopperPlate_C_FadeOutText final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CopperPlate_C_FadeOutText) == 0x000008, "Wrong alignment on BP_CopperPlate_C_FadeOutText");
static_assert(sizeof(BP_CopperPlate_C_FadeOutText) == 0x000020, "Wrong size on BP_CopperPlate_C_FadeOutText");
static_assert(offsetof(BP_CopperPlate_C_FadeOutText, Temp_int_Variable) == 0x000000, "Member 'BP_CopperPlate_C_FadeOutText::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_FadeOutText, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_CopperPlate_C_FadeOutText::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_FadeOutText, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_CopperPlate_C_FadeOutText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_FadeOutText, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'BP_CopperPlate_C_FadeOutText::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BP_CopperPlate.BP_CopperPlate_C.SetCaptionText
// 0x0050 (0x0050 - 0x0000)
struct BP_CopperPlate_C_SetCaptionText final
{
public:
	int32                                         InCaptionIndex;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0008(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
};
static_assert(alignof(BP_CopperPlate_C_SetCaptionText) == 0x000008, "Wrong alignment on BP_CopperPlate_C_SetCaptionText");
static_assert(sizeof(BP_CopperPlate_C_SetCaptionText) == 0x000050, "Wrong size on BP_CopperPlate_C_SetCaptionText");
static_assert(offsetof(BP_CopperPlate_C_SetCaptionText, InCaptionIndex) == 0x000000, "Member 'BP_CopperPlate_C_SetCaptionText::InCaptionIndex' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_SetCaptionText, CallFunc_GetEmptyText_ReturnValue) == 0x000008, "Member 'BP_CopperPlate_C_SetCaptionText::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_SetCaptionText, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_CopperPlate_C_SetCaptionText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_SetCaptionText, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'BP_CopperPlate_C_SetCaptionText::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_SetCaptionText, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_CopperPlate_C_SetCaptionText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CopperPlate_C_SetCaptionText, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'BP_CopperPlate_C_SetCaptionText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

