#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CorruptedWisp_Beam_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CorruptedWisp_Beam_VisualEntity.BP_CorruptedWisp_Beam_VisualEntity_C
// 0x0050 (0x03A0 - 0x0350)
class ABP_CorruptedWisp_Beam_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_CorruptedWisp_BeamExtra;                        // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      UNLUCKY;                                           // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BackwardBeamStart;                                 // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      ForwardBeamStart;                                  // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BackwardBeam;                                      // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      ForwardBeam;                                       // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBeamAbility*                           BeamAbility;                                       // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         OwnerChar;                                         // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Killed;                                            // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_CorruptedWisp_Beam_VisualEntity(int32 EntryPoint);
	void StopHitSound();
	void PlayHitSound();
	void OnKill();
	void ReceiveTick(float DeltaSeconds);
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CorruptedWisp_Beam_VisualEntity_C">();
	}
	static class ABP_CorruptedWisp_Beam_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CorruptedWisp_Beam_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_CorruptedWisp_Beam_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_CorruptedWisp_Beam_VisualEntity_C");
static_assert(sizeof(ABP_CorruptedWisp_Beam_VisualEntity_C) == 0x0003A0, "Wrong size on ABP_CorruptedWisp_Beam_VisualEntity_C");
static_assert(offsetof(ABP_CorruptedWisp_Beam_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_CorruptedWisp_Beam_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CorruptedWisp_Beam_VisualEntity_C, NS_CorruptedWisp_BeamExtra) == 0x000358, "Member 'ABP_CorruptedWisp_Beam_VisualEntity_C::NS_CorruptedWisp_BeamExtra' has a wrong offset!");
static_assert(offsetof(ABP_CorruptedWisp_Beam_VisualEntity_C, UNLUCKY) == 0x000360, "Member 'ABP_CorruptedWisp_Beam_VisualEntity_C::UNLUCKY' has a wrong offset!");
static_assert(offsetof(ABP_CorruptedWisp_Beam_VisualEntity_C, BackwardBeamStart) == 0x000368, "Member 'ABP_CorruptedWisp_Beam_VisualEntity_C::BackwardBeamStart' has a wrong offset!");
static_assert(offsetof(ABP_CorruptedWisp_Beam_VisualEntity_C, ForwardBeamStart) == 0x000370, "Member 'ABP_CorruptedWisp_Beam_VisualEntity_C::ForwardBeamStart' has a wrong offset!");
static_assert(offsetof(ABP_CorruptedWisp_Beam_VisualEntity_C, BackwardBeam) == 0x000378, "Member 'ABP_CorruptedWisp_Beam_VisualEntity_C::BackwardBeam' has a wrong offset!");
static_assert(offsetof(ABP_CorruptedWisp_Beam_VisualEntity_C, ForwardBeam) == 0x000380, "Member 'ABP_CorruptedWisp_Beam_VisualEntity_C::ForwardBeam' has a wrong offset!");
static_assert(offsetof(ABP_CorruptedWisp_Beam_VisualEntity_C, BeamAbility) == 0x000388, "Member 'ABP_CorruptedWisp_Beam_VisualEntity_C::BeamAbility' has a wrong offset!");
static_assert(offsetof(ABP_CorruptedWisp_Beam_VisualEntity_C, OwnerChar) == 0x000390, "Member 'ABP_CorruptedWisp_Beam_VisualEntity_C::OwnerChar' has a wrong offset!");
static_assert(offsetof(ABP_CorruptedWisp_Beam_VisualEntity_C, Killed) == 0x000398, "Member 'ABP_CorruptedWisp_Beam_VisualEntity_C::Killed' has a wrong offset!");

}

