#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Credits

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Credits.BP_Credits_C
// 0x0060 (0x0550 - 0x04F0)
class UBP_Credits_C final : public UCreditsUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutContentAnim;                                // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInContentAnim;                                 // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                BottomScreenFrame;                                 // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyHoldX;                                    // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CreditsVerticalBox;                                // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManScrollBox*                          TextScrollBox;                                     // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         TextTopOffest;                                     // 0x0540(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScrollEndOffset;                                   // 0x0544(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayOnShowAnim;                                    // 0x0548(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          BPCloseRequest;                                    // 0x0549(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PlayOnCloseAnim;                                   // 0x054A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Credits(int32 EntryPoint);
	void OnHideFinished();
	void OnStopMainMenuMusic();
	void OnPlayMainMenuMusic();
	void OnStopCreditsMusic();
	void OnPlayCreditsMusic();
	void OnShowFinished();
	void OnHoldFinished(class UInteractButtonUserWidget* InteractButtonUserWidget);
	void OnGamepadDPadUpEvent();
	void OnGamepadRightStickUpEvent();
	void OnGamepadLeftStickUpEvent();
	void OnGamepadRightStickDownEvent();
	void OnGamepadDPadDownEvent();
	void OnGamepadLeftStickDownEvent();
	void OnHide(float AnimDuration);
	void OnShow(float AnimDuration);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void Close();
	void FadeOutAnimFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Credits_C">();
	}
	static class UBP_Credits_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Credits_C>();
	}
};
static_assert(alignof(UBP_Credits_C) == 0x000008, "Wrong alignment on UBP_Credits_C");
static_assert(sizeof(UBP_Credits_C) == 0x000550, "Wrong size on UBP_Credits_C");
static_assert(offsetof(UBP_Credits_C, UberGraphFrame) == 0x0004F0, "Member 'UBP_Credits_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Credits_C, FadeOutContentAnim) == 0x0004F8, "Member 'UBP_Credits_C::FadeOutContentAnim' has a wrong offset!");
static_assert(offsetof(UBP_Credits_C, FadeInAnim) == 0x000500, "Member 'UBP_Credits_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_Credits_C, FadeOutAnim) == 0x000508, "Member 'UBP_Credits_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_Credits_C, FadeInContentAnim) == 0x000510, "Member 'UBP_Credits_C::FadeInContentAnim' has a wrong offset!");
static_assert(offsetof(UBP_Credits_C, BottomScreenFrame) == 0x000518, "Member 'UBP_Credits_C::BottomScreenFrame' has a wrong offset!");
static_assert(offsetof(UBP_Credits_C, BtnHotkeyHoldX) == 0x000520, "Member 'UBP_Credits_C::BtnHotkeyHoldX' has a wrong offset!");
static_assert(offsetof(UBP_Credits_C, CanvasPanel_0) == 0x000528, "Member 'UBP_Credits_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UBP_Credits_C, CreditsVerticalBox) == 0x000530, "Member 'UBP_Credits_C::CreditsVerticalBox' has a wrong offset!");
static_assert(offsetof(UBP_Credits_C, TextScrollBox) == 0x000538, "Member 'UBP_Credits_C::TextScrollBox' has a wrong offset!");
static_assert(offsetof(UBP_Credits_C, TextTopOffest) == 0x000540, "Member 'UBP_Credits_C::TextTopOffest' has a wrong offset!");
static_assert(offsetof(UBP_Credits_C, ScrollEndOffset) == 0x000544, "Member 'UBP_Credits_C::ScrollEndOffset' has a wrong offset!");
static_assert(offsetof(UBP_Credits_C, PlayOnShowAnim) == 0x000548, "Member 'UBP_Credits_C::PlayOnShowAnim' has a wrong offset!");
static_assert(offsetof(UBP_Credits_C, BPCloseRequest) == 0x000549, "Member 'UBP_Credits_C::BPCloseRequest' has a wrong offset!");
static_assert(offsetof(UBP_Credits_C, PlayOnCloseAnim) == 0x00054A, "Member 'UBP_Credits_C::PlayOnCloseAnim' has a wrong offset!");

}

