#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChestBaseActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ChestBaseActor.BP_ChestBaseActor_C.ExecuteUbergraph_BP_ChestBaseActor
// 0x0040 (0x0040 - 0x0000)
struct BP_ChestBaseActor_C_ExecuteUbergraph_BP_ChestBaseActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityBase*                           K2Node_CustomEvent_pAbility;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bDesired;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAbilityBase* pAbility, bool bDesired)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ChestBaseActor_C_ExecuteUbergraph_BP_ChestBaseActor) == 0x000008, "Wrong alignment on BP_ChestBaseActor_C_ExecuteUbergraph_BP_ChestBaseActor");
static_assert(sizeof(BP_ChestBaseActor_C_ExecuteUbergraph_BP_ChestBaseActor) == 0x000040, "Wrong size on BP_ChestBaseActor_C_ExecuteUbergraph_BP_ChestBaseActor");
static_assert(offsetof(BP_ChestBaseActor_C_ExecuteUbergraph_BP_ChestBaseActor, EntryPoint) == 0x000000, "Member 'BP_ChestBaseActor_C_ExecuteUbergraph_BP_ChestBaseActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ChestBaseActor_C_ExecuteUbergraph_BP_ChestBaseActor, K2Node_CustomEvent_pAbility) == 0x000008, "Member 'BP_ChestBaseActor_C_ExecuteUbergraph_BP_ChestBaseActor::K2Node_CustomEvent_pAbility' has a wrong offset!");
static_assert(offsetof(BP_ChestBaseActor_C_ExecuteUbergraph_BP_ChestBaseActor, K2Node_CustomEvent_bDesired) == 0x000010, "Member 'BP_ChestBaseActor_C_ExecuteUbergraph_BP_ChestBaseActor::K2Node_CustomEvent_bDesired' has a wrong offset!");
static_assert(offsetof(BP_ChestBaseActor_C_ExecuteUbergraph_BP_ChestBaseActor, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_ChestBaseActor_C_ExecuteUbergraph_BP_ChestBaseActor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ChestBaseActor_C_ExecuteUbergraph_BP_ChestBaseActor, CallFunc_GetObjectClass_ReturnValue) == 0x000028, "Member 'BP_ChestBaseActor_C_ExecuteUbergraph_BP_ChestBaseActor::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChestBaseActor_C_ExecuteUbergraph_BP_ChestBaseActor, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000030, "Member 'BP_ChestBaseActor_C_ExecuteUbergraph_BP_ChestBaseActor::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChestBaseActor_C_ExecuteUbergraph_BP_ChestBaseActor, CallFunc_GetAbilityController_ReturnValue) == 0x000038, "Member 'BP_ChestBaseActor_C_ExecuteUbergraph_BP_ChestBaseActor::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");

// Function BP_ChestBaseActor.BP_ChestBaseActor_C.OnAbilityStarted
// 0x0010 (0x0010 - 0x0000)
struct BP_ChestBaseActor_C_OnAbilityStarted final
{
public:
	class UAbilityBase*                           pAbility;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDesired;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ChestBaseActor_C_OnAbilityStarted) == 0x000008, "Wrong alignment on BP_ChestBaseActor_C_OnAbilityStarted");
static_assert(sizeof(BP_ChestBaseActor_C_OnAbilityStarted) == 0x000010, "Wrong size on BP_ChestBaseActor_C_OnAbilityStarted");
static_assert(offsetof(BP_ChestBaseActor_C_OnAbilityStarted, pAbility) == 0x000000, "Member 'BP_ChestBaseActor_C_OnAbilityStarted::pAbility' has a wrong offset!");
static_assert(offsetof(BP_ChestBaseActor_C_OnAbilityStarted, bDesired) == 0x000008, "Member 'BP_ChestBaseActor_C_OnAbilityStarted::bDesired' has a wrong offset!");

// Function BP_ChestBaseActor.BP_ChestBaseActor_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct BP_ChestBaseActor_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ChestBaseActor_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_ChestBaseActor_C_UserConstructionScript");
static_assert(sizeof(BP_ChestBaseActor_C_UserConstructionScript) == 0x000010, "Wrong size on BP_ChestBaseActor_C_UserConstructionScript");
static_assert(offsetof(BP_ChestBaseActor_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000000, "Member 'BP_ChestBaseActor_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChestBaseActor_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x00000C, "Member 'BP_ChestBaseActor_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChestBaseActor_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x00000D, "Member 'BP_ChestBaseActor_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");

}

