#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Concentration

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Concentration.BP_Concentration_C.ExecuteUbergraph_BP_Concentration
// 0x0018 (0x0018 - 0x0000)
struct BP_Concentration_C_ExecuteUbergraph_BP_Concentration final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Concentration_C_ExecuteUbergraph_BP_Concentration) == 0x000008, "Wrong alignment on BP_Concentration_C_ExecuteUbergraph_BP_Concentration");
static_assert(sizeof(BP_Concentration_C_ExecuteUbergraph_BP_Concentration) == 0x000018, "Wrong size on BP_Concentration_C_ExecuteUbergraph_BP_Concentration");
static_assert(offsetof(BP_Concentration_C_ExecuteUbergraph_BP_Concentration, EntryPoint) == 0x000000, "Member 'BP_Concentration_C_ExecuteUbergraph_BP_Concentration::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Concentration_C_ExecuteUbergraph_BP_Concentration, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'BP_Concentration_C_ExecuteUbergraph_BP_Concentration::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Concentration_C_ExecuteUbergraph_BP_Concentration, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000010, "Member 'BP_Concentration_C_ExecuteUbergraph_BP_Concentration::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

}

