#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosSparksVisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ChaosSparksVisualEntity.BP_ChaosSparksVisualEntity_C
// 0x0018 (0x0368 - 0x0350)
class ABP_ChaosSparksVisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Moving;                                            // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         NewVar_0;                                          // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ChaosSparksVisualEntity(int32 EntryPoint);
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ChaosSparksVisualEntity_C">();
	}
	static class ABP_ChaosSparksVisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ChaosSparksVisualEntity_C>();
	}
};
static_assert(alignof(ABP_ChaosSparksVisualEntity_C) == 0x000008, "Wrong alignment on ABP_ChaosSparksVisualEntity_C");
static_assert(sizeof(ABP_ChaosSparksVisualEntity_C) == 0x000368, "Wrong size on ABP_ChaosSparksVisualEntity_C");
static_assert(offsetof(ABP_ChaosSparksVisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_ChaosSparksVisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ChaosSparksVisualEntity_C, Moving) == 0x000358, "Member 'ABP_ChaosSparksVisualEntity_C::Moving' has a wrong offset!");
static_assert(offsetof(ABP_ChaosSparksVisualEntity_C, NewVar_0) == 0x000360, "Member 'ABP_ChaosSparksVisualEntity_C::NewVar_0' has a wrong offset!");

}

