#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CasterImpFireball_VisualEntity

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_CasterImpFireball_VisualEntity.BP_CasterImpFireball_VisualEntity_C.ExecuteUbergraph_BP_CasterImpFireball_VisualEntity
// 0x0038 (0x0038 - 0x0000)
struct BP_CasterImpFireball_VisualEntity_C_ExecuteUbergraph_BP_CasterImpFireball_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0020(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CasterImpFireball_VisualEntity_C_ExecuteUbergraph_BP_CasterImpFireball_VisualEntity) == 0x000008, "Wrong alignment on BP_CasterImpFireball_VisualEntity_C_ExecuteUbergraph_BP_CasterImpFireball_VisualEntity");
static_assert(sizeof(BP_CasterImpFireball_VisualEntity_C_ExecuteUbergraph_BP_CasterImpFireball_VisualEntity) == 0x000038, "Wrong size on BP_CasterImpFireball_VisualEntity_C_ExecuteUbergraph_BP_CasterImpFireball_VisualEntity");
static_assert(offsetof(BP_CasterImpFireball_VisualEntity_C_ExecuteUbergraph_BP_CasterImpFireball_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_CasterImpFireball_VisualEntity_C_ExecuteUbergraph_BP_CasterImpFireball_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CasterImpFireball_VisualEntity_C_ExecuteUbergraph_BP_CasterImpFireball_VisualEntity, Temp_delegate_Variable) == 0x000004, "Member 'BP_CasterImpFireball_VisualEntity_C_ExecuteUbergraph_BP_CasterImpFireball_VisualEntity::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_CasterImpFireball_VisualEntity_C_ExecuteUbergraph_BP_CasterImpFireball_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_CasterImpFireball_VisualEntity_C_ExecuteUbergraph_BP_CasterImpFireball_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CasterImpFireball_VisualEntity_C_ExecuteUbergraph_BP_CasterImpFireball_VisualEntity, Temp_delegate_Variable_1) == 0x000020, "Member 'BP_CasterImpFireball_VisualEntity_C_ExecuteUbergraph_BP_CasterImpFireball_VisualEntity::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CasterImpFireball_VisualEntity_C_ExecuteUbergraph_BP_CasterImpFireball_VisualEntity, CallFunc_PostEvent_ReturnValue) == 0x000030, "Member 'BP_CasterImpFireball_VisualEntity_C_ExecuteUbergraph_BP_CasterImpFireball_VisualEntity::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CasterImpFireball_VisualEntity_C_ExecuteUbergraph_BP_CasterImpFireball_VisualEntity, CallFunc_PostEvent_ReturnValue_1) == 0x000034, "Member 'BP_CasterImpFireball_VisualEntity_C_ExecuteUbergraph_BP_CasterImpFireball_VisualEntity::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");

}

