#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CrimsonCity_Flag_08

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CrimsonCity_Flag_08.BP_CrimsonCity_Flag_08_C
// 0x0020 (0x0248 - 0x0228)
class ABP_CrimsonCity_Flag_08_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SK_CrimsonCity_Flag_08_VAT1;                       // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SK_CrimsonCity_Flag_08_VAT;                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_CrimsonCity_Flag_08_Tpose;                      // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CrimsonCity_Flag_08_C">();
	}
	static class ABP_CrimsonCity_Flag_08_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CrimsonCity_Flag_08_C>();
	}
};
static_assert(alignof(ABP_CrimsonCity_Flag_08_C) == 0x000008, "Wrong alignment on ABP_CrimsonCity_Flag_08_C");
static_assert(sizeof(ABP_CrimsonCity_Flag_08_C) == 0x000248, "Wrong size on ABP_CrimsonCity_Flag_08_C");
static_assert(offsetof(ABP_CrimsonCity_Flag_08_C, SK_CrimsonCity_Flag_08_VAT1) == 0x000228, "Member 'ABP_CrimsonCity_Flag_08_C::SK_CrimsonCity_Flag_08_VAT1' has a wrong offset!");
static_assert(offsetof(ABP_CrimsonCity_Flag_08_C, SK_CrimsonCity_Flag_08_VAT) == 0x000230, "Member 'ABP_CrimsonCity_Flag_08_C::SK_CrimsonCity_Flag_08_VAT' has a wrong offset!");
static_assert(offsetof(ABP_CrimsonCity_Flag_08_C, SK_CrimsonCity_Flag_08_Tpose) == 0x000238, "Member 'ABP_CrimsonCity_Flag_08_C::SK_CrimsonCity_Flag_08_Tpose' has a wrong offset!");
static_assert(offsetof(ABP_CrimsonCity_Flag_08_C, DefaultSceneRoot) == 0x000240, "Member 'ABP_CrimsonCity_Flag_08_C::DefaultSceneRoot' has a wrong offset!");

}

