#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Chest_OnPreInteract

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Chest_OnPreInteract.BP_Chest_OnPreInteract_C.ExecuteUbergraph_BP_Chest_OnPreInteract
// 0x0018 (0x0018 - 0x0000)
struct BP_Chest_OnPreInteract_C_ExecuteUbergraph_BP_Chest_OnPreInteract final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUDUserWidget*                         CallFunc_BPGetHudWidget_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHUDUserWidget*                         CallFunc_BPGetHudWidget_ReturnValue_1;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Chest_OnPreInteract_C_ExecuteUbergraph_BP_Chest_OnPreInteract) == 0x000008, "Wrong alignment on BP_Chest_OnPreInteract_C_ExecuteUbergraph_BP_Chest_OnPreInteract");
static_assert(sizeof(BP_Chest_OnPreInteract_C_ExecuteUbergraph_BP_Chest_OnPreInteract) == 0x000018, "Wrong size on BP_Chest_OnPreInteract_C_ExecuteUbergraph_BP_Chest_OnPreInteract");
static_assert(offsetof(BP_Chest_OnPreInteract_C_ExecuteUbergraph_BP_Chest_OnPreInteract, EntryPoint) == 0x000000, "Member 'BP_Chest_OnPreInteract_C_ExecuteUbergraph_BP_Chest_OnPreInteract::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Chest_OnPreInteract_C_ExecuteUbergraph_BP_Chest_OnPreInteract, CallFunc_BPGetHudWidget_ReturnValue) == 0x000008, "Member 'BP_Chest_OnPreInteract_C_ExecuteUbergraph_BP_Chest_OnPreInteract::CallFunc_BPGetHudWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chest_OnPreInteract_C_ExecuteUbergraph_BP_Chest_OnPreInteract, CallFunc_BPGetHudWidget_ReturnValue_1) == 0x000010, "Member 'BP_Chest_OnPreInteract_C_ExecuteUbergraph_BP_Chest_OnPreInteract::CallFunc_BPGetHudWidget_ReturnValue_1' has a wrong offset!");

}

