#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Collection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Collection.BP_Collection_C
// 0x00E8 (0x05A0 - 0x04B8)
class UBP_Collection_C final : public UCollectionUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CountChangeAnim;                                   // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur_0;                                  // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BottomScreenFrame;                                 // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CloseButton_C*                      BtnClose;                                          // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyB;                                        // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnNextTab;                                        // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnPreviousTab;                                    // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Collection_ItemsHandler_C*          CollectionItemsHandler;                            // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ContentFrame;                                      // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Count;                                             // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Count_Highlight;                                   // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NormalFrame;                                       // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScreenBg2;                                         // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Collection;                                    // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Statistics;                                    // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Tabs;                                              // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Title;                                             // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TitleDecorLeft;                                    // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TitleDecorRight;                                   // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleText;                                         // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TopScreenFrame;                                    // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              BtnCloseClickedEvent;                              // 0x0578(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   NewCount;                                          // 0x0588(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_Collection(int32 EntryPoint);
	void OnSetInputDisplay(EInputDisplay InInputDisplay, EInputDisplay InControlDisplay);
	void BndEvt__BP_Collection_BtnClose_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();
	void BndEvt__BP_Collection_Tab_Statistics_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();
	void BndEvt__BP_Collection_Tab_Collection_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void OnSetCollectionCountText(const class FText& InCollectionCountText, bool bChanged);
	void OnGamepadRBEvent();
	void OnGamepadLBEvent();
	void BndEvt__BtnNextTab_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature();
	void BndEvt__BtnPreviousTab_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature();
	void BndEvt__BP_Glossary_BtnHotkeyB_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();
	void OnHide(float AnimDuration);
	void OnShow(float AnimDuration);
	void OnGamepadBEvent();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BtnHotkeyBClicked();
	void SetBtnCloseVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Collection_C">();
	}
	static class UBP_Collection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Collection_C>();
	}
};
static_assert(alignof(UBP_Collection_C) == 0x000008, "Wrong alignment on UBP_Collection_C");
static_assert(sizeof(UBP_Collection_C) == 0x0005A0, "Wrong size on UBP_Collection_C");
static_assert(offsetof(UBP_Collection_C, UberGraphFrame) == 0x0004B8, "Member 'UBP_Collection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Collection_C, CountChangeAnim) == 0x0004C0, "Member 'UBP_Collection_C::CountChangeAnim' has a wrong offset!");
static_assert(offsetof(UBP_Collection_C, FadeOutAnim) == 0x0004C8, "Member 'UBP_Collection_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_Collection_C, FadeInAnim) == 0x0004D0, "Member 'UBP_Collection_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_Collection_C, BackgroundBlur_0) == 0x0004D8, "Member 'UBP_Collection_C::BackgroundBlur_0' has a wrong offset!");
static_assert(offsetof(UBP_Collection_C, BottomScreenFrame) == 0x0004E0, "Member 'UBP_Collection_C::BottomScreenFrame' has a wrong offset!");
static_assert(offsetof(UBP_Collection_C, BtnClose) == 0x0004E8, "Member 'UBP_Collection_C::BtnClose' has a wrong offset!");
static_assert(offsetof(UBP_Collection_C, BtnHotkeyB) == 0x0004F0, "Member 'UBP_Collection_C::BtnHotkeyB' has a wrong offset!");
static_assert(offsetof(UBP_Collection_C, BtnNextTab) == 0x0004F8, "Member 'UBP_Collection_C::BtnNextTab' has a wrong offset!");
static_assert(offsetof(UBP_Collection_C, BtnPreviousTab) == 0x000500, "Member 'UBP_Collection_C::BtnPreviousTab' has a wrong offset!");
static_assert(offsetof(UBP_Collection_C, CollectionItemsHandler) == 0x000508, "Member 'UBP_Collection_C::CollectionItemsHandler' has a wrong offset!");
static_assert(offsetof(UBP_Collection_C, ContentFrame) == 0x000510, "Member 'UBP_Collection_C::ContentFrame' has a wrong offset!");
static_assert(offsetof(UBP_Collection_C, Count) == 0x000518, "Member 'UBP_Collection_C::Count' has a wrong offset!");
static_assert(offsetof(UBP_Collection_C, Count_Highlight) == 0x000520, "Member 'UBP_Collection_C::Count_Highlight' has a wrong offset!");
static_assert(offsetof(UBP_Collection_C, NormalFrame) == 0x000528, "Member 'UBP_Collection_C::NormalFrame' has a wrong offset!");
static_assert(offsetof(UBP_Collection_C, ScreenBg2) == 0x000530, "Member 'UBP_Collection_C::ScreenBg2' has a wrong offset!");
static_assert(offsetof(UBP_Collection_C, Tab_Collection) == 0x000538, "Member 'UBP_Collection_C::Tab_Collection' has a wrong offset!");
static_assert(offsetof(UBP_Collection_C, Tab_Statistics) == 0x000540, "Member 'UBP_Collection_C::Tab_Statistics' has a wrong offset!");
static_assert(offsetof(UBP_Collection_C, Tabs) == 0x000548, "Member 'UBP_Collection_C::Tabs' has a wrong offset!");
static_assert(offsetof(UBP_Collection_C, Title) == 0x000550, "Member 'UBP_Collection_C::Title' has a wrong offset!");
static_assert(offsetof(UBP_Collection_C, TitleDecorLeft) == 0x000558, "Member 'UBP_Collection_C::TitleDecorLeft' has a wrong offset!");
static_assert(offsetof(UBP_Collection_C, TitleDecorRight) == 0x000560, "Member 'UBP_Collection_C::TitleDecorRight' has a wrong offset!");
static_assert(offsetof(UBP_Collection_C, TitleText) == 0x000568, "Member 'UBP_Collection_C::TitleText' has a wrong offset!");
static_assert(offsetof(UBP_Collection_C, TopScreenFrame) == 0x000570, "Member 'UBP_Collection_C::TopScreenFrame' has a wrong offset!");
static_assert(offsetof(UBP_Collection_C, BtnCloseClickedEvent) == 0x000578, "Member 'UBP_Collection_C::BtnCloseClickedEvent' has a wrong offset!");
static_assert(offsetof(UBP_Collection_C, NewCount) == 0x000588, "Member 'UBP_Collection_C::NewCount' has a wrong offset!");

}

