#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosBeamStart_VisualEntity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ChaosBeamStart_VisualEntity.BP_ChaosBeamStart_VisualEntity_C.ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity
// 0x0278 (0x0278 - 0x0000)
struct BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue_1;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ChaosBeam_ActiveAbility_C*          K2Node_DynamicCast_AsBP_Chaos_Beam_Active_Ability; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BPGetAimAngle_ReturnValue;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastBeamStartPoint_ReturnValue;        // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x008C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0120(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void(class FName CustomName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
	class ACharacterBase*                         CallFunc_GetCharacter_ReturnValue;                 // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_2;        // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BPGetAimAngle_ReturnValue_1;              // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAbilityUpgradeUnlocked_ReturnValue;     // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_1;     // 0x01E4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FName                                   K2Node_CustomEvent_CustomName;                     // 0x026C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity) == 0x000008, "Wrong alignment on BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity");
static_assert(sizeof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity) == 0x000278, "Wrong size on BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_GetAttachParentActor_ReturnValue) == 0x000010, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_GetAttachParentActor_ReturnValue_1) == 0x000020, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_GetAttachParentActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_IsValid_ReturnValue_2) == 0x000028, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, K2Node_DynamicCast_AsCharacter_Base) == 0x000030, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_GetAbilityController_ReturnValue) == 0x000040, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000048, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_IsValid_ReturnValue_3) == 0x000050, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, K2Node_DynamicCast_AsBP_Chaos_Beam_Active_Ability) == 0x000058, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::K2Node_DynamicCast_AsBP_Chaos_Beam_Active_Ability' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_IsValid_ReturnValue_4) == 0x000061, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000068, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000070, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_BPGetAimAngle_ReturnValue) == 0x000078, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_BPGetAimAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_GetLastBeamStartPoint_ReturnValue) == 0x00007C, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_GetLastBeamStartPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000088, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x00008C, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_MakeRotator_ReturnValue) == 0x000114, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000120, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, K2Node_CreateDelegate_OutputDelegate) == 0x0001A8, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_GetCharacter_ReturnValue) == 0x0001B8, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_K2_GetRootComponent_ReturnValue_2) == 0x0001C0, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_K2_GetRootComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_IsValid_ReturnValue_5) == 0x0001C8, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x0001C9, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_BPGetAimAngle_ReturnValue_1) == 0x0001CC, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_BPGetAimAngle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0001D0, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_IsAbilityUpgradeUnlocked_ReturnValue) == 0x0001D4, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_IsAbilityUpgradeUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_MakeRotator_ReturnValue_1) == 0x0001D8, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_K2_SetWorldRotation_SweepHitResult_1) == 0x0001E4, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_K2_SetWorldRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, K2Node_CustomEvent_CustomName) == 0x00026C, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::K2Node_CustomEvent_CustomName' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000274, "Member 'BP_ChaosBeamStart_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamStart_VisualEntity::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function BP_ChaosBeamStart_VisualEntity.BP_ChaosBeamStart_VisualEntity_C.EventOnCustomEvent_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BP_ChaosBeamStart_VisualEntity_C_EventOnCustomEvent_Event_0 final
{
public:
	class FName                                   CustomName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ChaosBeamStart_VisualEntity_C_EventOnCustomEvent_Event_0) == 0x000004, "Wrong alignment on BP_ChaosBeamStart_VisualEntity_C_EventOnCustomEvent_Event_0");
static_assert(sizeof(BP_ChaosBeamStart_VisualEntity_C_EventOnCustomEvent_Event_0) == 0x000008, "Wrong size on BP_ChaosBeamStart_VisualEntity_C_EventOnCustomEvent_Event_0");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_EventOnCustomEvent_Event_0, CustomName) == 0x000000, "Member 'BP_ChaosBeamStart_VisualEntity_C_EventOnCustomEvent_Event_0::CustomName' has a wrong offset!");

// Function BP_ChaosBeamStart_VisualEntity.BP_ChaosBeamStart_VisualEntity_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ChaosBeamStart_VisualEntity_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ChaosBeamStart_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ChaosBeamStart_VisualEntity_C_ReceiveTick");
static_assert(sizeof(BP_ChaosBeamStart_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong size on BP_ChaosBeamStart_VisualEntity_C_ReceiveTick");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ChaosBeamStart_VisualEntity_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ChaosBeamStart_VisualEntity.BP_ChaosBeamStart_VisualEntity_C.ChooseNiagareSystem
// 0x0018 (0x0018 - 0x0000)
struct BP_ChaosBeamStart_VisualEntity_C_ChooseNiagareSystem final
{
public:
	class AActor*                                 InHitActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ChaosBeamStart_VisualEntity_C_ChooseNiagareSystem) == 0x000008, "Wrong alignment on BP_ChaosBeamStart_VisualEntity_C_ChooseNiagareSystem");
static_assert(sizeof(BP_ChaosBeamStart_VisualEntity_C_ChooseNiagareSystem) == 0x000018, "Wrong size on BP_ChaosBeamStart_VisualEntity_C_ChooseNiagareSystem");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ChooseNiagareSystem, InHitActor) == 0x000000, "Member 'BP_ChaosBeamStart_VisualEntity_C_ChooseNiagareSystem::InHitActor' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ChooseNiagareSystem, K2Node_DynamicCast_AsCharacter_Base) == 0x000008, "Member 'BP_ChaosBeamStart_VisualEntity_C_ChooseNiagareSystem::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ChooseNiagareSystem, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_ChaosBeamStart_VisualEntity_C_ChooseNiagareSystem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ChooseNiagareSystem, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_ChaosBeamStart_VisualEntity_C_ChooseNiagareSystem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ChooseNiagareSystem, CallFunc_IsValid_ReturnValue_1) == 0x000012, "Member 'BP_ChaosBeamStart_VisualEntity_C_ChooseNiagareSystem::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ChooseNiagareSystem, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000013, "Member 'BP_ChaosBeamStart_VisualEntity_C_ChooseNiagareSystem::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ChooseNiagareSystem, CallFunc_IsValid_ReturnValue_2) == 0x000014, "Member 'BP_ChaosBeamStart_VisualEntity_C_ChooseNiagareSystem::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ChooseNiagareSystem, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000015, "Member 'BP_ChaosBeamStart_VisualEntity_C_ChooseNiagareSystem::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ChooseNiagareSystem, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x000016, "Member 'BP_ChaosBeamStart_VisualEntity_C_ChooseNiagareSystem::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamStart_VisualEntity_C_ChooseNiagareSystem, CallFunc_IsValid_ReturnValue_3) == 0x000017, "Member 'BP_ChaosBeamStart_VisualEntity_C_ChooseNiagareSystem::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

}

