#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ComboPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ComboPoint.BP_ComboPoint_C
// 0x0040 (0x02A0 - 0x0260)
class UBP_ComboPoint_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FullAnim;                                          // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ExplosionVFX1;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ExplosionVFX2;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ExplosionVFX3;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GlowVFX;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Fraction;                                          // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ComboPoint(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetComboPoint(int32 InFraction);
	void PlayFullAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ComboPoint_C">();
	}
	static class UBP_ComboPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ComboPoint_C>();
	}
};
static_assert(alignof(UBP_ComboPoint_C) == 0x000008, "Wrong alignment on UBP_ComboPoint_C");
static_assert(sizeof(UBP_ComboPoint_C) == 0x0002A0, "Wrong size on UBP_ComboPoint_C");
static_assert(offsetof(UBP_ComboPoint_C, UberGraphFrame) == 0x000260, "Member 'UBP_ComboPoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ComboPoint_C, FullAnim) == 0x000268, "Member 'UBP_ComboPoint_C::FullAnim' has a wrong offset!");
static_assert(offsetof(UBP_ComboPoint_C, ExplosionVFX1) == 0x000270, "Member 'UBP_ComboPoint_C::ExplosionVFX1' has a wrong offset!");
static_assert(offsetof(UBP_ComboPoint_C, ExplosionVFX2) == 0x000278, "Member 'UBP_ComboPoint_C::ExplosionVFX2' has a wrong offset!");
static_assert(offsetof(UBP_ComboPoint_C, ExplosionVFX3) == 0x000280, "Member 'UBP_ComboPoint_C::ExplosionVFX3' has a wrong offset!");
static_assert(offsetof(UBP_ComboPoint_C, GlowVFX) == 0x000288, "Member 'UBP_ComboPoint_C::GlowVFX' has a wrong offset!");
static_assert(offsetof(UBP_ComboPoint_C, Icon) == 0x000290, "Member 'UBP_ComboPoint_C::Icon' has a wrong offset!");
static_assert(offsetof(UBP_ComboPoint_C, Fraction) == 0x000298, "Member 'UBP_ComboPoint_C::Fraction' has a wrong offset!");

}

