#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Crow_Trigger

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Crow_Trigger.BP_Crow_Trigger_C
// 0x0040 (0x0268 - 0x0228)
class ABP_Crow_Trigger_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTriggerBoxComponent*                   TriggerBox;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Crow_C*>                     Affected_Crows;                                    // 0x0238(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, ExposeOnSpawn)
	float                                         Direction;                                         // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trigger_Size;                                      // 0x024C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Fly_Delay_Max_Random;                              // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Direction_Spread_Max_Random;                       // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Horizontal_Spread_Max_Random;                      // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Crow_Trigger(int32 EntryPoint);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Crow_Trigger_C">();
	}
	static class ABP_Crow_Trigger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Crow_Trigger_C>();
	}
};
static_assert(alignof(ABP_Crow_Trigger_C) == 0x000008, "Wrong alignment on ABP_Crow_Trigger_C");
static_assert(sizeof(ABP_Crow_Trigger_C) == 0x000268, "Wrong size on ABP_Crow_Trigger_C");
static_assert(offsetof(ABP_Crow_Trigger_C, UberGraphFrame) == 0x000228, "Member 'ABP_Crow_Trigger_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Crow_Trigger_C, TriggerBox) == 0x000230, "Member 'ABP_Crow_Trigger_C::TriggerBox' has a wrong offset!");
static_assert(offsetof(ABP_Crow_Trigger_C, Affected_Crows) == 0x000238, "Member 'ABP_Crow_Trigger_C::Affected_Crows' has a wrong offset!");
static_assert(offsetof(ABP_Crow_Trigger_C, Direction) == 0x000248, "Member 'ABP_Crow_Trigger_C::Direction' has a wrong offset!");
static_assert(offsetof(ABP_Crow_Trigger_C, Trigger_Size) == 0x00024C, "Member 'ABP_Crow_Trigger_C::Trigger_Size' has a wrong offset!");
static_assert(offsetof(ABP_Crow_Trigger_C, Fly_Delay_Max_Random) == 0x000258, "Member 'ABP_Crow_Trigger_C::Fly_Delay_Max_Random' has a wrong offset!");
static_assert(offsetof(ABP_Crow_Trigger_C, Direction_Spread_Max_Random) == 0x00025C, "Member 'ABP_Crow_Trigger_C::Direction_Spread_Max_Random' has a wrong offset!");
static_assert(offsetof(ABP_Crow_Trigger_C, Horizontal_Spread_Max_Random) == 0x000260, "Member 'ABP_Crow_Trigger_C::Horizontal_Spread_Max_Random' has a wrong offset!");

}

