#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaoticEnergiesMelee_VisualEntity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ChaoticEnergiesMelee_VisualEntity.BP_ChaoticEnergiesMelee_VisualEntity_C.ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity
// 0x0090 (0x0090 - 0x0000)
struct BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetChaoticEnergiesDefaults_CE_Color;      // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetChaoticEnergiesDefaults_CE_NormalCheck; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_GetSlotMeshComponents_ReturnValue;        // 0x0028(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_GetSlotMeshComponents_ReturnValue_1;      // 0x0068(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_1;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity) == 0x000008, "Wrong alignment on BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity");
static_assert(sizeof(BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity) == 0x000090, "Wrong size on BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity");
static_assert(offsetof(BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity, CallFunc_GetChaoticEnergiesDefaults_CE_Color) == 0x000004, "Member 'BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity::CallFunc_GetChaoticEnergiesDefaults_CE_Color' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity, CallFunc_GetChaoticEnergiesDefaults_CE_NormalCheck) == 0x000014, "Member 'BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity::CallFunc_GetChaoticEnergiesDefaults_CE_NormalCheck' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000018, "Member 'BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity, CallFunc_GetSlotMeshComponents_ReturnValue) == 0x000028, "Member 'BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity::CallFunc_GetSlotMeshComponents_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity, Temp_int_Array_Index_Variable_1) == 0x000040, "Member 'BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity, Temp_int_Loop_Counter_Variable_1) == 0x000058, "Member 'BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity, CallFunc_Add_IntInt_ReturnValue_1) == 0x000060, "Member 'BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity, CallFunc_GetSlotMeshComponents_ReturnValue_1) == 0x000068, "Member 'BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity::CallFunc_GetSlotMeshComponents_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity, CallFunc_Array_Get_Item_1) == 0x000080, "Member 'BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity, CallFunc_Array_Length_ReturnValue_1) == 0x000088, "Member 'BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity, CallFunc_Less_IntInt_ReturnValue_1) == 0x00008C, "Member 'BP_ChaoticEnergiesMelee_VisualEntity_C_ExecuteUbergraph_BP_ChaoticEnergiesMelee_VisualEntity::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

}

