#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CutsceneCinematic

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_CutsceneCinematic.BP_CutsceneCinematic_C.ExecuteUbergraph_BP_CutsceneCinematic
// 0x0028 (0x0028 - 0x0000)
struct BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_AnimDuration_1;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsResumeToGame_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic) == 0x000008, "Wrong alignment on BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic");
static_assert(sizeof(BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic) == 0x000028, "Wrong size on BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic");
static_assert(offsetof(BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic, EntryPoint) == 0x000000, "Member 'BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic, Temp_bool_Variable) == 0x000004, "Member 'BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic, Temp_byte_Variable) == 0x000005, "Member 'BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic, Temp_byte_Variable_1) == 0x000006, "Member 'BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic, CallFunc_IsActive_ReturnValue) == 0x000007, "Member 'BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic, K2Node_Event_AnimDuration_1) == 0x000008, "Member 'BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic::K2Node_Event_AnimDuration_1' has a wrong offset!");
static_assert(offsetof(BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic, CallFunc_GetAnimPlaybackSpeed_ReturnValue) == 0x00000C, "Member 'BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic::CallFunc_GetAnimPlaybackSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic, K2Node_Event_AnimDuration) == 0x000010, "Member 'BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic::K2Node_Event_AnimDuration' has a wrong offset!");
static_assert(offsetof(BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic, CallFunc_IsResumeToGame_ReturnValue) == 0x000020, "Member 'BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic::CallFunc_IsResumeToGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic, K2Node_Select_Default) == 0x000021, "Member 'BP_CutsceneCinematic_C_ExecuteUbergraph_BP_CutsceneCinematic::K2Node_Select_Default' has a wrong offset!");

// Function BP_CutsceneCinematic.BP_CutsceneCinematic_C.OnShow
// 0x0004 (0x0004 - 0x0000)
struct BP_CutsceneCinematic_C_OnShow final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CutsceneCinematic_C_OnShow) == 0x000004, "Wrong alignment on BP_CutsceneCinematic_C_OnShow");
static_assert(sizeof(BP_CutsceneCinematic_C_OnShow) == 0x000004, "Wrong size on BP_CutsceneCinematic_C_OnShow");
static_assert(offsetof(BP_CutsceneCinematic_C_OnShow, AnimDuration) == 0x000000, "Member 'BP_CutsceneCinematic_C_OnShow::AnimDuration' has a wrong offset!");

// Function BP_CutsceneCinematic.BP_CutsceneCinematic_C.OnHide
// 0x0004 (0x0004 - 0x0000)
struct BP_CutsceneCinematic_C_OnHide final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CutsceneCinematic_C_OnHide) == 0x000004, "Wrong alignment on BP_CutsceneCinematic_C_OnHide");
static_assert(sizeof(BP_CutsceneCinematic_C_OnHide) == 0x000004, "Wrong size on BP_CutsceneCinematic_C_OnHide");
static_assert(offsetof(BP_CutsceneCinematic_C_OnHide, AnimDuration) == 0x000000, "Member 'BP_CutsceneCinematic_C_OnHide::AnimDuration' has a wrong offset!");

// Function BP_CutsceneCinematic.BP_CutsceneCinematic_C.BtnHotkeyXClicked
// 0x0001 (0x0001 - 0x0000)
struct BP_CutsceneCinematic_C_BtnHotkeyXClicked final
{
public:
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CutsceneCinematic_C_BtnHotkeyXClicked) == 0x000001, "Wrong alignment on BP_CutsceneCinematic_C_BtnHotkeyXClicked");
static_assert(sizeof(BP_CutsceneCinematic_C_BtnHotkeyXClicked) == 0x000001, "Wrong size on BP_CutsceneCinematic_C_BtnHotkeyXClicked");
static_assert(offsetof(BP_CutsceneCinematic_C_BtnHotkeyXClicked, CallFunc_IsActive_ReturnValue) == 0x000000, "Member 'BP_CutsceneCinematic_C_BtnHotkeyXClicked::CallFunc_IsActive_ReturnValue' has a wrong offset!");

}

