#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaoticEnergiesSpell_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ChaoticEnergiesSpell_VisualEntity.BP_ChaoticEnergiesSpell_VisualEntity_C
// 0x0030 (0x03C0 - 0x0390)
class ABP_ChaoticEnergiesSpell_VisualEntity_C final : public AMeshSamplingVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           AkComponent;                                       // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_ChaoticEnergies_SingleFire;                     // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_ChaoticEnergiesFlash_5A6E21BE4C89BD3E7B7EF9A8D435BD9C; // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_5A6E21BE4C89BD3E7B7EF9A8D435BD9C; // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AD[0x3];                                      // 0x03AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrawlerHero_C*                      Brother;                                           // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ChaoticEnergiesSpell_VisualEntity(int32 EntryPoint);
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ChaoticEnergiesSpell_VisualEntity_C">();
	}
	static class ABP_ChaoticEnergiesSpell_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ChaoticEnergiesSpell_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_ChaoticEnergiesSpell_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_ChaoticEnergiesSpell_VisualEntity_C");
static_assert(sizeof(ABP_ChaoticEnergiesSpell_VisualEntity_C) == 0x0003C0, "Wrong size on ABP_ChaoticEnergiesSpell_VisualEntity_C");
static_assert(offsetof(ABP_ChaoticEnergiesSpell_VisualEntity_C, UberGraphFrame) == 0x000390, "Member 'ABP_ChaoticEnergiesSpell_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ChaoticEnergiesSpell_VisualEntity_C, AkComponent) == 0x000398, "Member 'ABP_ChaoticEnergiesSpell_VisualEntity_C::AkComponent' has a wrong offset!");
static_assert(offsetof(ABP_ChaoticEnergiesSpell_VisualEntity_C, NS_ChaoticEnergies_SingleFire) == 0x0003A0, "Member 'ABP_ChaoticEnergiesSpell_VisualEntity_C::NS_ChaoticEnergies_SingleFire' has a wrong offset!");
static_assert(offsetof(ABP_ChaoticEnergiesSpell_VisualEntity_C, Timeline_0_ChaoticEnergiesFlash_5A6E21BE4C89BD3E7B7EF9A8D435BD9C) == 0x0003A8, "Member 'ABP_ChaoticEnergiesSpell_VisualEntity_C::Timeline_0_ChaoticEnergiesFlash_5A6E21BE4C89BD3E7B7EF9A8D435BD9C' has a wrong offset!");
static_assert(offsetof(ABP_ChaoticEnergiesSpell_VisualEntity_C, Timeline_0__Direction_5A6E21BE4C89BD3E7B7EF9A8D435BD9C) == 0x0003AC, "Member 'ABP_ChaoticEnergiesSpell_VisualEntity_C::Timeline_0__Direction_5A6E21BE4C89BD3E7B7EF9A8D435BD9C' has a wrong offset!");
static_assert(offsetof(ABP_ChaoticEnergiesSpell_VisualEntity_C, Timeline_0) == 0x0003B0, "Member 'ABP_ChaoticEnergiesSpell_VisualEntity_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_ChaoticEnergiesSpell_VisualEntity_C, Brother) == 0x0003B8, "Member 'ABP_ChaoticEnergiesSpell_VisualEntity_C::Brother' has a wrong offset!");

}

