#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CreateCharacter_ClassSlot

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_CreateCharacter_ClassSlot.BP_CreateCharacter_ClassSlot_C.SetDisabledIcon
// 0x0008 (0x0008 - 0x0000)
struct BP_CreateCharacter_ClassSlot_C_SetDisabledIcon final
{
public:
	class UTexture2D*                             InIconTexture;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreateCharacter_ClassSlot_C_SetDisabledIcon) == 0x000008, "Wrong alignment on BP_CreateCharacter_ClassSlot_C_SetDisabledIcon");
static_assert(sizeof(BP_CreateCharacter_ClassSlot_C_SetDisabledIcon) == 0x000008, "Wrong size on BP_CreateCharacter_ClassSlot_C_SetDisabledIcon");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_SetDisabledIcon, InIconTexture) == 0x000000, "Member 'BP_CreateCharacter_ClassSlot_C_SetDisabledIcon::InIconTexture' has a wrong offset!");

// Function BP_CreateCharacter_ClassSlot.BP_CreateCharacter_ClassSlot_C.SetSelectedIcon
// 0x0008 (0x0008 - 0x0000)
struct BP_CreateCharacter_ClassSlot_C_SetSelectedIcon final
{
public:
	class UTexture2D*                             InSelectedIconTexture;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreateCharacter_ClassSlot_C_SetSelectedIcon) == 0x000008, "Wrong alignment on BP_CreateCharacter_ClassSlot_C_SetSelectedIcon");
static_assert(sizeof(BP_CreateCharacter_ClassSlot_C_SetSelectedIcon) == 0x000008, "Wrong size on BP_CreateCharacter_ClassSlot_C_SetSelectedIcon");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_SetSelectedIcon, InSelectedIconTexture) == 0x000000, "Member 'BP_CreateCharacter_ClassSlot_C_SetSelectedIcon::InSelectedIconTexture' has a wrong offset!");

// Function BP_CreateCharacter_ClassSlot.BP_CreateCharacter_ClassSlot_C.SetSelected
// 0x003C (0x003C - 0x0000)
struct BP_CreateCharacter_ClassSlot_C_SetSelected final
{
public:
	bool                                          InIsSelected;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_1;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreateCharacter_ClassSlot_C_SetSelected) == 0x000004, "Wrong alignment on BP_CreateCharacter_ClassSlot_C_SetSelected");
static_assert(sizeof(BP_CreateCharacter_ClassSlot_C_SetSelected) == 0x00003C, "Wrong size on BP_CreateCharacter_ClassSlot_C_SetSelected");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_SetSelected, InIsSelected) == 0x000000, "Member 'BP_CreateCharacter_ClassSlot_C_SetSelected::InIsSelected' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_SetSelected, Temp_bool_Variable) == 0x000001, "Member 'BP_CreateCharacter_ClassSlot_C_SetSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_SetSelected, Temp_float_Variable) == 0x000004, "Member 'BP_CreateCharacter_ClassSlot_C_SetSelected::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_SetSelected, Temp_float_Variable_1) == 0x000008, "Member 'BP_CreateCharacter_ClassSlot_C_SetSelected::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_SetSelected, Temp_bool_Variable_1) == 0x00000C, "Member 'BP_CreateCharacter_ClassSlot_C_SetSelected::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_SetSelected, Temp_struct_Variable) == 0x000010, "Member 'BP_CreateCharacter_ClassSlot_C_SetSelected::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_SetSelected, Temp_struct_Variable_1) == 0x000018, "Member 'BP_CreateCharacter_ClassSlot_C_SetSelected::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_SetSelected, Temp_bool_Variable_2) == 0x000020, "Member 'BP_CreateCharacter_ClassSlot_C_SetSelected::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_SetSelected, Temp_float_Variable_2) == 0x000024, "Member 'BP_CreateCharacter_ClassSlot_C_SetSelected::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_SetSelected, Temp_float_Variable_3) == 0x000028, "Member 'BP_CreateCharacter_ClassSlot_C_SetSelected::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_SetSelected, K2Node_Select_Default) == 0x00002C, "Member 'BP_CreateCharacter_ClassSlot_C_SetSelected::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_SetSelected, K2Node_Select_Default_1) == 0x000030, "Member 'BP_CreateCharacter_ClassSlot_C_SetSelected::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_SetSelected, K2Node_Select_Default_2) == 0x000038, "Member 'BP_CreateCharacter_ClassSlot_C_SetSelected::K2Node_Select_Default_2' has a wrong offset!");

// Function BP_CreateCharacter_ClassSlot.BP_CreateCharacter_ClassSlot_C.Set Focused
// 0x0020 (0x0020 - 0x0000)
struct BP_CreateCharacter_ClassSlot_C_Set_Focused final
{
public:
	bool                                          InIsFocused;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          PlayAnim;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreateCharacter_ClassSlot_C_Set_Focused) == 0x000008, "Wrong alignment on BP_CreateCharacter_ClassSlot_C_Set_Focused");
static_assert(sizeof(BP_CreateCharacter_ClassSlot_C_Set_Focused) == 0x000020, "Wrong size on BP_CreateCharacter_ClassSlot_C_Set_Focused");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_Set_Focused, InIsFocused) == 0x000000, "Member 'BP_CreateCharacter_ClassSlot_C_Set_Focused::InIsFocused' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_Set_Focused, PlayAnim) == 0x000001, "Member 'BP_CreateCharacter_ClassSlot_C_Set_Focused::PlayAnim' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_Set_Focused, Temp_bool_Variable) == 0x000002, "Member 'BP_CreateCharacter_ClassSlot_C_Set_Focused::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_Set_Focused, Temp_float_Variable) == 0x000004, "Member 'BP_CreateCharacter_ClassSlot_C_Set_Focused::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_Set_Focused, Temp_bool_Variable_1) == 0x000008, "Member 'BP_CreateCharacter_ClassSlot_C_Set_Focused::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_Set_Focused, Temp_byte_Variable) == 0x000009, "Member 'BP_CreateCharacter_ClassSlot_C_Set_Focused::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_Set_Focused, Temp_byte_Variable_1) == 0x00000A, "Member 'BP_CreateCharacter_ClassSlot_C_Set_Focused::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_Set_Focused, CallFunc_Not_PreBool_ReturnValue) == 0x00000B, "Member 'BP_CreateCharacter_ClassSlot_C_Set_Focused::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_Set_Focused, CallFunc_Not_PreBool_ReturnValue_1) == 0x00000C, "Member 'BP_CreateCharacter_ClassSlot_C_Set_Focused::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_Set_Focused, CallFunc_BooleanAND_ReturnValue) == 0x00000D, "Member 'BP_CreateCharacter_ClassSlot_C_Set_Focused::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_Set_Focused, K2Node_Select_Default) == 0x00000E, "Member 'BP_CreateCharacter_ClassSlot_C_Set_Focused::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_Set_Focused, CallFunc_GetEndTime_ReturnValue) == 0x000010, "Member 'BP_CreateCharacter_ClassSlot_C_Set_Focused::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_Set_Focused, K2Node_Select_Default_1) == 0x000014, "Member 'BP_CreateCharacter_ClassSlot_C_Set_Focused::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_Set_Focused, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'BP_CreateCharacter_ClassSlot_C_Set_Focused::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BP_CreateCharacter_ClassSlot.BP_CreateCharacter_ClassSlot_C.PlayUnhoveredAnim
// 0x0008 (0x0008 - 0x0000)
struct BP_CreateCharacter_ClassSlot_C_PlayUnhoveredAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreateCharacter_ClassSlot_C_PlayUnhoveredAnim) == 0x000008, "Wrong alignment on BP_CreateCharacter_ClassSlot_C_PlayUnhoveredAnim");
static_assert(sizeof(BP_CreateCharacter_ClassSlot_C_PlayUnhoveredAnim) == 0x000008, "Wrong size on BP_CreateCharacter_ClassSlot_C_PlayUnhoveredAnim");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_PlayUnhoveredAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'BP_CreateCharacter_ClassSlot_C_PlayUnhoveredAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BP_CreateCharacter_ClassSlot.BP_CreateCharacter_ClassSlot_C.PlayHoveredAnim
// 0x0008 (0x0008 - 0x0000)
struct BP_CreateCharacter_ClassSlot_C_PlayHoveredAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreateCharacter_ClassSlot_C_PlayHoveredAnim) == 0x000008, "Wrong alignment on BP_CreateCharacter_ClassSlot_C_PlayHoveredAnim");
static_assert(sizeof(BP_CreateCharacter_ClassSlot_C_PlayHoveredAnim) == 0x000008, "Wrong size on BP_CreateCharacter_ClassSlot_C_PlayHoveredAnim");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_PlayHoveredAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'BP_CreateCharacter_ClassSlot_C_PlayHoveredAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BP_CreateCharacter_ClassSlot.BP_CreateCharacter_ClassSlot_C.SetIcon
// 0x0008 (0x0008 - 0x0000)
struct BP_CreateCharacter_ClassSlot_C_SetIcon final
{
public:
	class UTexture2D*                             InIconTexture;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreateCharacter_ClassSlot_C_SetIcon) == 0x000008, "Wrong alignment on BP_CreateCharacter_ClassSlot_C_SetIcon");
static_assert(sizeof(BP_CreateCharacter_ClassSlot_C_SetIcon) == 0x000008, "Wrong size on BP_CreateCharacter_ClassSlot_C_SetIcon");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_SetIcon, InIconTexture) == 0x000000, "Member 'BP_CreateCharacter_ClassSlot_C_SetIcon::InIconTexture' has a wrong offset!");

// Function BP_CreateCharacter_ClassSlot.BP_CreateCharacter_ClassSlot_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_CreateCharacter_ClassSlot_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CreateCharacter_ClassSlot_C_PreConstruct) == 0x000001, "Wrong alignment on BP_CreateCharacter_ClassSlot_C_PreConstruct");
static_assert(sizeof(BP_CreateCharacter_ClassSlot_C_PreConstruct) == 0x000001, "Wrong size on BP_CreateCharacter_ClassSlot_C_PreConstruct");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_CreateCharacter_ClassSlot_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_CreateCharacter_ClassSlot.BP_CreateCharacter_ClassSlot_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_CreateCharacter_ClassSlot_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreateCharacter_ClassSlot_C_Tick) == 0x000004, "Wrong alignment on BP_CreateCharacter_ClassSlot_C_Tick");
static_assert(sizeof(BP_CreateCharacter_ClassSlot_C_Tick) == 0x00003C, "Wrong size on BP_CreateCharacter_ClassSlot_C_Tick");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_Tick, MyGeometry) == 0x000000, "Member 'BP_CreateCharacter_ClassSlot_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_CreateCharacter_ClassSlot_C_Tick::InDeltaTime' has a wrong offset!");

// Function BP_CreateCharacter_ClassSlot.BP_CreateCharacter_ClassSlot_C.OnSetIcon
// 0x0008 (0x0008 - 0x0000)
struct BP_CreateCharacter_ClassSlot_C_OnSetIcon final
{
public:
	class UTexture2D*                             Icon;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreateCharacter_ClassSlot_C_OnSetIcon) == 0x000008, "Wrong alignment on BP_CreateCharacter_ClassSlot_C_OnSetIcon");
static_assert(sizeof(BP_CreateCharacter_ClassSlot_C_OnSetIcon) == 0x000008, "Wrong size on BP_CreateCharacter_ClassSlot_C_OnSetIcon");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_OnSetIcon, Icon) == 0x000000, "Member 'BP_CreateCharacter_ClassSlot_C_OnSetIcon::Icon' has a wrong offset!");

// Function BP_CreateCharacter_ClassSlot.BP_CreateCharacter_ClassSlot_C.OnFocused
// 0x0001 (0x0001 - 0x0000)
struct BP_CreateCharacter_ClassSlot_C_OnFocused final
{
public:
	bool                                          bAnimate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CreateCharacter_ClassSlot_C_OnFocused) == 0x000001, "Wrong alignment on BP_CreateCharacter_ClassSlot_C_OnFocused");
static_assert(sizeof(BP_CreateCharacter_ClassSlot_C_OnFocused) == 0x000001, "Wrong size on BP_CreateCharacter_ClassSlot_C_OnFocused");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_OnFocused, bAnimate) == 0x000000, "Member 'BP_CreateCharacter_ClassSlot_C_OnFocused::bAnimate' has a wrong offset!");

// Function BP_CreateCharacter_ClassSlot.BP_CreateCharacter_ClassSlot_C.OnUnfocused
// 0x0001 (0x0001 - 0x0000)
struct BP_CreateCharacter_ClassSlot_C_OnUnfocused final
{
public:
	bool                                          bAnimate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CreateCharacter_ClassSlot_C_OnUnfocused) == 0x000001, "Wrong alignment on BP_CreateCharacter_ClassSlot_C_OnUnfocused");
static_assert(sizeof(BP_CreateCharacter_ClassSlot_C_OnUnfocused) == 0x000001, "Wrong size on BP_CreateCharacter_ClassSlot_C_OnUnfocused");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_OnUnfocused, bAnimate) == 0x000000, "Member 'BP_CreateCharacter_ClassSlot_C_OnUnfocused::bAnimate' has a wrong offset!");

// Function BP_CreateCharacter_ClassSlot.BP_CreateCharacter_ClassSlot_C.OnSetFocusAnim
// 0x0001 (0x0001 - 0x0000)
struct BP_CreateCharacter_ClassSlot_C_OnSetFocusAnim final
{
public:
	bool                                          bInFocused;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CreateCharacter_ClassSlot_C_OnSetFocusAnim) == 0x000001, "Wrong alignment on BP_CreateCharacter_ClassSlot_C_OnSetFocusAnim");
static_assert(sizeof(BP_CreateCharacter_ClassSlot_C_OnSetFocusAnim) == 0x000001, "Wrong size on BP_CreateCharacter_ClassSlot_C_OnSetFocusAnim");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_OnSetFocusAnim, bInFocused) == 0x000000, "Member 'BP_CreateCharacter_ClassSlot_C_OnSetFocusAnim::bInFocused' has a wrong offset!");

// Function BP_CreateCharacter_ClassSlot.BP_CreateCharacter_ClassSlot_C.OnSetEnabled
// 0x0001 (0x0001 - 0x0000)
struct BP_CreateCharacter_ClassSlot_C_OnSetEnabled final
{
public:
	bool                                          bInEnabled;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CreateCharacter_ClassSlot_C_OnSetEnabled) == 0x000001, "Wrong alignment on BP_CreateCharacter_ClassSlot_C_OnSetEnabled");
static_assert(sizeof(BP_CreateCharacter_ClassSlot_C_OnSetEnabled) == 0x000001, "Wrong size on BP_CreateCharacter_ClassSlot_C_OnSetEnabled");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_OnSetEnabled, bInEnabled) == 0x000000, "Member 'BP_CreateCharacter_ClassSlot_C_OnSetEnabled::bInEnabled' has a wrong offset!");

// Function BP_CreateCharacter_ClassSlot.BP_CreateCharacter_ClassSlot_C.OnHighlighted
// 0x0002 (0x0002 - 0x0000)
struct BP_CreateCharacter_ClassSlot_C_OnHighlighted final
{
public:
	bool                                          bHighlighted;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bAnimate;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CreateCharacter_ClassSlot_C_OnHighlighted) == 0x000001, "Wrong alignment on BP_CreateCharacter_ClassSlot_C_OnHighlighted");
static_assert(sizeof(BP_CreateCharacter_ClassSlot_C_OnHighlighted) == 0x000002, "Wrong size on BP_CreateCharacter_ClassSlot_C_OnHighlighted");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_OnHighlighted, bHighlighted) == 0x000000, "Member 'BP_CreateCharacter_ClassSlot_C_OnHighlighted::bHighlighted' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_OnHighlighted, bAnimate) == 0x000001, "Member 'BP_CreateCharacter_ClassSlot_C_OnHighlighted::bAnimate' has a wrong offset!");

// Function BP_CreateCharacter_ClassSlot.BP_CreateCharacter_ClassSlot_C.ExecuteUbergraph_BP_CreateCharacter_ClassSlot
// 0x0078 (0x0078 - 0x0000)
struct BP_CreateCharacter_ClassSlot_C_ExecuteUbergraph_BP_CreateCharacter_ClassSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0014(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Event_Icon;                                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAnimate_2;                           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bAnimate_1;                           // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInFocused;                           // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInEnabled;                           // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHighlighted;                         // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bAnimate;                             // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreateCharacter_ClassSlot_C_ExecuteUbergraph_BP_CreateCharacter_ClassSlot) == 0x000008, "Wrong alignment on BP_CreateCharacter_ClassSlot_C_ExecuteUbergraph_BP_CreateCharacter_ClassSlot");
static_assert(sizeof(BP_CreateCharacter_ClassSlot_C_ExecuteUbergraph_BP_CreateCharacter_ClassSlot) == 0x000078, "Wrong size on BP_CreateCharacter_ClassSlot_C_ExecuteUbergraph_BP_CreateCharacter_ClassSlot");
static_assert(offsetof(BP_CreateCharacter_ClassSlot_C_ExecuteUbergraph_BP_CreateCharacter_ClassSlot, EntryPoint) == 0x000000, "Member 'BP_CreateCharacter_ClassSlot_C_ExecuteUbergraph_BP_CreateCharacter_ClassSlot::EntryPoint' has a wrong offset!");
