#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CatCritter_08_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CatCritter_08_Anim.BP_CatCritter_08_Anim_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct BP_CatCritter_08_Anim_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BP_CatCritter_08_Anim_C_AnimGraph) == 0x000008, "Wrong alignment on BP_CatCritter_08_Anim_C_AnimGraph");
static_assert(sizeof(BP_CatCritter_08_Anim_C_AnimGraph) == 0x000010, "Wrong size on BP_CatCritter_08_Anim_C_AnimGraph");
static_assert(offsetof(BP_CatCritter_08_Anim_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'BP_CatCritter_08_Anim_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function BP_CatCritter_08_Anim.BP_CatCritter_08_Anim_C.ExecuteUbergraph_BP_CatCritter_08_Anim
// 0x0008 (0x0008 - 0x0000)
struct BP_CatCritter_08_Anim_C_ExecuteUbergraph_BP_CatCritter_08_Anim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActorHiddenInGame_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CatCritter_08_Anim_C_ExecuteUbergraph_BP_CatCritter_08_Anim) == 0x000004, "Wrong alignment on BP_CatCritter_08_Anim_C_ExecuteUbergraph_BP_CatCritter_08_Anim");
static_assert(sizeof(BP_CatCritter_08_Anim_C_ExecuteUbergraph_BP_CatCritter_08_Anim) == 0x000008, "Wrong size on BP_CatCritter_08_Anim_C_ExecuteUbergraph_BP_CatCritter_08_Anim");
static_assert(offsetof(BP_CatCritter_08_Anim_C_ExecuteUbergraph_BP_CatCritter_08_Anim, EntryPoint) == 0x000000, "Member 'BP_CatCritter_08_Anim_C_ExecuteUbergraph_BP_CatCritter_08_Anim::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CatCritter_08_Anim_C_ExecuteUbergraph_BP_CatCritter_08_Anim, CallFunc_IsActorHiddenInGame_ReturnValue) == 0x000004, "Member 'BP_CatCritter_08_Anim_C_ExecuteUbergraph_BP_CatCritter_08_Anim::CallFunc_IsActorHiddenInGame_ReturnValue' has a wrong offset!");

}

