#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Conversation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Conversation.BP_Conversation_C
// 0x0150 (0x07D8 - 0x0688)
class UBP_Conversation_C final : public UConversationUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0688(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SetOpacityAnim;                                    // 0x0690(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowOptionsAnim;                                   // 0x0698(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowDialogAnim;                                    // 0x06A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x06A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x06B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_TypeWriterText_C*                   BP_TypeWriterText;                                 // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnDialogSkip;                                     // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnNextTab;                                        // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnPreviousTab;                                    // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ConversationPanel;                                 // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DebugLineID;                                       // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           DialogBox;                                         // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManRichTextBlock*                      DialogCaptionRich;                                 // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DialogSelector;                                    // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           OptionButtons;                                     // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScreenBg2;                                         // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Bestiary;                                      // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Buy;                                           // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Craft;                                         // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Enchant;                                       // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Garden;                                        // 0x0730(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_MapFragments;                                  // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Sell;                                          // 0x0740(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Talk;                                          // 0x0748(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Transmog;                                      // 0x0750(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Upgrade;                                       // 0x0758(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Tabs;                                              // 0x0760(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TopScreenFrame;                                    // 0x0768(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Conversation_Portrait_C*            CurrentTalker;                                     // 0x0770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Skippable;                                         // 0x0778(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_779[0x7];                                      // 0x0779(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TotalText_old;                                     // 0x0780(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 CurrentText_old;                                   // 0x0790(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          TotalTextFinished_old;                             // 0x07A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A1[0x7];                                      // 0x07A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   SpeakerText;                                       // 0x07A8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   LineID;                                            // 0x07C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_Conversation(int32 EntryPoint);
	void OnSubtitleEnable(bool bInEnabled);
	void BndEvt__BP_Conversation_Tab_Transmog_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();
	void BndEvt__BP_Conversation_Tab_MapFragments_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void OnSetTabButtonsVisbility(int32 InVisibleTabButtonNum);
	void BndEvt__BP_Vendor_Enchant_Tab_Upgrade_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();
	void OnClearSpeakerLine();
	void OnHideOptions();
	void OnShowOptions();
	void BndEvt__BP_Conversation_Tab_Talk_1_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature();
	void BndEvt__BP_Conversation_Tab_Bestiary_1_K2Node_ComponentBoundEvent_15_OnClicked__DelegateSignature();
	void BndEvt__BP_Conversation_Tab_Garden_1_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature();
	void BndEvt__BP_Conversation_Tab_Upgrade_1_K2Node_ComponentBoundEvent_13_OnClicked__DelegateSignature();
	void BndEvt__BP_Conversation_Tab_Craft_1_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature();
	void BndEvt__BP_Conversation_Tab_Sell_1_K2Node_ComponentBoundEvent_11_OnClicked__DelegateSignature();
	void BndEvt__BP_Conversation_Tab_Buy_1_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature();
	void OnConversationResponseClicked(int32 ResponseIndex);
	void BndEvt__BtnNextTab_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature();
	void BndEvt__BtnPreviousTab_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature();
	void OnGamepadRBEvent();
	void OnGamepadLBEvent();
	void BndEvt__BP_InteractButton_Normal_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void OnSetConversation(const class FText& SpeakerText_0, const class FText& FormattedSpeakerText, const class FText& LineIDText, bool bSkippable);
	void OnInit();
	void OnSetOpacity(float Opacity);
	void OnHide(float AnimDuration);
	void OnShow(float AnimDuration);
	void OnGamepadXEvent();
	void OnGamepadBEvent();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void ShowDialog(const class FText& InSpeakerText, const class FText& InFormattedSpeakerText, const class FText& InLineIDText, bool InSkippable);
	void ShowDialogSelector();
	void HideDialogSelector();
	void BtnHotkeyBClicked();
	void SetCurrentText();
	void SetOpacity(float InOpacity);
	void BtnHotkeyLBClicked();
	void BtnHotkeyRBClicked();
	void BtnHotkeyXClicked();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Conversation_C">();
	}
	static class UBP_Conversation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Conversation_C>();
	}
};
static_assert(alignof(UBP_Conversation_C) == 0x000008, "Wrong alignment on UBP_Conversation_C");
static_assert(sizeof(UBP_Conversation_C) == 0x0007D8, "Wrong size on UBP_Conversation_C");
static_assert(offsetof(UBP_Conversation_C, UberGraphFrame) == 0x000688, "Member 'UBP_Conversation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, SetOpacityAnim) == 0x000690, "Member 'UBP_Conversation_C::SetOpacityAnim' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, ShowOptionsAnim) == 0x000698, "Member 'UBP_Conversation_C::ShowOptionsAnim' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, ShowDialogAnim) == 0x0006A0, "Member 'UBP_Conversation_C::ShowDialogAnim' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, FadeOutAnim) == 0x0006A8, "Member 'UBP_Conversation_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, FadeInAnim) == 0x0006B0, "Member 'UBP_Conversation_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, BP_TypeWriterText) == 0x0006B8, "Member 'UBP_Conversation_C::BP_TypeWriterText' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, BtnDialogSkip) == 0x0006C0, "Member 'UBP_Conversation_C::BtnDialogSkip' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, BtnNextTab) == 0x0006C8, "Member 'UBP_Conversation_C::BtnNextTab' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, BtnPreviousTab) == 0x0006D0, "Member 'UBP_Conversation_C::BtnPreviousTab' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, ConversationPanel) == 0x0006D8, "Member 'UBP_Conversation_C::ConversationPanel' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, DebugLineID) == 0x0006E0, "Member 'UBP_Conversation_C::DebugLineID' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, DialogBox) == 0x0006E8, "Member 'UBP_Conversation_C::DialogBox' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, DialogCaptionRich) == 0x0006F0, "Member 'UBP_Conversation_C::DialogCaptionRich' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, DialogSelector) == 0x0006F8, "Member 'UBP_Conversation_C::DialogSelector' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, OptionButtons) == 0x000700, "Member 'UBP_Conversation_C::OptionButtons' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, ScreenBg2) == 0x000708, "Member 'UBP_Conversation_C::ScreenBg2' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, Tab_Bestiary) == 0x000710, "Member 'UBP_Conversation_C::Tab_Bestiary' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, Tab_Buy) == 0x000718, "Member 'UBP_Conversation_C::Tab_Buy' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, Tab_Craft) == 0x000720, "Member 'UBP_Conversation_C::Tab_Craft' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, Tab_Enchant) == 0x000728, "Member 'UBP_Conversation_C::Tab_Enchant' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, Tab_Garden) == 0x000730, "Member 'UBP_Conversation_C::Tab_Garden' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, Tab_MapFragments) == 0x000738, "Member 'UBP_Conversation_C::Tab_MapFragments' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, Tab_Sell) == 0x000740, "Member 'UBP_Conversation_C::Tab_Sell' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, Tab_Talk) == 0x000748, "Member 'UBP_Conversation_C::Tab_Talk' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, Tab_Transmog) == 0x000750, "Member 'UBP_Conversation_C::Tab_Transmog' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, Tab_Upgrade) == 0x000758, "Member 'UBP_Conversation_C::Tab_Upgrade' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, Tabs) == 0x000760, "Member 'UBP_Conversation_C::Tabs' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, TopScreenFrame) == 0x000768, "Member 'UBP_Conversation_C::TopScreenFrame' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, CurrentTalker) == 0x000770, "Member 'UBP_Conversation_C::CurrentTalker' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, Skippable) == 0x000778, "Member 'UBP_Conversation_C::Skippable' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, TotalText_old) == 0x000780, "Member 'UBP_Conversation_C::TotalText_old' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, CurrentText_old) == 0x000790, "Member 'UBP_Conversation_C::CurrentText_old' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, TotalTextFinished_old) == 0x0007A0, "Member 'UBP_Conversation_C::TotalTextFinished_old' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, SpeakerText) == 0x0007A8, "Member 'UBP_Conversation_C::SpeakerText' has a wrong offset!");
static_assert(offsetof(UBP_Conversation_C, LineID) == 0x0007C0, "Member 'UBP_Conversation_C::LineID' has a wrong offset!");

}

