#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ConeOfFire_VisualEntity

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ConeOfFire_VisualEntity.BP_ConeOfFire_VisualEntity_C.ExecuteUbergraph_BP_ConeOfFire_VisualEntity
// 0x0010 (0x0010 - 0x0000)
struct BP_ConeOfFire_VisualEntity_C_ExecuteUbergraph_BP_ConeOfFire_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAbilityUpgradeUnlocked_ReturnValue;     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConeOfFire_VisualEntity_C_ExecuteUbergraph_BP_ConeOfFire_VisualEntity) == 0x000004, "Wrong alignment on BP_ConeOfFire_VisualEntity_C_ExecuteUbergraph_BP_ConeOfFire_VisualEntity");
static_assert(sizeof(BP_ConeOfFire_VisualEntity_C_ExecuteUbergraph_BP_ConeOfFire_VisualEntity) == 0x000010, "Wrong size on BP_ConeOfFire_VisualEntity_C_ExecuteUbergraph_BP_ConeOfFire_VisualEntity");
static_assert(offsetof(BP_ConeOfFire_VisualEntity_C_ExecuteUbergraph_BP_ConeOfFire_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_ConeOfFire_VisualEntity_C_ExecuteUbergraph_BP_ConeOfFire_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ConeOfFire_VisualEntity_C_ExecuteUbergraph_BP_ConeOfFire_VisualEntity, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_ConeOfFire_VisualEntity_C_ExecuteUbergraph_BP_ConeOfFire_VisualEntity::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ConeOfFire_VisualEntity_C_ExecuteUbergraph_BP_ConeOfFire_VisualEntity, CallFunc_IsAbilityUpgradeUnlocked_ReturnValue) == 0x000008, "Member 'BP_ConeOfFire_VisualEntity_C_ExecuteUbergraph_BP_ConeOfFire_VisualEntity::CallFunc_IsAbilityUpgradeUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConeOfFire_VisualEntity_C_ExecuteUbergraph_BP_ConeOfFire_VisualEntity, CallFunc_SelectFloat_ReturnValue) == 0x00000C, "Member 'BP_ConeOfFire_VisualEntity_C_ExecuteUbergraph_BP_ConeOfFire_VisualEntity::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");

// Function BP_ConeOfFire_VisualEntity.BP_ConeOfFire_VisualEntity_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ConeOfFire_VisualEntity_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConeOfFire_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ConeOfFire_VisualEntity_C_ReceiveTick");
static_assert(sizeof(BP_ConeOfFire_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong size on BP_ConeOfFire_VisualEntity_C_ReceiveTick");
static_assert(offsetof(BP_ConeOfFire_VisualEntity_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ConeOfFire_VisualEntity_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

