#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CasterImp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CasterImp.BP_CasterImp_C
// 0x0080 (0x1B40 - 0x1AC0)
class ABP_CasterImp_C : public AEnemyCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1AC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHurtCapsule*                           HurtCapsule_Hand2;                                 // 0x1AC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule_Hand1;                                 // 0x1AD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule_Tail;                                  // 0x1AD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule6;                                      // 0x1AE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule5;                                      // 0x1AE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule4;                                      // 0x1AF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule3;                                      // 0x1AF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule2;                                      // 0x1B00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TR_CurrentAction;                                  // 0x1B08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDestructibleComponent*                 DM_amorf;                                          // 0x1B10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_HPBarWidgetComponent_C*             BP_HPBarWidgetComponent;                           // 0x1B18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                HitBox;                                            // 0x1B20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                LegHitBox;                                         // 0x1B28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule1;                                      // 0x1B30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FadeSpeed;                                         // 0x1B38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeValue;                                         // 0x1B3C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CasterImp(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void OnKilled_Event_0(class UObject* Killer, class UAbilityController* KillerAbilityController);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CasterImp_C">();
	}
	static class ABP_CasterImp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CasterImp_C>();
	}
};
static_assert(alignof(ABP_CasterImp_C) == 0x000010, "Wrong alignment on ABP_CasterImp_C");
static_assert(sizeof(ABP_CasterImp_C) == 0x001B40, "Wrong size on ABP_CasterImp_C");
static_assert(offsetof(ABP_CasterImp_C, UberGraphFrame) == 0x001AC0, "Member 'ABP_CasterImp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_C, HurtCapsule_Hand2) == 0x001AC8, "Member 'ABP_CasterImp_C::HurtCapsule_Hand2' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_C, HurtCapsule_Hand1) == 0x001AD0, "Member 'ABP_CasterImp_C::HurtCapsule_Hand1' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_C, HurtCapsule_Tail) == 0x001AD8, "Member 'ABP_CasterImp_C::HurtCapsule_Tail' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_C, HurtCapsule6) == 0x001AE0, "Member 'ABP_CasterImp_C::HurtCapsule6' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_C, HurtCapsule5) == 0x001AE8, "Member 'ABP_CasterImp_C::HurtCapsule5' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_C, HurtCapsule4) == 0x001AF0, "Member 'ABP_CasterImp_C::HurtCapsule4' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_C, HurtCapsule3) == 0x001AF8, "Member 'ABP_CasterImp_C::HurtCapsule3' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_C, HurtCapsule2) == 0x001B00, "Member 'ABP_CasterImp_C::HurtCapsule2' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_C, TR_CurrentAction) == 0x001B08, "Member 'ABP_CasterImp_C::TR_CurrentAction' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_C, DM_amorf) == 0x001B10, "Member 'ABP_CasterImp_C::DM_amorf' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_C, BP_HPBarWidgetComponent) == 0x001B18, "Member 'ABP_CasterImp_C::BP_HPBarWidgetComponent' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_C, HitBox) == 0x001B20, "Member 'ABP_CasterImp_C::HitBox' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_C, LegHitBox) == 0x001B28, "Member 'ABP_CasterImp_C::LegHitBox' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_C, HurtCapsule1) == 0x001B30, "Member 'ABP_CasterImp_C::HurtCapsule1' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_C, FadeSpeed) == 0x001B38, "Member 'ABP_CasterImp_C::FadeSpeed' has a wrong offset!");
static_assert(offsetof(ABP_CasterImp_C, FadeValue) == 0x001B3C, "Member 'ABP_CasterImp_C::FadeValue' has a wrong offset!");

}

