#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ConeOfFire_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ConeOfFire_VisualEntity.BP_ConeOfFire_VisualEntity_C
// 0x0018 (0x0368 - 0x0350)
class ABP_ConeOfFire_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_ConeOfFire;                                     // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MaxSize;                                           // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ConeOfFire_VisualEntity(int32 EntryPoint);
	void VisualEntityConstructionFinished();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ConeOfFire_VisualEntity_C">();
	}
	static class ABP_ConeOfFire_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ConeOfFire_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_ConeOfFire_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_ConeOfFire_VisualEntity_C");
static_assert(sizeof(ABP_ConeOfFire_VisualEntity_C) == 0x000368, "Wrong size on ABP_ConeOfFire_VisualEntity_C");
static_assert(offsetof(ABP_ConeOfFire_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_ConeOfFire_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ConeOfFire_VisualEntity_C, NS_ConeOfFire) == 0x000358, "Member 'ABP_ConeOfFire_VisualEntity_C::NS_ConeOfFire' has a wrong offset!");
static_assert(offsetof(ABP_ConeOfFire_VisualEntity_C, MaxSize) == 0x000360, "Member 'ABP_ConeOfFire_VisualEntity_C::MaxSize' has a wrong offset!");

}

