#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaoticRejuvenation_Passive

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ChaoticRejuvenation_Passive.BP_ChaoticRejuvenation_Passive_C.ExecuteUbergraph_BP_ChaoticRejuvenation_Passive
// 0x0030 (0x0030 - 0x0000)
struct BP_ChaoticRejuvenation_Passive_C_ExecuteUbergraph_BP_ChaoticRejuvenation_Passive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHeroBase*                              CallFunc_GetHero_ReturnValue;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_CustomName;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetGameMode_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ChaoticRejuvenation_Passive_C_ExecuteUbergraph_BP_ChaoticRejuvenation_Passive) == 0x000008, "Wrong alignment on BP_ChaoticRejuvenation_Passive_C_ExecuteUbergraph_BP_ChaoticRejuvenation_Passive");
static_assert(sizeof(BP_ChaoticRejuvenation_Passive_C_ExecuteUbergraph_BP_ChaoticRejuvenation_Passive) == 0x000030, "Wrong size on BP_ChaoticRejuvenation_Passive_C_ExecuteUbergraph_BP_ChaoticRejuvenation_Passive");
static_assert(offsetof(BP_ChaoticRejuvenation_Passive_C_ExecuteUbergraph_BP_ChaoticRejuvenation_Passive, EntryPoint) == 0x000000, "Member 'BP_ChaoticRejuvenation_Passive_C_ExecuteUbergraph_BP_ChaoticRejuvenation_Passive::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRejuvenation_Passive_C_ExecuteUbergraph_BP_ChaoticRejuvenation_Passive, CallFunc_GetHero_ReturnValue) == 0x000008, "Member 'BP_ChaoticRejuvenation_Passive_C_ExecuteUbergraph_BP_ChaoticRejuvenation_Passive::CallFunc_GetHero_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRejuvenation_Passive_C_ExecuteUbergraph_BP_ChaoticRejuvenation_Passive, K2Node_Event_CustomName) == 0x000010, "Member 'BP_ChaoticRejuvenation_Passive_C_ExecuteUbergraph_BP_ChaoticRejuvenation_Passive::K2Node_Event_CustomName' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRejuvenation_Passive_C_ExecuteUbergraph_BP_ChaoticRejuvenation_Passive, CallFunc_GetGameMode_ReturnValue) == 0x000018, "Member 'BP_ChaoticRejuvenation_Passive_C_ExecuteUbergraph_BP_ChaoticRejuvenation_Passive::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRejuvenation_Passive_C_ExecuteUbergraph_BP_ChaoticRejuvenation_Passive, K2Node_SwitchName_CmpSuccess) == 0x000020, "Member 'BP_ChaoticRejuvenation_Passive_C_ExecuteUbergraph_BP_ChaoticRejuvenation_Passive::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ChaoticRejuvenation_Passive_C_ExecuteUbergraph_BP_ChaoticRejuvenation_Passive, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000028, "Member 'BP_ChaoticRejuvenation_Passive_C_ExecuteUbergraph_BP_ChaoticRejuvenation_Passive::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");

// Function BP_ChaoticRejuvenation_Passive.BP_ChaoticRejuvenation_Passive_C.BPAbilityCustomEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_ChaoticRejuvenation_Passive_C_BPAbilityCustomEvent final
{
public:
	class FName                                   CustomName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ChaoticRejuvenation_Passive_C_BPAbilityCustomEvent) == 0x000004, "Wrong alignment on BP_ChaoticRejuvenation_Passive_C_BPAbilityCustomEvent");
static_assert(sizeof(BP_ChaoticRejuvenation_Passive_C_BPAbilityCustomEvent) == 0x000008, "Wrong size on BP_ChaoticRejuvenation_Passive_C_BPAbilityCustomEvent");
static_assert(offsetof(BP_ChaoticRejuvenation_Passive_C_BPAbilityCustomEvent, CustomName) == 0x000000, "Member 'BP_ChaoticRejuvenation_Passive_C_BPAbilityCustomEvent::CustomName' has a wrong offset!");

}

