#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Crow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Crow.BP_Crow_C
// 0x0038 (0x0260 - 0x0228)
class ABP_Crow_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UManVisualController*                   ManVisualController;                               // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Crow_Anim_C*                        Crow_Anim;                                         // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Idle_Bridge_Chance;                                // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Idle_Bridge_Start_Timer;                           // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Direction;                                         // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Crow(int32 EntryPoint);
	void FlyAway_Trigger(float Delay, float Horizontal_Spread, float Direction_0);
	void Done();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Crow_C">();
	}
	static class ABP_Crow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Crow_C>();
	}
};
static_assert(alignof(ABP_Crow_C) == 0x000008, "Wrong alignment on ABP_Crow_C");
static_assert(sizeof(ABP_Crow_C) == 0x000260, "Wrong size on ABP_Crow_C");
static_assert(offsetof(ABP_Crow_C, UberGraphFrame) == 0x000228, "Member 'ABP_Crow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Crow_C, Ak) == 0x000230, "Member 'ABP_Crow_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_Crow_C, SkeletalMesh) == 0x000238, "Member 'ABP_Crow_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_Crow_C, ManVisualController) == 0x000240, "Member 'ABP_Crow_C::ManVisualController' has a wrong offset!");
static_assert(offsetof(ABP_Crow_C, Crow_Anim) == 0x000248, "Member 'ABP_Crow_C::Crow_Anim' has a wrong offset!");
static_assert(offsetof(ABP_Crow_C, Idle_Bridge_Chance) == 0x000250, "Member 'ABP_Crow_C::Idle_Bridge_Chance' has a wrong offset!");
static_assert(offsetof(ABP_Crow_C, Idle_Bridge_Start_Timer) == 0x000254, "Member 'ABP_Crow_C::Idle_Bridge_Start_Timer' has a wrong offset!");
static_assert(offsetof(ABP_Crow_C, Direction) == 0x000258, "Member 'ABP_Crow_C::Direction' has a wrong offset!");

}

