#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosSparksProjectile

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ChaosSparksProjectile.BP_ChaosSparksProjectile_C.ExecuteUbergraph_BP_ChaosSparksProjectile
// 0x0040 (0x0040 - 0x0000)
struct BP_ChaosSparksProjectile_C_ExecuteUbergraph_BP_ChaosSparksProjectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ChaosSparksIdleVisualEntity_C*      K2Node_DynamicCast_AsBP_Chaos_Sparks_Idle_Visual_Entity; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue_1;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue_1;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ChaosSparksProjectile_C_ExecuteUbergraph_BP_ChaosSparksProjectile) == 0x000008, "Wrong alignment on BP_ChaosSparksProjectile_C_ExecuteUbergraph_BP_ChaosSparksProjectile");
static_assert(sizeof(BP_ChaosSparksProjectile_C_ExecuteUbergraph_BP_ChaosSparksProjectile) == 0x000040, "Wrong size on BP_ChaosSparksProjectile_C_ExecuteUbergraph_BP_ChaosSparksProjectile");
static_assert(offsetof(BP_ChaosSparksProjectile_C_ExecuteUbergraph_BP_ChaosSparksProjectile, EntryPoint) == 0x000000, "Member 'BP_ChaosSparksProjectile_C_ExecuteUbergraph_BP_ChaosSparksProjectile::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ChaosSparksProjectile_C_ExecuteUbergraph_BP_ChaosSparksProjectile, CallFunc_GetManGameMode_ReturnValue) == 0x000008, "Member 'BP_ChaosSparksProjectile_C_ExecuteUbergraph_BP_ChaosSparksProjectile::CallFunc_GetManGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosSparksProjectile_C_ExecuteUbergraph_BP_ChaosSparksProjectile, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000010, "Member 'BP_ChaosSparksProjectile_C_ExecuteUbergraph_BP_ChaosSparksProjectile::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosSparksProjectile_C_ExecuteUbergraph_BP_ChaosSparksProjectile, K2Node_DynamicCast_AsBP_Chaos_Sparks_Idle_Visual_Entity) == 0x000018, "Member 'BP_ChaosSparksProjectile_C_ExecuteUbergraph_BP_ChaosSparksProjectile::K2Node_DynamicCast_AsBP_Chaos_Sparks_Idle_Visual_Entity' has a wrong offset!");
static_assert(offsetof(BP_ChaosSparksProjectile_C_ExecuteUbergraph_BP_ChaosSparksProjectile, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_ChaosSparksProjectile_C_ExecuteUbergraph_BP_ChaosSparksProjectile::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ChaosSparksProjectile_C_ExecuteUbergraph_BP_ChaosSparksProjectile, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'BP_ChaosSparksProjectile_C_ExecuteUbergraph_BP_ChaosSparksProjectile::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosSparksProjectile_C_ExecuteUbergraph_BP_ChaosSparksProjectile, CallFunc_GetManGameMode_ReturnValue_1) == 0x000028, "Member 'BP_ChaosSparksProjectile_C_ExecuteUbergraph_BP_ChaosSparksProjectile::CallFunc_GetManGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosSparksProjectile_C_ExecuteUbergraph_BP_ChaosSparksProjectile, CallFunc_SpawnVisualEntity_ReturnValue_1) == 0x000030, "Member 'BP_ChaosSparksProjectile_C_ExecuteUbergraph_BP_ChaosSparksProjectile::CallFunc_SpawnVisualEntity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosSparksProjectile_C_ExecuteUbergraph_BP_ChaosSparksProjectile, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'BP_ChaosSparksProjectile_C_ExecuteUbergraph_BP_ChaosSparksProjectile::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosSparksProjectile_C_ExecuteUbergraph_BP_ChaosSparksProjectile, CallFunc_IsValid_ReturnValue_2) == 0x000039, "Member 'BP_ChaosSparksProjectile_C_ExecuteUbergraph_BP_ChaosSparksProjectile::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

}

