#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosBeamEnd_VisualEntity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ChaosBeamEnd_VisualEntity.BP_ChaosBeamEnd_VisualEntity_C.ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity
// 0x0680 (0x0680 - 0x0000)
struct BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_AddComponent_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0xC];                                       // 0x0054(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable_1;                            // 0x0060(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_AddComponent_ReturnValue_1;               // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_ChaosBeam_ActiveAbility_C*          K2Node_DynamicCast_AsBP_Chaos_Beam_Active_Ability; // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue_1;       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName CustomName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x012C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CustomName;                     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetDamagedEntities_ReturnValue;           // 0x0150(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16E[0x2];                                      // 0x016E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17E[0x2];                                      // 0x017E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         CallFunc_GetAsset_ReturnValue;                     // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetDamagedEntities_ReturnValue_1;         // 0x0188(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_GetLastBeamHitResult_ReturnValue;         // 0x01A8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_232[0x2];                                      // 0x0232(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x023C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0248(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0254(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0260(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x029C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLastBeamStartPoint_ReturnValue;        // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x02D0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetLastBeamEndPoint_ReturnValue;          // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x030C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0320(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetLastBeamEndPoint_ReturnValue_1;        // 0x0350(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x035C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x03E4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item_1;                         // 0x0470(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item_2;                         // 0x0488(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_3;                         // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0499(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49A[0x2];                                      // 0x049A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x049C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ProjectPositionToBeam_ReturnValue;        // 0x04A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         CallFunc_GetAsset_ReturnValue_1;                   // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item_4;                         // 0x04C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult_1;    // 0x04C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_8;               // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0554(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_555[0x3];                                      // 0x0555(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetDamagedEntities_ReturnValue_2;         // 0x0558(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_9;               // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x056C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56D[0x3];                                      // 0x056D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item_5;                         // 0x0570(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_10;              // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x057C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57D[0x3];                                      // 0x057D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item_6;                         // 0x0580(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_11;              // 0x0588(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x058C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58D[0x3];                                      // 0x058D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLastBeamStartPoint_ReturnValue_1;      // 0x0590(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastBeamEndPoint_ReturnValue_2;        // 0x059C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x05A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_1;         // 0x05AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item_7;                         // 0x05B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x05C0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F1[0x3];                                      // 0x05F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult_2;    // 0x05F4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity) == 0x000010, "Wrong alignment on BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity");
static_assert(sizeof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity) == 0x000680, "Wrong size on BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, Temp_struct_Variable) == 0x000010, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, Temp_int_Array_Index_Variable) == 0x000040, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_AddComponent_ReturnValue) == 0x000048, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, Temp_struct_Variable_1) == 0x000060, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Add_IntInt_ReturnValue) == 0x000090, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_AddComponent_ReturnValue_1) == 0x000098, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, Temp_int_Array_Index_Variable_1) == 0x0000A0, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, Temp_int_Loop_Counter_Variable_1) == 0x0000A4, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A8, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, Temp_int_Array_Index_Variable_2) == 0x0000AC, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_GetAbilityController_ReturnValue) == 0x0000B0, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x0000B8, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, K2Node_DynamicCast_AsBP_Chaos_Beam_Active_Ability) == 0x0000C0, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::K2Node_DynamicCast_AsBP_Chaos_Beam_Active_Ability' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_IsValid_ReturnValue) == 0x0000C9, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, K2Node_Event_DeltaSeconds) == 0x0000CC, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_GetAttachParentActor_ReturnValue) == 0x0000D0, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_IsValid_ReturnValue_1) == 0x0000D8, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_GetAttachParentActor_ReturnValue_1) == 0x0000E0, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_GetAttachParentActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_IsValid_ReturnValue_2) == 0x0000E8, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, K2Node_DynamicCast_AsCharacter_Base) == 0x0000F0, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, K2Node_DynamicCast_bSuccess_1) == 0x0000F8, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, Temp_int_Loop_Counter_Variable_2) == 0x0000FC, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Add_IntInt_ReturnValue_2) == 0x000100, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_IsValid_ReturnValue_3) == 0x000104, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, Temp_int_Array_Index_Variable_3) == 0x000108, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, Temp_int_Loop_Counter_Variable_3) == 0x00010C, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Add_IntInt_ReturnValue_3) == 0x000110, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, Temp_int_Array_Index_Variable_4) == 0x000114, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, Temp_int_Loop_Counter_Variable_4) == 0x000118, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, Temp_int_Loop_Counter_Variable_5) == 0x00011C, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Add_IntInt_ReturnValue_4) == 0x000120, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Add_IntInt_ReturnValue_5) == 0x000124, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, Temp_int_Loop_Counter_Variable_6) == 0x000128, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::Temp_int_Loop_Counter_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, K2Node_CreateDelegate_OutputDelegate) == 0x00012C, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Add_IntInt_ReturnValue_6) == 0x00013C, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, K2Node_CustomEvent_CustomName) == 0x000140, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::K2Node_CustomEvent_CustomName' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000148, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_GetDamagedEntities_ReturnValue) == 0x000150, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_GetDamagedEntities_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Array_Add_ReturnValue) == 0x000160, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Array_Length_ReturnValue) == 0x000164, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Array_Length_ReturnValue_1) == 0x000168, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Less_IntInt_ReturnValue) == 0x00016C, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00016D, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Array_Length_ReturnValue_2) == 0x000170, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Array_Length_ReturnValue_3) == 0x000174, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Array_Length_ReturnValue_4) == 0x000178, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Less_IntInt_ReturnValue_1) == 0x00017C, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Less_IntInt_ReturnValue_2) == 0x00017D, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_GetAsset_ReturnValue) == 0x000180, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_GetAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_GetDamagedEntities_ReturnValue_1) == 0x000188, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_GetDamagedEntities_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Array_Length_ReturnValue_5) == 0x000198, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Array_Get_Item) == 0x0001A0, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_GetLastBeamHitResult_ReturnValue) == 0x0001A8, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_GetLastBeamHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_BreakHitResult_bBlockingHit) == 0x000230, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_BreakHitResult_bInitialOverlap) == 0x000231, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_BreakHitResult_Time) == 0x000234, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_BreakHitResult_Distance) == 0x000238, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_BreakHitResult_Location) == 0x00023C, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_BreakHitResult_ImpactPoint) == 0x000248, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_BreakHitResult_Normal) == 0x000254, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_BreakHitResult_ImpactNormal) == 0x000260, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_BreakHitResult_PhysMat) == 0x000270, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_BreakHitResult_HitActor) == 0x000278, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_BreakHitResult_HitComponent) == 0x000280, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_BreakHitResult_HitBoneName) == 0x000288, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_BreakHitResult_HitItem) == 0x000290, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_BreakHitResult_ElementIndex) == 0x000294, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_BreakHitResult_FaceIndex) == 0x000298, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_BreakHitResult_TraceStart) == 0x00029C, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_BreakHitResult_TraceEnd) == 0x0002A8, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Array_Length_ReturnValue_6) == 0x0002B4, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Less_IntInt_ReturnValue_3) == 0x0002B8, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_GetLastBeamStartPoint_ReturnValue) == 0x0002BC, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_GetLastBeamStartPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_MakeTransform_ReturnValue) == 0x0002D0, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_GetLastBeamEndPoint_ReturnValue) == 0x000300, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_GetLastBeamEndPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_FindLookAtRotation_ReturnValue) == 0x00030C, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_MakeTransform_ReturnValue_1) == 0x000320, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_GetLastBeamEndPoint_ReturnValue_1) == 0x000350, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_GetLastBeamEndPoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x00035C, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0003E4, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Array_Get_Item_1) == 0x000470, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Array_Length_ReturnValue_7) == 0x000478, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Array_Length_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, Temp_int_Array_Index_Variable_5) == 0x00047C, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Less_IntInt_ReturnValue_4) == 0x000480, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Array_Get_Item_2) == 0x000488, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Array_Get_Item_3) == 0x000490, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Greater_IntInt_ReturnValue) == 0x000498, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_IsValid_ReturnValue_4) == 0x000499, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00049C, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_ProjectPositionToBeam_ReturnValue) == 0x0004A8, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_ProjectPositionToBeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Array_Add_ReturnValue_1) == 0x0004B4, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_GetAsset_ReturnValue_1) == 0x0004B8, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_GetAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Array_Get_Item_4) == 0x0004C0, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_K2_SetWorldTransform_SweepHitResult_1) == 0x0004C8, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_K2_SetWorldTransform_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Array_Length_ReturnValue_8) == 0x000550, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Array_Length_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000554, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_GetDamagedEntities_ReturnValue_2) == 0x000558, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_GetDamagedEntities_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Array_Length_ReturnValue_9) == 0x000568, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Array_Length_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Less_IntInt_ReturnValue_5) == 0x00056C, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Array_Get_Item_5) == 0x000570, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Array_Length_ReturnValue_10) == 0x000578, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Array_Length_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Less_IntInt_ReturnValue_6) == 0x00057C, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Less_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Array_Get_Item_6) == 0x000580, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Array_Length_ReturnValue_11) == 0x000588, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Array_Length_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Less_IntInt_ReturnValue_7) == 0x00058C, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Less_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_GetLastBeamStartPoint_ReturnValue_1) == 0x000590, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_GetLastBeamStartPoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_GetLastBeamEndPoint_ReturnValue_2) == 0x00059C, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_GetLastBeamEndPoint_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, Temp_int_Array_Index_Variable_6) == 0x0005A8, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::Temp_int_Array_Index_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_FindLookAtRotation_ReturnValue_1) == 0x0005AC, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_FindLookAtRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_Array_Get_Item_7) == 0x0005B8, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_MakeTransform_ReturnValue_2) == 0x0005C0, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity, CallFunc_IsValid_ReturnValue_5) == 0x0005F0, "Member 'BP_ChaosBeamEnd_VisualEntity_C_ExecuteUbergraph_BP_ChaosBeamEnd_VisualEntity::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
