#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CreateCharacter_IconSelector

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_CreateCharacter_IconSelector.BP_CreateCharacter_IconSelector_C.ToggleSmallScreen
// 0x00D8 (0x00D8 - 0x0000)
struct BP_CreateCharacter_IconSelector_C_ToggleSmallScreen final
{
public:
	bool                                          InIsSmallScreen;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0020(0x0058)(HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_1;                 // 0x0080(0x0058)(HasGetValueTypeHash)
};
static_assert(alignof(BP_CreateCharacter_IconSelector_C_ToggleSmallScreen) == 0x000008, "Wrong alignment on BP_CreateCharacter_IconSelector_C_ToggleSmallScreen");
static_assert(sizeof(BP_CreateCharacter_IconSelector_C_ToggleSmallScreen) == 0x0000D8, "Wrong size on BP_CreateCharacter_IconSelector_C_ToggleSmallScreen");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_ToggleSmallScreen, InIsSmallScreen) == 0x000000, "Member 'BP_CreateCharacter_IconSelector_C_ToggleSmallScreen::InIsSmallScreen' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_ToggleSmallScreen, Temp_bool_Variable) == 0x000001, "Member 'BP_CreateCharacter_IconSelector_C_ToggleSmallScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_ToggleSmallScreen, Temp_int_Variable) == 0x000004, "Member 'BP_CreateCharacter_IconSelector_C_ToggleSmallScreen::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_ToggleSmallScreen, Temp_int_Variable_1) == 0x000008, "Member 'BP_CreateCharacter_IconSelector_C_ToggleSmallScreen::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_ToggleSmallScreen, Temp_bool_Variable_1) == 0x00000C, "Member 'BP_CreateCharacter_IconSelector_C_ToggleSmallScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_ToggleSmallScreen, Temp_int_Variable_2) == 0x000010, "Member 'BP_CreateCharacter_IconSelector_C_ToggleSmallScreen::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_ToggleSmallScreen, Temp_int_Variable_3) == 0x000014, "Member 'BP_CreateCharacter_IconSelector_C_ToggleSmallScreen::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_ToggleSmallScreen, K2Node_Select_Default) == 0x000018, "Member 'BP_CreateCharacter_IconSelector_C_ToggleSmallScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_ToggleSmallScreen, K2Node_MakeStruct_SlateFontInfo) == 0x000020, "Member 'BP_CreateCharacter_IconSelector_C_ToggleSmallScreen::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_ToggleSmallScreen, K2Node_Select_Default_1) == 0x000078, "Member 'BP_CreateCharacter_IconSelector_C_ToggleSmallScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_ToggleSmallScreen, K2Node_MakeStruct_SlateFontInfo_1) == 0x000080, "Member 'BP_CreateCharacter_IconSelector_C_ToggleSmallScreen::K2Node_MakeStruct_SlateFontInfo_1' has a wrong offset!");

// Function BP_CreateCharacter_IconSelector.BP_CreateCharacter_IconSelector_C.ToggleEnabled
// 0x0060 (0x0060 - 0x0000)
struct BP_CreateCharacter_IconSelector_C_ToggleEnabled final
{
public:
	bool                                          InIsEnabled;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0038(0x0028)()
};
static_assert(alignof(BP_CreateCharacter_IconSelector_C_ToggleEnabled) == 0x000008, "Wrong alignment on BP_CreateCharacter_IconSelector_C_ToggleEnabled");
static_assert(sizeof(BP_CreateCharacter_IconSelector_C_ToggleEnabled) == 0x000060, "Wrong size on BP_CreateCharacter_IconSelector_C_ToggleEnabled");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_ToggleEnabled, InIsEnabled) == 0x000000, "Member 'BP_CreateCharacter_IconSelector_C_ToggleEnabled::InIsEnabled' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_ToggleEnabled, Temp_bool_Variable) == 0x000001, "Member 'BP_CreateCharacter_IconSelector_C_ToggleEnabled::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_ToggleEnabled, Temp_struct_Variable) == 0x000004, "Member 'BP_CreateCharacter_IconSelector_C_ToggleEnabled::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_ToggleEnabled, Temp_struct_Variable_1) == 0x000014, "Member 'BP_CreateCharacter_IconSelector_C_ToggleEnabled::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_ToggleEnabled, K2Node_Select_Default) == 0x000024, "Member 'BP_CreateCharacter_IconSelector_C_ToggleEnabled::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_ToggleEnabled, K2Node_MakeStruct_SlateColor) == 0x000038, "Member 'BP_CreateCharacter_IconSelector_C_ToggleEnabled::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function BP_CreateCharacter_IconSelector.BP_CreateCharacter_IconSelector_C.BtnNextClicked
// 0x0018 (0x0018 - 0x0000)
struct BP_CreateCharacter_IconSelector_C_BtnNextClicked final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreateCharacter_IconSelector_C_BtnNextClicked) == 0x000008, "Wrong alignment on BP_CreateCharacter_IconSelector_C_BtnNextClicked");
static_assert(sizeof(BP_CreateCharacter_IconSelector_C_BtnNextClicked) == 0x000018, "Wrong size on BP_CreateCharacter_IconSelector_C_BtnNextClicked");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_BtnNextClicked, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'BP_CreateCharacter_IconSelector_C_BtnNextClicked::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_BtnNextClicked, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'BP_CreateCharacter_IconSelector_C_BtnNextClicked::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_BtnNextClicked, Temp_int_Variable) == 0x00000C, "Member 'BP_CreateCharacter_IconSelector_C_BtnNextClicked::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_BtnNextClicked, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000010, "Member 'BP_CreateCharacter_IconSelector_C_BtnNextClicked::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_BtnNextClicked, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_CreateCharacter_IconSelector_C_BtnNextClicked::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_CreateCharacter_IconSelector.BP_CreateCharacter_IconSelector_C.BtnPreviousClicked
// 0x0020 (0x0020 - 0x0000)
struct BP_CreateCharacter_IconSelector_C_BtnPreviousClicked final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreateCharacter_IconSelector_C_BtnPreviousClicked) == 0x000008, "Wrong alignment on BP_CreateCharacter_IconSelector_C_BtnPreviousClicked");
static_assert(sizeof(BP_CreateCharacter_IconSelector_C_BtnPreviousClicked) == 0x000020, "Wrong size on BP_CreateCharacter_IconSelector_C_BtnPreviousClicked");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_BtnPreviousClicked, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'BP_CreateCharacter_IconSelector_C_BtnPreviousClicked::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_BtnPreviousClicked, Temp_int_Variable) == 0x000008, "Member 'BP_CreateCharacter_IconSelector_C_BtnPreviousClicked::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_BtnPreviousClicked, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BP_CreateCharacter_IconSelector_C_BtnPreviousClicked::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_BtnPreviousClicked, CallFunc_Less_IntInt_ReturnValue) == 0x000010, "Member 'BP_CreateCharacter_IconSelector_C_BtnPreviousClicked::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_BtnPreviousClicked, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'BP_CreateCharacter_IconSelector_C_BtnPreviousClicked::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_BtnPreviousClicked, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000018, "Member 'BP_CreateCharacter_IconSelector_C_BtnPreviousClicked::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_CreateCharacter_IconSelector.BP_CreateCharacter_IconSelector_C.UpdateSlots
// 0x0018 (0x0018 - 0x0000)
struct BP_CreateCharacter_IconSelector_C_UpdateSlots final
{
public:
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreateCharacter_IconSelector_C_UpdateSlots) == 0x000008, "Wrong alignment on BP_CreateCharacter_IconSelector_C_UpdateSlots");
static_assert(sizeof(BP_CreateCharacter_IconSelector_C_UpdateSlots) == 0x000018, "Wrong size on BP_CreateCharacter_IconSelector_C_UpdateSlots");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_UpdateSlots, CallFunc_Array_Length_ReturnValue) == 0x000000, "Member 'BP_CreateCharacter_IconSelector_C_UpdateSlots::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_UpdateSlots, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'BP_CreateCharacter_IconSelector_C_UpdateSlots::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_UpdateSlots, CallFunc_Array_Length_ReturnValue_1) == 0x000008, "Member 'BP_CreateCharacter_IconSelector_C_UpdateSlots::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_UpdateSlots, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00000C, "Member 'BP_CreateCharacter_IconSelector_C_UpdateSlots::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_UpdateSlots, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_CreateCharacter_IconSelector_C_UpdateSlots::CallFunc_Array_Get_Item' has a wrong offset!");

// Function BP_CreateCharacter_IconSelector.BP_CreateCharacter_IconSelector_C.SetFocused
// 0x0080 (0x0080 - 0x0000)
struct BP_CreateCharacter_IconSelector_C_SetFocused final
{
public:
	bool                                          InIsFocused;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          PlayAnim;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0040(0x0028)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          K2Node_Select_Default_1;                           // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreateCharacter_IconSelector_C_SetFocused) == 0x000008, "Wrong alignment on BP_CreateCharacter_IconSelector_C_SetFocused");
static_assert(sizeof(BP_CreateCharacter_IconSelector_C_SetFocused) == 0x000080, "Wrong size on BP_CreateCharacter_IconSelector_C_SetFocused");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_SetFocused, InIsFocused) == 0x000000, "Member 'BP_CreateCharacter_IconSelector_C_SetFocused::InIsFocused' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_SetFocused, PlayAnim) == 0x000001, "Member 'BP_CreateCharacter_IconSelector_C_SetFocused::PlayAnim' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_SetFocused, Temp_bool_Variable) == 0x000002, "Member 'BP_CreateCharacter_IconSelector_C_SetFocused::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_SetFocused, Temp_struct_Variable) == 0x000004, "Member 'BP_CreateCharacter_IconSelector_C_SetFocused::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_SetFocused, Temp_struct_Variable_1) == 0x000014, "Member 'BP_CreateCharacter_IconSelector_C_SetFocused::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_SetFocused, Temp_bool_Variable_1) == 0x000024, "Member 'BP_CreateCharacter_IconSelector_C_SetFocused::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_SetFocused, Temp_float_Variable) == 0x000028, "Member 'BP_CreateCharacter_IconSelector_C_SetFocused::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_SetFocused, Temp_bool_Variable_2) == 0x00002C, "Member 'BP_CreateCharacter_IconSelector_C_SetFocused::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_SetFocused, Temp_byte_Variable) == 0x00002D, "Member 'BP_CreateCharacter_IconSelector_C_SetFocused::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_SetFocused, Temp_byte_Variable_1) == 0x00002E, "Member 'BP_CreateCharacter_IconSelector_C_SetFocused::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_SetFocused, K2Node_Select_Default) == 0x000030, "Member 'BP_CreateCharacter_IconSelector_C_SetFocused::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_SetFocused, K2Node_MakeStruct_SlateColor) == 0x000040, "Member 'BP_CreateCharacter_IconSelector_C_SetFocused::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_SetFocused, CallFunc_Not_PreBool_ReturnValue) == 0x000068, "Member 'BP_CreateCharacter_IconSelector_C_SetFocused::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_SetFocused, CallFunc_Not_PreBool_ReturnValue_1) == 0x000069, "Member 'BP_CreateCharacter_IconSelector_C_SetFocused::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_SetFocused, CallFunc_BooleanAND_ReturnValue) == 0x00006A, "Member 'BP_CreateCharacter_IconSelector_C_SetFocused::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_SetFocused, K2Node_Select_Default_1) == 0x00006B, "Member 'BP_CreateCharacter_IconSelector_C_SetFocused::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_SetFocused, CallFunc_GetEndTime_ReturnValue) == 0x00006C, "Member 'BP_CreateCharacter_IconSelector_C_SetFocused::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_SetFocused, K2Node_Select_Default_2) == 0x000070, "Member 'BP_CreateCharacter_IconSelector_C_SetFocused::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_SetFocused, CallFunc_PlayAnimation_ReturnValue) == 0x000078, "Member 'BP_CreateCharacter_IconSelector_C_SetFocused::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BP_CreateCharacter_IconSelector.BP_CreateCharacter_IconSelector_C.Init
// 0x0028 (0x0028 - 0x0000)
struct BP_CreateCharacter_IconSelector_C_Init final
{
public:
	TArray<class UTexture2D*>                     InIconArray;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class FText>                           InOptionsArray;                                    // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         InSelectedIndex;                                   // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreateCharacter_IconSelector_C_Init) == 0x000008, "Wrong alignment on BP_CreateCharacter_IconSelector_C_Init");
static_assert(sizeof(BP_CreateCharacter_IconSelector_C_Init) == 0x000028, "Wrong size on BP_CreateCharacter_IconSelector_C_Init");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_Init, InIconArray) == 0x000000, "Member 'BP_CreateCharacter_IconSelector_C_Init::InIconArray' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_Init, InOptionsArray) == 0x000010, "Member 'BP_CreateCharacter_IconSelector_C_Init::InOptionsArray' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_Init, InSelectedIndex) == 0x000020, "Member 'BP_CreateCharacter_IconSelector_C_Init::InSelectedIndex' has a wrong offset!");

// Function BP_CreateCharacter_IconSelector.BP_CreateCharacter_IconSelector_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_CreateCharacter_IconSelector_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CreateCharacter_IconSelector_C_PreConstruct) == 0x000001, "Wrong alignment on BP_CreateCharacter_IconSelector_C_PreConstruct");
static_assert(sizeof(BP_CreateCharacter_IconSelector_C_PreConstruct) == 0x000001, "Wrong size on BP_CreateCharacter_IconSelector_C_PreConstruct");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_CreateCharacter_IconSelector_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_CreateCharacter_IconSelector.BP_CreateCharacter_IconSelector_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_CreateCharacter_IconSelector_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreateCharacter_IconSelector_C_Tick) == 0x000004, "Wrong alignment on BP_CreateCharacter_IconSelector_C_Tick");
static_assert(sizeof(BP_CreateCharacter_IconSelector_C_Tick) == 0x00003C, "Wrong size on BP_CreateCharacter_IconSelector_C_Tick");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_Tick, MyGeometry) == 0x000000, "Member 'BP_CreateCharacter_IconSelector_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_CreateCharacter_IconSelector_C_Tick::InDeltaTime' has a wrong offset!");

// Function BP_CreateCharacter_IconSelector.BP_CreateCharacter_IconSelector_C.OnFocused
// 0x0001 (0x0001 - 0x0000)
struct BP_CreateCharacter_IconSelector_C_OnFocused final
{
public:
	bool                                          bAnimate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CreateCharacter_IconSelector_C_OnFocused) == 0x000001, "Wrong alignment on BP_CreateCharacter_IconSelector_C_OnFocused");
static_assert(sizeof(BP_CreateCharacter_IconSelector_C_OnFocused) == 0x000001, "Wrong size on BP_CreateCharacter_IconSelector_C_OnFocused");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_OnFocused, bAnimate) == 0x000000, "Member 'BP_CreateCharacter_IconSelector_C_OnFocused::bAnimate' has a wrong offset!");

// Function BP_CreateCharacter_IconSelector.BP_CreateCharacter_IconSelector_C.OnUnfocused
// 0x0001 (0x0001 - 0x0000)
struct BP_CreateCharacter_IconSelector_C_OnUnfocused final
{
public:
	bool                                          bAnimate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CreateCharacter_IconSelector_C_OnUnfocused) == 0x000001, "Wrong alignment on BP_CreateCharacter_IconSelector_C_OnUnfocused");
static_assert(sizeof(BP_CreateCharacter_IconSelector_C_OnUnfocused) == 0x000001, "Wrong size on BP_CreateCharacter_IconSelector_C_OnUnfocused");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_OnUnfocused, bAnimate) == 0x000000, "Member 'BP_CreateCharacter_IconSelector_C_OnUnfocused::bAnimate' has a wrong offset!");

// Function BP_CreateCharacter_IconSelector.BP_CreateCharacter_IconSelector_C.OnSetFocusAnim
// 0x0001 (0x0001 - 0x0000)
struct BP_CreateCharacter_IconSelector_C_OnSetFocusAnim final
{
public:
	bool                                          bInFocused;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CreateCharacter_IconSelector_C_OnSetFocusAnim) == 0x000001, "Wrong alignment on BP_CreateCharacter_IconSelector_C_OnSetFocusAnim");
static_assert(sizeof(BP_CreateCharacter_IconSelector_C_OnSetFocusAnim) == 0x000001, "Wrong size on BP_CreateCharacter_IconSelector_C_OnSetFocusAnim");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_OnSetFocusAnim, bInFocused) == 0x000000, "Member 'BP_CreateCharacter_IconSelector_C_OnSetFocusAnim::bInFocused' has a wrong offset!");

// Function BP_CreateCharacter_IconSelector.BP_CreateCharacter_IconSelector_C.OnSetEnabled
// 0x0001 (0x0001 - 0x0000)
struct BP_CreateCharacter_IconSelector_C_OnSetEnabled final
{
public:
	bool                                          bInEnabled;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CreateCharacter_IconSelector_C_OnSetEnabled) == 0x000001, "Wrong alignment on BP_CreateCharacter_IconSelector_C_OnSetEnabled");
static_assert(sizeof(BP_CreateCharacter_IconSelector_C_OnSetEnabled) == 0x000001, "Wrong size on BP_CreateCharacter_IconSelector_C_OnSetEnabled");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_OnSetEnabled, bInEnabled) == 0x000000, "Member 'BP_CreateCharacter_IconSelector_C_OnSetEnabled::bInEnabled' has a wrong offset!");

// Function BP_CreateCharacter_IconSelector.BP_CreateCharacter_IconSelector_C.ExecuteUbergraph_BP_CreateCharacter_IconSelector
// 0x0060 (0x0060 - 0x0000)
struct BP_CreateCharacter_IconSelector_C_ExecuteUbergraph_BP_CreateCharacter_IconSelector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAnimate_1;                           // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bAnimate;                             // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInFocused;                           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInEnabled;                           // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CreateCharacter_IconSelector_C_ExecuteUbergraph_BP_CreateCharacter_IconSelector) == 0x000008, "Wrong alignment on BP_CreateCharacter_IconSelector_C_ExecuteUbergraph_BP_CreateCharacter_IconSelector");
static_assert(sizeof(BP_CreateCharacter_IconSelector_C_ExecuteUbergraph_BP_CreateCharacter_IconSelector) == 0x000060, "Wrong size on BP_CreateCharacter_IconSelector_C_ExecuteUbergraph_BP_CreateCharacter_IconSelector");
static_assert(offsetof(BP_CreateCharacter_IconSelector_C_ExecuteUbergraph_BP_CreateCharacter_IconSelector, EntryPoint) == 0x000000, "Member 'BP_CreateCharacter_IconSelector_C_ExecuteUbergraph_BP_CreateCharacter_IconSelector::EntryPoint' has a wrong offset!");
