#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosSparksVisualEntity

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ChaosSparksVisualEntity.BP_ChaosSparksVisualEntity_C.ExecuteUbergraph_BP_ChaosSparksVisualEntity
// 0x0020 (0x0020 - 0x0000)
struct BP_ChaosSparksVisualEntity_C_ExecuteUbergraph_BP_ChaosSparksVisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AChaosSparksProjectile*                 K2Node_DynamicCast_AsChaos_Sparks_Projectile;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ChaosSparksVisualEntity_C_ExecuteUbergraph_BP_ChaosSparksVisualEntity) == 0x000008, "Wrong alignment on BP_ChaosSparksVisualEntity_C_ExecuteUbergraph_BP_ChaosSparksVisualEntity");
static_assert(sizeof(BP_ChaosSparksVisualEntity_C_ExecuteUbergraph_BP_ChaosSparksVisualEntity) == 0x000020, "Wrong size on BP_ChaosSparksVisualEntity_C_ExecuteUbergraph_BP_ChaosSparksVisualEntity");
static_assert(offsetof(BP_ChaosSparksVisualEntity_C_ExecuteUbergraph_BP_ChaosSparksVisualEntity, EntryPoint) == 0x000000, "Member 'BP_ChaosSparksVisualEntity_C_ExecuteUbergraph_BP_ChaosSparksVisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ChaosSparksVisualEntity_C_ExecuteUbergraph_BP_ChaosSparksVisualEntity, CallFunc_GetAttachParentActor_ReturnValue) == 0x000008, "Member 'BP_ChaosSparksVisualEntity_C_ExecuteUbergraph_BP_ChaosSparksVisualEntity::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChaosSparksVisualEntity_C_ExecuteUbergraph_BP_ChaosSparksVisualEntity, K2Node_DynamicCast_AsChaos_Sparks_Projectile) == 0x000010, "Member 'BP_ChaosSparksVisualEntity_C_ExecuteUbergraph_BP_ChaosSparksVisualEntity::K2Node_DynamicCast_AsChaos_Sparks_Projectile' has a wrong offset!");
static_assert(offsetof(BP_ChaosSparksVisualEntity_C_ExecuteUbergraph_BP_ChaosSparksVisualEntity, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_ChaosSparksVisualEntity_C_ExecuteUbergraph_BP_ChaosSparksVisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

