#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DaggerTrap

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_DaggerTrap.BP_DaggerTrap_C.ExecuteUbergraph_BP_DaggerTrap
// 0x0048 (0x0048 - 0x0000)
struct BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     K2Node_CustomEvent_OwnerAbilityController;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayEventID*                       K2Node_CustomEvent_GameplayEventID;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_GameplayEventName;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActorSoul*                             K2Node_CustomEvent_paramActorSoul;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class UAbilityController* OwnerAbilityController, class UGameplayEventID* GameplayEventID, class FName GameplayEventName, class AActorSoul* paramActorSoul)> K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap) == 0x000008, "Wrong alignment on BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap");
static_assert(sizeof(BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap) == 0x000048, "Wrong size on BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap");
static_assert(offsetof(BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap, EntryPoint) == 0x000000, "Member 'BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap, CallFunc_GetAbilityController_ReturnValue) == 0x000008, "Member 'BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap, K2Node_CustomEvent_OwnerAbilityController) == 0x000010, "Member 'BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap::K2Node_CustomEvent_OwnerAbilityController' has a wrong offset!");
static_assert(offsetof(BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap, K2Node_CustomEvent_GameplayEventID) == 0x000018, "Member 'BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap::K2Node_CustomEvent_GameplayEventID' has a wrong offset!");
static_assert(offsetof(BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap, K2Node_CustomEvent_GameplayEventName) == 0x000020, "Member 'BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap::K2Node_CustomEvent_GameplayEventName' has a wrong offset!");
static_assert(offsetof(BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap, K2Node_CustomEvent_paramActorSoul) == 0x000028, "Member 'BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap::K2Node_CustomEvent_paramActorSoul' has a wrong offset!");
static_assert(offsetof(BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000030, "Member 'BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap, K2Node_SwitchEnum_CmpSuccess) == 0x000031, "Member 'BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000032, "Member 'BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x000033, "Member 'BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'BP_DaggerTrap_C_ExecuteUbergraph_BP_DaggerTrap::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_DaggerTrap.BP_DaggerTrap_C.OnGameplayEvent
// 0x0020 (0x0020 - 0x0000)
struct BP_DaggerTrap_C_OnGameplayEvent final
{
public:
	class UAbilityController*                     OwnerAbilityController;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayEventID*                       GameplayEventID;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GameplayEventName;                                 // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActorSoul*                             paramActorSoul;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DaggerTrap_C_OnGameplayEvent) == 0x000008, "Wrong alignment on BP_DaggerTrap_C_OnGameplayEvent");
static_assert(sizeof(BP_DaggerTrap_C_OnGameplayEvent) == 0x000020, "Wrong size on BP_DaggerTrap_C_OnGameplayEvent");
static_assert(offsetof(BP_DaggerTrap_C_OnGameplayEvent, OwnerAbilityController) == 0x000000, "Member 'BP_DaggerTrap_C_OnGameplayEvent::OwnerAbilityController' has a wrong offset!");
static_assert(offsetof(BP_DaggerTrap_C_OnGameplayEvent, GameplayEventID) == 0x000008, "Member 'BP_DaggerTrap_C_OnGameplayEvent::GameplayEventID' has a wrong offset!");
static_assert(offsetof(BP_DaggerTrap_C_OnGameplayEvent, GameplayEventName) == 0x000010, "Member 'BP_DaggerTrap_C_OnGameplayEvent::GameplayEventName' has a wrong offset!");
static_assert(offsetof(BP_DaggerTrap_C_OnGameplayEvent, paramActorSoul) == 0x000018, "Member 'BP_DaggerTrap_C_OnGameplayEvent::paramActorSoul' has a wrong offset!");

}

