#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DarkFireImp_BeamPrecursor_VisualEntity

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DarkFireImp_BeamPrecursor_VisualEntity.BP_DarkFireImp_BeamPrecursor_VisualEntity_C.ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity
// 0x01B0 (0x01B0 - 0x0000)
struct BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_GetLastBeamEndPoint_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByName_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAISupportedBeamAbility*                K2Node_DynamicCast_AsAISupported_Beam_Ability;     // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetLastBeamEndPoint_ReturnValue_1;        // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0084(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_1;         // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_1;     // 0x0124(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity) == 0x000008, "Wrong alignment on BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity");
static_assert(sizeof(BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity) == 0x0001B0, "Wrong size on BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity");
static_assert(offsetof(BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity, Temp_delegate_Variable) == 0x000004, "Member 'BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity, CallFunc_GetLastBeamEndPoint_ReturnValue) == 0x000014, "Member 'BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity::CallFunc_GetLastBeamEndPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity, CallFunc_PostAkEvent_ReturnValue) == 0x000020, "Member 'BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity, CallFunc_GetAttachParentActor_ReturnValue) == 0x000028, "Member 'BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity, K2Node_DynamicCast_AsCharacter_Base) == 0x000030, "Member 'BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity, K2Node_Event_DeltaSeconds) == 0x00003C, "Member 'BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity, CallFunc_GetAbilityController_ReturnValue) == 0x000040, "Member 'BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity, CallFunc_BPGetAbilityByName_ReturnValue) == 0x000048, "Member 'BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity::CallFunc_BPGetAbilityByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity, K2Node_DynamicCast_AsAISupported_Beam_Ability) == 0x000060, "Member 'BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity::K2Node_DynamicCast_AsAISupported_Beam_Ability' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity, CallFunc_FindLookAtRotation_ReturnValue) == 0x00006C, "Member 'BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity, CallFunc_GetLastBeamEndPoint_ReturnValue_1) == 0x000078, "Member 'BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity::CallFunc_GetLastBeamEndPoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000084, "Member 'BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00010C, "Member 'BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity, CallFunc_FindLookAtRotation_ReturnValue_1) == 0x000118, "Member 'BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity::CallFunc_FindLookAtRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity, CallFunc_K2_SetWorldRotation_SweepHitResult_1) == 0x000124, "Member 'BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_BeamPrecursor_VisualEntity::CallFunc_K2_SetWorldRotation_SweepHitResult_1' has a wrong offset!");

// Function BP_DarkFireImp_BeamPrecursor_VisualEntity.BP_DarkFireImp_BeamPrecursor_VisualEntity_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ReceiveTick");
static_assert(sizeof(BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong size on BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ReceiveTick");
static_assert(offsetof(BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_DarkFireImp_BeamPrecursor_VisualEntity_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

