#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DivineAegis_Impact

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_DivineAegis_Impact.BP_DivineAegis_Impact_C.ExecuteUbergraph_BP_DivineAegis_Impact
// 0x000C (0x000C - 0x0000)
struct BP_DivineAegis_Impact_C_ExecuteUbergraph_BP_DivineAegis_Impact final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAbilityUpgradeUnlocked_ReturnValue;     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DivineAegis_Impact_C_ExecuteUbergraph_BP_DivineAegis_Impact) == 0x000004, "Wrong alignment on BP_DivineAegis_Impact_C_ExecuteUbergraph_BP_DivineAegis_Impact");
static_assert(sizeof(BP_DivineAegis_Impact_C_ExecuteUbergraph_BP_DivineAegis_Impact) == 0x00000C, "Wrong size on BP_DivineAegis_Impact_C_ExecuteUbergraph_BP_DivineAegis_Impact");
static_assert(offsetof(BP_DivineAegis_Impact_C_ExecuteUbergraph_BP_DivineAegis_Impact, EntryPoint) == 0x000000, "Member 'BP_DivineAegis_Impact_C_ExecuteUbergraph_BP_DivineAegis_Impact::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DivineAegis_Impact_C_ExecuteUbergraph_BP_DivineAegis_Impact, CallFunc_IsAbilityUpgradeUnlocked_ReturnValue) == 0x000004, "Member 'BP_DivineAegis_Impact_C_ExecuteUbergraph_BP_DivineAegis_Impact::CallFunc_IsAbilityUpgradeUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DivineAegis_Impact_C_ExecuteUbergraph_BP_DivineAegis_Impact, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000008, "Member 'BP_DivineAegis_Impact_C_ExecuteUbergraph_BP_DivineAegis_Impact::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");

}

