#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Debris_Splash

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Debris_Splash.BP_Debris_Splash_C
// 0x0038 (0x0260 - 0x0228)
class ABP_Debris_Splash_C final : public AActor
{
public:
	class UNiagaraComponent*                      NS_SplashDebris1;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UManVisualController*                   ManVisualController;                               // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Diameter;                                          // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DebrisSize;                                        // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Opacity;                                           // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x024C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         amount;                                            // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Debris_Splash_C">();
	}
	static class ABP_Debris_Splash_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Debris_Splash_C>();
	}
};
static_assert(alignof(ABP_Debris_Splash_C) == 0x000008, "Wrong alignment on ABP_Debris_Splash_C");
static_assert(sizeof(ABP_Debris_Splash_C) == 0x000260, "Wrong size on ABP_Debris_Splash_C");
static_assert(offsetof(ABP_Debris_Splash_C, NS_SplashDebris1) == 0x000228, "Member 'ABP_Debris_Splash_C::NS_SplashDebris1' has a wrong offset!");
static_assert(offsetof(ABP_Debris_Splash_C, ManVisualController) == 0x000230, "Member 'ABP_Debris_Splash_C::ManVisualController' has a wrong offset!");
static_assert(offsetof(ABP_Debris_Splash_C, DefaultSceneRoot) == 0x000238, "Member 'ABP_Debris_Splash_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Debris_Splash_C, Diameter) == 0x000240, "Member 'ABP_Debris_Splash_C::Diameter' has a wrong offset!");
static_assert(offsetof(ABP_Debris_Splash_C, DebrisSize) == 0x000244, "Member 'ABP_Debris_Splash_C::DebrisSize' has a wrong offset!");
static_assert(offsetof(ABP_Debris_Splash_C, Opacity) == 0x000248, "Member 'ABP_Debris_Splash_C::Opacity' has a wrong offset!");
static_assert(offsetof(ABP_Debris_Splash_C, Color) == 0x00024C, "Member 'ABP_Debris_Splash_C::Color' has a wrong offset!");
static_assert(offsetof(ABP_Debris_Splash_C, amount) == 0x00025C, "Member 'ABP_Debris_Splash_C::amount' has a wrong offset!");

}

