#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeathScreenVFX

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_DeathScreenVFX.BP_DeathScreenVFX_C.ExecuteUbergraph_BP_DeathScreenVFX
// 0x01D0 (0x01D0 - 0x0000)
struct BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0030(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0xC];                                       // 0x0044(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               K2Node_MakeStruct_Vector4;                         // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               K2Node_MakeStruct_Vector4_1;                       // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_1;         // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector4ToVector_ReturnValue;         // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector4ToVector_ReturnValue_1;       // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0xC];                                       // 0x00C4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue;                  // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               CallFunc_MakeVector4_ReturnValue_1;                // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector4ToVector_ReturnValue_2;       // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector4ToVector_ReturnValue_3;       // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_2;                      // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector4ToVector_ReturnValue_4;       // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue_2;                // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_2;         // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_3;         // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_3;                      // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_4;                      // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_4;                          // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_4;                          // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_4;                          // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue_3;                // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               CallFunc_MakeVector4_ReturnValue_4;                // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AManPlayerController*                   K2Node_DynamicCast_AsMan_Player_Controller;        // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UManLocalPlayer*                        CallFunc_GetManLocalPlayer_ReturnValue;            // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX) == 0x000010, "Wrong alignment on BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX");
static_assert(sizeof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX) == 0x0001D0, "Wrong size on BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, EntryPoint) == 0x000000, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000004, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, Temp_delegate_Variable) == 0x000030, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_PostEvent_ReturnValue) == 0x000040, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, K2Node_MakeStruct_Vector4) == 0x000050, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::K2Node_MakeStruct_Vector4' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, K2Node_MakeStruct_Vector4_1) == 0x000060, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::K2Node_MakeStruct_Vector4_1' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_Conv_FloatToVector_ReturnValue_1) == 0x000070, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_Conv_FloatToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_Conv_Vector4ToVector_ReturnValue) == 0x00007C, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_Conv_Vector4ToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_Conv_Vector4ToVector_ReturnValue_1) == 0x000088, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_Conv_Vector4ToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_VLerp_ReturnValue) == 0x000094, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_VLerp_ReturnValue_1) == 0x0000A0, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_BreakVector_X) == 0x0000AC, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_BreakVector_Y) == 0x0000B0, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_BreakVector_Z) == 0x0000B4, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_BreakVector_X_1) == 0x0000B8, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_BreakVector_Y_1) == 0x0000BC, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_BreakVector_Z_1) == 0x0000C0, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_MakeVector4_ReturnValue) == 0x0000D0, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_MakeVector4_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_MakeVector4_ReturnValue_1) == 0x0000E0, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_MakeVector4_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_Conv_Vector4ToVector_ReturnValue_2) == 0x0000F0, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_Conv_Vector4ToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_Conv_Vector4ToVector_ReturnValue_3) == 0x0000FC, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_Conv_Vector4ToVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_VLerp_ReturnValue_2) == 0x000108, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_VLerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_Conv_Vector4ToVector_ReturnValue_4) == 0x000114, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_Conv_Vector4ToVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_BreakVector_X_2) == 0x000120, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_BreakVector_Y_2) == 0x000124, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_BreakVector_Z_2) == 0x000128, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_MakeVector4_ReturnValue_2) == 0x000130, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_MakeVector4_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_Conv_FloatToVector_ReturnValue_2) == 0x000140, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_Conv_FloatToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_Conv_FloatToVector_ReturnValue_3) == 0x00014C, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_Conv_FloatToVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_VLerp_ReturnValue_3) == 0x000158, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_VLerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_VLerp_ReturnValue_4) == 0x000164, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_VLerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_BreakVector_X_3) == 0x000170, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_BreakVector_Y_3) == 0x000174, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_BreakVector_Z_3) == 0x000178, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_BreakVector_X_4) == 0x00017C, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_BreakVector_Y_4) == 0x000180, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_BreakVector_Y_4' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_BreakVector_Z_4) == 0x000184, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_BreakVector_Z_4' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_MakeVector4_ReturnValue_3) == 0x000190, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_MakeVector4_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_MakeVector4_ReturnValue_4) == 0x0001A0, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_MakeVector4_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_GetPlayerController_ReturnValue) == 0x0001B0, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, K2Node_DynamicCast_AsMan_Player_Controller) == 0x0001B8, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::K2Node_DynamicCast_AsMan_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, K2Node_DynamicCast_bSuccess) == 0x0001C0, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX, CallFunc_GetManLocalPlayer_ReturnValue) == 0x0001C8, "Member 'BP_DeathScreenVFX_C_ExecuteUbergraph_BP_DeathScreenVFX::CallFunc_GetManLocalPlayer_ReturnValue' has a wrong offset!");

// Function BP_DeathScreenVFX.BP_DeathScreenVFX_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct BP_DeathScreenVFX_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeathScreenVFX_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_DeathScreenVFX_C_UserConstructionScript");
static_assert(sizeof(BP_DeathScreenVFX_C_UserConstructionScript) == 0x000008, "Wrong size on BP_DeathScreenVFX_C_UserConstructionScript");
static_assert(offsetof(BP_DeathScreenVFX_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_DeathScreenVFX_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

