#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DivineAegisShatter_VE

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DivineAegisShatter_VE.BP_DivineAegisShatter_VE_C
// 0x0018 (0x0368 - 0x0350)
class ABP_DivineAegisShatter_VE_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Sphere;                                            // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara_Break;                                     // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DivineAegisShatter_VE(int32 EntryPoint);
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DivineAegisShatter_VE_C">();
	}
	static class ABP_DivineAegisShatter_VE_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DivineAegisShatter_VE_C>();
	}
};
static_assert(alignof(ABP_DivineAegisShatter_VE_C) == 0x000008, "Wrong alignment on ABP_DivineAegisShatter_VE_C");
static_assert(sizeof(ABP_DivineAegisShatter_VE_C) == 0x000368, "Wrong size on ABP_DivineAegisShatter_VE_C");
static_assert(offsetof(ABP_DivineAegisShatter_VE_C, UberGraphFrame) == 0x000350, "Member 'ABP_DivineAegisShatter_VE_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DivineAegisShatter_VE_C, Sphere) == 0x000358, "Member 'ABP_DivineAegisShatter_VE_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_DivineAegisShatter_VE_C, Niagara_Break) == 0x000360, "Member 'ABP_DivineAegisShatter_VE_C::Niagara_Break' has a wrong offset!");

}

