#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Door_ActorBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Door_ActorBase.BP_Door_ActorBase_C.CloseDoor
// 0x0008 (0x0008 - 0x0000)
struct BP_Door_ActorBase_C_CloseDoor final
{
public:
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Door_ActorBase_C_CloseDoor) == 0x000008, "Wrong alignment on BP_Door_ActorBase_C_CloseDoor");
static_assert(sizeof(BP_Door_ActorBase_C_CloseDoor) == 0x000008, "Wrong size on BP_Door_ActorBase_C_CloseDoor");
static_assert(offsetof(BP_Door_ActorBase_C_CloseDoor, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000000, "Member 'BP_Door_ActorBase_C_CloseDoor::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");

// Function BP_Door_ActorBase.BP_Door_ActorBase_C.OpenDoor
// 0x0008 (0x0008 - 0x0000)
struct BP_Door_ActorBase_C_OpenDoor final
{
public:
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Door_ActorBase_C_OpenDoor) == 0x000008, "Wrong alignment on BP_Door_ActorBase_C_OpenDoor");
static_assert(sizeof(BP_Door_ActorBase_C_OpenDoor) == 0x000008, "Wrong size on BP_Door_ActorBase_C_OpenDoor");
static_assert(offsetof(BP_Door_ActorBase_C_OpenDoor, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000000, "Member 'BP_Door_ActorBase_C_OpenDoor::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");

// Function BP_Door_ActorBase.BP_Door_ActorBase_C.UserConstructionScript
// 0x02EC (0x02EC - 0x0000)
struct BP_Door_ActorBase_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult;    // 0x000C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult_1;  // 0x0094(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x011C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult_2;  // 0x012C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x01B4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x023C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue_1;   // 0x02C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x02D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_1;    // 0x02DC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Door_ActorBase_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_Door_ActorBase_C_UserConstructionScript");
static_assert(sizeof(BP_Door_ActorBase_C_UserConstructionScript) == 0x0002EC, "Wrong size on BP_Door_ActorBase_C_UserConstructionScript");
static_assert(offsetof(BP_Door_ActorBase_C_UserConstructionScript, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000000, "Member 'BP_Door_ActorBase_C_UserConstructionScript::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_UserConstructionScript, CallFunc_K2_AddRelativeLocation_SweepHitResult) == 0x00000C, "Member 'BP_Door_ActorBase_C_UserConstructionScript::CallFunc_K2_AddRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_UserConstructionScript, CallFunc_K2_AddRelativeLocation_SweepHitResult_1) == 0x000094, "Member 'BP_Door_ActorBase_C_UserConstructionScript::CallFunc_K2_AddRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_UserConstructionScript, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x00011C, "Member 'BP_Door_ActorBase_C_UserConstructionScript::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_UserConstructionScript, CallFunc_K2_AddRelativeLocation_SweepHitResult_2) == 0x00012C, "Member 'BP_Door_ActorBase_C_UserConstructionScript::CallFunc_K2_AddRelativeLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_UserConstructionScript, CallFunc_K2_AddRelativeRotation_SweepHitResult) == 0x0001B4, "Member 'BP_Door_ActorBase_C_UserConstructionScript::CallFunc_K2_AddRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x00023C, "Member 'BP_Door_ActorBase_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_UserConstructionScript, CallFunc_Conv_LinearColorToVector_ReturnValue_1) == 0x0002C4, "Member 'BP_Door_ActorBase_C_UserConstructionScript::CallFunc_Conv_LinearColorToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0002D0, "Member 'BP_Door_ActorBase_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_UserConstructionScript, CallFunc_Conv_ColorToLinearColor_ReturnValue_1) == 0x0002DC, "Member 'BP_Door_ActorBase_C_UserConstructionScript::CallFunc_Conv_ColorToLinearColor_ReturnValue_1' has a wrong offset!");

// Function BP_Door_ActorBase.BP_Door_ActorBase_C.OnBPStart
// 0x0008 (0x0008 - 0x0000)
struct BP_Door_ActorBase_C_OnBPStart final
{
public:
	class UAbilityBase*                           InAbility;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Door_ActorBase_C_OnBPStart) == 0x000008, "Wrong alignment on BP_Door_ActorBase_C_OnBPStart");
static_assert(sizeof(BP_Door_ActorBase_C_OnBPStart) == 0x000008, "Wrong size on BP_Door_ActorBase_C_OnBPStart");
static_assert(offsetof(BP_Door_ActorBase_C_OnBPStart, InAbility) == 0x000000, "Member 'BP_Door_ActorBase_C_OnBPStart::InAbility' has a wrong offset!");

// Function BP_Door_ActorBase.BP_Door_ActorBase_C.OnVfxEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_Door_ActorBase_C_OnVfxEvent final
{
public:
	class FName                                   VfxEventType;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Door_ActorBase_C_OnVfxEvent) == 0x000004, "Wrong alignment on BP_Door_ActorBase_C_OnVfxEvent");
static_assert(sizeof(BP_Door_ActorBase_C_OnVfxEvent) == 0x000008, "Wrong size on BP_Door_ActorBase_C_OnVfxEvent");
static_assert(offsetof(BP_Door_ActorBase_C_OnVfxEvent, VfxEventType) == 0x000000, "Member 'BP_Door_ActorBase_C_OnVfxEvent::VfxEventType' has a wrong offset!");

// Function BP_Door_ActorBase.BP_Door_ActorBase_C.ExecuteUbergraph_BP_Door_ActorBase
// 0x0060 (0x0060 - 0x0000)
struct BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_2;      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_3;      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           K2Node_CustomEvent_InAbility;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAbilityBase* InAbility)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class UBP_General_Open_Ability_C*             K2Node_DynamicCast_AsBP_General_Open_Ability;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_VfxEventType;                         // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase) == 0x000008, "Wrong alignment on BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase");
static_assert(sizeof(BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase) == 0x000060, "Wrong size on BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase");
static_assert(offsetof(BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase, EntryPoint) == 0x000000, "Member 'BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000004, "Member 'BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00000C, "Member 'BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x000010, "Member 'BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase, CallFunc_EqualEqual_ClassClass_ReturnValue_2) == 0x000011, "Member 'BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase::CallFunc_EqualEqual_ClassClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase, CallFunc_EqualEqual_ClassClass_ReturnValue_3) == 0x000012, "Member 'BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase::CallFunc_EqualEqual_ClassClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase, CallFunc_BooleanOR_ReturnValue) == 0x000013, "Member 'BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000014, "Member 'BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase, CallFunc_BooleanOR_ReturnValue_1) == 0x000018, "Member 'BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase, CallFunc_BooleanOR_ReturnValue_2) == 0x000019, "Member 'BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase, CallFunc_GetAbilityController_ReturnValue) == 0x000020, "Member 'BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase, K2Node_CustomEvent_InAbility) == 0x000028, "Member 'BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase::K2Node_CustomEvent_InAbility' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000030, "Member 'BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase, K2Node_DynamicCast_AsBP_General_Open_Ability) == 0x000048, "Member 'BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase::K2Node_DynamicCast_AsBP_General_Open_Ability' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase, K2Node_Event_VfxEventType) == 0x000054, "Member 'BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase::K2Node_Event_VfxEventType' has a wrong offset!");
static_assert(offsetof(BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase, K2Node_SwitchName_CmpSuccess) == 0x00005C, "Member 'BP_Door_ActorBase_C_ExecuteUbergraph_BP_Door_ActorBase::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

}

