#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dudley

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Dudley.BP_Dudley_C
// 0x0040 (0x0818 - 0x07D8)
class ABP_Dudley_C : public AActorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_CinematicGhost_C*                   BP_CinematicGhost;                                 // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SpeechBubbleComponent_C*            BP_SpeechBubbleComponent;                          // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CameraSphere;                                      // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTriggerBoxComponent*                   TriggerBox;                                        // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_Dudley(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Dudley_C">();
	}
	static class ABP_Dudley_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Dudley_C>();
	}
};
static_assert(alignof(ABP_Dudley_C) == 0x000008, "Wrong alignment on ABP_Dudley_C");
static_assert(sizeof(ABP_Dudley_C) == 0x000818, "Wrong size on ABP_Dudley_C");
static_assert(offsetof(ABP_Dudley_C, UberGraphFrame) == 0x0007D8, "Member 'ABP_Dudley_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Dudley_C, BP_CinematicGhost) == 0x0007E0, "Member 'ABP_Dudley_C::BP_CinematicGhost' has a wrong offset!");
static_assert(offsetof(ABP_Dudley_C, BP_SpeechBubbleComponent) == 0x0007E8, "Member 'ABP_Dudley_C::BP_SpeechBubbleComponent' has a wrong offset!");
static_assert(offsetof(ABP_Dudley_C, Ak) == 0x0007F0, "Member 'ABP_Dudley_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_Dudley_C, CameraSphere) == 0x0007F8, "Member 'ABP_Dudley_C::CameraSphere' has a wrong offset!");
static_assert(offsetof(ABP_Dudley_C, SkeletalMesh) == 0x000800, "Member 'ABP_Dudley_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_Dudley_C, TriggerBox) == 0x000808, "Member 'ABP_Dudley_C::TriggerBox' has a wrong offset!");
static_assert(offsetof(ABP_Dudley_C, DefaultSceneRoot) == 0x000810, "Member 'ABP_Dudley_C::DefaultSceneRoot' has a wrong offset!");

}

