#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DialogueWindow_SaveGameFailed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_DialogueWindow_SaveGameFailed.BP_DialogueWindow_SaveGameFailed_C
// 0x0078 (0x0598 - 0x0520)
class UBP_DialogueWindow_SaveGameFailed_C final : public UDialogueWindowSaveGameFailedUW
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0520(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x0528(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x0530(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur;                                    // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CloseButton_C*                      BtnClose;                                          // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyA;                                        // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyB;                                        // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyX;                                        // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Buttons;                                           // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Darkening;                                         // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManRichTextBlock*                      Description;                                       // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_166;                                         // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManRichTextBlock*                      Title;                                             // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TitleBorder;                                       // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DialogueWindow_SaveGameFailed(int32 EntryPoint);
	void OnSetInputDisplay(EInputDisplay InInputDisplay, EInputDisplay InControlDisplay);
	void BndEvt__BP_DialogueWindow_SaveGameFailed_BtnClose_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();
	void OnDescriptionTextChanged(const class FText& Desciption);
	void OnSetData(const class FText& InTitle, const class FText& InDesciption, const class FText& InBtnHotkeyAText, const class FText& InBtnHotkeyXText, const class FText& InBtnHotkeyBText);
	void OnHide(float AnimDuration);
	void OnShow(float AnimDuration);
	void OnGamepadXEvent();
	void OnGamepadBEvent();
	void OnGamepadAEvent();
	void BndEvt__Btn2_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();
	void BndEvt__Btn1_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void BndEvt__Btn0_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BtnHotkeyBClicked();
	void BtnHotkeyAClicked();
	void BtnHotkeyXClicked();
	void SetBtnState(class UBP_InteractButton_Normal_C* Btn, EDialogueButtonType BtnType, const class FText& BtnText);
	void SetBtnCloseVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DialogueWindow_SaveGameFailed_C">();
	}
	static class UBP_DialogueWindow_SaveGameFailed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_DialogueWindow_SaveGameFailed_C>();
	}
};
static_assert(alignof(UBP_DialogueWindow_SaveGameFailed_C) == 0x000008, "Wrong alignment on UBP_DialogueWindow_SaveGameFailed_C");
static_assert(sizeof(UBP_DialogueWindow_SaveGameFailed_C) == 0x000598, "Wrong size on UBP_DialogueWindow_SaveGameFailed_C");
static_assert(offsetof(UBP_DialogueWindow_SaveGameFailed_C, UberGraphFrame) == 0x000520, "Member 'UBP_DialogueWindow_SaveGameFailed_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_DialogueWindow_SaveGameFailed_C, FadeOutAnim) == 0x000528, "Member 'UBP_DialogueWindow_SaveGameFailed_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_DialogueWindow_SaveGameFailed_C, FadeInAnim) == 0x000530, "Member 'UBP_DialogueWindow_SaveGameFailed_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_DialogueWindow_SaveGameFailed_C, BackgroundBlur) == 0x000538, "Member 'UBP_DialogueWindow_SaveGameFailed_C::BackgroundBlur' has a wrong offset!");
static_assert(offsetof(UBP_DialogueWindow_SaveGameFailed_C, BtnClose) == 0x000540, "Member 'UBP_DialogueWindow_SaveGameFailed_C::BtnClose' has a wrong offset!");
static_assert(offsetof(UBP_DialogueWindow_SaveGameFailed_C, BtnHotkeyA) == 0x000548, "Member 'UBP_DialogueWindow_SaveGameFailed_C::BtnHotkeyA' has a wrong offset!");
static_assert(offsetof(UBP_DialogueWindow_SaveGameFailed_C, BtnHotkeyB) == 0x000550, "Member 'UBP_DialogueWindow_SaveGameFailed_C::BtnHotkeyB' has a wrong offset!");
static_assert(offsetof(UBP_DialogueWindow_SaveGameFailed_C, BtnHotkeyX) == 0x000558, "Member 'UBP_DialogueWindow_SaveGameFailed_C::BtnHotkeyX' has a wrong offset!");
static_assert(offsetof(UBP_DialogueWindow_SaveGameFailed_C, Buttons) == 0x000560, "Member 'UBP_DialogueWindow_SaveGameFailed_C::Buttons' has a wrong offset!");
static_assert(offsetof(UBP_DialogueWindow_SaveGameFailed_C, Darkening) == 0x000568, "Member 'UBP_DialogueWindow_SaveGameFailed_C::Darkening' has a wrong offset!");
static_assert(offsetof(UBP_DialogueWindow_SaveGameFailed_C, Description) == 0x000570, "Member 'UBP_DialogueWindow_SaveGameFailed_C::Description' has a wrong offset!");
static_assert(offsetof(UBP_DialogueWindow_SaveGameFailed_C, Image) == 0x000578, "Member 'UBP_DialogueWindow_SaveGameFailed_C::Image' has a wrong offset!");
static_assert(offsetof(UBP_DialogueWindow_SaveGameFailed_C, Image_166) == 0x000580, "Member 'UBP_DialogueWindow_SaveGameFailed_C::Image_166' has a wrong offset!");
static_assert(offsetof(UBP_DialogueWindow_SaveGameFailed_C, Title) == 0x000588, "Member 'UBP_DialogueWindow_SaveGameFailed_C::Title' has a wrong offset!");
static_assert(offsetof(UBP_DialogueWindow_SaveGameFailed_C, TitleBorder) == 0x000590, "Member 'UBP_DialogueWindow_SaveGameFailed_C::TitleBorder' has a wrong offset!");

}

