#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeathEssence_die

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_DeathEssence_die.BP_DeathEssence_die_C.ExecuteUbergraph_BP_DeathEssence_die
// 0x0048 (0x0048 - 0x0000)
struct BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UActorComponent*>                CallFunc_GetComponentsByTag_ReturnValue;           // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        K2Node_DynamicCast_AsScene_Component;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die) == 0x000008, "Wrong alignment on BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die");
static_assert(sizeof(BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die) == 0x000048, "Wrong size on BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die");
static_assert(offsetof(BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die, EntryPoint) == 0x000000, "Member 'BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die, CallFunc_GetComponentsByTag_ReturnValue) == 0x000010, "Member 'BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die, K2Node_DynamicCast_AsScene_Component) == 0x000030, "Member 'BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die::K2Node_DynamicCast_AsScene_Component' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BP_DeathEssence_die_C_ExecuteUbergraph_BP_DeathEssence_die::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

