#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DetonateToxin_VE

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DetonateToxin_VE.BP_DetonateToxin_VE_C.ExecuteUbergraph_BP_DetonateToxin_VE
// 0x01B0 (0x01B0 - 0x0000)
struct BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetVETarget_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHeroBase*                              K2Node_DynamicCast_AsHero_Base;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_DetonateToxin_ActiveAbility_C*      K2Node_DynamicCast_AsBP_Detonate_Toxin_Active_Ability; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0080(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_2;          // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x0124(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE) == 0x000008, "Wrong alignment on BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE");
static_assert(sizeof(BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE) == 0x0001B0, "Wrong size on BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE");
static_assert(offsetof(BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE, EntryPoint) == 0x000000, "Member 'BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE, CallFunc_GetVETarget_ReturnValue) == 0x000010, "Member 'BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE::CallFunc_GetVETarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE, K2Node_DynamicCast_AsHero_Base) == 0x000018, "Member 'BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE::K2Node_DynamicCast_AsHero_Base' has a wrong offset!");
static_assert(offsetof(BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE, K2Node_DynamicCast_AsCharacter_Base) == 0x000028, "Member 'BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE, CallFunc_GetAbilityController_ReturnValue) == 0x000038, "Member 'BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000040, "Member 'BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE, K2Node_DynamicCast_AsBP_Detonate_Toxin_Active_Ability) == 0x000048, "Member 'BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE::K2Node_DynamicCast_AsBP_Detonate_Toxin_Active_Ability' has a wrong offset!");
static_assert(offsetof(BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000054, "Member 'BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE, K2Node_Event_DeltaSeconds) == 0x000058, "Member 'BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x000060, "Member 'BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE, CallFunc_GetSocketLocation_ReturnValue) == 0x000068, "Member 'BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000074, "Member 'BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000080, "Member 'BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000108, "Member 'BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE, CallFunc_PostEventAtLocation_ReturnValue) == 0x000114, "Member 'BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE, CallFunc_GetSocketLocation_ReturnValue_2) == 0x000118, "Member 'BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE::CallFunc_GetSocketLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x000124, "Member 'BP_DetonateToxin_VE_C_ExecuteUbergraph_BP_DetonateToxin_VE::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");

// Function BP_DetonateToxin_VE.BP_DetonateToxin_VE_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_DetonateToxin_VE_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DetonateToxin_VE_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_DetonateToxin_VE_C_ReceiveTick");
static_assert(sizeof(BP_DetonateToxin_VE_C_ReceiveTick) == 0x000004, "Wrong size on BP_DetonateToxin_VE_C_ReceiveTick");
static_assert(offsetof(BP_DetonateToxin_VE_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_DetonateToxin_VE_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

