#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DaggerTrap_Projectile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_DaggerTrap_Projectile.BP_DaggerTrap_Projectile_C.ExecuteUbergraph_BP_DaggerTrap_Projectile
// 0x0040 (0x0040 - 0x0000)
struct BP_DaggerTrap_Projectile_C_ExecuteUbergraph_BP_DaggerTrap_Projectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0020(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DaggerTrap_Projectile_C_ExecuteUbergraph_BP_DaggerTrap_Projectile) == 0x000004, "Wrong alignment on BP_DaggerTrap_Projectile_C_ExecuteUbergraph_BP_DaggerTrap_Projectile");
static_assert(sizeof(BP_DaggerTrap_Projectile_C_ExecuteUbergraph_BP_DaggerTrap_Projectile) == 0x000040, "Wrong size on BP_DaggerTrap_Projectile_C_ExecuteUbergraph_BP_DaggerTrap_Projectile");
static_assert(offsetof(BP_DaggerTrap_Projectile_C_ExecuteUbergraph_BP_DaggerTrap_Projectile, EntryPoint) == 0x000000, "Member 'BP_DaggerTrap_Projectile_C_ExecuteUbergraph_BP_DaggerTrap_Projectile::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DaggerTrap_Projectile_C_ExecuteUbergraph_BP_DaggerTrap_Projectile, Temp_delegate_Variable) == 0x000004, "Member 'BP_DaggerTrap_Projectile_C_ExecuteUbergraph_BP_DaggerTrap_Projectile::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_DaggerTrap_Projectile_C_ExecuteUbergraph_BP_DaggerTrap_Projectile, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000014, "Member 'BP_DaggerTrap_Projectile_C_ExecuteUbergraph_BP_DaggerTrap_Projectile::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DaggerTrap_Projectile_C_ExecuteUbergraph_BP_DaggerTrap_Projectile, Temp_delegate_Variable_1) == 0x000020, "Member 'BP_DaggerTrap_Projectile_C_ExecuteUbergraph_BP_DaggerTrap_Projectile::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DaggerTrap_Projectile_C_ExecuteUbergraph_BP_DaggerTrap_Projectile, CallFunc_PostEventAtLocation_ReturnValue) == 0x000030, "Member 'BP_DaggerTrap_Projectile_C_ExecuteUbergraph_BP_DaggerTrap_Projectile::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DaggerTrap_Projectile_C_ExecuteUbergraph_BP_DaggerTrap_Projectile, CallFunc_PostAkEvent_ReturnValue) == 0x000034, "Member 'BP_DaggerTrap_Projectile_C_ExecuteUbergraph_BP_DaggerTrap_Projectile::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DaggerTrap_Projectile_C_ExecuteUbergraph_BP_DaggerTrap_Projectile, K2Node_Event_EndPlayReason) == 0x000038, "Member 'BP_DaggerTrap_Projectile_C_ExecuteUbergraph_BP_DaggerTrap_Projectile::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_DaggerTrap_Projectile_C_ExecuteUbergraph_BP_DaggerTrap_Projectile, CallFunc_PostAkEvent_ReturnValue_1) == 0x00003C, "Member 'BP_DaggerTrap_Projectile_C_ExecuteUbergraph_BP_DaggerTrap_Projectile::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");

// Function BP_DaggerTrap_Projectile.BP_DaggerTrap_Projectile_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_DaggerTrap_Projectile_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DaggerTrap_Projectile_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_DaggerTrap_Projectile_C_ReceiveEndPlay");
static_assert(sizeof(BP_DaggerTrap_Projectile_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_DaggerTrap_Projectile_C_ReceiveEndPlay");
static_assert(offsetof(BP_DaggerTrap_Projectile_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_DaggerTrap_Projectile_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

