#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Disclaimer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Disclaimer.BP_Disclaimer_C
// 0x0030 (0x04E8 - 0x04B8)
class UBP_Disclaimer_C final : public UDisclaimerUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PressAnyKeyAnim;                                   // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Bg;                                                // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PressAnyKeyBg;                                     // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PressAnyKeyText;                                   // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManRichTextBlock*                      RichText;                                          // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void OnShow(float AnimDuration);
	void ExecuteUbergraph_BP_Disclaimer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Disclaimer_C">();
	}
	static class UBP_Disclaimer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Disclaimer_C>();
	}
};
static_assert(alignof(UBP_Disclaimer_C) == 0x000008, "Wrong alignment on UBP_Disclaimer_C");
static_assert(sizeof(UBP_Disclaimer_C) == 0x0004E8, "Wrong size on UBP_Disclaimer_C");
static_assert(offsetof(UBP_Disclaimer_C, UberGraphFrame) == 0x0004B8, "Member 'UBP_Disclaimer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Disclaimer_C, PressAnyKeyAnim) == 0x0004C0, "Member 'UBP_Disclaimer_C::PressAnyKeyAnim' has a wrong offset!");
static_assert(offsetof(UBP_Disclaimer_C, Bg) == 0x0004C8, "Member 'UBP_Disclaimer_C::Bg' has a wrong offset!");
static_assert(offsetof(UBP_Disclaimer_C, PressAnyKeyBg) == 0x0004D0, "Member 'UBP_Disclaimer_C::PressAnyKeyBg' has a wrong offset!");
static_assert(offsetof(UBP_Disclaimer_C, PressAnyKeyText) == 0x0004D8, "Member 'UBP_Disclaimer_C::PressAnyKeyText' has a wrong offset!");
static_assert(offsetof(UBP_Disclaimer_C, RichText) == 0x0004E0, "Member 'UBP_Disclaimer_C::RichText' has a wrong offset!");

}

