#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DaggerTrap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DaggerTrap.BP_DaggerTrap_C
// 0x0020 (0x0868 - 0x0848)
class ABP_DaggerTrap_C final : public AProjectileTrap
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0848(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMiniMapActorComponent*                 MiniMapActor;                                      // 0x0850(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0858(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTriggerBoxComponent*                   TriggerBox;                                        // 0x0860(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DaggerTrap(int32 EntryPoint);
	void OnGameplayEvent(class UAbilityController* OwnerAbilityController, class UGameplayEventID* GameplayEventID, class FName GameplayEventName, class AActorSoul* paramActorSoul);
	void BPPostBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DaggerTrap_C">();
	}
	static class ABP_DaggerTrap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DaggerTrap_C>();
	}
};
static_assert(alignof(ABP_DaggerTrap_C) == 0x000008, "Wrong alignment on ABP_DaggerTrap_C");
static_assert(sizeof(ABP_DaggerTrap_C) == 0x000868, "Wrong size on ABP_DaggerTrap_C");
static_assert(offsetof(ABP_DaggerTrap_C, UberGraphFrame) == 0x000848, "Member 'ABP_DaggerTrap_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DaggerTrap_C, MiniMapActor) == 0x000850, "Member 'ABP_DaggerTrap_C::MiniMapActor' has a wrong offset!");
static_assert(offsetof(ABP_DaggerTrap_C, SkeletalMesh) == 0x000858, "Member 'ABP_DaggerTrap_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_DaggerTrap_C, TriggerBox) == 0x000860, "Member 'ABP_DaggerTrap_C::TriggerBox' has a wrong offset!");

}

