#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Debris_HayOnFloor

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Debris_HayOnFloor.BP_Debris_HayOnFloor_C
// 0x0040 (0x0268 - 0x0228)
class ABP_Debris_HayOnFloor_C final : public AActor
{
public:
	class UNiagaraComponent*                      Niagara;                                           // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UManVisualController*                   ManVisualController;                               // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Diameter1;                                         // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Diameter2;                                         // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Diameter3;                                         // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Height;                                            // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Brightness;                                        // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DebrisSize;                                        // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Opacity;                                           // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Amount1;                                           // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Amount2;                                           // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Amount3;                                           // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Debris_HayOnFloor_C">();
	}
	static class ABP_Debris_HayOnFloor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Debris_HayOnFloor_C>();
	}
};
static_assert(alignof(ABP_Debris_HayOnFloor_C) == 0x000008, "Wrong alignment on ABP_Debris_HayOnFloor_C");
static_assert(sizeof(ABP_Debris_HayOnFloor_C) == 0x000268, "Wrong size on ABP_Debris_HayOnFloor_C");
static_assert(offsetof(ABP_Debris_HayOnFloor_C, Niagara) == 0x000228, "Member 'ABP_Debris_HayOnFloor_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_Debris_HayOnFloor_C, ManVisualController) == 0x000230, "Member 'ABP_Debris_HayOnFloor_C::ManVisualController' has a wrong offset!");
static_assert(offsetof(ABP_Debris_HayOnFloor_C, DefaultSceneRoot) == 0x000238, "Member 'ABP_Debris_HayOnFloor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Debris_HayOnFloor_C, Diameter1) == 0x000240, "Member 'ABP_Debris_HayOnFloor_C::Diameter1' has a wrong offset!");
static_assert(offsetof(ABP_Debris_HayOnFloor_C, Diameter2) == 0x000244, "Member 'ABP_Debris_HayOnFloor_C::Diameter2' has a wrong offset!");
static_assert(offsetof(ABP_Debris_HayOnFloor_C, Diameter3) == 0x000248, "Member 'ABP_Debris_HayOnFloor_C::Diameter3' has a wrong offset!");
static_assert(offsetof(ABP_Debris_HayOnFloor_C, Height) == 0x00024C, "Member 'ABP_Debris_HayOnFloor_C::Height' has a wrong offset!");
static_assert(offsetof(ABP_Debris_HayOnFloor_C, Brightness) == 0x000250, "Member 'ABP_Debris_HayOnFloor_C::Brightness' has a wrong offset!");
static_assert(offsetof(ABP_Debris_HayOnFloor_C, DebrisSize) == 0x000254, "Member 'ABP_Debris_HayOnFloor_C::DebrisSize' has a wrong offset!");
static_assert(offsetof(ABP_Debris_HayOnFloor_C, Opacity) == 0x000258, "Member 'ABP_Debris_HayOnFloor_C::Opacity' has a wrong offset!");
static_assert(offsetof(ABP_Debris_HayOnFloor_C, Amount1) == 0x00025C, "Member 'ABP_Debris_HayOnFloor_C::Amount1' has a wrong offset!");
static_assert(offsetof(ABP_Debris_HayOnFloor_C, Amount2) == 0x000260, "Member 'ABP_Debris_HayOnFloor_C::Amount2' has a wrong offset!");
static_assert(offsetof(ABP_Debris_HayOnFloor_C, Amount3) == 0x000264, "Member 'ABP_Debris_HayOnFloor_C::Amount3' has a wrong offset!");

}

