#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Disclaimer

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Disclaimer.BP_Disclaimer_C.OnShow
// 0x0004 (0x0004 - 0x0000)
struct BP_Disclaimer_C_OnShow final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Disclaimer_C_OnShow) == 0x000004, "Wrong alignment on BP_Disclaimer_C_OnShow");
static_assert(sizeof(BP_Disclaimer_C_OnShow) == 0x000004, "Wrong size on BP_Disclaimer_C_OnShow");
static_assert(offsetof(BP_Disclaimer_C_OnShow, AnimDuration) == 0x000000, "Member 'BP_Disclaimer_C_OnShow::AnimDuration' has a wrong offset!");

// Function BP_Disclaimer.BP_Disclaimer_C.ExecuteUbergraph_BP_Disclaimer
// 0x0010 (0x0010 - 0x0000)
struct BP_Disclaimer_C_ExecuteUbergraph_BP_Disclaimer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Disclaimer_C_ExecuteUbergraph_BP_Disclaimer) == 0x000008, "Wrong alignment on BP_Disclaimer_C_ExecuteUbergraph_BP_Disclaimer");
static_assert(sizeof(BP_Disclaimer_C_ExecuteUbergraph_BP_Disclaimer) == 0x000010, "Wrong size on BP_Disclaimer_C_ExecuteUbergraph_BP_Disclaimer");
static_assert(offsetof(BP_Disclaimer_C_ExecuteUbergraph_BP_Disclaimer, EntryPoint) == 0x000000, "Member 'BP_Disclaimer_C_ExecuteUbergraph_BP_Disclaimer::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Disclaimer_C_ExecuteUbergraph_BP_Disclaimer, K2Node_Event_AnimDuration) == 0x000004, "Member 'BP_Disclaimer_C_ExecuteUbergraph_BP_Disclaimer::K2Node_Event_AnimDuration' has a wrong offset!");
static_assert(offsetof(BP_Disclaimer_C_ExecuteUbergraph_BP_Disclaimer, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'BP_Disclaimer_C_ExecuteUbergraph_BP_Disclaimer::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

