#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DieOfChaos_Projectile

#include "Basic.hpp"

#include "man_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_DieOfChaos_Projectile.BP_DieOfChaos_Projectile_C.ExecuteUbergraph_BP_DieOfChaos_Projectile
// 0x0160 (0x0160 - 0x0000)
struct BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AVisualEntity>              Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EManProjectileEventType Type, const struct FVector& position, class AActor* HitActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0024(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0044(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NewState;                             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue_1;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue_2;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue_1;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EManProjectileEventType                       K2Node_CustomEvent_Type;                           // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Position;                       // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_HitActor;                       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSurfaceTypeSystemAtLocation_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SpawnSurfaceTypeSystemAtLocation_bSuccess; // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AVisualEntity>              Temp_class_Variable_1;                             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AVisualEntity>              Temp_class_Variable_2;                             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class AVisualEntity>              K2Node_Select_Default;                             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsAbilityUpgradeUnlocked_ReturnValue;     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue_2;          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue_3;             // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue_3;          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile) == 0x000010, "Wrong alignment on BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile");
static_assert(sizeof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile) == 0x000160, "Wrong size on BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, EntryPoint) == 0x000000, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, Temp_class_Variable) == 0x000008, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, Temp_delegate_Variable) == 0x000024, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000038, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, CallFunc_PostAkEvent_ReturnValue) == 0x000040, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, Temp_delegate_Variable_1) == 0x000044, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, CallFunc_PostAkEvent_ReturnValue_1) == 0x000054, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, CallFunc_GetManGameMode_ReturnValue) == 0x000058, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::CallFunc_GetManGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, K2Node_Event_NewState) == 0x000060, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, CallFunc_GetManGameMode_ReturnValue_1) == 0x000068, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::CallFunc_GetManGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000070, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000078, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, CallFunc_GetManGameMode_ReturnValue_2) == 0x000080, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::CallFunc_GetManGameMode_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, Temp_int_Variable) == 0x000088, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, CallFunc_SpawnVisualEntity_ReturnValue_1) == 0x000090, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::CallFunc_SpawnVisualEntity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, K2Node_CustomEvent_Type) == 0x000098, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::K2Node_CustomEvent_Type' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, K2Node_CustomEvent_Position) == 0x00009C, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::K2Node_CustomEvent_Position' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, K2Node_CustomEvent_HitActor) == 0x0000A8, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::K2Node_CustomEvent_HitActor' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000B0, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, CallFunc_MakeTransform_ReturnValue) == 0x0000C0, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000F0, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000F4, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000100, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, CallFunc_Vector_Distance_ReturnValue) == 0x00010C, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, CallFunc_SpawnSurfaceTypeSystemAtLocation_ReturnValue) == 0x000110, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::CallFunc_SpawnSurfaceTypeSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, CallFunc_SpawnSurfaceTypeSystemAtLocation_bSuccess) == 0x000118, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::CallFunc_SpawnSurfaceTypeSystemAtLocation_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000119, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, Temp_class_Variable_1) == 0x000120, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, CallFunc_BooleanAND_ReturnValue) == 0x000128, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, Temp_class_Variable_2) == 0x000130, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::Temp_class_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, K2Node_Select_Default) == 0x000138, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, CallFunc_IsAbilityUpgradeUnlocked_ReturnValue) == 0x000140, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::CallFunc_IsAbilityUpgradeUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, CallFunc_SpawnVisualEntity_ReturnValue_2) == 0x000148, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::CallFunc_SpawnVisualEntity_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, CallFunc_GetManGameMode_ReturnValue_3) == 0x000150, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::CallFunc_GetManGameMode_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile, CallFunc_SpawnVisualEntity_ReturnValue_3) == 0x000158, "Member 'BP_DieOfChaos_Projectile_C_ExecuteUbergraph_BP_DieOfChaos_Projectile::CallFunc_SpawnVisualEntity_ReturnValue_3' has a wrong offset!");

// Function BP_DieOfChaos_Projectile.BP_DieOfChaos_Projectile_C.Bounce
// 0x0018 (0x0018 - 0x0000)
struct BP_DieOfChaos_Projectile_C_Bounce final
{
public:
	EManProjectileEventType                       Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                position;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HitActor;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DieOfChaos_Projectile_C_Bounce) == 0x000008, "Wrong alignment on BP_DieOfChaos_Projectile_C_Bounce");
static_assert(sizeof(BP_DieOfChaos_Projectile_C_Bounce) == 0x000018, "Wrong size on BP_DieOfChaos_Projectile_C_Bounce");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_Bounce, Type) == 0x000000, "Member 'BP_DieOfChaos_Projectile_C_Bounce::Type' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_Bounce, position) == 0x000004, "Member 'BP_DieOfChaos_Projectile_C_Bounce::position' has a wrong offset!");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_Bounce, HitActor) == 0x000010, "Member 'BP_DieOfChaos_Projectile_C_Bounce::HitActor' has a wrong offset!");

// Function BP_DieOfChaos_Projectile.BP_DieOfChaos_Projectile_C.DieStateChanged
// 0x0004 (0x0004 - 0x0000)
struct BP_DieOfChaos_Projectile_C_DieStateChanged final
{
public:
	int32                                         NewState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DieOfChaos_Projectile_C_DieStateChanged) == 0x000004, "Wrong alignment on BP_DieOfChaos_Projectile_C_DieStateChanged");
static_assert(sizeof(BP_DieOfChaos_Projectile_C_DieStateChanged) == 0x000004, "Wrong size on BP_DieOfChaos_Projectile_C_DieStateChanged");
static_assert(offsetof(BP_DieOfChaos_Projectile_C_DieStateChanged, NewState) == 0x000000, "Member 'BP_DieOfChaos_Projectile_C_DieStateChanged::NewState' has a wrong offset!");

}

