#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DivineAegis_VisualEntity

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_DivineAegis_VisualEntity.BP_DivineAegis_VisualEntity_C.ExecuteUbergraph_BP_DivineAegis_VisualEntity
// 0x0058 (0x0058 - 0x0000)
struct BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName CustomName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDivineAegisAbility*                    K2Node_DynamicCast_AsDivine_Aegis_Ability;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_CustomName;                     // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity) == 0x000008, "Wrong alignment on BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity");
static_assert(sizeof(BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity) == 0x000058, "Wrong size on BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity");
static_assert(offsetof(BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity, K2Node_DynamicCast_AsCharacter_Base) == 0x000010, "Member 'BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity, CallFunc_GetAbilityController_ReturnValue) == 0x000030, "Member 'BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000038, "Member 'BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity, K2Node_DynamicCast_AsDivine_Aegis_Ability) == 0x000040, "Member 'BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity::K2Node_DynamicCast_AsDivine_Aegis_Ability' has a wrong offset!");
static_assert(offsetof(BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity, K2Node_CustomEvent_CustomName) == 0x00004C, "Member 'BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity::K2Node_CustomEvent_CustomName' has a wrong offset!");
static_assert(offsetof(BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000054, "Member 'BP_DivineAegis_VisualEntity_C_ExecuteUbergraph_BP_DivineAegis_VisualEntity::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function BP_DivineAegis_VisualEntity.BP_DivineAegis_VisualEntity_C.OnBreak
// 0x0008 (0x0008 - 0x0000)
struct BP_DivineAegis_VisualEntity_C_OnBreak final
{
public:
	class FName                                   CustomName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DivineAegis_VisualEntity_C_OnBreak) == 0x000004, "Wrong alignment on BP_DivineAegis_VisualEntity_C_OnBreak");
static_assert(sizeof(BP_DivineAegis_VisualEntity_C_OnBreak) == 0x000008, "Wrong size on BP_DivineAegis_VisualEntity_C_OnBreak");
static_assert(offsetof(BP_DivineAegis_VisualEntity_C_OnBreak, CustomName) == 0x000000, "Member 'BP_DivineAegis_VisualEntity_C_OnBreak::CustomName' has a wrong offset!");

}

