#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DivineAegisDoubleShield_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DivineAegisDoubleShield_VisualEntity.BP_DivineAegisDoubleShield_VisualEntity_C
// 0x0030 (0x0380 - 0x0350)
class ABP_DivineAegisDoubleShield_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara_Break;                                     // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane;                                             // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_DivineAegis_ActiveAbility_C*        Aegis;                                             // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABrawlerHero*                           As_Brawler_Hero_0;                                 // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DivineAegisDoubleShield_VisualEntity(int32 EntryPoint);
	void OnBreak(class FName CustomName);
	void ReceiveTick(float DeltaSeconds);
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DivineAegisDoubleShield_VisualEntity_C">();
	}
	static class ABP_DivineAegisDoubleShield_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DivineAegisDoubleShield_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_DivineAegisDoubleShield_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_DivineAegisDoubleShield_VisualEntity_C");
static_assert(sizeof(ABP_DivineAegisDoubleShield_VisualEntity_C) == 0x000380, "Wrong size on ABP_DivineAegisDoubleShield_VisualEntity_C");
static_assert(offsetof(ABP_DivineAegisDoubleShield_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_DivineAegisDoubleShield_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DivineAegisDoubleShield_VisualEntity_C, Niagara_Break) == 0x000358, "Member 'ABP_DivineAegisDoubleShield_VisualEntity_C::Niagara_Break' has a wrong offset!");
static_assert(offsetof(ABP_DivineAegisDoubleShield_VisualEntity_C, Plane) == 0x000360, "Member 'ABP_DivineAegisDoubleShield_VisualEntity_C::Plane' has a wrong offset!");
static_assert(offsetof(ABP_DivineAegisDoubleShield_VisualEntity_C, Niagara) == 0x000368, "Member 'ABP_DivineAegisDoubleShield_VisualEntity_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_DivineAegisDoubleShield_VisualEntity_C, Aegis) == 0x000370, "Member 'ABP_DivineAegisDoubleShield_VisualEntity_C::Aegis' has a wrong offset!");
static_assert(offsetof(ABP_DivineAegisDoubleShield_VisualEntity_C, As_Brawler_Hero_0) == 0x000378, "Member 'ABP_DivineAegisDoubleShield_VisualEntity_C::As_Brawler_Hero_0' has a wrong offset!");

}

