#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DarkFireImp_Beam_VisualEntity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DarkFireImp_Beam_VisualEntity.BP_DarkFireImp_Beam_VisualEntity_C.ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity
// 0x02B8 (0x02B8 - 0x0000)
struct BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastBeamEndPoint_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0010(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastBeamEndPoint_ReturnValue_1;        // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityBase*                           CallFunc_BPGetAbilityByName_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAISupportedBeamAbility*                K2Node_DynamicCast_AsAISupported_Beam_Ability;     // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0084(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0124(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_GetLastBeamHitResult_ReturnValue;         // 0x01AC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0235(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_236[0x2];                                      // 0x0236(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0264(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x029C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity) == 0x000008, "Wrong alignment on BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity");
static_assert(sizeof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity) == 0x0002B8, "Wrong size on BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_GetLastBeamEndPoint_ReturnValue) == 0x000004, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_GetLastBeamEndPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, Temp_delegate_Variable) == 0x000010, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_PostAkEvent_ReturnValue) == 0x000024, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_GetLastBeamEndPoint_ReturnValue_1) == 0x000028, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_GetLastBeamEndPoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_GetAttachParentActor_ReturnValue) == 0x000038, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, K2Node_DynamicCast_AsCharacter_Base) == 0x000040, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00004C, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_GetAbilityController_ReturnValue) == 0x000058, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000060, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_BPGetAbilityByName_ReturnValue) == 0x000070, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_BPGetAbilityByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, K2Node_DynamicCast_AsAISupported_Beam_Ability) == 0x000078, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::K2Node_DynamicCast_AsAISupported_Beam_Ability' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000084, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x00010C, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_FindLookAtRotation_ReturnValue) == 0x000118, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000124, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_GetLastBeamHitResult_ReturnValue) == 0x0001AC, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_GetLastBeamHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_BreakHitResult_bBlockingHit) == 0x000234, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_BreakHitResult_bInitialOverlap) == 0x000235, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_BreakHitResult_Time) == 0x000238, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_BreakHitResult_Distance) == 0x00023C, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_BreakHitResult_Location) == 0x000240, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_BreakHitResult_ImpactPoint) == 0x00024C, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_BreakHitResult_Normal) == 0x000258, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_BreakHitResult_ImpactNormal) == 0x000264, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_BreakHitResult_PhysMat) == 0x000270, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_BreakHitResult_HitActor) == 0x000278, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_BreakHitResult_HitComponent) == 0x000280, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_BreakHitResult_HitBoneName) == 0x000288, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_BreakHitResult_HitItem) == 0x000290, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_BreakHitResult_ElementIndex) == 0x000294, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_BreakHitResult_FaceIndex) == 0x000298, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_BreakHitResult_TraceStart) == 0x00029C, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity, CallFunc_BreakHitResult_TraceEnd) == 0x0002A8, "Member 'BP_DarkFireImp_Beam_VisualEntity_C_ExecuteUbergraph_BP_DarkFireImp_Beam_VisualEntity::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");

}

