#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeathEssence

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DeathEssence.BP_DeathEssence_C
// 0x0040 (0x0818 - 0x07D8)
class ABP_DeathEssence_C final : public AActorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMiniMapActorComponent*                 MiniMapActor;                                      // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Death_Essence_Idle;                             // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoundingBoxComponent*                  BoundingBox;                                       // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         DeathEssenceUnique;                                // 0x0810(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DeathEssence(int32 EntryPoint);
	void BPPostBeginPlay();
	void OnKilled(class UObject* Killer, class UAbilityController* KillerAbilityController);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DeathEssence_C">();
	}
	static class ABP_DeathEssence_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DeathEssence_C>();
	}
};
static_assert(alignof(ABP_DeathEssence_C) == 0x000008, "Wrong alignment on ABP_DeathEssence_C");
static_assert(sizeof(ABP_DeathEssence_C) == 0x000818, "Wrong size on ABP_DeathEssence_C");
static_assert(offsetof(ABP_DeathEssence_C, UberGraphFrame) == 0x0007D8, "Member 'ABP_DeathEssence_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DeathEssence_C, MiniMapActor) == 0x0007E0, "Member 'ABP_DeathEssence_C::MiniMapActor' has a wrong offset!");
static_assert(offsetof(ABP_DeathEssence_C, Ak) == 0x0007E8, "Member 'ABP_DeathEssence_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_DeathEssence_C, NS_Death_Essence_Idle) == 0x0007F0, "Member 'ABP_DeathEssence_C::NS_Death_Essence_Idle' has a wrong offset!");
static_assert(offsetof(ABP_DeathEssence_C, TextRender) == 0x0007F8, "Member 'ABP_DeathEssence_C::TextRender' has a wrong offset!");
static_assert(offsetof(ABP_DeathEssence_C, BoundingBox) == 0x000800, "Member 'ABP_DeathEssence_C::BoundingBox' has a wrong offset!");
static_assert(offsetof(ABP_DeathEssence_C, DefaultSceneRoot) == 0x000808, "Member 'ABP_DeathEssence_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_DeathEssence_C, DeathEssenceUnique) == 0x000810, "Member 'ABP_DeathEssence_C::DeathEssenceUnique' has a wrong offset!");

}

