#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DarkEcho_CloneDIR_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DarkEcho_CloneDIR_VisualEntity.BP_DarkEcho_CloneDIR_VisualEntity_C
// 0x0040 (0x0390 - 0x0350)
class ABP_DarkEcho_CloneDIR_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      End;                                               // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CloneLoc;                                          // 0x0368(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBase*                         Character;                                         // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTeleportBackOnTriggerAbility*          DarkEchoAbility;                                   // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WarningStr;                                        // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DarkEcho_CloneDIR_VisualEntity(int32 EntryPoint);
	void OnKill();
	void VisualEntityConstructionFinished();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DarkEcho_CloneDIR_VisualEntity_C">();
	}
	static class ABP_DarkEcho_CloneDIR_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DarkEcho_CloneDIR_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_DarkEcho_CloneDIR_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_DarkEcho_CloneDIR_VisualEntity_C");
static_assert(sizeof(ABP_DarkEcho_CloneDIR_VisualEntity_C) == 0x000390, "Wrong size on ABP_DarkEcho_CloneDIR_VisualEntity_C");
static_assert(offsetof(ABP_DarkEcho_CloneDIR_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_DarkEcho_CloneDIR_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DarkEcho_CloneDIR_VisualEntity_C, End) == 0x000358, "Member 'ABP_DarkEcho_CloneDIR_VisualEntity_C::End' has a wrong offset!");
static_assert(offsetof(ABP_DarkEcho_CloneDIR_VisualEntity_C, Niagara) == 0x000360, "Member 'ABP_DarkEcho_CloneDIR_VisualEntity_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_DarkEcho_CloneDIR_VisualEntity_C, CloneLoc) == 0x000368, "Member 'ABP_DarkEcho_CloneDIR_VisualEntity_C::CloneLoc' has a wrong offset!");
static_assert(offsetof(ABP_DarkEcho_CloneDIR_VisualEntity_C, Character) == 0x000378, "Member 'ABP_DarkEcho_CloneDIR_VisualEntity_C::Character' has a wrong offset!");
static_assert(offsetof(ABP_DarkEcho_CloneDIR_VisualEntity_C, DarkEchoAbility) == 0x000380, "Member 'ABP_DarkEcho_CloneDIR_VisualEntity_C::DarkEchoAbility' has a wrong offset!");
static_assert(offsetof(ABP_DarkEcho_CloneDIR_VisualEntity_C, WarningStr) == 0x000388, "Member 'ABP_DarkEcho_CloneDIR_VisualEntity_C::WarningStr' has a wrong offset!");

}

