#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeathScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_DeathScreen.BP_DeathScreen_C
// 0x0068 (0x0518 - 0x04B0)
class UBP_DeathScreen_C final : public UDeathScreenUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Background;                                        // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur_0;                                  // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackgroundText;                                    // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        Blur;                                              // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Caption;                                           // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Center;                                            // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              AnimationFinished;                                 // 0x04F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           AnimFinishedTimer;                                 // 0x0508(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsKillingField;                                    // 0x0510(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BP_DeathScreen(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnHide(float AnimDuration);
	void OnShow(float AnimDuration);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void CallAnimFinished();
	void SetDeathScreen();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DeathScreen_C">();
	}
	static class UBP_DeathScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_DeathScreen_C>();
	}
};
static_assert(alignof(UBP_DeathScreen_C) == 0x000008, "Wrong alignment on UBP_DeathScreen_C");
static_assert(sizeof(UBP_DeathScreen_C) == 0x000518, "Wrong size on UBP_DeathScreen_C");
static_assert(offsetof(UBP_DeathScreen_C, UberGraphFrame) == 0x0004B0, "Member 'UBP_DeathScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_DeathScreen_C, FadeOutAnim) == 0x0004B8, "Member 'UBP_DeathScreen_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_DeathScreen_C, FadeInAnim) == 0x0004C0, "Member 'UBP_DeathScreen_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_DeathScreen_C, Background) == 0x0004C8, "Member 'UBP_DeathScreen_C::Background' has a wrong offset!");
static_assert(offsetof(UBP_DeathScreen_C, BackgroundBlur_0) == 0x0004D0, "Member 'UBP_DeathScreen_C::BackgroundBlur_0' has a wrong offset!");
static_assert(offsetof(UBP_DeathScreen_C, BackgroundText) == 0x0004D8, "Member 'UBP_DeathScreen_C::BackgroundText' has a wrong offset!");
static_assert(offsetof(UBP_DeathScreen_C, Blur) == 0x0004E0, "Member 'UBP_DeathScreen_C::Blur' has a wrong offset!");
static_assert(offsetof(UBP_DeathScreen_C, Caption) == 0x0004E8, "Member 'UBP_DeathScreen_C::Caption' has a wrong offset!");
static_assert(offsetof(UBP_DeathScreen_C, Center) == 0x0004F0, "Member 'UBP_DeathScreen_C::Center' has a wrong offset!");
static_assert(offsetof(UBP_DeathScreen_C, AnimationFinished) == 0x0004F8, "Member 'UBP_DeathScreen_C::AnimationFinished' has a wrong offset!");
static_assert(offsetof(UBP_DeathScreen_C, AnimFinishedTimer) == 0x000508, "Member 'UBP_DeathScreen_C::AnimFinishedTimer' has a wrong offset!");
static_assert(offsetof(UBP_DeathScreen_C, IsKillingField) == 0x000510, "Member 'UBP_DeathScreen_C::IsKillingField' has a wrong offset!");

}

