#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DarkEchoDummy

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_DarkEchoDummy.BP_DarkEchoDummy_C.ExecuteUbergraph_BP_DarkEchoDummy
// 0x0038 (0x0038 - 0x0000)
struct BP_DarkEchoDummy_C_ExecuteUbergraph_BP_DarkEchoDummy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0010(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DarkEchoDummy_C_ExecuteUbergraph_BP_DarkEchoDummy) == 0x000008, "Wrong alignment on BP_DarkEchoDummy_C_ExecuteUbergraph_BP_DarkEchoDummy");
static_assert(sizeof(BP_DarkEchoDummy_C_ExecuteUbergraph_BP_DarkEchoDummy) == 0x000038, "Wrong size on BP_DarkEchoDummy_C_ExecuteUbergraph_BP_DarkEchoDummy");
static_assert(offsetof(BP_DarkEchoDummy_C_ExecuteUbergraph_BP_DarkEchoDummy, EntryPoint) == 0x000000, "Member 'BP_DarkEchoDummy_C_ExecuteUbergraph_BP_DarkEchoDummy::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DarkEchoDummy_C_ExecuteUbergraph_BP_DarkEchoDummy, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'BP_DarkEchoDummy_C_ExecuteUbergraph_BP_DarkEchoDummy::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarkEchoDummy_C_ExecuteUbergraph_BP_DarkEchoDummy, Temp_delegate_Variable) == 0x000010, "Member 'BP_DarkEchoDummy_C_ExecuteUbergraph_BP_DarkEchoDummy::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_DarkEchoDummy_C_ExecuteUbergraph_BP_DarkEchoDummy, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000020, "Member 'BP_DarkEchoDummy_C_ExecuteUbergraph_BP_DarkEchoDummy::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarkEchoDummy_C_ExecuteUbergraph_BP_DarkEchoDummy, CallFunc_PostEvent_ReturnValue) == 0x00002C, "Member 'BP_DarkEchoDummy_C_ExecuteUbergraph_BP_DarkEchoDummy::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarkEchoDummy_C_ExecuteUbergraph_BP_DarkEchoDummy, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000030, "Member 'BP_DarkEchoDummy_C_ExecuteUbergraph_BP_DarkEchoDummy::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

}

