#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Debris_HayAirBorne

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Debris_HayAirBorne.BP_Debris_HayAirBorne_C
// 0x0030 (0x0258 - 0x0228)
class ABP_Debris_HayAirBorne_C final : public AActor
{
public:
	class UManVisualController*                   ManVisualController;                               // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         DustBrightness;                                    // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HayBrightness;                                     // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Opacity;                                           // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AmountOfHay;                                       // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AmountOfLargeDust;                                 // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AmountOfSmallDust;                                 // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Debris_HayAirBorne_C">();
	}
	static class ABP_Debris_HayAirBorne_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Debris_HayAirBorne_C>();
	}
};
static_assert(alignof(ABP_Debris_HayAirBorne_C) == 0x000008, "Wrong alignment on ABP_Debris_HayAirBorne_C");
static_assert(sizeof(ABP_Debris_HayAirBorne_C) == 0x000258, "Wrong size on ABP_Debris_HayAirBorne_C");
static_assert(offsetof(ABP_Debris_HayAirBorne_C, ManVisualController) == 0x000228, "Member 'ABP_Debris_HayAirBorne_C::ManVisualController' has a wrong offset!");
static_assert(offsetof(ABP_Debris_HayAirBorne_C, ParticleSystem) == 0x000230, "Member 'ABP_Debris_HayAirBorne_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABP_Debris_HayAirBorne_C, DefaultSceneRoot) == 0x000238, "Member 'ABP_Debris_HayAirBorne_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Debris_HayAirBorne_C, DustBrightness) == 0x000240, "Member 'ABP_Debris_HayAirBorne_C::DustBrightness' has a wrong offset!");
static_assert(offsetof(ABP_Debris_HayAirBorne_C, HayBrightness) == 0x000244, "Member 'ABP_Debris_HayAirBorne_C::HayBrightness' has a wrong offset!");
static_assert(offsetof(ABP_Debris_HayAirBorne_C, Opacity) == 0x000248, "Member 'ABP_Debris_HayAirBorne_C::Opacity' has a wrong offset!");
static_assert(offsetof(ABP_Debris_HayAirBorne_C, AmountOfHay) == 0x00024C, "Member 'ABP_Debris_HayAirBorne_C::AmountOfHay' has a wrong offset!");
static_assert(offsetof(ABP_Debris_HayAirBorne_C, AmountOfLargeDust) == 0x000250, "Member 'ABP_Debris_HayAirBorne_C::AmountOfLargeDust' has a wrong offset!");
static_assert(offsetof(ABP_Debris_HayAirBorne_C, AmountOfSmallDust) == 0x000254, "Member 'ABP_Debris_HayAirBorne_C::AmountOfSmallDust' has a wrong offset!");

}

