#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeathEssence_OnInteract

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DeathEssence_OnInteract.BP_DeathEssence_OnInteract_C
// 0x0040 (0x0718 - 0x06D8)
class UBP_DeathEssence_OnInteract_C final : public UOnInteractAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         EssenceAmount;                                     // 0x06E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EntropicEssenceAmount;                             // 0x06E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   PopupTitle;                                        // 0x06E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   PopupText;                                         // 0x0700(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_DeathEssence_OnInteract(int32 EntryPoint);
	void BPOnStart();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DeathEssence_OnInteract_C">();
	}
	static class UBP_DeathEssence_OnInteract_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_DeathEssence_OnInteract_C>();
	}
};
static_assert(alignof(UBP_DeathEssence_OnInteract_C) == 0x000008, "Wrong alignment on UBP_DeathEssence_OnInteract_C");
static_assert(sizeof(UBP_DeathEssence_OnInteract_C) == 0x000718, "Wrong size on UBP_DeathEssence_OnInteract_C");
static_assert(offsetof(UBP_DeathEssence_OnInteract_C, UberGraphFrame) == 0x0006D8, "Member 'UBP_DeathEssence_OnInteract_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_DeathEssence_OnInteract_C, EssenceAmount) == 0x0006E0, "Member 'UBP_DeathEssence_OnInteract_C::EssenceAmount' has a wrong offset!");
static_assert(offsetof(UBP_DeathEssence_OnInteract_C, EntropicEssenceAmount) == 0x0006E4, "Member 'UBP_DeathEssence_OnInteract_C::EntropicEssenceAmount' has a wrong offset!");
static_assert(offsetof(UBP_DeathEssence_OnInteract_C, PopupTitle) == 0x0006E8, "Member 'UBP_DeathEssence_OnInteract_C::PopupTitle' has a wrong offset!");
static_assert(offsetof(UBP_DeathEssence_OnInteract_C, PopupText) == 0x000700, "Member 'UBP_DeathEssence_OnInteract_C::PopupText' has a wrong offset!");

}

