#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeathScreen

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DeathScreen.BP_DeathScreen_C.ExecuteUbergraph_BP_DeathScreen
// 0x0080 (0x0080 - 0x0000)
struct BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUDUserWidget*                         CallFunc_GetHUDWidget_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_AnimDuration_1;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0040(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen) == 0x000008, "Wrong alignment on BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen");
static_assert(sizeof(BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen) == 0x000080, "Wrong size on BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen");
static_assert(offsetof(BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen, EntryPoint) == 0x000000, "Member 'BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen, CallFunc_GetHUDWidget_ReturnValue) == 0x000008, "Member 'BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen::CallFunc_GetHUDWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen, K2Node_Event_IsDesignTime) == 0x000010, "Member 'BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen, K2Node_Event_AnimDuration_1) == 0x000014, "Member 'BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen::K2Node_Event_AnimDuration_1' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen, CallFunc_GetEndTime_ReturnValue) == 0x000020, "Member 'BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen, K2Node_Event_AnimDuration) == 0x000024, "Member 'BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen::K2Node_Event_AnimDuration' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen, CallFunc_K2_SetTimer_ReturnValue) == 0x000028, "Member 'BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen, CallFunc_GetAnimPlaybackSpeed_ReturnValue) == 0x000030, "Member 'BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen::CallFunc_GetAnimPlaybackSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen, CallFunc_PlayAnimation_ReturnValue_1) == 0x000038, "Member 'BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen, K2Node_Event_MyGeometry) == 0x000040, "Member 'BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen, K2Node_Event_InDeltaTime) == 0x000078, "Member 'BP_DeathScreen_C_ExecuteUbergraph_BP_DeathScreen::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function BP_DeathScreen.BP_DeathScreen_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_DeathScreen_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeathScreen_C_Tick) == 0x000004, "Wrong alignment on BP_DeathScreen_C_Tick");
static_assert(sizeof(BP_DeathScreen_C_Tick) == 0x00003C, "Wrong size on BP_DeathScreen_C_Tick");
static_assert(offsetof(BP_DeathScreen_C_Tick, MyGeometry) == 0x000000, "Member 'BP_DeathScreen_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_DeathScreen_C_Tick::InDeltaTime' has a wrong offset!");

// Function BP_DeathScreen.BP_DeathScreen_C.OnHide
// 0x0004 (0x0004 - 0x0000)
struct BP_DeathScreen_C_OnHide final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeathScreen_C_OnHide) == 0x000004, "Wrong alignment on BP_DeathScreen_C_OnHide");
static_assert(sizeof(BP_DeathScreen_C_OnHide) == 0x000004, "Wrong size on BP_DeathScreen_C_OnHide");
static_assert(offsetof(BP_DeathScreen_C_OnHide, AnimDuration) == 0x000000, "Member 'BP_DeathScreen_C_OnHide::AnimDuration' has a wrong offset!");

// Function BP_DeathScreen.BP_DeathScreen_C.OnShow
// 0x0004 (0x0004 - 0x0000)
struct BP_DeathScreen_C_OnShow final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeathScreen_C_OnShow) == 0x000004, "Wrong alignment on BP_DeathScreen_C_OnShow");
static_assert(sizeof(BP_DeathScreen_C_OnShow) == 0x000004, "Wrong size on BP_DeathScreen_C_OnShow");
static_assert(offsetof(BP_DeathScreen_C_OnShow, AnimDuration) == 0x000000, "Member 'BP_DeathScreen_C_OnShow::AnimDuration' has a wrong offset!");

// Function BP_DeathScreen.BP_DeathScreen_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_DeathScreen_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DeathScreen_C_PreConstruct) == 0x000001, "Wrong alignment on BP_DeathScreen_C_PreConstruct");
static_assert(sizeof(BP_DeathScreen_C_PreConstruct) == 0x000001, "Wrong size on BP_DeathScreen_C_PreConstruct");
static_assert(offsetof(BP_DeathScreen_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_DeathScreen_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_DeathScreen.BP_DeathScreen_C.SetDeathScreen
// 0x0118 (0x0118 - 0x0000)
struct BP_DeathScreen_C_SetDeathScreen final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Temp_object_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Temp_object_Variable_3;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0050(0x0018)()
	bool                                          Temp_bool_Variable_3;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Temp_object_Variable_4;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0080(0x0018)()
	class UTexture*                               K2Node_Select_Default;                             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_Select_Default_1;                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEntropyDeath_ReturnValue;               // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x00B8(0x0018)()
	class UTexture*                               K2Node_Select_Default_3;                           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEntropyDeath_ReturnValue_1;             // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_4;                           // 0x00E8(0x0018)()
	class FText                                   CallFunc_SetTextFormatByHeroGender_ReturnValue;    // 0x0100(0x0018)()
};
static_assert(alignof(BP_DeathScreen_C_SetDeathScreen) == 0x000008, "Wrong alignment on BP_DeathScreen_C_SetDeathScreen");
static_assert(sizeof(BP_DeathScreen_C_SetDeathScreen) == 0x000118, "Wrong size on BP_DeathScreen_C_SetDeathScreen");
static_assert(offsetof(BP_DeathScreen_C_SetDeathScreen, Temp_bool_Variable) == 0x000000, "Member 'BP_DeathScreen_C_SetDeathScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_SetDeathScreen, Temp_object_Variable) == 0x000008, "Member 'BP_DeathScreen_C_SetDeathScreen::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_SetDeathScreen, Temp_object_Variable_1) == 0x000010, "Member 'BP_DeathScreen_C_SetDeathScreen::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_SetDeathScreen, Temp_bool_Variable_1) == 0x000018, "Member 'BP_DeathScreen_C_SetDeathScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_SetDeathScreen, Temp_object_Variable_2) == 0x000020, "Member 'BP_DeathScreen_C_SetDeathScreen::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_SetDeathScreen, Temp_object_Variable_3) == 0x000028, "Member 'BP_DeathScreen_C_SetDeathScreen::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_SetDeathScreen, Temp_bool_Variable_2) == 0x000030, "Member 'BP_DeathScreen_C_SetDeathScreen::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_SetDeathScreen, Temp_text_Variable) == 0x000038, "Member 'BP_DeathScreen_C_SetDeathScreen::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_SetDeathScreen, Temp_text_Variable_1) == 0x000050, "Member 'BP_DeathScreen_C_SetDeathScreen::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_SetDeathScreen, Temp_bool_Variable_3) == 0x000068, "Member 'BP_DeathScreen_C_SetDeathScreen::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_SetDeathScreen, Temp_object_Variable_4) == 0x000070, "Member 'BP_DeathScreen_C_SetDeathScreen::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_SetDeathScreen, Temp_bool_Variable_4) == 0x000078, "Member 'BP_DeathScreen_C_SetDeathScreen::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_SetDeathScreen, Temp_text_Variable_2) == 0x000080, "Member 'BP_DeathScreen_C_SetDeathScreen::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_SetDeathScreen, K2Node_Select_Default) == 0x000098, "Member 'BP_DeathScreen_C_SetDeathScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_SetDeathScreen, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000A0, "Member 'BP_DeathScreen_C_SetDeathScreen::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_SetDeathScreen, K2Node_Select_Default_1) == 0x0000A8, "Member 'BP_DeathScreen_C_SetDeathScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_SetDeathScreen, CallFunc_IsEntropyDeath_ReturnValue) == 0x0000B0, "Member 'BP_DeathScreen_C_SetDeathScreen::CallFunc_IsEntropyDeath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_SetDeathScreen, K2Node_Select_Default_2) == 0x0000B8, "Member 'BP_DeathScreen_C_SetDeathScreen::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_SetDeathScreen, K2Node_Select_Default_3) == 0x0000D0, "Member 'BP_DeathScreen_C_SetDeathScreen::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_SetDeathScreen, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x0000D8, "Member 'BP_DeathScreen_C_SetDeathScreen::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_SetDeathScreen, CallFunc_IsEntropyDeath_ReturnValue_1) == 0x0000E0, "Member 'BP_DeathScreen_C_SetDeathScreen::CallFunc_IsEntropyDeath_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_SetDeathScreen, K2Node_Select_Default_4) == 0x0000E8, "Member 'BP_DeathScreen_C_SetDeathScreen::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(BP_DeathScreen_C_SetDeathScreen, CallFunc_SetTextFormatByHeroGender_ReturnValue) == 0x000100, "Member 'BP_DeathScreen_C_SetDeathScreen::CallFunc_SetTextFormatByHeroGender_ReturnValue' has a wrong offset!");

}

