#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DarkFireImp_FireCrystalCharge_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DarkFireImp_FireCrystalCharge_VisualEntity.BP_DarkFireImp_FireCrystalCharge_VisualEntity_C
// 0x0020 (0x0370 - 0x0350)
class ABP_DarkFireImp_FireCrystalCharge_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           AkComponent;                                       // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Explosion;                                         // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Crystal;                                           // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DarkFireImp_FireCrystalCharge_VisualEntity(int32 EntryPoint);
	void OnKill();
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DarkFireImp_FireCrystalCharge_VisualEntity_C">();
	}
	static class ABP_DarkFireImp_FireCrystalCharge_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DarkFireImp_FireCrystalCharge_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_DarkFireImp_FireCrystalCharge_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_DarkFireImp_FireCrystalCharge_VisualEntity_C");
static_assert(sizeof(ABP_DarkFireImp_FireCrystalCharge_VisualEntity_C) == 0x000370, "Wrong size on ABP_DarkFireImp_FireCrystalCharge_VisualEntity_C");
static_assert(offsetof(ABP_DarkFireImp_FireCrystalCharge_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_DarkFireImp_FireCrystalCharge_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DarkFireImp_FireCrystalCharge_VisualEntity_C, AkComponent) == 0x000358, "Member 'ABP_DarkFireImp_FireCrystalCharge_VisualEntity_C::AkComponent' has a wrong offset!");
static_assert(offsetof(ABP_DarkFireImp_FireCrystalCharge_VisualEntity_C, Explosion) == 0x000360, "Member 'ABP_DarkFireImp_FireCrystalCharge_VisualEntity_C::Explosion' has a wrong offset!");
static_assert(offsetof(ABP_DarkFireImp_FireCrystalCharge_VisualEntity_C, Crystal) == 0x000368, "Member 'ABP_DarkFireImp_FireCrystalCharge_VisualEntity_C::Crystal' has a wrong offset!");

}

