#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeathEssence

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_DeathEssence.BP_DeathEssence_C.ExecuteUbergraph_BP_DeathEssence
// 0x0058 (0x0058 - 0x0000)
struct BP_DeathEssence_C_ExecuteUbergraph_BP_DeathEssence final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Killer, class UAbilityController* KillerAbilityController)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0024(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Killer;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     K2Node_CustomEvent_KillerAbilityController;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeathEssence_C_ExecuteUbergraph_BP_DeathEssence) == 0x000008, "Wrong alignment on BP_DeathEssence_C_ExecuteUbergraph_BP_DeathEssence");
static_assert(sizeof(BP_DeathEssence_C_ExecuteUbergraph_BP_DeathEssence) == 0x000058, "Wrong size on BP_DeathEssence_C_ExecuteUbergraph_BP_DeathEssence");
static_assert(offsetof(BP_DeathEssence_C_ExecuteUbergraph_BP_DeathEssence, EntryPoint) == 0x000000, "Member 'BP_DeathEssence_C_ExecuteUbergraph_BP_DeathEssence::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_C_ExecuteUbergraph_BP_DeathEssence, Temp_delegate_Variable) == 0x000004, "Member 'BP_DeathEssence_C_ExecuteUbergraph_BP_DeathEssence::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_C_ExecuteUbergraph_BP_DeathEssence, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_DeathEssence_C_ExecuteUbergraph_BP_DeathEssence::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_C_ExecuteUbergraph_BP_DeathEssence, Temp_delegate_Variable_1) == 0x000024, "Member 'BP_DeathEssence_C_ExecuteUbergraph_BP_DeathEssence::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_C_ExecuteUbergraph_BP_DeathEssence, CallFunc_PostAkEvent_ReturnValue) == 0x000034, "Member 'BP_DeathEssence_C_ExecuteUbergraph_BP_DeathEssence::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_C_ExecuteUbergraph_BP_DeathEssence, CallFunc_GetAbilityController_ReturnValue) == 0x000038, "Member 'BP_DeathEssence_C_ExecuteUbergraph_BP_DeathEssence::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_C_ExecuteUbergraph_BP_DeathEssence, K2Node_CustomEvent_Killer) == 0x000040, "Member 'BP_DeathEssence_C_ExecuteUbergraph_BP_DeathEssence::K2Node_CustomEvent_Killer' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_C_ExecuteUbergraph_BP_DeathEssence, K2Node_CustomEvent_KillerAbilityController) == 0x000048, "Member 'BP_DeathEssence_C_ExecuteUbergraph_BP_DeathEssence::K2Node_CustomEvent_KillerAbilityController' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_C_ExecuteUbergraph_BP_DeathEssence, CallFunc_PostAkEvent_ReturnValue_1) == 0x000050, "Member 'BP_DeathEssence_C_ExecuteUbergraph_BP_DeathEssence::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");

// Function BP_DeathEssence.BP_DeathEssence_C.OnKilled
// 0x0010 (0x0010 - 0x0000)
struct BP_DeathEssence_C_OnKilled final
{
public:
	class UObject*                                Killer;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     KillerAbilityController;                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeathEssence_C_OnKilled) == 0x000008, "Wrong alignment on BP_DeathEssence_C_OnKilled");
static_assert(sizeof(BP_DeathEssence_C_OnKilled) == 0x000010, "Wrong size on BP_DeathEssence_C_OnKilled");
static_assert(offsetof(BP_DeathEssence_C_OnKilled, Killer) == 0x000000, "Member 'BP_DeathEssence_C_OnKilled::Killer' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_C_OnKilled, KillerAbilityController) == 0x000008, "Member 'BP_DeathEssence_C_OnKilled::KillerAbilityController' has a wrong offset!");

}

