#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DaggerInHand

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DaggerInHand.BP_DaggerInHand_C
// 0x0060 (0x03B0 - 0x0350)
class ABP_DaggerInHand_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class UMaterialInterface*>  MaterialMap;                                       // 0x0360(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void VisualEntityConstructionFinished();
	void ExecuteUbergraph_BP_DaggerInHand(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DaggerInHand_C">();
	}
	static class ABP_DaggerInHand_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DaggerInHand_C>();
	}
};
static_assert(alignof(ABP_DaggerInHand_C) == 0x000008, "Wrong alignment on ABP_DaggerInHand_C");
static_assert(sizeof(ABP_DaggerInHand_C) == 0x0003B0, "Wrong size on ABP_DaggerInHand_C");
static_assert(offsetof(ABP_DaggerInHand_C, UberGraphFrame) == 0x000350, "Member 'ABP_DaggerInHand_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DaggerInHand_C, SkeletalMesh) == 0x000358, "Member 'ABP_DaggerInHand_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_DaggerInHand_C, MaterialMap) == 0x000360, "Member 'ABP_DaggerInHand_C::MaterialMap' has a wrong offset!");

}

