#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeathEssence_OnInteract

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_DeathEssence_OnInteract.BP_DeathEssence_OnInteract_C.ExecuteUbergraph_BP_DeathEssence_OnInteract
// 0x0048 (0x0048 - 0x0000)
struct BP_DeathEssence_OnInteract_C_ExecuteUbergraph_BP_DeathEssence_OnInteract final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     CallFunc_BPGetTarget_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CallFunc_GetInventory_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         CallFunc_GetCharacter_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHeroBase*                              K2Node_DynamicCast_AsHero_Base;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMandragoraGameMode*                    CallFunc_GetGameMode_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeathEssence_OnInteract_C_ExecuteUbergraph_BP_DeathEssence_OnInteract) == 0x000008, "Wrong alignment on BP_DeathEssence_OnInteract_C_ExecuteUbergraph_BP_DeathEssence_OnInteract");
static_assert(sizeof(BP_DeathEssence_OnInteract_C_ExecuteUbergraph_BP_DeathEssence_OnInteract) == 0x000048, "Wrong size on BP_DeathEssence_OnInteract_C_ExecuteUbergraph_BP_DeathEssence_OnInteract");
static_assert(offsetof(BP_DeathEssence_OnInteract_C_ExecuteUbergraph_BP_DeathEssence_OnInteract, EntryPoint) == 0x000000, "Member 'BP_DeathEssence_OnInteract_C_ExecuteUbergraph_BP_DeathEssence_OnInteract::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_OnInteract_C_ExecuteUbergraph_BP_DeathEssence_OnInteract, CallFunc_GetAbilityController_ReturnValue) == 0x000008, "Member 'BP_DeathEssence_OnInteract_C_ExecuteUbergraph_BP_DeathEssence_OnInteract::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_OnInteract_C_ExecuteUbergraph_BP_DeathEssence_OnInteract, CallFunc_BPGetTarget_ReturnValue) == 0x000010, "Member 'BP_DeathEssence_OnInteract_C_ExecuteUbergraph_BP_DeathEssence_OnInteract::CallFunc_BPGetTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_OnInteract_C_ExecuteUbergraph_BP_DeathEssence_OnInteract, CallFunc_GetInventory_ReturnValue) == 0x000018, "Member 'BP_DeathEssence_OnInteract_C_ExecuteUbergraph_BP_DeathEssence_OnInteract::CallFunc_GetInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_OnInteract_C_ExecuteUbergraph_BP_DeathEssence_OnInteract, CallFunc_GetCharacter_ReturnValue) == 0x000020, "Member 'BP_DeathEssence_OnInteract_C_ExecuteUbergraph_BP_DeathEssence_OnInteract::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_OnInteract_C_ExecuteUbergraph_BP_DeathEssence_OnInteract, K2Node_DynamicCast_AsHero_Base) == 0x000028, "Member 'BP_DeathEssence_OnInteract_C_ExecuteUbergraph_BP_DeathEssence_OnInteract::K2Node_DynamicCast_AsHero_Base' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_OnInteract_C_ExecuteUbergraph_BP_DeathEssence_OnInteract, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_DeathEssence_OnInteract_C_ExecuteUbergraph_BP_DeathEssence_OnInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_OnInteract_C_ExecuteUbergraph_BP_DeathEssence_OnInteract, CallFunc_GetGameMode_ReturnValue) == 0x000038, "Member 'BP_DeathEssence_OnInteract_C_ExecuteUbergraph_BP_DeathEssence_OnInteract::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEssence_OnInteract_C_ExecuteUbergraph_BP_DeathEssence_OnInteract, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000040, "Member 'BP_DeathEssence_OnInteract_C_ExecuteUbergraph_BP_DeathEssence_OnInteract::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");

}

