#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DarkEcho_Clone_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DarkEcho_Clone_VisualEntity.BP_DarkEcho_Clone_VisualEntity_C
// 0x0038 (0x0388 - 0x0350)
class ABP_DarkEcho_Clone_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_GDD_1C145DAC4D473EF03D05CBBCBED859D1;   // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_Radius_1C145DAC4D473EF03D05CBBCBED859D1; // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_2__Direction_1C145DAC4D473EF03D05CBBCBED859D1; // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_2;                                        // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       Dynamic_Materials_0;                               // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_DarkEcho_Clone_VisualEntity(int32 EntryPoint);
	void OnKill();
	void VisualEntityConstructionFinished();
	void Timeline_2__UpdateFunc();
	void Timeline_2__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DarkEcho_Clone_VisualEntity_C">();
	}
	static class ABP_DarkEcho_Clone_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DarkEcho_Clone_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_DarkEcho_Clone_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_DarkEcho_Clone_VisualEntity_C");
static_assert(sizeof(ABP_DarkEcho_Clone_VisualEntity_C) == 0x000388, "Wrong size on ABP_DarkEcho_Clone_VisualEntity_C");
static_assert(offsetof(ABP_DarkEcho_Clone_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_DarkEcho_Clone_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DarkEcho_Clone_VisualEntity_C, Niagara) == 0x000358, "Member 'ABP_DarkEcho_Clone_VisualEntity_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_DarkEcho_Clone_VisualEntity_C, Timeline_2_GDD_1C145DAC4D473EF03D05CBBCBED859D1) == 0x000360, "Member 'ABP_DarkEcho_Clone_VisualEntity_C::Timeline_2_GDD_1C145DAC4D473EF03D05CBBCBED859D1' has a wrong offset!");
static_assert(offsetof(ABP_DarkEcho_Clone_VisualEntity_C, Timeline_2_Radius_1C145DAC4D473EF03D05CBBCBED859D1) == 0x000364, "Member 'ABP_DarkEcho_Clone_VisualEntity_C::Timeline_2_Radius_1C145DAC4D473EF03D05CBBCBED859D1' has a wrong offset!");
static_assert(offsetof(ABP_DarkEcho_Clone_VisualEntity_C, Timeline_2__Direction_1C145DAC4D473EF03D05CBBCBED859D1) == 0x000368, "Member 'ABP_DarkEcho_Clone_VisualEntity_C::Timeline_2__Direction_1C145DAC4D473EF03D05CBBCBED859D1' has a wrong offset!");
static_assert(offsetof(ABP_DarkEcho_Clone_VisualEntity_C, Timeline_2) == 0x000370, "Member 'ABP_DarkEcho_Clone_VisualEntity_C::Timeline_2' has a wrong offset!");
static_assert(offsetof(ABP_DarkEcho_Clone_VisualEntity_C, Dynamic_Materials_0) == 0x000378, "Member 'ABP_DarkEcho_Clone_VisualEntity_C::Dynamic_Materials_0' has a wrong offset!");

}

