#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EntropicFissure_Explode_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EntropicFissure_Explode_VisualEntity.BP_EntropicFissure_Explode_VisualEntity_C
// 0x0020 (0x0370 - 0x0350)
class ABP_EntropicFissure_Explode_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitBoxScale;                                       // 0x0360(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void VisualEntityConstructionFinished();
	void OnKill();
	void ExecuteUbergraph_BP_EntropicFissure_Explode_VisualEntity(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EntropicFissure_Explode_VisualEntity_C">();
	}
	static class ABP_EntropicFissure_Explode_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EntropicFissure_Explode_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_EntropicFissure_Explode_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_EntropicFissure_Explode_VisualEntity_C");
static_assert(sizeof(ABP_EntropicFissure_Explode_VisualEntity_C) == 0x000370, "Wrong size on ABP_EntropicFissure_Explode_VisualEntity_C");
static_assert(offsetof(ABP_EntropicFissure_Explode_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_EntropicFissure_Explode_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EntropicFissure_Explode_VisualEntity_C, Niagara) == 0x000358, "Member 'ABP_EntropicFissure_Explode_VisualEntity_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_EntropicFissure_Explode_VisualEntity_C, HitBoxScale) == 0x000360, "Member 'ABP_EntropicFissure_Explode_VisualEntity_C::HitBoxScale' has a wrong offset!");

}

