#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EvadedText

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EvadedText.BP_EvadedText_C
// 0x0028 (0x0250 - 0x0228)
class ABP_EvadedText_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       Widget;                                            // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timer;                                             // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Pos;                                               // 0x0244(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_EvadedText(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EvadedText_C">();
	}
	static class ABP_EvadedText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EvadedText_C>();
	}
};
static_assert(alignof(ABP_EvadedText_C) == 0x000008, "Wrong alignment on ABP_EvadedText_C");
static_assert(sizeof(ABP_EvadedText_C) == 0x000250, "Wrong size on ABP_EvadedText_C");
static_assert(offsetof(ABP_EvadedText_C, UberGraphFrame) == 0x000228, "Member 'ABP_EvadedText_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EvadedText_C, Widget) == 0x000230, "Member 'ABP_EvadedText_C::Widget' has a wrong offset!");
static_assert(offsetof(ABP_EvadedText_C, DefaultSceneRoot) == 0x000238, "Member 'ABP_EvadedText_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_EvadedText_C, Timer) == 0x000240, "Member 'ABP_EvadedText_C::Timer' has a wrong offset!");
static_assert(offsetof(ABP_EvadedText_C, Pos) == 0x000244, "Member 'ABP_EvadedText_C::Pos' has a wrong offset!");

}

