#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EvadedText

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_EvadedText.BP_EvadedText_C.ExecuteUbergraph_BP_EvadedText
// 0x00F0 (0x00F0 - 0x0000)
struct BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0050(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_EvadedText_Widget_C*                K2Node_DynamicCast_AsBP_Evaded_Text_Widget;        // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText) == 0x000008, "Wrong alignment on BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText");
static_assert(sizeof(BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText) == 0x0000F0, "Wrong size on BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText");
static_assert(offsetof(BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText, EntryPoint) == 0x000000, "Member 'BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x00000C, "Member 'BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText, CallFunc_Add_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00001C, "Member 'BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText, CallFunc_BreakVector_X) == 0x000028, "Member 'BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText, CallFunc_BreakVector_Y) == 0x00002C, "Member 'BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText, CallFunc_BreakVector_Z) == 0x000030, "Member 'BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000034, "Member 'BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText, CallFunc_MakeVector_ReturnValue) == 0x000038, "Member 'BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000048, "Member 'BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000050, "Member 'BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0000D8, "Member 'BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText, K2Node_DynamicCast_AsBP_Evaded_Text_Widget) == 0x0000E0, "Member 'BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText::K2Node_DynamicCast_AsBP_Evaded_Text_Widget' has a wrong offset!");
static_assert(offsetof(BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x0000E9, "Member 'BP_EvadedText_C_ExecuteUbergraph_BP_EvadedText::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function BP_EvadedText.BP_EvadedText_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_EvadedText_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EvadedText_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_EvadedText_C_ReceiveTick");
static_assert(sizeof(BP_EvadedText_C_ReceiveTick) == 0x000004, "Wrong size on BP_EvadedText_C_ReceiveTick");
static_assert(offsetof(BP_EvadedText_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_EvadedText_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

