#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EntropyRift_SimpleClosable

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_EntropyRift_SimpleClosable.BP_EntropyRift_SimpleClosable_C.ExecuteUbergraph_BP_EntropyRift_SimpleClosable
// 0x00B8 (0x00B8 - 0x0000)
struct BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EntryKey)>         Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0024(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x0034(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_4;                          // 0x0044(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_5;                          // 0x0054(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_6;                          // 0x0064(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_7;                          // 0x0074(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UManConversationManager*                CallFunc_GetConversationManager_ReturnValue;       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GlobalDictionarySetBool_ReturnValue;      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_4;                // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_5;                // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_6;                // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable) == 0x000008, "Wrong alignment on BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable");
static_assert(sizeof(BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable) == 0x0000B8, "Wrong size on BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable, EntryPoint) == 0x000000, "Member 'BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable, Temp_delegate_Variable) == 0x000004, "Member 'BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable, Temp_delegate_Variable_1) == 0x000014, "Member 'BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable, Temp_delegate_Variable_2) == 0x000024, "Member 'BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable, Temp_delegate_Variable_3) == 0x000034, "Member 'BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable, Temp_delegate_Variable_4) == 0x000044, "Member 'BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable::Temp_delegate_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable, Temp_delegate_Variable_5) == 0x000054, "Member 'BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable::Temp_delegate_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable, Temp_delegate_Variable_6) == 0x000064, "Member 'BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable::Temp_delegate_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable, Temp_delegate_Variable_7) == 0x000074, "Member 'BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable::Temp_delegate_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable, CallFunc_GetConversationManager_ReturnValue) == 0x000088, "Member 'BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable::CallFunc_GetConversationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable, CallFunc_GlobalDictionarySetBool_ReturnValue) == 0x000091, "Member 'BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable::CallFunc_GlobalDictionarySetBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable, CallFunc_Array_Length_ReturnValue) == 0x000094, "Member 'BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000098, "Member 'BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable, CallFunc_PostAkEvent_ReturnValue) == 0x00009C, "Member 'BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable, CallFunc_PostAkEvent_ReturnValue_1) == 0x0000A0, "Member 'BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable, CallFunc_PostAkEvent_ReturnValue_2) == 0x0000A4, "Member 'BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable, CallFunc_PostAkEvent_ReturnValue_3) == 0x0000A8, "Member 'BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable::CallFunc_PostAkEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable, CallFunc_PostAkEvent_ReturnValue_4) == 0x0000AC, "Member 'BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable::CallFunc_PostAkEvent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable, CallFunc_PostAkEvent_ReturnValue_5) == 0x0000B0, "Member 'BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable::CallFunc_PostAkEvent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable, CallFunc_PostAkEvent_ReturnValue_6) == 0x0000B4, "Member 'BP_EntropyRift_SimpleClosable_C_ExecuteUbergraph_BP_EntropyRift_SimpleClosable::CallFunc_PostAkEvent_ReturnValue_6' has a wrong offset!");

// Function BP_EntropyRift_SimpleClosable.BP_EntropyRift_SimpleClosable_C.UserConstructionScript
// 0x0048 (0x0048 - 0x0000)
struct BP_EntropyRift_SimpleClosable_C_UserConstructionScript final
{
public:
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_4;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_5;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_6;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_7;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_8;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_9;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_10;                      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_11;                      // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EntropyRift_SimpleClosable_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_EntropyRift_SimpleClosable_C_UserConstructionScript");
static_assert(sizeof(BP_EntropyRift_SimpleClosable_C_UserConstructionScript) == 0x000048, "Wrong size on BP_EntropyRift_SimpleClosable_C_UserConstructionScript");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000000, "Member 'BP_EntropyRift_SimpleClosable_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_UserConstructionScript, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'BP_EntropyRift_SimpleClosable_C_UserConstructionScript::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_UserConstructionScript, CallFunc_Lerp_ReturnValue_1) == 0x000008, "Member 'BP_EntropyRift_SimpleClosable_C_UserConstructionScript::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_UserConstructionScript, CallFunc_Lerp_ReturnValue_2) == 0x00000C, "Member 'BP_EntropyRift_SimpleClosable_C_UserConstructionScript::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_UserConstructionScript, CallFunc_Lerp_ReturnValue_3) == 0x000010, "Member 'BP_EntropyRift_SimpleClosable_C_UserConstructionScript::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_UserConstructionScript, CallFunc_Lerp_ReturnValue_4) == 0x000014, "Member 'BP_EntropyRift_SimpleClosable_C_UserConstructionScript::CallFunc_Lerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_UserConstructionScript, CallFunc_Lerp_ReturnValue_5) == 0x000018, "Member 'BP_EntropyRift_SimpleClosable_C_UserConstructionScript::CallFunc_Lerp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_UserConstructionScript, CallFunc_Lerp_ReturnValue_6) == 0x00001C, "Member 'BP_EntropyRift_SimpleClosable_C_UserConstructionScript::CallFunc_Lerp_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_UserConstructionScript, CallFunc_Lerp_ReturnValue_7) == 0x000020, "Member 'BP_EntropyRift_SimpleClosable_C_UserConstructionScript::CallFunc_Lerp_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_UserConstructionScript, CallFunc_Lerp_ReturnValue_8) == 0x000024, "Member 'BP_EntropyRift_SimpleClosable_C_UserConstructionScript::CallFunc_Lerp_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_UserConstructionScript, CallFunc_Lerp_ReturnValue_9) == 0x000028, "Member 'BP_EntropyRift_SimpleClosable_C_UserConstructionScript::CallFunc_Lerp_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_UserConstructionScript, CallFunc_Lerp_ReturnValue_10) == 0x00002C, "Member 'BP_EntropyRift_SimpleClosable_C_UserConstructionScript::CallFunc_Lerp_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_UserConstructionScript, CallFunc_Lerp_ReturnValue_11) == 0x000030, "Member 'BP_EntropyRift_SimpleClosable_C_UserConstructionScript::CallFunc_Lerp_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000038, "Member 'BP_EntropyRift_SimpleClosable_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000040, "Member 'BP_EntropyRift_SimpleClosable_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

// Function BP_EntropyRift_SimpleClosable.BP_EntropyRift_SimpleClosable_C.UpdateLightRiftLayer
// 0x0028 (0x0028 - 0x0000)
struct BP_EntropyRift_SimpleClosable_C_UpdateLightRiftLayer final
{
public:
	float                                         Alpha;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          forceMidOpen;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_4;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_5;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_6;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_7;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EntropyRift_SimpleClosable_C_UpdateLightRiftLayer) == 0x000004, "Wrong alignment on BP_EntropyRift_SimpleClosable_C_UpdateLightRiftLayer");
static_assert(sizeof(BP_EntropyRift_SimpleClosable_C_UpdateLightRiftLayer) == 0x000028, "Wrong size on BP_EntropyRift_SimpleClosable_C_UpdateLightRiftLayer");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_UpdateLightRiftLayer, Alpha) == 0x000000, "Member 'BP_EntropyRift_SimpleClosable_C_UpdateLightRiftLayer::Alpha' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_UpdateLightRiftLayer, forceMidOpen) == 0x000004, "Member 'BP_EntropyRift_SimpleClosable_C_UpdateLightRiftLayer::forceMidOpen' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_UpdateLightRiftLayer, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'BP_EntropyRift_SimpleClosable_C_UpdateLightRiftLayer::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_UpdateLightRiftLayer, CallFunc_Lerp_ReturnValue_1) == 0x00000C, "Member 'BP_EntropyRift_SimpleClosable_C_UpdateLightRiftLayer::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_UpdateLightRiftLayer, CallFunc_Lerp_ReturnValue_2) == 0x000010, "Member 'BP_EntropyRift_SimpleClosable_C_UpdateLightRiftLayer::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_UpdateLightRiftLayer, CallFunc_Lerp_ReturnValue_3) == 0x000014, "Member 'BP_EntropyRift_SimpleClosable_C_UpdateLightRiftLayer::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_UpdateLightRiftLayer, CallFunc_Lerp_ReturnValue_4) == 0x000018, "Member 'BP_EntropyRift_SimpleClosable_C_UpdateLightRiftLayer::CallFunc_Lerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_UpdateLightRiftLayer, CallFunc_Lerp_ReturnValue_5) == 0x00001C, "Member 'BP_EntropyRift_SimpleClosable_C_UpdateLightRiftLayer::CallFunc_Lerp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_UpdateLightRiftLayer, CallFunc_Lerp_ReturnValue_6) == 0x000020, "Member 'BP_EntropyRift_SimpleClosable_C_UpdateLightRiftLayer::CallFunc_Lerp_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_UpdateLightRiftLayer, CallFunc_Lerp_ReturnValue_7) == 0x000024, "Member 'BP_EntropyRift_SimpleClosable_C_UpdateLightRiftLayer::CallFunc_Lerp_ReturnValue_7' has a wrong offset!");

// Function BP_EntropyRift_SimpleClosable.BP_EntropyRift_SimpleClosable_C.Update Dark Rift Layer
// 0x0024 (0x0024 - 0x0000)
struct BP_EntropyRift_SimpleClosable_C_Update_Dark_Rift_Layer final
{
public:
	float                                         Alpha;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          forceMidOpen;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_4;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_5;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EntropyRift_SimpleClosable_C_Update_Dark_Rift_Layer) == 0x000004, "Wrong alignment on BP_EntropyRift_SimpleClosable_C_Update_Dark_Rift_Layer");
static_assert(sizeof(BP_EntropyRift_SimpleClosable_C_Update_Dark_Rift_Layer) == 0x000024, "Wrong size on BP_EntropyRift_SimpleClosable_C_Update_Dark_Rift_Layer");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_Update_Dark_Rift_Layer, Alpha) == 0x000000, "Member 'BP_EntropyRift_SimpleClosable_C_Update_Dark_Rift_Layer::Alpha' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_Update_Dark_Rift_Layer, forceMidOpen) == 0x000004, "Member 'BP_EntropyRift_SimpleClosable_C_Update_Dark_Rift_Layer::forceMidOpen' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_Update_Dark_Rift_Layer, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'BP_EntropyRift_SimpleClosable_C_Update_Dark_Rift_Layer::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_Update_Dark_Rift_Layer, CallFunc_Lerp_ReturnValue_1) == 0x00000C, "Member 'BP_EntropyRift_SimpleClosable_C_Update_Dark_Rift_Layer::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_Update_Dark_Rift_Layer, CallFunc_Lerp_ReturnValue_2) == 0x000010, "Member 'BP_EntropyRift_SimpleClosable_C_Update_Dark_Rift_Layer::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_Update_Dark_Rift_Layer, CallFunc_Lerp_ReturnValue_3) == 0x000014, "Member 'BP_EntropyRift_SimpleClosable_C_Update_Dark_Rift_Layer::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_Update_Dark_Rift_Layer, CallFunc_Lerp_ReturnValue_4) == 0x000018, "Member 'BP_EntropyRift_SimpleClosable_C_Update_Dark_Rift_Layer::CallFunc_Lerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_Update_Dark_Rift_Layer, CallFunc_Lerp_ReturnValue_5) == 0x00001C, "Member 'BP_EntropyRift_SimpleClosable_C_Update_Dark_Rift_Layer::CallFunc_Lerp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_EntropyRift_SimpleClosable_C_Update_Dark_Rift_Layer, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_EntropyRift_SimpleClosable_C_Update_Dark_Rift_Layer::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

}

