#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EssenceIcon

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_EssenceIcon.BP_EssenceIcon_C
// 0x0018 (0x0278 - 0x0260)
class UBP_EssenceIcon_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       HighlightAnim;                                     // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Highlight;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PlayHighlight();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EssenceIcon_C">();
	}
	static class UBP_EssenceIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_EssenceIcon_C>();
	}
};
static_assert(alignof(UBP_EssenceIcon_C) == 0x000008, "Wrong alignment on UBP_EssenceIcon_C");
static_assert(sizeof(UBP_EssenceIcon_C) == 0x000278, "Wrong size on UBP_EssenceIcon_C");
static_assert(offsetof(UBP_EssenceIcon_C, HighlightAnim) == 0x000260, "Member 'UBP_EssenceIcon_C::HighlightAnim' has a wrong offset!");
static_assert(offsetof(UBP_EssenceIcon_C, Highlight) == 0x000268, "Member 'UBP_EssenceIcon_C::Highlight' has a wrong offset!");
static_assert(offsetof(UBP_EssenceIcon_C, Icon) == 0x000270, "Member 'UBP_EssenceIcon_C::Icon' has a wrong offset!");

}

