#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EntropicEssence_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EntropicEssence_VisualEntity.BP_EntropicEssence_VisualEntity_C
// 0x0018 (0x0368 - 0x0350)
class ABP_EntropicEssence_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void VisualEntityConstructionFinished();
	void OnKill();
	void ExecuteUbergraph_BP_EntropicEssence_VisualEntity(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EntropicEssence_VisualEntity_C">();
	}
	static class ABP_EntropicEssence_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EntropicEssence_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_EntropicEssence_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_EntropicEssence_VisualEntity_C");
static_assert(sizeof(ABP_EntropicEssence_VisualEntity_C) == 0x000368, "Wrong size on ABP_EntropicEssence_VisualEntity_C");
static_assert(offsetof(ABP_EntropicEssence_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_EntropicEssence_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EntropicEssence_VisualEntity_C, Ak) == 0x000358, "Member 'ABP_EntropicEssence_VisualEntity_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_EntropicEssence_VisualEntity_C, Niagara) == 0x000360, "Member 'ABP_EntropicEssence_VisualEntity_C::Niagara' has a wrong offset!");

}

