#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EntropyRiftPortal_FrontDoor

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_EntropyRiftPortal_FrontDoor.BP_EntropyRiftPortal_FrontDoor_C.InstantOpen
// 0x0020 (0x0020 - 0x0000)
struct BP_EntropyRiftPortal_FrontDoor_C_InstantOpen final
{
public:
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0000(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EntropyRiftPortal_FrontDoor_C_InstantOpen) == 0x000004, "Wrong alignment on BP_EntropyRiftPortal_FrontDoor_C_InstantOpen");
static_assert(sizeof(BP_EntropyRiftPortal_FrontDoor_C_InstantOpen) == 0x000020, "Wrong size on BP_EntropyRiftPortal_FrontDoor_C_InstantOpen");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_InstantOpen, Temp_delegate_Variable) == 0x000000, "Member 'BP_EntropyRiftPortal_FrontDoor_C_InstantOpen::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_InstantOpen, CallFunc_PostAkEvent_ReturnValue) == 0x000010, "Member 'BP_EntropyRiftPortal_FrontDoor_C_InstantOpen::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_InstantOpen, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_EntropyRiftPortal_FrontDoor_C_InstantOpen::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_InstantOpen, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000018, "Member 'BP_EntropyRiftPortal_FrontDoor_C_InstantOpen::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_InstantOpen, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00001C, "Member 'BP_EntropyRiftPortal_FrontDoor_C_InstantOpen::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");

// Function BP_EntropyRiftPortal_FrontDoor.BP_EntropyRiftPortal_FrontDoor_C.UserConstructionScript
// 0x0370 (0x0370 - 0x0000)
struct BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript final
{
public:
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue_1;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue_2;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue_3;                // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_4; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_1;    // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_2;    // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_3;    // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0098(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0120(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x01A8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_3;  // 0x0230(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_5; // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_4;  // 0x02CC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_6; // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript");
static_assert(sizeof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript) == 0x000370, "Wrong size on BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000000, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_RandomFloat_ReturnValue) == 0x000018, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000020, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_RandomFloat_ReturnValue_1) == 0x000028, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_RandomFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000030, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_RandomFloat_ReturnValue_2) == 0x000038, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_RandomFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_3) == 0x000040, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_RandomFloat_ReturnValue_3) == 0x000048, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_RandomFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_4) == 0x000050, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000058, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_Conv_ColorToLinearColor_ReturnValue_1) == 0x000068, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_Conv_ColorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_Conv_ColorToLinearColor_ReturnValue_2) == 0x000078, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_Conv_ColorToLinearColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_Conv_ColorToLinearColor_ReturnValue_3) == 0x000088, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_Conv_ColorToLinearColor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000098, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x000120, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult_2) == 0x0001A8, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult_3) == 0x000230, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_5) == 0x0002B8, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x0002C0, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x0002C4, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x0002C8, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult_4) == 0x0002CC, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult_4' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_BreakVector_X_1) == 0x000354, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_BreakVector_Y_1) == 0x000358, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_BreakVector_Z_1) == 0x00035C, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000360, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_6) == 0x000368, "Member 'BP_EntropyRiftPortal_FrontDoor_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_6' has a wrong offset!");

// Function BP_EntropyRiftPortal_FrontDoor.BP_EntropyRiftPortal_FrontDoor_C.ExecuteUbergraph_BP_EntropyRiftPortal_FrontDoor
// 0x00BC (0x00BC - 0x0000)
struct BP_EntropyRiftPortal_FrontDoor_C_ExecuteUbergraph_BP_EntropyRiftPortal_FrontDoor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x000C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x001C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x002C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x003C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_4;                          // 0x005C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_5;                          // 0x006C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_6;                          // 0x007C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_4;                // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_5;                // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_6;                // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EntropyRiftPortal_FrontDoor_C_ExecuteUbergraph_BP_EntropyRiftPortal_FrontDoor) == 0x000004, "Wrong alignment on BP_EntropyRiftPortal_FrontDoor_C_ExecuteUbergraph_BP_EntropyRiftPortal_FrontDoor");
static_assert(sizeof(BP_EntropyRiftPortal_FrontDoor_C_ExecuteUbergraph_BP_EntropyRiftPortal_FrontDoor) == 0x0000BC, "Wrong size on BP_EntropyRiftPortal_FrontDoor_C_ExecuteUbergraph_BP_EntropyRiftPortal_FrontDoor");
static_assert(offsetof(BP_EntropyRiftPortal_FrontDoor_C_ExecuteUbergraph_BP_EntropyRiftPortal_FrontDoor, EntryPoint) == 0x000000, "Member 'BP_EntropyRiftPortal_FrontDoor_C_ExecuteUbergraph_BP_EntropyRiftPortal_FrontDoor::EntryPoint' has a wrong offset!");
