#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EULAWindow

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_EULAWindow.BP_EULAWindow_C.OnSetText
// 0x0018 (0x0018 - 0x0000)
struct BP_EULAWindow_C_OnSetText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_EULAWindow_C_OnSetText) == 0x000008, "Wrong alignment on BP_EULAWindow_C_OnSetText");
static_assert(sizeof(BP_EULAWindow_C_OnSetText) == 0x000018, "Wrong size on BP_EULAWindow_C_OnSetText");
static_assert(offsetof(BP_EULAWindow_C_OnSetText, InText) == 0x000000, "Member 'BP_EULAWindow_C_OnSetText::InText' has a wrong offset!");

// Function BP_EULAWindow.BP_EULAWindow_C.OnShow
// 0x0004 (0x0004 - 0x0000)
struct BP_EULAWindow_C_OnShow final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EULAWindow_C_OnShow) == 0x000004, "Wrong alignment on BP_EULAWindow_C_OnShow");
static_assert(sizeof(BP_EULAWindow_C_OnShow) == 0x000004, "Wrong size on BP_EULAWindow_C_OnShow");
static_assert(offsetof(BP_EULAWindow_C_OnShow, AnimDuration) == 0x000000, "Member 'BP_EULAWindow_C_OnShow::AnimDuration' has a wrong offset!");

// Function BP_EULAWindow.BP_EULAWindow_C.ExecuteUbergraph_BP_EULAWindow
// 0x0038 (0x0038 - 0x0000)
struct BP_EULAWindow_C_ExecuteUbergraph_BP_EULAWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InText;                               // 0x0008(0x0018)(ConstParm)
	float                                         K2Node_Event_AnimDuration;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 SelectedIndex, bool bChangeByUser)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_EULAWindow_C_ExecuteUbergraph_BP_EULAWindow) == 0x000008, "Wrong alignment on BP_EULAWindow_C_ExecuteUbergraph_BP_EULAWindow");
static_assert(sizeof(BP_EULAWindow_C_ExecuteUbergraph_BP_EULAWindow) == 0x000038, "Wrong size on BP_EULAWindow_C_ExecuteUbergraph_BP_EULAWindow");
static_assert(offsetof(BP_EULAWindow_C_ExecuteUbergraph_BP_EULAWindow, EntryPoint) == 0x000000, "Member 'BP_EULAWindow_C_ExecuteUbergraph_BP_EULAWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EULAWindow_C_ExecuteUbergraph_BP_EULAWindow, K2Node_Event_InText) == 0x000008, "Member 'BP_EULAWindow_C_ExecuteUbergraph_BP_EULAWindow::K2Node_Event_InText' has a wrong offset!");
static_assert(offsetof(BP_EULAWindow_C_ExecuteUbergraph_BP_EULAWindow, K2Node_Event_AnimDuration) == 0x000020, "Member 'BP_EULAWindow_C_ExecuteUbergraph_BP_EULAWindow::K2Node_Event_AnimDuration' has a wrong offset!");
static_assert(offsetof(BP_EULAWindow_C_ExecuteUbergraph_BP_EULAWindow, CallFunc_Not_PreBool_ReturnValue) == 0x000024, "Member 'BP_EULAWindow_C_ExecuteUbergraph_BP_EULAWindow::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EULAWindow_C_ExecuteUbergraph_BP_EULAWindow, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'BP_EULAWindow_C_ExecuteUbergraph_BP_EULAWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

}

