#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EvadedText_Widget

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_EvadedText_Widget.BP_EvadedText_Widget_C.FadeIn
// 0x0008 (0x0008 - 0x0000)
struct BP_EvadedText_Widget_C_FadeIn final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EvadedText_Widget_C_FadeIn) == 0x000004, "Wrong alignment on BP_EvadedText_Widget_C_FadeIn");
static_assert(sizeof(BP_EvadedText_Widget_C_FadeIn) == 0x000008, "Wrong size on BP_EvadedText_Widget_C_FadeIn");
static_assert(offsetof(BP_EvadedText_Widget_C_FadeIn, Temp_int_Variable) == 0x000000, "Member 'BP_EvadedText_Widget_C_FadeIn::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_EvadedText_Widget_C_FadeIn, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_EvadedText_Widget_C_FadeIn::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_EvadedText_Widget.BP_EvadedText_Widget_C.FadeOut
// 0x000C (0x000C - 0x0000)
struct BP_EvadedText_Widget_C_FadeOut final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EvadedText_Widget_C_FadeOut) == 0x000004, "Wrong alignment on BP_EvadedText_Widget_C_FadeOut");
static_assert(sizeof(BP_EvadedText_Widget_C_FadeOut) == 0x00000C, "Wrong size on BP_EvadedText_Widget_C_FadeOut");
static_assert(offsetof(BP_EvadedText_Widget_C_FadeOut, Temp_int_Variable) == 0x000000, "Member 'BP_EvadedText_Widget_C_FadeOut::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_EvadedText_Widget_C_FadeOut, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'BP_EvadedText_Widget_C_FadeOut::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EvadedText_Widget_C_FadeOut, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'BP_EvadedText_Widget_C_FadeOut::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function BP_EvadedText_Widget.BP_EvadedText_Widget_C.SetAlpha
// 0x0004 (0x0004 - 0x0000)
struct BP_EvadedText_Widget_C_SetAlpha final
{
public:
	float                                         Alpha;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EvadedText_Widget_C_SetAlpha) == 0x000004, "Wrong alignment on BP_EvadedText_Widget_C_SetAlpha");
static_assert(sizeof(BP_EvadedText_Widget_C_SetAlpha) == 0x000004, "Wrong size on BP_EvadedText_Widget_C_SetAlpha");
static_assert(offsetof(BP_EvadedText_Widget_C_SetAlpha, Alpha) == 0x000000, "Member 'BP_EvadedText_Widget_C_SetAlpha::Alpha' has a wrong offset!");

}

