#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExplodingOrb

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ExplodingOrb.BP_ExplodingOrb_C.ExecuteUbergraph_BP_ExplodingOrb
// 0x0038 (0x0038 - 0x0000)
struct BP_ExplodingOrb_C_ExecuteUbergraph_BP_ExplodingOrb final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLastOrb_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue_1;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExplodingOrb_C_ExecuteUbergraph_BP_ExplodingOrb) == 0x000008, "Wrong alignment on BP_ExplodingOrb_C_ExecuteUbergraph_BP_ExplodingOrb");
static_assert(sizeof(BP_ExplodingOrb_C_ExecuteUbergraph_BP_ExplodingOrb) == 0x000038, "Wrong size on BP_ExplodingOrb_C_ExecuteUbergraph_BP_ExplodingOrb");
static_assert(offsetof(BP_ExplodingOrb_C_ExecuteUbergraph_BP_ExplodingOrb, EntryPoint) == 0x000000, "Member 'BP_ExplodingOrb_C_ExecuteUbergraph_BP_ExplodingOrb::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ExplodingOrb_C_ExecuteUbergraph_BP_ExplodingOrb, CallFunc_IsLastOrb_ReturnValue) == 0x000004, "Member 'BP_ExplodingOrb_C_ExecuteUbergraph_BP_ExplodingOrb::CallFunc_IsLastOrb_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExplodingOrb_C_ExecuteUbergraph_BP_ExplodingOrb, CallFunc_GetManGameMode_ReturnValue) == 0x000008, "Member 'BP_ExplodingOrb_C_ExecuteUbergraph_BP_ExplodingOrb::CallFunc_GetManGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExplodingOrb_C_ExecuteUbergraph_BP_ExplodingOrb, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_ExplodingOrb_C_ExecuteUbergraph_BP_ExplodingOrb::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExplodingOrb_C_ExecuteUbergraph_BP_ExplodingOrb, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000020, "Member 'BP_ExplodingOrb_C_ExecuteUbergraph_BP_ExplodingOrb::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExplodingOrb_C_ExecuteUbergraph_BP_ExplodingOrb, CallFunc_PostEventAtLocation_ReturnValue) == 0x000028, "Member 'BP_ExplodingOrb_C_ExecuteUbergraph_BP_ExplodingOrb::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExplodingOrb_C_ExecuteUbergraph_BP_ExplodingOrb, CallFunc_SpawnVisualEntity_ReturnValue_1) == 0x000030, "Member 'BP_ExplodingOrb_C_ExecuteUbergraph_BP_ExplodingOrb::CallFunc_SpawnVisualEntity_ReturnValue_1' has a wrong offset!");

}

