#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExplodingOrb

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ExplodingOrb.BP_ExplodingOrb_C
// 0x0020 (0x0BA8 - 0x0B88)
class ABP_ExplodingOrb_C final : public AExplodingOrbActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B88(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHitBox*                                HitBox;                                            // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0B98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          LastOrbVFXSpawned;                                 // 0x0BA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_ExplodingOrb(int32 EntryPoint);
	void TrySpawnLastOrbVFX();
	void ReceiveDestroyed();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ExplodingOrb_C">();
	}
	static class ABP_ExplodingOrb_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ExplodingOrb_C>();
	}
};
static_assert(alignof(ABP_ExplodingOrb_C) == 0x000008, "Wrong alignment on ABP_ExplodingOrb_C");
static_assert(sizeof(ABP_ExplodingOrb_C) == 0x000BA8, "Wrong size on ABP_ExplodingOrb_C");
static_assert(offsetof(ABP_ExplodingOrb_C, UberGraphFrame) == 0x000B88, "Member 'ABP_ExplodingOrb_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ExplodingOrb_C, HitBox) == 0x000B90, "Member 'ABP_ExplodingOrb_C::HitBox' has a wrong offset!");
static_assert(offsetof(ABP_ExplodingOrb_C, DefaultSceneRoot) == 0x000B98, "Member 'ABP_ExplodingOrb_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ExplodingOrb_C, LastOrbVFXSpawned) == 0x000BA0, "Member 'ABP_ExplodingOrb_C::LastOrbVFXSpawned' has a wrong offset!");

}

