#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EntropicEssenceFragment

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_EntropicEssenceFragment.BP_EntropicEssenceFragment_C.ExecuteUbergraph_BP_EntropicEssenceFragment
// 0x0030 (0x0030 - 0x0000)
struct BP_EntropicEssenceFragment_C_ExecuteUbergraph_BP_EntropicEssenceFragment final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrawlerHero_C*                      K2Node_DynamicCast_AsBP_Brawler_Hero;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EntropicEssenceFragment_C_ExecuteUbergraph_BP_EntropicEssenceFragment) == 0x000008, "Wrong alignment on BP_EntropicEssenceFragment_C_ExecuteUbergraph_BP_EntropicEssenceFragment");
static_assert(sizeof(BP_EntropicEssenceFragment_C_ExecuteUbergraph_BP_EntropicEssenceFragment) == 0x000030, "Wrong size on BP_EntropicEssenceFragment_C_ExecuteUbergraph_BP_EntropicEssenceFragment");
static_assert(offsetof(BP_EntropicEssenceFragment_C_ExecuteUbergraph_BP_EntropicEssenceFragment, EntryPoint) == 0x000000, "Member 'BP_EntropicEssenceFragment_C_ExecuteUbergraph_BP_EntropicEssenceFragment::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EntropicEssenceFragment_C_ExecuteUbergraph_BP_EntropicEssenceFragment, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'BP_EntropicEssenceFragment_C_ExecuteUbergraph_BP_EntropicEssenceFragment::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropicEssenceFragment_C_ExecuteUbergraph_BP_EntropicEssenceFragment, CallFunc_GetManGameMode_ReturnValue) == 0x000010, "Member 'BP_EntropicEssenceFragment_C_ExecuteUbergraph_BP_EntropicEssenceFragment::CallFunc_GetManGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropicEssenceFragment_C_ExecuteUbergraph_BP_EntropicEssenceFragment, K2Node_DynamicCast_AsBP_Brawler_Hero) == 0x000018, "Member 'BP_EntropicEssenceFragment_C_ExecuteUbergraph_BP_EntropicEssenceFragment::K2Node_DynamicCast_AsBP_Brawler_Hero' has a wrong offset!");
static_assert(offsetof(BP_EntropicEssenceFragment_C_ExecuteUbergraph_BP_EntropicEssenceFragment, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_EntropicEssenceFragment_C_ExecuteUbergraph_BP_EntropicEssenceFragment::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EntropicEssenceFragment_C_ExecuteUbergraph_BP_EntropicEssenceFragment, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000028, "Member 'BP_EntropicEssenceFragment_C_ExecuteUbergraph_BP_EntropicEssenceFragment::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");

}

