#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EssenceFragment_Normal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EssenceFragment_Normal.BP_EssenceFragment_Normal_C
// 0x0030 (0x0818 - 0x07E8)
class ABP_EssenceFragment_Normal_C final : public ALootFragmentActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BoundBox;                                          // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          VisualEntity;                                      // 0x0808(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrawlerHero_C*                      PCRef;                                             // 0x0810(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_EssenceFragment_Normal(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnDeactivated();
	void OnActivated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EssenceFragment_Normal_C">();
	}
	static class ABP_EssenceFragment_Normal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EssenceFragment_Normal_C>();
	}
};
static_assert(alignof(ABP_EssenceFragment_Normal_C) == 0x000008, "Wrong alignment on ABP_EssenceFragment_Normal_C");
static_assert(sizeof(ABP_EssenceFragment_Normal_C) == 0x000818, "Wrong size on ABP_EssenceFragment_Normal_C");
static_assert(offsetof(ABP_EssenceFragment_Normal_C, UberGraphFrame) == 0x0007E8, "Member 'ABP_EssenceFragment_Normal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EssenceFragment_Normal_C, Arrow) == 0x0007F0, "Member 'ABP_EssenceFragment_Normal_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_EssenceFragment_Normal_C, BoundBox) == 0x0007F8, "Member 'ABP_EssenceFragment_Normal_C::BoundBox' has a wrong offset!");
static_assert(offsetof(ABP_EssenceFragment_Normal_C, DefaultSceneRoot) == 0x000800, "Member 'ABP_EssenceFragment_Normal_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_EssenceFragment_Normal_C, VisualEntity) == 0x000808, "Member 'ABP_EssenceFragment_Normal_C::VisualEntity' has a wrong offset!");
static_assert(offsetof(ABP_EssenceFragment_Normal_C, PCRef) == 0x000810, "Member 'ABP_EssenceFragment_Normal_C::PCRef' has a wrong offset!");

}

