#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EntropicFissure

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_EntropicFissure.BP_EntropicFissure_C.OnGameplayEvent_Event_0
// 0x0020 (0x0020 - 0x0000)
struct BP_EntropicFissure_C_OnGameplayEvent_Event_0 final
{
public:
	class UAbilityController*                     OwnerAbilityController;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayEventID*                       GameplayEventID;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GameplayEventName;                                 // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActorSoul*                             paramActorSoul;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EntropicFissure_C_OnGameplayEvent_Event_0) == 0x000008, "Wrong alignment on BP_EntropicFissure_C_OnGameplayEvent_Event_0");
static_assert(sizeof(BP_EntropicFissure_C_OnGameplayEvent_Event_0) == 0x000020, "Wrong size on BP_EntropicFissure_C_OnGameplayEvent_Event_0");
static_assert(offsetof(BP_EntropicFissure_C_OnGameplayEvent_Event_0, OwnerAbilityController) == 0x000000, "Member 'BP_EntropicFissure_C_OnGameplayEvent_Event_0::OwnerAbilityController' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_OnGameplayEvent_Event_0, GameplayEventID) == 0x000008, "Member 'BP_EntropicFissure_C_OnGameplayEvent_Event_0::GameplayEventID' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_OnGameplayEvent_Event_0, GameplayEventName) == 0x000010, "Member 'BP_EntropicFissure_C_OnGameplayEvent_Event_0::GameplayEventName' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_OnGameplayEvent_Event_0, paramActorSoul) == 0x000018, "Member 'BP_EntropicFissure_C_OnGameplayEvent_Event_0::paramActorSoul' has a wrong offset!");

// Function BP_EntropicFissure.BP_EntropicFissure_C.OnKilled_Event_0
// 0x0010 (0x0010 - 0x0000)
struct BP_EntropicFissure_C_OnKilled_Event_0 final
{
public:
	class UObject*                                Killer;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     KillerAbilityController;                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EntropicFissure_C_OnKilled_Event_0) == 0x000008, "Wrong alignment on BP_EntropicFissure_C_OnKilled_Event_0");
static_assert(sizeof(BP_EntropicFissure_C_OnKilled_Event_0) == 0x000010, "Wrong size on BP_EntropicFissure_C_OnKilled_Event_0");
static_assert(offsetof(BP_EntropicFissure_C_OnKilled_Event_0, Killer) == 0x000000, "Member 'BP_EntropicFissure_C_OnKilled_Event_0::Killer' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_OnKilled_Event_0, KillerAbilityController) == 0x000008, "Member 'BP_EntropicFissure_C_OnKilled_Event_0::KillerAbilityController' has a wrong offset!");

// Function BP_EntropicFissure.BP_EntropicFissure_C.ExecuteUbergraph_BP_EntropicFissure
// 0x0100 (0x0100 - 0x0000)
struct BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAbilityController* OwnerAbilityController, class UGameplayEventID* GameplayEventID, class FName GameplayEventName, class AActorSoul* paramActorSoul)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Killer, class UAbilityController* KillerAbilityController)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UForceFeedbackComponent*                CallFunc_SpawnForceFeedbackAttached_ReturnValue;   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaledBoxExtent_ReturnValue;           // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EntropicFissure_Explode_VisualEntity_C* K2Node_DynamicCast_AsBP_Entropic_Fissure_Explode_Visual_Entity; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     K2Node_CustomEvent_OwnerAbilityController;         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayEventID*                       K2Node_CustomEvent_GameplayEventID;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_GameplayEventName;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActorSoul*                             K2Node_CustomEvent_paramActorSoul;                 // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Killer;                         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     K2Node_CustomEvent_KillerAbilityController;        // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaledBoxExtent_ReturnValue_1;         // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_1;        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue_1;             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue_1;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Warg_EntropicFissure_Precursor_VisualEntity_C* K2Node_DynamicCast_AsBP_Warg_Entropic_Fissure_Precursor_Visual_Entity; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure) == 0x000008, "Wrong alignment on BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure");
static_assert(sizeof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure) == 0x000100, "Wrong size on BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, EntryPoint) == 0x000000, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000018, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, CallFunc_SpawnForceFeedbackAttached_ReturnValue) == 0x000030, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::CallFunc_SpawnForceFeedbackAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, CallFunc_GetManGameMode_ReturnValue) == 0x000038, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::CallFunc_GetManGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000040, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, CallFunc_GetScaledBoxExtent_ReturnValue) == 0x000048, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::CallFunc_GetScaledBoxExtent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, K2Node_DynamicCast_AsBP_Entropic_Fissure_Explode_Visual_Entity) == 0x000058, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::K2Node_DynamicCast_AsBP_Entropic_Fissure_Explode_Visual_Entity' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000064, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, CallFunc_GetAbilityController_ReturnValue) == 0x000070, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, K2Node_CustomEvent_OwnerAbilityController) == 0x000078, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::K2Node_CustomEvent_OwnerAbilityController' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, K2Node_CustomEvent_GameplayEventID) == 0x000080, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::K2Node_CustomEvent_GameplayEventID' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, K2Node_CustomEvent_GameplayEventName) == 0x000088, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::K2Node_CustomEvent_GameplayEventName' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, K2Node_CustomEvent_paramActorSoul) == 0x000090, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::K2Node_CustomEvent_paramActorSoul' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, K2Node_SwitchName_CmpSuccess) == 0x000098, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, K2Node_CustomEvent_Killer) == 0x0000A0, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::K2Node_CustomEvent_Killer' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, K2Node_CustomEvent_KillerAbilityController) == 0x0000A8, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::K2Node_CustomEvent_KillerAbilityController' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, CallFunc_GetScaledBoxExtent_ReturnValue_1) == 0x0000B0, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::CallFunc_GetScaledBoxExtent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000BC, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000C8, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, CallFunc_PostEventAtLocation_ReturnValue) == 0x0000D4, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, CallFunc_PostEventAtLocation_ReturnValue_1) == 0x0000D8, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::CallFunc_PostEventAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, CallFunc_GetManGameMode_ReturnValue_1) == 0x0000E0, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::CallFunc_GetManGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, CallFunc_SpawnVisualEntity_ReturnValue_1) == 0x0000E8, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::CallFunc_SpawnVisualEntity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, K2Node_DynamicCast_AsBP_Warg_Entropic_Fissure_Precursor_Visual_Entity) == 0x0000F0, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::K2Node_DynamicCast_AsBP_Warg_Entropic_Fissure_Precursor_Visual_Entity' has a wrong offset!");
static_assert(offsetof(BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure, K2Node_DynamicCast_bSuccess_1) == 0x0000F8, "Member 'BP_EntropicFissure_C_ExecuteUbergraph_BP_EntropicFissure::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

