#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EntropicFissureGenerator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EntropicFissureGenerator.BP_EntropicFissureGenerator_C
// 0x0018 (0x07F0 - 0x07D8)
class ABP_EntropicFissureGenerator_C final : public AEntropicFissureActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   temp_visual;                                       // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BPPostBeginPlay();
	void ExecuteUbergraph_BP_EntropicFissureGenerator(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EntropicFissureGenerator_C">();
	}
	static class ABP_EntropicFissureGenerator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EntropicFissureGenerator_C>();
	}
};
static_assert(alignof(ABP_EntropicFissureGenerator_C) == 0x000008, "Wrong alignment on ABP_EntropicFissureGenerator_C");
static_assert(sizeof(ABP_EntropicFissureGenerator_C) == 0x0007F0, "Wrong size on ABP_EntropicFissureGenerator_C");
static_assert(offsetof(ABP_EntropicFissureGenerator_C, UberGraphFrame) == 0x0007D8, "Member 'ABP_EntropicFissureGenerator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EntropicFissureGenerator_C, temp_visual) == 0x0007E0, "Member 'ABP_EntropicFissureGenerator_C::temp_visual' has a wrong offset!");
static_assert(offsetof(ABP_EntropicFissureGenerator_C, DefaultSceneRoot) == 0x0007E8, "Member 'ABP_EntropicFissureGenerator_C::DefaultSceneRoot' has a wrong offset!");

}

