#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EntropyInsideMesh

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EntropyInsideMesh.BP_EntropyInsideMesh_C
// 0x0028 (0x00D8 - 0x00B0)
class UBP_EntropyInsideMesh_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AEnemyCharacter*                        OwnerAsEnemyCharacter;                             // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPoseableMeshComponent*                 Poseable;                                          // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Material;                                          // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AbsoluteRotation;                                  // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_EntropyInsideMesh(int32 EntryPoint);
	void OnKilled_Event_0(class UObject* Killer, class UAbilityController* KillerAbilityController);
	void ReceiveBeginPlay();
	void ToggleMesh(bool bNewVisibility);
	void GetMesh(class UPoseableMeshComponent** Mesh);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EntropyInsideMesh_C">();
	}
	static class UBP_EntropyInsideMesh_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_EntropyInsideMesh_C>();
	}
};
static_assert(alignof(UBP_EntropyInsideMesh_C) == 0x000008, "Wrong alignment on UBP_EntropyInsideMesh_C");
static_assert(sizeof(UBP_EntropyInsideMesh_C) == 0x0000D8, "Wrong size on UBP_EntropyInsideMesh_C");
static_assert(offsetof(UBP_EntropyInsideMesh_C, UberGraphFrame) == 0x0000B0, "Member 'UBP_EntropyInsideMesh_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_EntropyInsideMesh_C, OwnerAsEnemyCharacter) == 0x0000B8, "Member 'UBP_EntropyInsideMesh_C::OwnerAsEnemyCharacter' has a wrong offset!");
static_assert(offsetof(UBP_EntropyInsideMesh_C, Poseable) == 0x0000C0, "Member 'UBP_EntropyInsideMesh_C::Poseable' has a wrong offset!");
static_assert(offsetof(UBP_EntropyInsideMesh_C, Material) == 0x0000C8, "Member 'UBP_EntropyInsideMesh_C::Material' has a wrong offset!");
static_assert(offsetof(UBP_EntropyInsideMesh_C, AbsoluteRotation) == 0x0000D0, "Member 'UBP_EntropyInsideMesh_C::AbsoluteRotation' has a wrong offset!");

}

