#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EntropyDeathMS_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_MeshSampling_VisualEntity_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EntropyDeathMS_VisualEntity.BP_EntropyDeathMS_VisualEntity_C
// 0x0048 (0x03E8 - 0x03A0)
class ABP_EntropyDeathMS_VisualEntity_C final : public ABP_MeshSampling_VisualEntity_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_EntropyDeathMS_VisualEntity_C;   // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_EntropyDeath_Single;                            // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Dissolve_88ED7C6D460585022172C1805214A5F6; // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_88ED7C6D460585022172C1805214A5F6; // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B5[0x3];                                      // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         Bro;                                               // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     AC;                                                // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_WitchLantern_C*                     Lantern;                                           // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_EntropyDeathMS_VisualEntity(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void OnKilled_Event_0(class UObject* Killer, class UAbilityController* KillerAbilityController);
	void OnKill();
	void VisualEntityConstructionFinished();
	void Timeline_0__VFX__EventFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EntropyDeathMS_VisualEntity_C">();
	}
	static class ABP_EntropyDeathMS_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EntropyDeathMS_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_EntropyDeathMS_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_EntropyDeathMS_VisualEntity_C");
static_assert(sizeof(ABP_EntropyDeathMS_VisualEntity_C) == 0x0003E8, "Wrong size on ABP_EntropyDeathMS_VisualEntity_C");
static_assert(offsetof(ABP_EntropyDeathMS_VisualEntity_C, UberGraphFrame_BP_EntropyDeathMS_VisualEntity_C) == 0x0003A0, "Member 'ABP_EntropyDeathMS_VisualEntity_C::UberGraphFrame_BP_EntropyDeathMS_VisualEntity_C' has a wrong offset!");
static_assert(offsetof(ABP_EntropyDeathMS_VisualEntity_C, NS_EntropyDeath_Single) == 0x0003A8, "Member 'ABP_EntropyDeathMS_VisualEntity_C::NS_EntropyDeath_Single' has a wrong offset!");
static_assert(offsetof(ABP_EntropyDeathMS_VisualEntity_C, Timeline_0_Dissolve_88ED7C6D460585022172C1805214A5F6) == 0x0003B0, "Member 'ABP_EntropyDeathMS_VisualEntity_C::Timeline_0_Dissolve_88ED7C6D460585022172C1805214A5F6' has a wrong offset!");
static_assert(offsetof(ABP_EntropyDeathMS_VisualEntity_C, Timeline_0__Direction_88ED7C6D460585022172C1805214A5F6) == 0x0003B4, "Member 'ABP_EntropyDeathMS_VisualEntity_C::Timeline_0__Direction_88ED7C6D460585022172C1805214A5F6' has a wrong offset!");
static_assert(offsetof(ABP_EntropyDeathMS_VisualEntity_C, Timeline_0) == 0x0003B8, "Member 'ABP_EntropyDeathMS_VisualEntity_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_EntropyDeathMS_VisualEntity_C, Bro) == 0x0003C0, "Member 'ABP_EntropyDeathMS_VisualEntity_C::Bro' has a wrong offset!");
static_assert(offsetof(ABP_EntropyDeathMS_VisualEntity_C, AC) == 0x0003C8, "Member 'ABP_EntropyDeathMS_VisualEntity_C::AC' has a wrong offset!");
static_assert(offsetof(ABP_EntropyDeathMS_VisualEntity_C, Color) == 0x0003D0, "Member 'ABP_EntropyDeathMS_VisualEntity_C::Color' has a wrong offset!");
static_assert(offsetof(ABP_EntropyDeathMS_VisualEntity_C, Lantern) == 0x0003E0, "Member 'ABP_EntropyDeathMS_VisualEntity_C::Lantern' has a wrong offset!");

}

