#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EssenceFragment_Normal_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EssenceFragment_Normal_VisualEntity.BP_EssenceFragment_Normal_VisualEntity_C
// 0x0018 (0x0368 - 0x0350)
class ABP_EssenceFragment_Normal_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Boops;                                             // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_BrawlerHero_C*                      PCRef;                                             // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_EssenceFragment_Normal_VisualEntity(int32 EntryPoint);
	void OnKill();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EssenceFragment_Normal_VisualEntity_C">();
	}
	static class ABP_EssenceFragment_Normal_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EssenceFragment_Normal_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_EssenceFragment_Normal_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_EssenceFragment_Normal_VisualEntity_C");
static_assert(sizeof(ABP_EssenceFragment_Normal_VisualEntity_C) == 0x000368, "Wrong size on ABP_EssenceFragment_Normal_VisualEntity_C");
static_assert(offsetof(ABP_EssenceFragment_Normal_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_EssenceFragment_Normal_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EssenceFragment_Normal_VisualEntity_C, Boops) == 0x000358, "Member 'ABP_EssenceFragment_Normal_VisualEntity_C::Boops' has a wrong offset!");
static_assert(offsetof(ABP_EssenceFragment_Normal_VisualEntity_C, PCRef) == 0x000360, "Member 'ABP_EssenceFragment_Normal_VisualEntity_C::PCRef' has a wrong offset!");

}

