#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FriendlyWisp_Summon_OnTarget_VE

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_FriendlyWisp_Summon_OnTarget_VE.BP_FriendlyWisp_Summon_OnTarget_VE_C.ExecuteUbergraph_BP_FriendlyWisp_Summon_OnTarget_VE
// 0x0038 (0x0038 - 0x0000)
struct BP_FriendlyWisp_Summon_OnTarget_VE_C_ExecuteUbergraph_BP_FriendlyWisp_Summon_OnTarget_VE final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FriendlyWisp_Summon_OnTarget_VE_C_ExecuteUbergraph_BP_FriendlyWisp_Summon_OnTarget_VE) == 0x000008, "Wrong alignment on BP_FriendlyWisp_Summon_OnTarget_VE_C_ExecuteUbergraph_BP_FriendlyWisp_Summon_OnTarget_VE");
static_assert(sizeof(BP_FriendlyWisp_Summon_OnTarget_VE_C_ExecuteUbergraph_BP_FriendlyWisp_Summon_OnTarget_VE) == 0x000038, "Wrong size on BP_FriendlyWisp_Summon_OnTarget_VE_C_ExecuteUbergraph_BP_FriendlyWisp_Summon_OnTarget_VE");
static_assert(offsetof(BP_FriendlyWisp_Summon_OnTarget_VE_C_ExecuteUbergraph_BP_FriendlyWisp_Summon_OnTarget_VE, EntryPoint) == 0x000000, "Member 'BP_FriendlyWisp_Summon_OnTarget_VE_C_ExecuteUbergraph_BP_FriendlyWisp_Summon_OnTarget_VE::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FriendlyWisp_Summon_OnTarget_VE_C_ExecuteUbergraph_BP_FriendlyWisp_Summon_OnTarget_VE, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_FriendlyWisp_Summon_OnTarget_VE_C_ExecuteUbergraph_BP_FriendlyWisp_Summon_OnTarget_VE::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_FriendlyWisp_Summon_OnTarget_VE_C_ExecuteUbergraph_BP_FriendlyWisp_Summon_OnTarget_VE, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_FriendlyWisp_Summon_OnTarget_VE_C_ExecuteUbergraph_BP_FriendlyWisp_Summon_OnTarget_VE::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FriendlyWisp_Summon_OnTarget_VE_C_ExecuteUbergraph_BP_FriendlyWisp_Summon_OnTarget_VE, CallFunc_GetPlayerPawn_ReturnValue) == 0x000018, "Member 'BP_FriendlyWisp_Summon_OnTarget_VE_C_ExecuteUbergraph_BP_FriendlyWisp_Summon_OnTarget_VE::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FriendlyWisp_Summon_OnTarget_VE_C_ExecuteUbergraph_BP_FriendlyWisp_Summon_OnTarget_VE, K2Node_DynamicCast_AsCharacter_Base) == 0x000020, "Member 'BP_FriendlyWisp_Summon_OnTarget_VE_C_ExecuteUbergraph_BP_FriendlyWisp_Summon_OnTarget_VE::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_FriendlyWisp_Summon_OnTarget_VE_C_ExecuteUbergraph_BP_FriendlyWisp_Summon_OnTarget_VE, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_FriendlyWisp_Summon_OnTarget_VE_C_ExecuteUbergraph_BP_FriendlyWisp_Summon_OnTarget_VE::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FriendlyWisp_Summon_OnTarget_VE_C_ExecuteUbergraph_BP_FriendlyWisp_Summon_OnTarget_VE, CallFunc_GetSocketLocation_ReturnValue) == 0x00002C, "Member 'BP_FriendlyWisp_Summon_OnTarget_VE_C_ExecuteUbergraph_BP_FriendlyWisp_Summon_OnTarget_VE::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");

// Function BP_FriendlyWisp_Summon_OnTarget_VE.BP_FriendlyWisp_Summon_OnTarget_VE_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_FriendlyWisp_Summon_OnTarget_VE_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FriendlyWisp_Summon_OnTarget_VE_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_FriendlyWisp_Summon_OnTarget_VE_C_ReceiveTick");
static_assert(sizeof(BP_FriendlyWisp_Summon_OnTarget_VE_C_ReceiveTick) == 0x000004, "Wrong size on BP_FriendlyWisp_Summon_OnTarget_VE_C_ReceiveTick");
static_assert(offsetof(BP_FriendlyWisp_Summon_OnTarget_VE_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_FriendlyWisp_Summon_OnTarget_VE_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

