#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FlaskPotencyUpgraded

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_FlaskPotencyUpgraded.BP_FlaskPotencyUpgraded_C
// 0x0038 (0x0548 - 0x0510)
class UBP_FlaskPotencyUpgraded_C final : public UHUDPopupUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Bg;                                                // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DecorLeft;                                         // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DecorRight;                                        // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconImage;                                         // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FlaskPotencyUpgraded(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnSetData(const struct FHUDPopupQueue& InHUDPopupQueue);
	void OnShow(float AnimDuration);
	void OnHide(float AnimDuration);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void SetData(class UTexture2D* Icon);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FlaskPotencyUpgraded_C">();
	}
	static class UBP_FlaskPotencyUpgraded_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FlaskPotencyUpgraded_C>();
	}
};
static_assert(alignof(UBP_FlaskPotencyUpgraded_C) == 0x000008, "Wrong alignment on UBP_FlaskPotencyUpgraded_C");
static_assert(sizeof(UBP_FlaskPotencyUpgraded_C) == 0x000548, "Wrong size on UBP_FlaskPotencyUpgraded_C");
static_assert(offsetof(UBP_FlaskPotencyUpgraded_C, UberGraphFrame) == 0x000510, "Member 'UBP_FlaskPotencyUpgraded_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_FlaskPotencyUpgraded_C, FadeOutAnim) == 0x000518, "Member 'UBP_FlaskPotencyUpgraded_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_FlaskPotencyUpgraded_C, FadeInAnim) == 0x000520, "Member 'UBP_FlaskPotencyUpgraded_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_FlaskPotencyUpgraded_C, Bg) == 0x000528, "Member 'UBP_FlaskPotencyUpgraded_C::Bg' has a wrong offset!");
static_assert(offsetof(UBP_FlaskPotencyUpgraded_C, DecorLeft) == 0x000530, "Member 'UBP_FlaskPotencyUpgraded_C::DecorLeft' has a wrong offset!");
static_assert(offsetof(UBP_FlaskPotencyUpgraded_C, DecorRight) == 0x000538, "Member 'UBP_FlaskPotencyUpgraded_C::DecorRight' has a wrong offset!");
static_assert(offsetof(UBP_FlaskPotencyUpgraded_C, IconImage) == 0x000540, "Member 'UBP_FlaskPotencyUpgraded_C::IconImage' has a wrong offset!");

}

