#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FriendlyWisp_Familiar_Small

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_FriendlyWisp_Familiar_Small.BP_FriendlyWisp_Familiar_Small_C.ExecuteUbergraph_BP_FriendlyWisp_Familiar_Small
// 0x002C (0x002C - 0x0000)
struct BP_FriendlyWisp_Familiar_Small_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar_Small final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FriendlyWisp_Familiar_Small_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar_Small) == 0x000004, "Wrong alignment on BP_FriendlyWisp_Familiar_Small_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar_Small");
static_assert(sizeof(BP_FriendlyWisp_Familiar_Small_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar_Small) == 0x00002C, "Wrong size on BP_FriendlyWisp_Familiar_Small_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar_Small");
static_assert(offsetof(BP_FriendlyWisp_Familiar_Small_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar_Small, EntryPoint) == 0x000000, "Member 'BP_FriendlyWisp_Familiar_Small_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar_Small::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FriendlyWisp_Familiar_Small_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar_Small, Temp_delegate_Variable) == 0x000004, "Member 'BP_FriendlyWisp_Familiar_Small_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar_Small::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_FriendlyWisp_Familiar_Small_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar_Small, Temp_delegate_Variable_1) == 0x000014, "Member 'BP_FriendlyWisp_Familiar_Small_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar_Small::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FriendlyWisp_Familiar_Small_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar_Small, CallFunc_PostAkEvent_ReturnValue) == 0x000024, "Member 'BP_FriendlyWisp_Familiar_Small_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar_Small::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FriendlyWisp_Familiar_Small_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar_Small, CallFunc_PostAkEvent_ReturnValue_1) == 0x000028, "Member 'BP_FriendlyWisp_Familiar_Small_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar_Small::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");

}

