#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Food_Consume_VisualEntity

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_Food_Consume_VisualEntity.BP_Food_Consume_VisualEntity_C.ExecuteUbergraph_BP_Food_Consume_VisualEntity
// 0x0030 (0x0030 - 0x0000)
struct BP_Food_Consume_VisualEntity_C_ExecuteUbergraph_BP_Food_Consume_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Food_Consume_VisualEntity_C_ExecuteUbergraph_BP_Food_Consume_VisualEntity) == 0x000008, "Wrong alignment on BP_Food_Consume_VisualEntity_C_ExecuteUbergraph_BP_Food_Consume_VisualEntity");
static_assert(sizeof(BP_Food_Consume_VisualEntity_C_ExecuteUbergraph_BP_Food_Consume_VisualEntity) == 0x000030, "Wrong size on BP_Food_Consume_VisualEntity_C_ExecuteUbergraph_BP_Food_Consume_VisualEntity");
static_assert(offsetof(BP_Food_Consume_VisualEntity_C_ExecuteUbergraph_BP_Food_Consume_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_Food_Consume_VisualEntity_C_ExecuteUbergraph_BP_Food_Consume_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Food_Consume_VisualEntity_C_ExecuteUbergraph_BP_Food_Consume_VisualEntity, Temp_delegate_Variable) == 0x000004, "Member 'BP_Food_Consume_VisualEntity_C_ExecuteUbergraph_BP_Food_Consume_VisualEntity::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Food_Consume_VisualEntity_C_ExecuteUbergraph_BP_Food_Consume_VisualEntity, CallFunc_PostEvent_ReturnValue) == 0x000014, "Member 'BP_Food_Consume_VisualEntity_C_ExecuteUbergraph_BP_Food_Consume_VisualEntity::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Food_Consume_VisualEntity_C_ExecuteUbergraph_BP_Food_Consume_VisualEntity, CallFunc_GetAttachParentActor_ReturnValue) == 0x000018, "Member 'BP_Food_Consume_VisualEntity_C_ExecuteUbergraph_BP_Food_Consume_VisualEntity::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Food_Consume_VisualEntity_C_ExecuteUbergraph_BP_Food_Consume_VisualEntity, K2Node_DynamicCast_AsCharacter_Base) == 0x000020, "Member 'BP_Food_Consume_VisualEntity_C_ExecuteUbergraph_BP_Food_Consume_VisualEntity::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_Food_Consume_VisualEntity_C_ExecuteUbergraph_BP_Food_Consume_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Food_Consume_VisualEntity_C_ExecuteUbergraph_BP_Food_Consume_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

