#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FriendlyWisp_Familiar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FriendlyWisp_Familiar.BP_FriendlyWisp_Familiar_C
// 0x0020 (0x1CC0 - 0x1CA0)
class ABP_FriendlyWisp_Familiar_C final : public AFamiliarBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1CA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      WispComponent;                                     // 0x1CA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          LivingVE;                                          // 0x1CB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FriendlyWisp_Familiar(int32 EntryPoint);
	void ReceiveDestroyed();
	void EventOnTeleportEnd();
	void EventOnTeleportStart();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FriendlyWisp_Familiar_C">();
	}
	static class ABP_FriendlyWisp_Familiar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FriendlyWisp_Familiar_C>();
	}
};
static_assert(alignof(ABP_FriendlyWisp_Familiar_C) == 0x000010, "Wrong alignment on ABP_FriendlyWisp_Familiar_C");
static_assert(sizeof(ABP_FriendlyWisp_Familiar_C) == 0x001CC0, "Wrong size on ABP_FriendlyWisp_Familiar_C");
static_assert(offsetof(ABP_FriendlyWisp_Familiar_C, UberGraphFrame) == 0x001CA0, "Member 'ABP_FriendlyWisp_Familiar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FriendlyWisp_Familiar_C, WispComponent) == 0x001CA8, "Member 'ABP_FriendlyWisp_Familiar_C::WispComponent' has a wrong offset!");
static_assert(offsetof(ABP_FriendlyWisp_Familiar_C, LivingVE) == 0x001CB0, "Member 'ABP_FriendlyWisp_Familiar_C::LivingVE' has a wrong offset!");

}

