#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FireWall_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FireWall_VisualEntity.BP_FireWall_VisualEntity_C
// 0x0038 (0x0388 - 0x0350)
class ABP_FireWall_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Firewall_Upgrade_InitialDamage;                 // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Fade;                                              // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Loop;                                              // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Init;                                              // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FakeBounds;                                        // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FireWall_VisualEntity(int32 EntryPoint);
	void OnKill();
	void VisualEntityConstructionFinished();
	void GetDamageBounds(float LengthAdjust, class UClass* AbilityToCheck, struct FVector2D* DamageBounds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FireWall_VisualEntity_C">();
	}
	static class ABP_FireWall_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FireWall_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_FireWall_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_FireWall_VisualEntity_C");
static_assert(sizeof(ABP_FireWall_VisualEntity_C) == 0x000388, "Wrong size on ABP_FireWall_VisualEntity_C");
static_assert(offsetof(ABP_FireWall_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_FireWall_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FireWall_VisualEntity_C, Ak) == 0x000358, "Member 'ABP_FireWall_VisualEntity_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_FireWall_VisualEntity_C, NS_Firewall_Upgrade_InitialDamage) == 0x000360, "Member 'ABP_FireWall_VisualEntity_C::NS_Firewall_Upgrade_InitialDamage' has a wrong offset!");
static_assert(offsetof(ABP_FireWall_VisualEntity_C, Fade) == 0x000368, "Member 'ABP_FireWall_VisualEntity_C::Fade' has a wrong offset!");
static_assert(offsetof(ABP_FireWall_VisualEntity_C, Loop) == 0x000370, "Member 'ABP_FireWall_VisualEntity_C::Loop' has a wrong offset!");
static_assert(offsetof(ABP_FireWall_VisualEntity_C, Init) == 0x000378, "Member 'ABP_FireWall_VisualEntity_C::Init' has a wrong offset!");
static_assert(offsetof(ABP_FireWall_VisualEntity_C, FakeBounds) == 0x000380, "Member 'ABP_FireWall_VisualEntity_C::FakeBounds' has a wrong offset!");

}

