#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FriendlyWisp_Familiar

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_FriendlyWisp_Familiar.BP_FriendlyWisp_Familiar_C.ExecuteUbergraph_BP_FriendlyWisp_Familiar
// 0x0080 (0x0080 - 0x0000)
struct BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ChaosWisp_VisualEntity_C*           K2Node_DynamicCast_AsBP_Chaos_Wisp_Visual_Entity;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0024(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ChaosWisp_VisualEntity_C*           K2Node_DynamicCast_AsBP_Chaos_Wisp_Visual_Entity_1; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue_1;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue_1;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue_2;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue_2;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar) == 0x000008, "Wrong alignment on BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar");
static_assert(sizeof(BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar) == 0x000080, "Wrong size on BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar");
static_assert(offsetof(BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar, EntryPoint) == 0x000000, "Member 'BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar, K2Node_DynamicCast_AsBP_Chaos_Wisp_Visual_Entity) == 0x000008, "Member 'BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar::K2Node_DynamicCast_AsBP_Chaos_Wisp_Visual_Entity' has a wrong offset!");
static_assert(offsetof(BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar, Temp_delegate_Variable) == 0x000014, "Member 'BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar, Temp_delegate_Variable_1) == 0x000024, "Member 'BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar, CallFunc_PostAkEvent_ReturnValue) == 0x000034, "Member 'BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar, CallFunc_GetManGameMode_ReturnValue) == 0x000038, "Member 'BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar::CallFunc_GetManGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000040, "Member 'BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar, K2Node_DynamicCast_AsBP_Chaos_Wisp_Visual_Entity_1) == 0x000048, "Member 'BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar::K2Node_DynamicCast_AsBP_Chaos_Wisp_Visual_Entity_1' has a wrong offset!");
static_assert(offsetof(BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar, CallFunc_GetManGameMode_ReturnValue_1) == 0x000058, "Member 'BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar::CallFunc_GetManGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar, CallFunc_SpawnVisualEntity_ReturnValue_1) == 0x000060, "Member 'BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar::CallFunc_SpawnVisualEntity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar, CallFunc_GetManGameMode_ReturnValue_2) == 0x000068, "Member 'BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar::CallFunc_GetManGameMode_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar, CallFunc_SpawnVisualEntity_ReturnValue_2) == 0x000070, "Member 'BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar::CallFunc_SpawnVisualEntity_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar, CallFunc_PostAkEvent_ReturnValue_1) == 0x000078, "Member 'BP_FriendlyWisp_Familiar_C_ExecuteUbergraph_BP_FriendlyWisp_Familiar::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");

}

