#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FriendlyWisp_Familiar_Small

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FriendlyWisp_Familiar_Small.BP_FriendlyWisp_Familiar_Small_C
// 0x0020 (0x1CC0 - 0x1CA0)
class ABP_FriendlyWisp_Familiar_Small_C final : public AFamiliarBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1CA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x1CA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_SummonImp_Spawn;                                // 0x1CB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FriendlyWisp_Familiar_Small(int32 EntryPoint);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FriendlyWisp_Familiar_Small_C">();
	}
	static class ABP_FriendlyWisp_Familiar_Small_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FriendlyWisp_Familiar_Small_C>();
	}
};
static_assert(alignof(ABP_FriendlyWisp_Familiar_Small_C) == 0x000010, "Wrong alignment on ABP_FriendlyWisp_Familiar_Small_C");
static_assert(sizeof(ABP_FriendlyWisp_Familiar_Small_C) == 0x001CC0, "Wrong size on ABP_FriendlyWisp_Familiar_Small_C");
static_assert(offsetof(ABP_FriendlyWisp_Familiar_Small_C, UberGraphFrame) == 0x001CA0, "Member 'ABP_FriendlyWisp_Familiar_Small_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FriendlyWisp_Familiar_Small_C, Niagara) == 0x001CA8, "Member 'ABP_FriendlyWisp_Familiar_Small_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_FriendlyWisp_Familiar_Small_C, NS_SummonImp_Spawn) == 0x001CB0, "Member 'ABP_FriendlyWisp_Familiar_Small_C::NS_SummonImp_Spawn' has a wrong offset!");

}

