#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_fog_fx

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_fog_fx.BP_fog_fx_C.ExecuteUbergraph_BP_fog_fx
// 0x0028 (0x0028 - 0x0000)
struct BP_fog_fx_C_ExecuteUbergraph_BP_fog_fx final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFogParameters_FogDensity;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_GetFogParameters_FogColor;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFogParameters_FogGlow;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_Select_Default_1;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_fog_fx_C_ExecuteUbergraph_BP_fog_fx) == 0x000008, "Wrong alignment on BP_fog_fx_C_ExecuteUbergraph_BP_fog_fx");
static_assert(sizeof(BP_fog_fx_C_ExecuteUbergraph_BP_fog_fx) == 0x000028, "Wrong size on BP_fog_fx_C_ExecuteUbergraph_BP_fog_fx");
static_assert(offsetof(BP_fog_fx_C_ExecuteUbergraph_BP_fog_fx, EntryPoint) == 0x000000, "Member 'BP_fog_fx_C_ExecuteUbergraph_BP_fog_fx::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_ExecuteUbergraph_BP_fog_fx, Temp_bool_Variable) == 0x000004, "Member 'BP_fog_fx_C_ExecuteUbergraph_BP_fog_fx::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_ExecuteUbergraph_BP_fog_fx, Temp_bool_Variable_1) == 0x000005, "Member 'BP_fog_fx_C_ExecuteUbergraph_BP_fog_fx::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_ExecuteUbergraph_BP_fog_fx, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'BP_fog_fx_C_ExecuteUbergraph_BP_fog_fx::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_ExecuteUbergraph_BP_fog_fx, CallFunc_GetFogParameters_FogDensity) == 0x00000C, "Member 'BP_fog_fx_C_ExecuteUbergraph_BP_fog_fx::CallFunc_GetFogParameters_FogDensity' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_ExecuteUbergraph_BP_fog_fx, CallFunc_GetFogParameters_FogColor) == 0x000010, "Member 'BP_fog_fx_C_ExecuteUbergraph_BP_fog_fx::CallFunc_GetFogParameters_FogColor' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_ExecuteUbergraph_BP_fog_fx, CallFunc_GetFogParameters_FogGlow) == 0x000014, "Member 'BP_fog_fx_C_ExecuteUbergraph_BP_fog_fx::CallFunc_GetFogParameters_FogGlow' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_ExecuteUbergraph_BP_fog_fx, K2Node_Select_Default) == 0x000018, "Member 'BP_fog_fx_C_ExecuteUbergraph_BP_fog_fx::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_ExecuteUbergraph_BP_fog_fx, K2Node_Select_Default_1) == 0x000020, "Member 'BP_fog_fx_C_ExecuteUbergraph_BP_fog_fx::K2Node_Select_Default_1' has a wrong offset!");

// Function BP_fog_fx.BP_fog_fx_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_fog_fx_C_UserConstructionScript final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_fog_fx_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_fog_fx_C_UserConstructionScript");
static_assert(sizeof(BP_fog_fx_C_UserConstructionScript) == 0x000018, "Wrong size on BP_fog_fx_C_UserConstructionScript");
static_assert(offsetof(BP_fog_fx_C_UserConstructionScript, Temp_bool_Variable) == 0x000000, "Member 'BP_fog_fx_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_UserConstructionScript, K2Node_Select_Default) == 0x000008, "Member 'BP_fog_fx_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000010, "Member 'BP_fog_fx_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function BP_fog_fx.BP_fog_fx_C.SetUpMaterialBlend
// 0x0030 (0x0030 - 0x0000)
struct BP_fog_fx_C_SetUpMaterialBlend final
{
public:
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue;    // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_fog_fx_C_SetUpMaterialBlend) == 0x000008, "Wrong alignment on BP_fog_fx_C_SetUpMaterialBlend");
static_assert(sizeof(BP_fog_fx_C_SetUpMaterialBlend) == 0x000030, "Wrong size on BP_fog_fx_C_SetUpMaterialBlend");
static_assert(offsetof(BP_fog_fx_C_SetUpMaterialBlend, CallFunc_Add_FloatFloat_ReturnValue) == 0x000000, "Member 'BP_fog_fx_C_SetUpMaterialBlend::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_SetUpMaterialBlend, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000004, "Member 'BP_fog_fx_C_SetUpMaterialBlend::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_SetUpMaterialBlend, CallFunc_Multiply_LinearColorFloat_ReturnValue) == 0x000014, "Member 'BP_fog_fx_C_SetUpMaterialBlend::CallFunc_Multiply_LinearColorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_SetUpMaterialBlend, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000028, "Member 'BP_fog_fx_C_SetUpMaterialBlend::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_fog_fx.BP_fog_fx_C.SetUpMaterialAdditive
// 0x0030 (0x0030 - 0x0000)
struct BP_fog_fx_C_SetUpMaterialAdditive final
{
public:
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue;    // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_fog_fx_C_SetUpMaterialAdditive) == 0x000008, "Wrong alignment on BP_fog_fx_C_SetUpMaterialAdditive");
static_assert(sizeof(BP_fog_fx_C_SetUpMaterialAdditive) == 0x000030, "Wrong size on BP_fog_fx_C_SetUpMaterialAdditive");
static_assert(offsetof(BP_fog_fx_C_SetUpMaterialAdditive, CallFunc_Add_FloatFloat_ReturnValue) == 0x000000, "Member 'BP_fog_fx_C_SetUpMaterialAdditive::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_SetUpMaterialAdditive, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000004, "Member 'BP_fog_fx_C_SetUpMaterialAdditive::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_SetUpMaterialAdditive, CallFunc_Multiply_LinearColorFloat_ReturnValue) == 0x000014, "Member 'BP_fog_fx_C_SetUpMaterialAdditive::CallFunc_Multiply_LinearColorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_SetUpMaterialAdditive, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000028, "Member 'BP_fog_fx_C_SetUpMaterialAdditive::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_fog_fx.BP_fog_fx_C.UpdateFogParameters
// 0x0030 (0x0030 - 0x0000)
struct BP_fog_fx_C_UpdateFogParameters final
{
public:
	float                                         FogDensity_0;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 FogColor_0;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FogGlow_0;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue;    // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_fog_fx_C_UpdateFogParameters) == 0x000004, "Wrong alignment on BP_fog_fx_C_UpdateFogParameters");
static_assert(sizeof(BP_fog_fx_C_UpdateFogParameters) == 0x000030, "Wrong size on BP_fog_fx_C_UpdateFogParameters");
static_assert(offsetof(BP_fog_fx_C_UpdateFogParameters, FogDensity_0) == 0x000000, "Member 'BP_fog_fx_C_UpdateFogParameters::FogDensity_0' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_UpdateFogParameters, FogColor_0) == 0x000004, "Member 'BP_fog_fx_C_UpdateFogParameters::FogColor_0' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_UpdateFogParameters, FogGlow_0) == 0x000008, "Member 'BP_fog_fx_C_UpdateFogParameters::FogGlow_0' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_UpdateFogParameters, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x00000C, "Member 'BP_fog_fx_C_UpdateFogParameters::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_UpdateFogParameters, CallFunc_Add_FloatFloat_ReturnValue) == 0x00001C, "Member 'BP_fog_fx_C_UpdateFogParameters::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_UpdateFogParameters, CallFunc_Multiply_LinearColorFloat_ReturnValue) == 0x000020, "Member 'BP_fog_fx_C_UpdateFogParameters::CallFunc_Multiply_LinearColorFloat_ReturnValue' has a wrong offset!");

// Function BP_fog_fx.BP_fog_fx_C.GetFogParameters
// 0x000C (0x000C - 0x0000)
struct BP_fog_fx_C_GetFogParameters final
{
public:
	float                                         FogDensity_0;                                      // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 FogColor_0;                                        // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FogGlow_0;                                         // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_fog_fx_C_GetFogParameters) == 0x000004, "Wrong alignment on BP_fog_fx_C_GetFogParameters");
static_assert(sizeof(BP_fog_fx_C_GetFogParameters) == 0x00000C, "Wrong size on BP_fog_fx_C_GetFogParameters");
static_assert(offsetof(BP_fog_fx_C_GetFogParameters, FogDensity_0) == 0x000000, "Member 'BP_fog_fx_C_GetFogParameters::FogDensity_0' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_GetFogParameters, FogColor_0) == 0x000004, "Member 'BP_fog_fx_C_GetFogParameters::FogColor_0' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_GetFogParameters, FogGlow_0) == 0x000008, "Member 'BP_fog_fx_C_GetFogParameters::FogGlow_0' has a wrong offset!");

// Function BP_fog_fx.BP_fog_fx_C.ToggleFog
// 0x001C (0x001C - 0x0000)
struct BP_fog_fx_C_ToggleFog final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFogParameters_FogDensity;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_GetFogParameters_FogColor;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFogParameters_FogGlow;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFogParameters_FogDensity_1;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_GetFogParameters_FogColor_1;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFogParameters_FogGlow_1;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_fog_fx_C_ToggleFog) == 0x000004, "Wrong alignment on BP_fog_fx_C_ToggleFog");
static_assert(sizeof(BP_fog_fx_C_ToggleFog) == 0x00001C, "Wrong size on BP_fog_fx_C_ToggleFog");
static_assert(offsetof(BP_fog_fx_C_ToggleFog, On) == 0x000000, "Member 'BP_fog_fx_C_ToggleFog::On' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_ToggleFog, CallFunc_GetFogParameters_FogDensity) == 0x000004, "Member 'BP_fog_fx_C_ToggleFog::CallFunc_GetFogParameters_FogDensity' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_ToggleFog, CallFunc_GetFogParameters_FogColor) == 0x000008, "Member 'BP_fog_fx_C_ToggleFog::CallFunc_GetFogParameters_FogColor' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_ToggleFog, CallFunc_GetFogParameters_FogGlow) == 0x00000C, "Member 'BP_fog_fx_C_ToggleFog::CallFunc_GetFogParameters_FogGlow' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_ToggleFog, CallFunc_GetFogParameters_FogDensity_1) == 0x000010, "Member 'BP_fog_fx_C_ToggleFog::CallFunc_GetFogParameters_FogDensity_1' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_ToggleFog, CallFunc_GetFogParameters_FogColor_1) == 0x000014, "Member 'BP_fog_fx_C_ToggleFog::CallFunc_GetFogParameters_FogColor_1' has a wrong offset!");
static_assert(offsetof(BP_fog_fx_C_ToggleFog, CallFunc_GetFogParameters_FogGlow_1) == 0x000018, "Member 'BP_fog_fx_C_ToggleFog::CallFunc_GetFogParameters_FogGlow_1' has a wrong offset!");

}

