#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FireShield_ArrowDestroy_Temp_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FireShield_ArrowDestroy_Temp_VisualEntity.BP_FireShield_ArrowDestroy_Temp_VisualEntity_C
// 0x0038 (0x0388 - 0x0350)
class ABP_FireShield_ArrowDestroy_Temp_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           AkComponent;                                       // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_RibbonTEST;                                     // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_FireShield_ProjectileDestroy;                   // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   FireShieldTemp;                                    // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere;                                            // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Facing;                                            // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ProjectileSize;                                    // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FireShield_ArrowDestroy_Temp_VisualEntity(int32 EntryPoint);
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FireShield_ArrowDestroy_Temp_VisualEntity_C">();
	}
	static class ABP_FireShield_ArrowDestroy_Temp_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FireShield_ArrowDestroy_Temp_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_FireShield_ArrowDestroy_Temp_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_FireShield_ArrowDestroy_Temp_VisualEntity_C");
static_assert(sizeof(ABP_FireShield_ArrowDestroy_Temp_VisualEntity_C) == 0x000388, "Wrong size on ABP_FireShield_ArrowDestroy_Temp_VisualEntity_C");
static_assert(offsetof(ABP_FireShield_ArrowDestroy_Temp_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_FireShield_ArrowDestroy_Temp_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FireShield_ArrowDestroy_Temp_VisualEntity_C, AkComponent) == 0x000358, "Member 'ABP_FireShield_ArrowDestroy_Temp_VisualEntity_C::AkComponent' has a wrong offset!");
static_assert(offsetof(ABP_FireShield_ArrowDestroy_Temp_VisualEntity_C, NS_RibbonTEST) == 0x000360, "Member 'ABP_FireShield_ArrowDestroy_Temp_VisualEntity_C::NS_RibbonTEST' has a wrong offset!");
static_assert(offsetof(ABP_FireShield_ArrowDestroy_Temp_VisualEntity_C, NS_FireShield_ProjectileDestroy) == 0x000368, "Member 'ABP_FireShield_ArrowDestroy_Temp_VisualEntity_C::NS_FireShield_ProjectileDestroy' has a wrong offset!");
static_assert(offsetof(ABP_FireShield_ArrowDestroy_Temp_VisualEntity_C, FireShieldTemp) == 0x000370, "Member 'ABP_FireShield_ArrowDestroy_Temp_VisualEntity_C::FireShieldTemp' has a wrong offset!");
static_assert(offsetof(ABP_FireShield_ArrowDestroy_Temp_VisualEntity_C, Sphere) == 0x000378, "Member 'ABP_FireShield_ArrowDestroy_Temp_VisualEntity_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_FireShield_ArrowDestroy_Temp_VisualEntity_C, Facing) == 0x000380, "Member 'ABP_FireShield_ArrowDestroy_Temp_VisualEntity_C::Facing' has a wrong offset!");
static_assert(offsetof(ABP_FireShield_ArrowDestroy_Temp_VisualEntity_C, ProjectileSize) == 0x000384, "Member 'ABP_FireShield_ArrowDestroy_Temp_VisualEntity_C::ProjectileSize' has a wrong offset!");

}

