#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FastTravelTransition_Widget

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_FastTravelTransition_Widget.BP_FastTravelTransition_Widget_C.ExecuteUbergraph_BP_FastTravelTransition_Widget
// 0x0010 (0x0010 - 0x0000)
struct BP_FastTravelTransition_Widget_C_ExecuteUbergraph_BP_FastTravelTransition_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Event_Material;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FastTravelTransition_Widget_C_ExecuteUbergraph_BP_FastTravelTransition_Widget) == 0x000008, "Wrong alignment on BP_FastTravelTransition_Widget_C_ExecuteUbergraph_BP_FastTravelTransition_Widget");
static_assert(sizeof(BP_FastTravelTransition_Widget_C_ExecuteUbergraph_BP_FastTravelTransition_Widget) == 0x000010, "Wrong size on BP_FastTravelTransition_Widget_C_ExecuteUbergraph_BP_FastTravelTransition_Widget");
static_assert(offsetof(BP_FastTravelTransition_Widget_C_ExecuteUbergraph_BP_FastTravelTransition_Widget, EntryPoint) == 0x000000, "Member 'BP_FastTravelTransition_Widget_C_ExecuteUbergraph_BP_FastTravelTransition_Widget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FastTravelTransition_Widget_C_ExecuteUbergraph_BP_FastTravelTransition_Widget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BP_FastTravelTransition_Widget_C_ExecuteUbergraph_BP_FastTravelTransition_Widget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_FastTravelTransition_Widget_C_ExecuteUbergraph_BP_FastTravelTransition_Widget, K2Node_Event_Material) == 0x000008, "Member 'BP_FastTravelTransition_Widget_C_ExecuteUbergraph_BP_FastTravelTransition_Widget::K2Node_Event_Material' has a wrong offset!");

// Function BP_FastTravelTransition_Widget.BP_FastTravelTransition_Widget_C.OnShowWidget
// 0x0008 (0x0008 - 0x0000)
struct BP_FastTravelTransition_Widget_C_OnShowWidget final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FastTravelTransition_Widget_C_OnShowWidget) == 0x000008, "Wrong alignment on BP_FastTravelTransition_Widget_C_OnShowWidget");
static_assert(sizeof(BP_FastTravelTransition_Widget_C_OnShowWidget) == 0x000008, "Wrong size on BP_FastTravelTransition_Widget_C_OnShowWidget");
static_assert(offsetof(BP_FastTravelTransition_Widget_C_OnShowWidget, Material) == 0x000000, "Member 'BP_FastTravelTransition_Widget_C_OnShowWidget::Material' has a wrong offset!");

// Function BP_FastTravelTransition_Widget.BP_FastTravelTransition_Widget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_FastTravelTransition_Widget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FastTravelTransition_Widget_C_PreConstruct) == 0x000001, "Wrong alignment on BP_FastTravelTransition_Widget_C_PreConstruct");
static_assert(sizeof(BP_FastTravelTransition_Widget_C_PreConstruct) == 0x000001, "Wrong size on BP_FastTravelTransition_Widget_C_PreConstruct");
static_assert(offsetof(BP_FastTravelTransition_Widget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_FastTravelTransition_Widget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

