#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FloatingGreenEye_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "man_classes.hpp"
#include "KawaiiPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_FloatingGreenEye_Anim.BP_FloatingGreenEye_Anim_C
// 0x1A60 (0x2100 - 0x06A0)
class UBP_FloatingGreenEye_Anim_C final : public UAnimInstanceBase
{
public:
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0030)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x06D8(0x00A8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0780(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x07C8(0x0080)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x0848(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0910(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0A68(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0A90(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0AB8(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0B38(0x00A8)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x0BE0(0x0250)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0E30(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0E50(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x0E70(0x0250)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x10C0(0x0250)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x1310(0x0250)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1560(0x0080)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x15E0(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x16A8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1728(0x0080)()
	uint8                                         Pad_17A8[0x8];                                     // 0x17A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x17B0(0x0250)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x1A00(0x0250)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x1C50(0x0250)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x1EA0(0x0250)()
	bool                                          Blinking;                                          // 0x20F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20F1[0x3];                                     // 0x20F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlinkTimeBack;                                     // 0x20F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FloatingGreenEye_Anim(int32 EntryPoint);
	void AnimNotify_BlinkEnd();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_FloatingGreenEye_Anim_AnimGraphNode_KawaiiPhysics_5D97620244B3DD738ECFA99EE76808DF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_FloatingGreenEye_Anim_AnimGraphNode_KawaiiPhysics_8E99E2FB4602EF7F17BEABB665BB8195();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_FloatingGreenEye_Anim_AnimGraphNode_KawaiiPhysics_6B4296DB4D9D89BD8CA0308863BA252B();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_FloatingGreenEye_Anim_AnimGraphNode_KawaiiPhysics_5912BB93453F45FC066D9390C44258B5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_FloatingGreenEye_Anim_AnimGraphNode_KawaiiPhysics_1F080A294EE48EC0D8979FB1CBF58932();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_FloatingGreenEye_Anim_AnimGraphNode_KawaiiPhysics_4AE0AB514F0C32CBE09BB09B54490D36();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_FloatingGreenEye_Anim_AnimGraphNode_KawaiiPhysics_F66B62E74F22568D018F4EA86602A2AD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_FloatingGreenEye_Anim_AnimGraphNode_KawaiiPhysics_D006FA8D43218A214B9D48B45572DFE8();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FloatingGreenEye_Anim_C">();
	}
	static class UBP_FloatingGreenEye_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FloatingGreenEye_Anim_C>();
	}
};
static_assert(alignof(UBP_FloatingGreenEye_Anim_C) == 0x000010, "Wrong alignment on UBP_FloatingGreenEye_Anim_C");
static_assert(sizeof(UBP_FloatingGreenEye_Anim_C) == 0x002100, "Wrong size on UBP_FloatingGreenEye_Anim_C");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, UberGraphFrame) == 0x0006A0, "Member 'UBP_FloatingGreenEye_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UBP_FloatingGreenEye_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, AnimGraphNode_BlendListByInt) == 0x0006D8, "Member 'UBP_FloatingGreenEye_Anim_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, AnimGraphNode_Slot) == 0x000780, "Member 'UBP_FloatingGreenEye_Anim_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, AnimGraphNode_SequencePlayer_4) == 0x0007C8, "Member 'UBP_FloatingGreenEye_Anim_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, AnimGraphNode_ApplyAdditive_1) == 0x000848, "Member 'UBP_FloatingGreenEye_Anim_C::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, AnimGraphNode_SaveCachedPose) == 0x000910, "Member 'UBP_FloatingGreenEye_Anim_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, AnimGraphNode_UseCachedPose_1) == 0x000A68, "Member 'UBP_FloatingGreenEye_Anim_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, AnimGraphNode_UseCachedPose) == 0x000A90, "Member 'UBP_FloatingGreenEye_Anim_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, AnimGraphNode_SequencePlayer_3) == 0x000AB8, "Member 'UBP_FloatingGreenEye_Anim_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, AnimGraphNode_BlendListByBool) == 0x000B38, "Member 'UBP_FloatingGreenEye_Anim_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, AnimGraphNode_KawaiiPhysics_7) == 0x000BE0, "Member 'UBP_FloatingGreenEye_Anim_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, AnimGraphNode_LocalToComponentSpace) == 0x000E30, "Member 'UBP_FloatingGreenEye_Anim_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, AnimGraphNode_ComponentToLocalSpace) == 0x000E50, "Member 'UBP_FloatingGreenEye_Anim_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, AnimGraphNode_KawaiiPhysics_6) == 0x000E70, "Member 'UBP_FloatingGreenEye_Anim_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, AnimGraphNode_KawaiiPhysics_5) == 0x0010C0, "Member 'UBP_FloatingGreenEye_Anim_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, AnimGraphNode_KawaiiPhysics_4) == 0x001310, "Member 'UBP_FloatingGreenEye_Anim_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, AnimGraphNode_SequencePlayer_2) == 0x001560, "Member 'UBP_FloatingGreenEye_Anim_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, AnimGraphNode_ApplyAdditive) == 0x0015E0, "Member 'UBP_FloatingGreenEye_Anim_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, AnimGraphNode_SequencePlayer_1) == 0x0016A8, "Member 'UBP_FloatingGreenEye_Anim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, AnimGraphNode_SequencePlayer) == 0x001728, "Member 'UBP_FloatingGreenEye_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, AnimGraphNode_KawaiiPhysics_3) == 0x0017B0, "Member 'UBP_FloatingGreenEye_Anim_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, AnimGraphNode_KawaiiPhysics_2) == 0x001A00, "Member 'UBP_FloatingGreenEye_Anim_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, AnimGraphNode_KawaiiPhysics_1) == 0x001C50, "Member 'UBP_FloatingGreenEye_Anim_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, AnimGraphNode_KawaiiPhysics) == 0x001EA0, "Member 'UBP_FloatingGreenEye_Anim_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, Blinking) == 0x0020F0, "Member 'UBP_FloatingGreenEye_Anim_C::Blinking' has a wrong offset!");
static_assert(offsetof(UBP_FloatingGreenEye_Anim_C, BlinkTimeBack) == 0x0020F4, "Member 'UBP_FloatingGreenEye_Anim_C::BlinkTimeBack' has a wrong offset!");

}

