#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FloatingEye_Die_VisualEntity

#include "Basic.hpp"

#include "Niagara_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_FloatingEye_Die_VisualEntity.BP_FloatingEye_Die_VisualEntity_C.ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity
// 0x00C0 (0x00C0 - 0x0000)
struct BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionUnitVector_ReturnValue;       // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBasicParticleData>             K2Node_Event_Data;                                 // 0x0070(0x0010)(ConstParm, ReferenceParm)
	class UNiagaraSystem*                         K2Node_Event_NiagaraSystem;                        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBasicParticleData                     CallFunc_Array_Get_Item;                           // 0x008C(0x001C)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDecalComponent*                        CallFunc_SpawnWorldDecals_ReturnValue;             // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_SpawnWorldDecals_DynamicMaterial;         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity) == 0x000008, "Wrong alignment on BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity");
static_assert(sizeof(BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity) == 0x0000C0, "Wrong size on BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity");
static_assert(offsetof(BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000024, "Member 'BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity, CallFunc_BreakVector_X) == 0x000030, "Member 'BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity, CallFunc_BreakVector_Y) == 0x000034, "Member 'BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity, CallFunc_BreakVector_Z) == 0x000038, "Member 'BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity, CallFunc_BreakVector_X_1) == 0x00003C, "Member 'BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity, CallFunc_BreakVector_Y_1) == 0x000040, "Member 'BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity, CallFunc_BreakVector_Z_1) == 0x000044, "Member 'BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity, CallFunc_MakeVector_ReturnValue) == 0x000048, "Member 'BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity, CallFunc_MakeVector_ReturnValue_1) == 0x000054, "Member 'BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity, CallFunc_GetDirectionUnitVector_ReturnValue) == 0x000060, "Member 'BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity::CallFunc_GetDirectionUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity, K2Node_Event_Data) == 0x000070, "Member 'BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity::K2Node_Event_Data' has a wrong offset!");
static_assert(offsetof(BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity, K2Node_Event_NiagaraSystem) == 0x000080, "Member 'BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity::K2Node_Event_NiagaraSystem' has a wrong offset!");
static_assert(offsetof(BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity, CallFunc_Array_Get_Item) == 0x00008C, "Member 'BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity, CallFunc_Less_IntInt_ReturnValue) == 0x0000A8, "Member 'BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity, CallFunc_SpawnWorldDecals_ReturnValue) == 0x0000B0, "Member 'BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity::CallFunc_SpawnWorldDecals_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity, CallFunc_SpawnWorldDecals_DynamicMaterial) == 0x0000B8, "Member 'BP_FloatingEye_Die_VisualEntity_C_ExecuteUbergraph_BP_FloatingEye_Die_VisualEntity::CallFunc_SpawnWorldDecals_DynamicMaterial' has a wrong offset!");

// Function BP_FloatingEye_Die_VisualEntity.BP_FloatingEye_Die_VisualEntity_C.ReceiveParticleData
// 0x0018 (0x0018 - 0x0000)
struct BP_FloatingEye_Die_VisualEntity_C_ReceiveParticleData final
{
public:
	TArray<struct FBasicParticleData>             Data;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UNiagaraSystem*                         NiagaraSystem;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FloatingEye_Die_VisualEntity_C_ReceiveParticleData) == 0x000008, "Wrong alignment on BP_FloatingEye_Die_VisualEntity_C_ReceiveParticleData");
static_assert(sizeof(BP_FloatingEye_Die_VisualEntity_C_ReceiveParticleData) == 0x000018, "Wrong size on BP_FloatingEye_Die_VisualEntity_C_ReceiveParticleData");
static_assert(offsetof(BP_FloatingEye_Die_VisualEntity_C_ReceiveParticleData, Data) == 0x000000, "Member 'BP_FloatingEye_Die_VisualEntity_C_ReceiveParticleData::Data' has a wrong offset!");
static_assert(offsetof(BP_FloatingEye_Die_VisualEntity_C_ReceiveParticleData, NiagaraSystem) == 0x000010, "Member 'BP_FloatingEye_Die_VisualEntity_C_ReceiveParticleData::NiagaraSystem' has a wrong offset!");

}

