#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FreezeStackStatusEffect_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_MeshSampling_VisualEntity_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FreezeStackStatusEffect_VisualEntity.BP_FreezeStackStatusEffect_VisualEntity_C
// 0x0018 (0x03B8 - 0x03A0)
class ABP_FreezeStackStatusEffect_VisualEntity_C final : public ABP_MeshSampling_VisualEntity_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_FreezeStackStatusEffect_VisualEntity_C; // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         FreezeFade_Alpha_020A08DA4BA0D7998F471AB6849D707C; // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FreezeFade__Direction_020A08DA4BA0D7998F471AB6849D707C; // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AD[0x3];                                      // 0x03AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FreezeFade;                                        // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FreezeStackStatusEffect_VisualEntity(int32 EntryPoint);
	void OnKill();
	void VisualEntityConstructionFinished();
	void FreezeFade__UpdateFunc();
	void FreezeFade__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FreezeStackStatusEffect_VisualEntity_C">();
	}
	static class ABP_FreezeStackStatusEffect_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FreezeStackStatusEffect_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_FreezeStackStatusEffect_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_FreezeStackStatusEffect_VisualEntity_C");
static_assert(sizeof(ABP_FreezeStackStatusEffect_VisualEntity_C) == 0x0003B8, "Wrong size on ABP_FreezeStackStatusEffect_VisualEntity_C");
static_assert(offsetof(ABP_FreezeStackStatusEffect_VisualEntity_C, UberGraphFrame_BP_FreezeStackStatusEffect_VisualEntity_C) == 0x0003A0, "Member 'ABP_FreezeStackStatusEffect_VisualEntity_C::UberGraphFrame_BP_FreezeStackStatusEffect_VisualEntity_C' has a wrong offset!");
static_assert(offsetof(ABP_FreezeStackStatusEffect_VisualEntity_C, FreezeFade_Alpha_020A08DA4BA0D7998F471AB6849D707C) == 0x0003A8, "Member 'ABP_FreezeStackStatusEffect_VisualEntity_C::FreezeFade_Alpha_020A08DA4BA0D7998F471AB6849D707C' has a wrong offset!");
static_assert(offsetof(ABP_FreezeStackStatusEffect_VisualEntity_C, FreezeFade__Direction_020A08DA4BA0D7998F471AB6849D707C) == 0x0003AC, "Member 'ABP_FreezeStackStatusEffect_VisualEntity_C::FreezeFade__Direction_020A08DA4BA0D7998F471AB6849D707C' has a wrong offset!");
static_assert(offsetof(ABP_FreezeStackStatusEffect_VisualEntity_C, FreezeFade) == 0x0003B0, "Member 'ABP_FreezeStackStatusEffect_VisualEntity_C::FreezeFade' has a wrong offset!");

}

