#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FireTornadoActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FireTornadoActor.BP_FireTornadoActor_C
// 0x0020 (0x1FC0 - 0x1FA0)
class ABP_FireTornadoActor_C final : public AGroundMovingAbilityActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1FA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHitBox*                                HitBox;                                            // 0x1FA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         LIVE;                                              // 0x1FB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bb;                                                // 0x1FB4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FB5[0x3];                                     // 0x1FB5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AVisualEntity*                          MyVE;                                              // 0x1FB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FireTornadoActor(int32 EntryPoint);
	void VFXEnd();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FireTornadoActor_C">();
	}
	static class ABP_FireTornadoActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FireTornadoActor_C>();
	}
};
static_assert(alignof(ABP_FireTornadoActor_C) == 0x000010, "Wrong alignment on ABP_FireTornadoActor_C");
static_assert(sizeof(ABP_FireTornadoActor_C) == 0x001FC0, "Wrong size on ABP_FireTornadoActor_C");
static_assert(offsetof(ABP_FireTornadoActor_C, UberGraphFrame) == 0x001FA0, "Member 'ABP_FireTornadoActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FireTornadoActor_C, HitBox) == 0x001FA8, "Member 'ABP_FireTornadoActor_C::HitBox' has a wrong offset!");
static_assert(offsetof(ABP_FireTornadoActor_C, LIVE) == 0x001FB0, "Member 'ABP_FireTornadoActor_C::LIVE' has a wrong offset!");
static_assert(offsetof(ABP_FireTornadoActor_C, bb) == 0x001FB4, "Member 'ABP_FireTornadoActor_C::bb' has a wrong offset!");
static_assert(offsetof(ABP_FireTornadoActor_C, MyVE) == 0x001FB8, "Member 'ABP_FireTornadoActor_C::MyVE' has a wrong offset!");

}

