#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FireWallSegment

#include "Basic.hpp"

#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FireWallSegment.BP_FireWallSegment_C
// 0x0018 (0x07F0 - 0x07D8)
class ABP_FireWallSegment_C final : public AActorBase
{
public:
	class USceneComponent*                        BurningPatchSpawnPos;                              // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                HitBox;                                            // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FireWallSegment_C">();
	}
	static class ABP_FireWallSegment_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FireWallSegment_C>();
	}
};
static_assert(alignof(ABP_FireWallSegment_C) == 0x000008, "Wrong alignment on ABP_FireWallSegment_C");
static_assert(sizeof(ABP_FireWallSegment_C) == 0x0007F0, "Wrong size on ABP_FireWallSegment_C");
static_assert(offsetof(ABP_FireWallSegment_C, BurningPatchSpawnPos) == 0x0007D8, "Member 'ABP_FireWallSegment_C::BurningPatchSpawnPos' has a wrong offset!");
static_assert(offsetof(ABP_FireWallSegment_C, HitBox) == 0x0007E0, "Member 'ABP_FireWallSegment_C::HitBox' has a wrong offset!");
static_assert(offsetof(ABP_FireWallSegment_C, DefaultSceneRoot) == 0x0007E8, "Member 'ABP_FireWallSegment_C::DefaultSceneRoot' has a wrong offset!");

}

