#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FrontDoor_Invisible

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BP_FrontDoorActorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FrontDoor_Invisible.BP_FrontDoor_Invisible_C
// 0x0030 (0x0AA0 - 0x0A70)
class ABP_FrontDoor_Invisible_C final : public ABP_FrontDoorActorBase_C
{
public:
	class UStaticMeshComponent*                   Cube;                                              // 0x0A70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LightshaftRotation;                                // 0x0A78(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          LightEnable;                                       // 0x0A84(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A85[0x3];                                      // 0x0A85(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LightPosition;                                     // 0x0A88(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightIntensity;                                    // 0x0A94(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 LightColor;                                        // 0x0A98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightRadius;                                       // 0x0A9C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FrontDoor_Invisible_C">();
	}
	static class ABP_FrontDoor_Invisible_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FrontDoor_Invisible_C>();
	}
};
static_assert(alignof(ABP_FrontDoor_Invisible_C) == 0x000008, "Wrong alignment on ABP_FrontDoor_Invisible_C");
static_assert(sizeof(ABP_FrontDoor_Invisible_C) == 0x000AA0, "Wrong size on ABP_FrontDoor_Invisible_C");
static_assert(offsetof(ABP_FrontDoor_Invisible_C, Cube) == 0x000A70, "Member 'ABP_FrontDoor_Invisible_C::Cube' has a wrong offset!");
static_assert(offsetof(ABP_FrontDoor_Invisible_C, LightshaftRotation) == 0x000A78, "Member 'ABP_FrontDoor_Invisible_C::LightshaftRotation' has a wrong offset!");
static_assert(offsetof(ABP_FrontDoor_Invisible_C, LightEnable) == 0x000A84, "Member 'ABP_FrontDoor_Invisible_C::LightEnable' has a wrong offset!");
static_assert(offsetof(ABP_FrontDoor_Invisible_C, LightPosition) == 0x000A88, "Member 'ABP_FrontDoor_Invisible_C::LightPosition' has a wrong offset!");
static_assert(offsetof(ABP_FrontDoor_Invisible_C, LightIntensity) == 0x000A94, "Member 'ABP_FrontDoor_Invisible_C::LightIntensity' has a wrong offset!");
static_assert(offsetof(ABP_FrontDoor_Invisible_C, LightColor) == 0x000A98, "Member 'ABP_FrontDoor_Invisible_C::LightColor' has a wrong offset!");
static_assert(offsetof(ABP_FrontDoor_Invisible_C, LightRadius) == 0x000A9C, "Member 'ABP_FrontDoor_Invisible_C::LightRadius' has a wrong offset!");

}

