#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FireWall_VisualEntity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FireWall_VisualEntity.BP_FireWall_VisualEntity_C.ExecuteUbergraph_BP_FireWall_VisualEntity
// 0x01B8 (0x01B8 - 0x0000)
struct BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAbilityUpgradeUnlocked_ReturnValue;     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0048(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0060(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FireWallSegment_C*                  K2Node_DynamicCast_AsBP_Fire_Wall_Segment;         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FB[0x1];                                       // 0x00FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x017C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaledBoxExtent_ReturnValue;           // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x01A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity) == 0x000008, "Wrong alignment on BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity");
static_assert(sizeof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity) == 0x0001B8, "Wrong size on BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_MakeVector_ReturnValue) == 0x000010, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00001C, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_Add_VectorVector_ReturnValue) == 0x000028, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000038, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_IsAbilityUpgradeUnlocked_ReturnValue) == 0x000040, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_IsAbilityUpgradeUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, Temp_object_Variable) == 0x000048, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000058, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_LineTraceSingle_OutHit) == 0x000060, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_LineTraceSingle_ReturnValue) == 0x0000E8, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, K2Node_DynamicCast_AsBP_Fire_Wall_Segment) == 0x0000F0, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::K2Node_DynamicCast_AsBP_Fire_Wall_Segment' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_BreakHitResult_bBlockingHit) == 0x0000F9, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000FA, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_BreakHitResult_Time) == 0x0000FC, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_BreakHitResult_Distance) == 0x000100, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_BreakHitResult_Location) == 0x000104, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_BreakHitResult_ImpactPoint) == 0x000110, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_BreakHitResult_Normal) == 0x00011C, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_BreakHitResult_ImpactNormal) == 0x000128, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_BreakHitResult_PhysMat) == 0x000138, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_BreakHitResult_HitActor) == 0x000140, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_BreakHitResult_HitComponent) == 0x000148, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_BreakHitResult_HitBoneName) == 0x000150, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_BreakHitResult_HitItem) == 0x000158, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_BreakHitResult_ElementIndex) == 0x00015C, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_BreakHitResult_FaceIndex) == 0x000160, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_BreakHitResult_TraceStart) == 0x000164, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_BreakHitResult_TraceEnd) == 0x000170, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x00017C, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_GetScaledBoxExtent_ReturnValue) == 0x00018C, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_GetScaledBoxExtent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_BreakVector_X) == 0x000198, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_BreakVector_Y) == 0x00019C, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_BreakVector_Z) == 0x0001A0, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_Conv_VectorToLinearColor_ReturnValue_1) == 0x0001A4, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_Conv_VectorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001B4, "Member 'BP_FireWall_VisualEntity_C_ExecuteUbergraph_BP_FireWall_VisualEntity::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_FireWall_VisualEntity.BP_FireWall_VisualEntity_C.GetDamageBounds
// 0x0068 (0x0068 - 0x0000)
struct BP_FireWall_VisualEntity_C_GetDamageBounds final
{
public:
	float                                         LengthAdjust;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 AbilityToCheck;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              DamageBounds;                                      // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActorBase*                             K2Node_DynamicCast_AsActor_Base;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponent*                      CallFunc_BPGetComponentByClass_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAddAbilityInAreaComponent*             K2Node_DynamicCast_AsAdd_Ability_in_Area_Component; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetDamageHBounds_ReturnValue;             // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FireWall_VisualEntity_C_GetDamageBounds) == 0x000008, "Wrong alignment on BP_FireWall_VisualEntity_C_GetDamageBounds");
static_assert(sizeof(BP_FireWall_VisualEntity_C_GetDamageBounds) == 0x000068, "Wrong size on BP_FireWall_VisualEntity_C_GetDamageBounds");
static_assert(offsetof(BP_FireWall_VisualEntity_C_GetDamageBounds, LengthAdjust) == 0x000000, "Member 'BP_FireWall_VisualEntity_C_GetDamageBounds::LengthAdjust' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_GetDamageBounds, AbilityToCheck) == 0x000008, "Member 'BP_FireWall_VisualEntity_C_GetDamageBounds::AbilityToCheck' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_GetDamageBounds, DamageBounds) == 0x000010, "Member 'BP_FireWall_VisualEntity_C_GetDamageBounds::DamageBounds' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_GetDamageBounds, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_FireWall_VisualEntity_C_GetDamageBounds::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_GetDamageBounds, K2Node_DynamicCast_AsActor_Base) == 0x000020, "Member 'BP_FireWall_VisualEntity_C_GetDamageBounds::K2Node_DynamicCast_AsActor_Base' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_GetDamageBounds, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_FireWall_VisualEntity_C_GetDamageBounds::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_GetDamageBounds, CallFunc_GetAbilityController_ReturnValue) == 0x000030, "Member 'BP_FireWall_VisualEntity_C_GetDamageBounds::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_GetDamageBounds, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000038, "Member 'BP_FireWall_VisualEntity_C_GetDamageBounds::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_GetDamageBounds, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_FireWall_VisualEntity_C_GetDamageBounds::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_GetDamageBounds, CallFunc_BPGetComponentByClass_ReturnValue) == 0x000048, "Member 'BP_FireWall_VisualEntity_C_GetDamageBounds::CallFunc_BPGetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_GetDamageBounds, K2Node_DynamicCast_AsAdd_Ability_in_Area_Component) == 0x000050, "Member 'BP_FireWall_VisualEntity_C_GetDamageBounds::K2Node_DynamicCast_AsAdd_Ability_in_Area_Component' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_GetDamageBounds, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BP_FireWall_VisualEntity_C_GetDamageBounds::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_FireWall_VisualEntity_C_GetDamageBounds, CallFunc_GetDamageHBounds_ReturnValue) == 0x00005C, "Member 'BP_FireWall_VisualEntity_C_GetDamageBounds::CallFunc_GetDamageHBounds_ReturnValue' has a wrong offset!");

}

