#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FriendlyWisp_Familiar_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_FriendlyWisp_Familiar_Anim.BP_FriendlyWisp_Familiar_Anim_C
// 0x01E0 (0x0880 - 0x06A0)
class UBP_FriendlyWisp_Familiar_Anim_C final : public UAnimInstanceBase
{
public:
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x06D8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0758(0x0080)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x07D8(0x00A8)()

public:
	void ExecuteUbergraph_BP_FriendlyWisp_Familiar_Anim(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FriendlyWisp_Familiar_Anim_C">();
	}
	static class UBP_FriendlyWisp_Familiar_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FriendlyWisp_Familiar_Anim_C>();
	}
};
static_assert(alignof(UBP_FriendlyWisp_Familiar_Anim_C) == 0x000010, "Wrong alignment on UBP_FriendlyWisp_Familiar_Anim_C");
static_assert(sizeof(UBP_FriendlyWisp_Familiar_Anim_C) == 0x000880, "Wrong size on UBP_FriendlyWisp_Familiar_Anim_C");
static_assert(offsetof(UBP_FriendlyWisp_Familiar_Anim_C, UberGraphFrame) == 0x0006A0, "Member 'UBP_FriendlyWisp_Familiar_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_FriendlyWisp_Familiar_Anim_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UBP_FriendlyWisp_Familiar_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_FriendlyWisp_Familiar_Anim_C, AnimGraphNode_SequencePlayer_1) == 0x0006D8, "Member 'UBP_FriendlyWisp_Familiar_Anim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_FriendlyWisp_Familiar_Anim_C, AnimGraphNode_SequencePlayer) == 0x000758, "Member 'UBP_FriendlyWisp_Familiar_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBP_FriendlyWisp_Familiar_Anim_C, AnimGraphNode_BlendListByInt) == 0x0007D8, "Member 'UBP_FriendlyWisp_Familiar_Anim_C::AnimGraphNode_BlendListByInt' has a wrong offset!");

}

