#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Falcon

#include "Basic.hpp"

#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Falcon.BP_Falcon_C
// 0x0018 (0x07F0 - 0x07D8)
class ABP_Falcon_C final : public AActorBase
{
public:
	class UAkComponent*                           Ak;                                                // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UManVisualController*                   ManVisualController;                               // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Falcon_C">();
	}
	static class ABP_Falcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Falcon_C>();
	}
};
static_assert(alignof(ABP_Falcon_C) == 0x000008, "Wrong alignment on ABP_Falcon_C");
static_assert(sizeof(ABP_Falcon_C) == 0x0007F0, "Wrong size on ABP_Falcon_C");
static_assert(offsetof(ABP_Falcon_C, Ak) == 0x0007D8, "Member 'ABP_Falcon_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_Falcon_C, SkeletalMesh) == 0x0007E0, "Member 'ABP_Falcon_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_Falcon_C, ManVisualController) == 0x0007E8, "Member 'ABP_Falcon_C::ManVisualController' has a wrong offset!");

}

