#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FreezeStatusEffect_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_MeshSampling_VisualEntity_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FreezeStatusEffect_VisualEntity.BP_FreezeStatusEffect_VisualEntity_C
// 0x0040 (0x03E0 - 0x03A0)
class ABP_FreezeStatusEffect_VisualEntity_C final : public ABP_MeshSampling_VisualEntity_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_FreezeStatusEffect_VisualEntity_C; // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Aura;                                              // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      AuraEnd;                                           // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FStatusEffectCauserDamage              SECauserDamageData;                                // 0x03B8(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FVector                                VFXCollisionPlane;                                 // 0x03C4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                VFXCollisionPlaneNormal;                           // 0x03D0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FreezeStatusEffect_VisualEntity(int32 EntryPoint);
	void OnKill();
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FreezeStatusEffect_VisualEntity_C">();
	}
	static class ABP_FreezeStatusEffect_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FreezeStatusEffect_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_FreezeStatusEffect_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_FreezeStatusEffect_VisualEntity_C");
static_assert(sizeof(ABP_FreezeStatusEffect_VisualEntity_C) == 0x0003E0, "Wrong size on ABP_FreezeStatusEffect_VisualEntity_C");
static_assert(offsetof(ABP_FreezeStatusEffect_VisualEntity_C, UberGraphFrame_BP_FreezeStatusEffect_VisualEntity_C) == 0x0003A0, "Member 'ABP_FreezeStatusEffect_VisualEntity_C::UberGraphFrame_BP_FreezeStatusEffect_VisualEntity_C' has a wrong offset!");
static_assert(offsetof(ABP_FreezeStatusEffect_VisualEntity_C, Aura) == 0x0003A8, "Member 'ABP_FreezeStatusEffect_VisualEntity_C::Aura' has a wrong offset!");
static_assert(offsetof(ABP_FreezeStatusEffect_VisualEntity_C, AuraEnd) == 0x0003B0, "Member 'ABP_FreezeStatusEffect_VisualEntity_C::AuraEnd' has a wrong offset!");
static_assert(offsetof(ABP_FreezeStatusEffect_VisualEntity_C, SECauserDamageData) == 0x0003B8, "Member 'ABP_FreezeStatusEffect_VisualEntity_C::SECauserDamageData' has a wrong offset!");
static_assert(offsetof(ABP_FreezeStatusEffect_VisualEntity_C, VFXCollisionPlane) == 0x0003C4, "Member 'ABP_FreezeStatusEffect_VisualEntity_C::VFXCollisionPlane' has a wrong offset!");
static_assert(offsetof(ABP_FreezeStatusEffect_VisualEntity_C, VFXCollisionPlaneNormal) == 0x0003D0, "Member 'ABP_FreezeStatusEffect_VisualEntity_C::VFXCollisionPlaneNormal' has a wrong offset!");

}

