#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FriendlyCasterImp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FriendlyCasterImp.BP_FriendlyCasterImp_C
// 0x0020 (0x1CC0 - 0x1CA0)
class ABP_FriendlyCasterImp_C final : public AFamiliarBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1CA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_SummonImp_Living;                               // 0x1CA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_SummonImp_Spawn;                                // 0x1CB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FriendlyCasterImp(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FriendlyCasterImp_C">();
	}
	static class ABP_FriendlyCasterImp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FriendlyCasterImp_C>();
	}
};
static_assert(alignof(ABP_FriendlyCasterImp_C) == 0x000010, "Wrong alignment on ABP_FriendlyCasterImp_C");
static_assert(sizeof(ABP_FriendlyCasterImp_C) == 0x001CC0, "Wrong size on ABP_FriendlyCasterImp_C");
static_assert(offsetof(ABP_FriendlyCasterImp_C, UberGraphFrame) == 0x001CA0, "Member 'ABP_FriendlyCasterImp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FriendlyCasterImp_C, NS_SummonImp_Living) == 0x001CA8, "Member 'ABP_FriendlyCasterImp_C::NS_SummonImp_Living' has a wrong offset!");
static_assert(offsetof(ABP_FriendlyCasterImp_C, NS_SummonImp_Spawn) == 0x001CB0, "Member 'ABP_FriendlyCasterImp_C::NS_SummonImp_Spawn' has a wrong offset!");

}

