#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FuryOfTheElements_PassiveSkill

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_FuryOfTheElements_PassiveSkill.BP_FuryOfTheElements_PassiveSkill_C.ExecuteUbergraph_BP_FuryOfTheElements_PassiveSkill
// 0x0038 (0x0038 - 0x0000)
struct BP_FuryOfTheElements_PassiveSkill_C_ExecuteUbergraph_BP_FuryOfTheElements_PassiveSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_CustomName;                           // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMandragoraGameMode*                    CallFunc_GetGameMode_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FuryOfTheElements_PassiveSkill_C_ExecuteUbergraph_BP_FuryOfTheElements_PassiveSkill) == 0x000008, "Wrong alignment on BP_FuryOfTheElements_PassiveSkill_C_ExecuteUbergraph_BP_FuryOfTheElements_PassiveSkill");
static_assert(sizeof(BP_FuryOfTheElements_PassiveSkill_C_ExecuteUbergraph_BP_FuryOfTheElements_PassiveSkill) == 0x000038, "Wrong size on BP_FuryOfTheElements_PassiveSkill_C_ExecuteUbergraph_BP_FuryOfTheElements_PassiveSkill");
static_assert(offsetof(BP_FuryOfTheElements_PassiveSkill_C_ExecuteUbergraph_BP_FuryOfTheElements_PassiveSkill, EntryPoint) == 0x000000, "Member 'BP_FuryOfTheElements_PassiveSkill_C_ExecuteUbergraph_BP_FuryOfTheElements_PassiveSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FuryOfTheElements_PassiveSkill_C_ExecuteUbergraph_BP_FuryOfTheElements_PassiveSkill, CallFunc_GetAbilityController_ReturnValue) == 0x000008, "Member 'BP_FuryOfTheElements_PassiveSkill_C_ExecuteUbergraph_BP_FuryOfTheElements_PassiveSkill::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FuryOfTheElements_PassiveSkill_C_ExecuteUbergraph_BP_FuryOfTheElements_PassiveSkill, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_FuryOfTheElements_PassiveSkill_C_ExecuteUbergraph_BP_FuryOfTheElements_PassiveSkill::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FuryOfTheElements_PassiveSkill_C_ExecuteUbergraph_BP_FuryOfTheElements_PassiveSkill, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_FuryOfTheElements_PassiveSkill_C_ExecuteUbergraph_BP_FuryOfTheElements_PassiveSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FuryOfTheElements_PassiveSkill_C_ExecuteUbergraph_BP_FuryOfTheElements_PassiveSkill, K2Node_Event_CustomName) == 0x00001C, "Member 'BP_FuryOfTheElements_PassiveSkill_C_ExecuteUbergraph_BP_FuryOfTheElements_PassiveSkill::K2Node_Event_CustomName' has a wrong offset!");
static_assert(offsetof(BP_FuryOfTheElements_PassiveSkill_C_ExecuteUbergraph_BP_FuryOfTheElements_PassiveSkill, K2Node_SwitchName_CmpSuccess) == 0x000024, "Member 'BP_FuryOfTheElements_PassiveSkill_C_ExecuteUbergraph_BP_FuryOfTheElements_PassiveSkill::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_FuryOfTheElements_PassiveSkill_C_ExecuteUbergraph_BP_FuryOfTheElements_PassiveSkill, CallFunc_GetGameMode_ReturnValue) == 0x000028, "Member 'BP_FuryOfTheElements_PassiveSkill_C_ExecuteUbergraph_BP_FuryOfTheElements_PassiveSkill::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FuryOfTheElements_PassiveSkill_C_ExecuteUbergraph_BP_FuryOfTheElements_PassiveSkill, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000030, "Member 'BP_FuryOfTheElements_PassiveSkill_C_ExecuteUbergraph_BP_FuryOfTheElements_PassiveSkill::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");

// Function BP_FuryOfTheElements_PassiveSkill.BP_FuryOfTheElements_PassiveSkill_C.BPAbilityCustomEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_FuryOfTheElements_PassiveSkill_C_BPAbilityCustomEvent final
{
public:
	class FName                                   CustomName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FuryOfTheElements_PassiveSkill_C_BPAbilityCustomEvent) == 0x000004, "Wrong alignment on BP_FuryOfTheElements_PassiveSkill_C_BPAbilityCustomEvent");
static_assert(sizeof(BP_FuryOfTheElements_PassiveSkill_C_BPAbilityCustomEvent) == 0x000008, "Wrong size on BP_FuryOfTheElements_PassiveSkill_C_BPAbilityCustomEvent");
static_assert(offsetof(BP_FuryOfTheElements_PassiveSkill_C_BPAbilityCustomEvent, CustomName) == 0x000000, "Member 'BP_FuryOfTheElements_PassiveSkill_C_BPAbilityCustomEvent::CustomName' has a wrong offset!");

}

