#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Falcon_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_structs.hpp"


namespace SDK::Params
{

// Function BP_Falcon_Anim.BP_Falcon_Anim_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct BP_Falcon_Anim_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BP_Falcon_Anim_C_AnimGraph) == 0x000008, "Wrong alignment on BP_Falcon_Anim_C_AnimGraph");
static_assert(sizeof(BP_Falcon_Anim_C_AnimGraph) == 0x000010, "Wrong size on BP_Falcon_Anim_C_AnimGraph");
static_assert(offsetof(BP_Falcon_Anim_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'BP_Falcon_Anim_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function BP_Falcon_Anim.BP_Falcon_Anim_C.OnAnimStartRequest
// 0x0008 (0x0008 - 0x0000)
struct BP_Falcon_Anim_C_OnAnimStartRequest final
{
public:
	class UAnimID*                                AnimID;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Falcon_Anim_C_OnAnimStartRequest) == 0x000008, "Wrong alignment on BP_Falcon_Anim_C_OnAnimStartRequest");
static_assert(sizeof(BP_Falcon_Anim_C_OnAnimStartRequest) == 0x000008, "Wrong size on BP_Falcon_Anim_C_OnAnimStartRequest");
static_assert(offsetof(BP_Falcon_Anim_C_OnAnimStartRequest, AnimID) == 0x000000, "Member 'BP_Falcon_Anim_C_OnAnimStartRequest::AnimID' has a wrong offset!");

// Function BP_Falcon_Anim.BP_Falcon_Anim_C.OnAnimEventReceived
// 0x0018 (0x0018 - 0x0000)
struct BP_Falcon_Anim_C_OnAnimEventReceived final
{
public:
	class UAnimID*                                AnimID;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimEventType                                AnimEventType;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      InAnimation;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Falcon_Anim_C_OnAnimEventReceived) == 0x000008, "Wrong alignment on BP_Falcon_Anim_C_OnAnimEventReceived");
static_assert(sizeof(BP_Falcon_Anim_C_OnAnimEventReceived) == 0x000018, "Wrong size on BP_Falcon_Anim_C_OnAnimEventReceived");
static_assert(offsetof(BP_Falcon_Anim_C_OnAnimEventReceived, AnimID) == 0x000000, "Member 'BP_Falcon_Anim_C_OnAnimEventReceived::AnimID' has a wrong offset!");
static_assert(offsetof(BP_Falcon_Anim_C_OnAnimEventReceived, AnimEventType) == 0x000008, "Member 'BP_Falcon_Anim_C_OnAnimEventReceived::AnimEventType' has a wrong offset!");
static_assert(offsetof(BP_Falcon_Anim_C_OnAnimEventReceived, InAnimation) == 0x000010, "Member 'BP_Falcon_Anim_C_OnAnimEventReceived::InAnimation' has a wrong offset!");

// Function BP_Falcon_Anim.BP_Falcon_Anim_C.ExecuteUbergraph_BP_Falcon_Anim
// 0x0038 (0x0038 - 0x0000)
struct BP_Falcon_Anim_C_ExecuteUbergraph_BP_Falcon_Anim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimID*                                K2Node_Event_AnimID_1;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimID*                                K2Node_Event_AnimID;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimEventType                                K2Node_Event_AnimEventType;                        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      K2Node_Event_InAnimation;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Falcon_Anim_C_ExecuteUbergraph_BP_Falcon_Anim) == 0x000008, "Wrong alignment on BP_Falcon_Anim_C_ExecuteUbergraph_BP_Falcon_Anim");
static_assert(sizeof(BP_Falcon_Anim_C_ExecuteUbergraph_BP_Falcon_Anim) == 0x000038, "Wrong size on BP_Falcon_Anim_C_ExecuteUbergraph_BP_Falcon_Anim");
static_assert(offsetof(BP_Falcon_Anim_C_ExecuteUbergraph_BP_Falcon_Anim, EntryPoint) == 0x000000, "Member 'BP_Falcon_Anim_C_ExecuteUbergraph_BP_Falcon_Anim::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Falcon_Anim_C_ExecuteUbergraph_BP_Falcon_Anim, K2Node_Event_AnimID_1) == 0x000008, "Member 'BP_Falcon_Anim_C_ExecuteUbergraph_BP_Falcon_Anim::K2Node_Event_AnimID_1' has a wrong offset!");
static_assert(offsetof(BP_Falcon_Anim_C_ExecuteUbergraph_BP_Falcon_Anim, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'BP_Falcon_Anim_C_ExecuteUbergraph_BP_Falcon_Anim::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Falcon_Anim_C_ExecuteUbergraph_BP_Falcon_Anim, K2Node_Event_AnimID) == 0x000018, "Member 'BP_Falcon_Anim_C_ExecuteUbergraph_BP_Falcon_Anim::K2Node_Event_AnimID' has a wrong offset!");
static_assert(offsetof(BP_Falcon_Anim_C_ExecuteUbergraph_BP_Falcon_Anim, K2Node_Event_AnimEventType) == 0x000020, "Member 'BP_Falcon_Anim_C_ExecuteUbergraph_BP_Falcon_Anim::K2Node_Event_AnimEventType' has a wrong offset!");
static_assert(offsetof(BP_Falcon_Anim_C_ExecuteUbergraph_BP_Falcon_Anim, K2Node_Event_InAnimation) == 0x000028, "Member 'BP_Falcon_Anim_C_ExecuteUbergraph_BP_Falcon_Anim::K2Node_Event_InAnimation' has a wrong offset!");
static_assert(offsetof(BP_Falcon_Anim_C_ExecuteUbergraph_BP_Falcon_Anim, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000030, "Member 'BP_Falcon_Anim_C_ExecuteUbergraph_BP_Falcon_Anim::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Falcon_Anim_C_ExecuteUbergraph_BP_Falcon_Anim, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000031, "Member 'BP_Falcon_Anim_C_ExecuteUbergraph_BP_Falcon_Anim::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Falcon_Anim_C_ExecuteUbergraph_BP_Falcon_Anim, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x000032, "Member 'BP_Falcon_Anim_C_ExecuteUbergraph_BP_Falcon_Anim::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");

}

