#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FuryofElements_onCharacter_VisualEntity

#include "Basic.hpp"

#include "man_structs.hpp"


namespace SDK::Params
{

// Function BP_FuryofElements_onCharacter_VisualEntity.BP_FuryofElements_onCharacter_VisualEntity_C.ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity
// 0x0048 (0x0048 - 0x0000)
struct BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_FuryOfTheElements_PassiveSkill_C*   K2Node_DynamicCast_AsBP_Fury_Of_the_Elements_Passive_Skill; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EDamageType                                   CallFunc_BPGetDamageTypeForVFX_ReturnValue;        // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity) == 0x000008, "Wrong alignment on BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity");
static_assert(sizeof(BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity) == 0x000048, "Wrong size on BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity");
static_assert(offsetof(BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity, K2Node_DynamicCast_AsCharacter_Base) == 0x000010, "Member 'BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity, CallFunc_GetAbilityController_ReturnValue) == 0x000020, "Member 'BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000028, "Member 'BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000030, "Member 'BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity, K2Node_DynamicCast_AsBP_Fury_Of_the_Elements_Passive_Skill) == 0x000038, "Member 'BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity::K2Node_DynamicCast_AsBP_Fury_Of_the_Elements_Passive_Skill' has a wrong offset!");
static_assert(offsetof(BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity, CallFunc_BPGetDamageTypeForVFX_ReturnValue) == 0x000041, "Member 'BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity::CallFunc_BPGetDamageTypeForVFX_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity, K2Node_SwitchEnum_CmpSuccess) == 0x000042, "Member 'BP_FuryofElements_onCharacter_VisualEntity_C_ExecuteUbergraph_BP_FuryofElements_onCharacter_VisualEntity::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

