#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ForceFeedback

#include "Basic.hpp"

#include "man_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ForceFeedback.BP_ForceFeedback_C.ExecuteUbergraph_BP_ForceFeedback
// 0x0260 (0x0260 - 0x0000)
struct BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     K2Node_CustomEvent_Source;                         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     K2Node_CustomEvent_Bullet;                         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     K2Node_CustomEvent_Target;                         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           K2Node_CustomEvent_Ability;                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_effectiveDamage;                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageValue                           K2Node_CustomEvent_DamageValue;                    // 0x0038(0x0138)(ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BrawlerFallDamagePassive_C*         K2Node_DynamicCast_AsBP_Brawler_Fall_Damage_Passive; // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetActor_ReturnValue;                     // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PeriodicBulletTrap_C*               K2Node_DynamicCast_AsBP_Periodic_Bullet_Trap;      // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DaggerTrap_C*                       K2Node_DynamicCast_AsBP_Dagger_Trap;               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue_1;       // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetGameMode_ReturnValue;                  // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAbilityController* Source, class UAbilityController* Bullet, class UAbilityController* Target, class UAbilityBase* Ability, float effectiveDamage, const struct FDamageValue& DamageValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x01F0(0x0010)(ZeroConstructor, NoDestructor)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetChildComponent_ReturnValue;            // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceFeedbackComponent*                CallFunc_SpawnForceFeedbackAttached_ReturnValue;   // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceFeedbackComponent*                CallFunc_SpawnForceFeedbackAttached_ReturnValue_1; // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceFeedbackComponent*                CallFunc_SpawnForceFeedbackAttached_ReturnValue_2; // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackComponent*                CallFunc_SpawnForceFeedbackAttached_ReturnValue_3; // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback) == 0x000008, "Wrong alignment on BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback");
static_assert(sizeof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback) == 0x000260, "Wrong size on BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, EntryPoint) == 0x000000, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, CallFunc_GetAbilityController_ReturnValue) == 0x000008, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, K2Node_CustomEvent_Source) == 0x000010, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::K2Node_CustomEvent_Source' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, K2Node_CustomEvent_Bullet) == 0x000018, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::K2Node_CustomEvent_Bullet' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, K2Node_CustomEvent_Target) == 0x000020, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, K2Node_CustomEvent_Ability) == 0x000028, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::K2Node_CustomEvent_Ability' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, K2Node_CustomEvent_effectiveDamage) == 0x000030, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::K2Node_CustomEvent_effectiveDamage' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, K2Node_CustomEvent_DamageValue) == 0x000038, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::K2Node_CustomEvent_DamageValue' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, CallFunc_GetPlayerController_ReturnValue) == 0x000170, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000178, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, K2Node_DynamicCast_AsBP_Brawler_Fall_Damage_Passive) == 0x000180, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::K2Node_DynamicCast_AsBP_Brawler_Fall_Damage_Passive' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, K2Node_DynamicCast_bSuccess) == 0x000188, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, CallFunc_IsValid_ReturnValue) == 0x000189, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, CallFunc_GetActor_ReturnValue) == 0x000190, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::CallFunc_GetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000198, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, CallFunc_GetOwner_ReturnValue) == 0x0001A8, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, CallFunc_BreakVector_X) == 0x0001B0, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, CallFunc_BreakVector_Y) == 0x0001B4, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, CallFunc_BreakVector_Z) == 0x0001B8, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, CallFunc_IsValid_ReturnValue_1) == 0x0001BC, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, K2Node_DynamicCast_AsBP_Periodic_Bullet_Trap) == 0x0001C0, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::K2Node_DynamicCast_AsBP_Periodic_Bullet_Trap' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, K2Node_DynamicCast_bSuccess_1) == 0x0001C8, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, K2Node_DynamicCast_AsBP_Dagger_Trap) == 0x0001D0, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::K2Node_DynamicCast_AsBP_Dagger_Trap' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, K2Node_DynamicCast_bSuccess_2) == 0x0001D8, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, CallFunc_GetAbilityController_ReturnValue_1) == 0x0001E0, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::CallFunc_GetAbilityController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, CallFunc_GetGameMode_ReturnValue) == 0x0001E8, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, K2Node_CreateDelegate_OutputDelegate) == 0x0001F0, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000200, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000208, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, CallFunc_GetChildComponent_ReturnValue) == 0x000218, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::CallFunc_GetChildComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, CallFunc_BreakVector_X_1) == 0x000220, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, CallFunc_BreakVector_Y_1) == 0x000224, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, CallFunc_BreakVector_Z_1) == 0x000228, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, CallFunc_SpawnForceFeedbackAttached_ReturnValue) == 0x000230, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::CallFunc_SpawnForceFeedbackAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000238, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, CallFunc_SpawnForceFeedbackAttached_ReturnValue_1) == 0x000240, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::CallFunc_SpawnForceFeedbackAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x000248, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, CallFunc_SpawnForceFeedbackAttached_ReturnValue_2) == 0x000250, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::CallFunc_SpawnForceFeedbackAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback, CallFunc_SpawnForceFeedbackAttached_ReturnValue_3) == 0x000258, "Member 'BP_ForceFeedback_C_ExecuteUbergraph_BP_ForceFeedback::CallFunc_SpawnForceFeedbackAttached_ReturnValue_3' has a wrong offset!");

// Function BP_ForceFeedback.BP_ForceFeedback_C.DamageTakenEvent
// 0x0160 (0x0160 - 0x0000)
struct BP_ForceFeedback_C_DamageTakenEvent final
{
public:
	class UAbilityController*                     Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     Bullet;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     Target_0;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           Ability;                                           // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         effectiveDamage;                                   // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageValue                           DamageValue;                                       // 0x0028(0x0138)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_ForceFeedback_C_DamageTakenEvent) == 0x000008, "Wrong alignment on BP_ForceFeedback_C_DamageTakenEvent");
static_assert(sizeof(BP_ForceFeedback_C_DamageTakenEvent) == 0x000160, "Wrong size on BP_ForceFeedback_C_DamageTakenEvent");
static_assert(offsetof(BP_ForceFeedback_C_DamageTakenEvent, Source) == 0x000000, "Member 'BP_ForceFeedback_C_DamageTakenEvent::Source' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_DamageTakenEvent, Bullet) == 0x000008, "Member 'BP_ForceFeedback_C_DamageTakenEvent::Bullet' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_DamageTakenEvent, Target_0) == 0x000010, "Member 'BP_ForceFeedback_C_DamageTakenEvent::Target_0' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_DamageTakenEvent, Ability) == 0x000018, "Member 'BP_ForceFeedback_C_DamageTakenEvent::Ability' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_DamageTakenEvent, effectiveDamage) == 0x000020, "Member 'BP_ForceFeedback_C_DamageTakenEvent::effectiveDamage' has a wrong offset!");
static_assert(offsetof(BP_ForceFeedback_C_DamageTakenEvent, DamageValue) == 0x000028, "Member 'BP_ForceFeedback_C_DamageTakenEvent::DamageValue' has a wrong offset!");

}

