#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FlameSlash_Sword_VisualEntity

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_FlameSlash_Sword_VisualEntity.BP_FlameSlash_Sword_VisualEntity_C.ExecuteUbergraph_BP_FlameSlash_Sword_VisualEntity
// 0x0030 (0x0030 - 0x0000)
struct BP_FlameSlash_Sword_VisualEntity_C_ExecuteUbergraph_BP_FlameSlash_Sword_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FlameSlash_Sword_VisualEntity_C_ExecuteUbergraph_BP_FlameSlash_Sword_VisualEntity) == 0x000008, "Wrong alignment on BP_FlameSlash_Sword_VisualEntity_C_ExecuteUbergraph_BP_FlameSlash_Sword_VisualEntity");
static_assert(sizeof(BP_FlameSlash_Sword_VisualEntity_C_ExecuteUbergraph_BP_FlameSlash_Sword_VisualEntity) == 0x000030, "Wrong size on BP_FlameSlash_Sword_VisualEntity_C_ExecuteUbergraph_BP_FlameSlash_Sword_VisualEntity");
static_assert(offsetof(BP_FlameSlash_Sword_VisualEntity_C_ExecuteUbergraph_BP_FlameSlash_Sword_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_FlameSlash_Sword_VisualEntity_C_ExecuteUbergraph_BP_FlameSlash_Sword_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FlameSlash_Sword_VisualEntity_C_ExecuteUbergraph_BP_FlameSlash_Sword_VisualEntity, Temp_bool_Variable) == 0x000004, "Member 'BP_FlameSlash_Sword_VisualEntity_C_ExecuteUbergraph_BP_FlameSlash_Sword_VisualEntity::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_FlameSlash_Sword_VisualEntity_C_ExecuteUbergraph_BP_FlameSlash_Sword_VisualEntity, Temp_float_Variable) == 0x000008, "Member 'BP_FlameSlash_Sword_VisualEntity_C_ExecuteUbergraph_BP_FlameSlash_Sword_VisualEntity::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_FlameSlash_Sword_VisualEntity_C_ExecuteUbergraph_BP_FlameSlash_Sword_VisualEntity, Temp_float_Variable_1) == 0x00000C, "Member 'BP_FlameSlash_Sword_VisualEntity_C_ExecuteUbergraph_BP_FlameSlash_Sword_VisualEntity::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FlameSlash_Sword_VisualEntity_C_ExecuteUbergraph_BP_FlameSlash_Sword_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_FlameSlash_Sword_VisualEntity_C_ExecuteUbergraph_BP_FlameSlash_Sword_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FlameSlash_Sword_VisualEntity_C_ExecuteUbergraph_BP_FlameSlash_Sword_VisualEntity, K2Node_DynamicCast_AsCharacter_Base) == 0x000018, "Member 'BP_FlameSlash_Sword_VisualEntity_C_ExecuteUbergraph_BP_FlameSlash_Sword_VisualEntity::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_FlameSlash_Sword_VisualEntity_C_ExecuteUbergraph_BP_FlameSlash_Sword_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_FlameSlash_Sword_VisualEntity_C_ExecuteUbergraph_BP_FlameSlash_Sword_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FlameSlash_Sword_VisualEntity_C_ExecuteUbergraph_BP_FlameSlash_Sword_VisualEntity, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'BP_FlameSlash_Sword_VisualEntity_C_ExecuteUbergraph_BP_FlameSlash_Sword_VisualEntity::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_FlameSlash_Sword_VisualEntity_C_ExecuteUbergraph_BP_FlameSlash_Sword_VisualEntity, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000028, "Member 'BP_FlameSlash_Sword_VisualEntity_C_ExecuteUbergraph_BP_FlameSlash_Sword_VisualEntity::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FlameSlash_Sword_VisualEntity_C_ExecuteUbergraph_BP_FlameSlash_Sword_VisualEntity, K2Node_Select_Default) == 0x00002C, "Member 'BP_FlameSlash_Sword_VisualEntity_C_ExecuteUbergraph_BP_FlameSlash_Sword_VisualEntity::K2Node_Select_Default' has a wrong offset!");

// Function BP_FlameSlash_Sword_VisualEntity.BP_FlameSlash_Sword_VisualEntity_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_FlameSlash_Sword_VisualEntity_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FlameSlash_Sword_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_FlameSlash_Sword_VisualEntity_C_ReceiveTick");
static_assert(sizeof(BP_FlameSlash_Sword_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong size on BP_FlameSlash_Sword_VisualEntity_C_ReceiveTick");
static_assert(offsetof(BP_FlameSlash_Sword_VisualEntity_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_FlameSlash_Sword_VisualEntity_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

