#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GreenEye_PoisonTrail

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GreenEye_PoisonTrail.BP_GreenEye_PoisonTrail_C.ExecuteUbergraph_BP_GreenEye_PoisonTrail
// 0x0078 (0x0078 - 0x0000)
struct BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base_1;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPIsAlive_ReturnValue;                    // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue_1;       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByName_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLifeSpan_ReturnValue;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail) == 0x000008, "Wrong alignment on BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail");
static_assert(sizeof(BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail) == 0x000078, "Wrong size on BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail");
static_assert(offsetof(BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail, EntryPoint) == 0x000000, "Member 'BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail, K2Node_DynamicCast_AsCharacter_Base) == 0x000018, "Member 'BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail, CallFunc_GetOwner_ReturnValue_1) == 0x000028, "Member 'BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail, CallFunc_GetAbilityController_ReturnValue) == 0x000030, "Member 'BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail, K2Node_DynamicCast_AsCharacter_Base_1) == 0x000040, "Member 'BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail::K2Node_DynamicCast_AsCharacter_Base_1' has a wrong offset!");
static_assert(offsetof(BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail, Temp_bool_IsClosed_Variable) == 0x000049, "Member 'BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail, CallFunc_BPIsAlive_ReturnValue) == 0x00004A, "Member 'BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail::CallFunc_BPIsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail, CallFunc_GetAbilityController_ReturnValue_1) == 0x000050, "Member 'BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail::CallFunc_GetAbilityController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail, CallFunc_BPGetAbilityByName_ReturnValue) == 0x000058, "Member 'BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail::CallFunc_BPGetAbilityByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail, CallFunc_GetManGameMode_ReturnValue) == 0x000060, "Member 'BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail::CallFunc_GetManGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000068, "Member 'BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail, CallFunc_GetLifeSpan_ReturnValue) == 0x000070, "Member 'BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail::CallFunc_GetLifeSpan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000074, "Member 'BP_GreenEye_PoisonTrail_C_ExecuteUbergraph_BP_GreenEye_PoisonTrail::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_GreenEye_PoisonTrail.BP_GreenEye_PoisonTrail_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_GreenEye_PoisonTrail_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GreenEye_PoisonTrail_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_GreenEye_PoisonTrail_C_ReceiveTick");
static_assert(sizeof(BP_GreenEye_PoisonTrail_C_ReceiveTick) == 0x000004, "Wrong size on BP_GreenEye_PoisonTrail_C_ReceiveTick");
static_assert(offsetof(BP_GreenEye_PoisonTrail_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_GreenEye_PoisonTrail_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

