#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GeneralLightBrandStatusEffectVisual

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GeneralLightBrandStatusEffectVisual.BP_GeneralLightBrandStatusEffectVisual_C.ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual
// 0x0198 (0x0198 - 0x0000)
struct BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMandragoraGameMode*                    CallFunc_GetGameMode_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetActor_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHeroBase*                              K2Node_DynamicCast_AsHero_Base;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue_1;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorRelativeLocation_SweepHitResult; // 0x0058(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetActorRelativeLocation_SweepHitResult_1; // 0x00E0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18A[0x2];                                      // 0x018A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual) == 0x000008, "Wrong alignment on BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual");
static_assert(sizeof(BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual) == 0x000198, "Wrong size on BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual");
static_assert(offsetof(BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual, EntryPoint) == 0x000000, "Member 'BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000008, "Member 'BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual, CallFunc_GetGameMode_ReturnValue) == 0x000020, "Member 'BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual, CallFunc_GetActor_ReturnValue) == 0x000028, "Member 'BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual::CallFunc_GetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual, K2Node_DynamicCast_AsHero_Base) == 0x000038, "Member 'BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual::K2Node_DynamicCast_AsHero_Base' has a wrong offset!");
static_assert(offsetof(BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000048, "Member 'BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual, CallFunc_SpawnVisualEntity_ReturnValue_1) == 0x000050, "Member 'BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual::CallFunc_SpawnVisualEntity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual, CallFunc_K2_SetActorRelativeLocation_SweepHitResult) == 0x000058, "Member 'BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual::CallFunc_K2_SetActorRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual, CallFunc_K2_SetActorRelativeLocation_SweepHitResult_1) == 0x0000E0, "Member 'BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual::CallFunc_K2_SetActorRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual, Temp_int_Array_Index_Variable) == 0x000168, "Member 'BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual, CallFunc_Array_Get_Item) == 0x000170, "Member 'BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual, CallFunc_GetObjectName_ReturnValue) == 0x000178, "Member 'BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000188, "Member 'BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual, CallFunc_IsValid_ReturnValue_2) == 0x000189, "Member 'BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual, Temp_int_Loop_Counter_Variable) == 0x00018C, "Member 'BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual, CallFunc_Less_IntInt_ReturnValue) == 0x000190, "Member 'BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual, CallFunc_Add_IntInt_ReturnValue) == 0x000194, "Member 'BP_GeneralLightBrandStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

