#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GutterRat_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_GutterRat_Anim.BP_GutterRat_Anim_C
// 0x4780 (0x4E20 - 0x06A0)
class UBP_GutterRat_Anim_C final : public UAnimInstanceBase
{
public:
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_47;                   // 0x06D8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_46;                   // 0x0758(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_45;                   // 0x07D8(0x0080)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_4;                    // 0x0858(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_44;                   // 0x0900(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_43;                   // 0x0980(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_42;                   // 0x0A00(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_41;                   // 0x0A80(0x0080)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0x0B00(0x00C8)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_3;                    // 0x0BC8(0x00A8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x0C70(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_40;                   // 0x0C98(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_39;                   // 0x0D18(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_38;                   // 0x0D98(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_37;                   // 0x0E18(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_36;                   // 0x0E98(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_35;                   // 0x0F18(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_34;                   // 0x0F98(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_33;                   // 0x1018(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_32;                   // 0x1098(0x0080)()
	struct FAnimNode_MirrorBones                  AnimGraphNode_MirrorBones;                         // 0x1118(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x1160(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x1268(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x1288(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x12A8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x13B0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x14B8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x15C0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x16C8(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x17D0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_31;                   // 0x17F8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_30;                   // 0x1878(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_29;                   // 0x18F8(0x0080)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_2;                    // 0x1978(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_28;                   // 0x1A20(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_27;                   // 0x1AA0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_26;                   // 0x1B20(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_25;                   // 0x1BA0(0x0080)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x1C20(0x0250)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1E70(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1E90(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x1EB0(0x0250)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x2100(0x0250)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x2350(0x0250)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x25A0(0x0250)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x27F0(0x0250)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x2A40(0x0250)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x2C90(0x0250)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x2EE0(0x0250)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x3130(0x0250)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_24;                   // 0x3380(0x0080)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_1;                    // 0x3400(0x00A8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x34A8(0x0158)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_23;                   // 0x3600(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x3680(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x37D8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x3800(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x3828(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_22;                   // 0x3850(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_21;                   // 0x38D0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_20;                   // 0x3950(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_19;                   // 0x39D0(0x0080)()
	struct FAnimNode_HitReactionFourLegs          AnimGraphNode_HitReactionFourLegs_3;               // 0x3A50(0x0220)()
	struct FAnimNode_HitReactionFourLegs          AnimGraphNode_HitReactionFourLegs_2;               // 0x3C70(0x0220)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_18;                   // 0x3E90(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_17;                   // 0x3F10(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x3F90(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x3FB8(0x0028)()
	struct FAnimNode_HitReactionFourLegs          AnimGraphNode_HitReactionFourLegs_1;               // 0x3FE0(0x0220)()
	struct FAnimNode_HitReactionFourLegs          AnimGraphNode_HitReactionFourLegs;                 // 0x4200(0x0220)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16;                   // 0x4420(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0x44A0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x4520(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x45A0(0x0080)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x4620(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x46C8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x4748(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x47C8(0x0080)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x4848(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x4910(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x4990(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x4A10(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x4A90(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x4B10(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x4B90(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x4C10(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x4C90(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x4D10(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x4D90(0x0080)()
	int32                                         DieSequenceIndex;                                  // 0x4E10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AdditiveHitAnimIx;                                 // 0x4E14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_GutterRat_Anim_AnimGraphNode_ModifyBone_435870524977BD77B0DA199B3AA724F2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_GutterRat_Anim_AnimGraphNode_ModifyBone_ED11B74D464F88AC9295CCA6F4ABEDFA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_GutterRat_Anim_AnimGraphNode_ModifyBone_8E65B8804D9587DB265FF187CF4DA26B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_GutterRat_Anim_AnimGraphNode_ModifyBone_06853863413F0F00ECD14B9544625E62();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_GutterRat_Anim_AnimGraphNode_ModifyBone_1EE3B2EB4EAE1C1CFD519E9C1234B22C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_GutterRat_Anim_AnimGraphNode_ModifyBone_30D0DEE84718DDD0093BCBB8A2A2A6AE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_GutterRat_Anim_AnimGraphNode_BlendListByInt_3167D7AB4B3E6BE1D83D0AA17B00C684();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintBeginPlay();
	void OnFacingChanged(bool bForced);
	void OnAnimStartRequest(class UAnimID* AnimID);
	void ExecuteUbergraph_BP_GutterRat_Anim(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GutterRat_Anim_C">();
	}
	static class UBP_GutterRat_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GutterRat_Anim_C>();
	}
};
static_assert(alignof(UBP_GutterRat_Anim_C) == 0x000010, "Wrong alignment on UBP_GutterRat_Anim_C");
static_assert(sizeof(UBP_GutterRat_Anim_C) == 0x004E20, "Wrong size on UBP_GutterRat_Anim_C");
static_assert(offsetof(UBP_GutterRat_Anim_C, UberGraphFrame) == 0x0006A0, "Member 'UBP_GutterRat_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_47) == 0x0006D8, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_47' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_46) == 0x000758, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_46' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_45) == 0x0007D8, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_45' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_BlendListByInt_4) == 0x000858, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_BlendListByInt_4' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_44) == 0x000900, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_44' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_43) == 0x000980, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_43' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_42) == 0x000A00, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_42' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_41) == 0x000A80, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_41' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_TwoWayBlend_1) == 0x000B00, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_TwoWayBlend_1' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_BlendListByInt_3) == 0x000BC8, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_BlendListByInt_3' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_UseCachedPose_6) == 0x000C70, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_40) == 0x000C98, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_40' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_39) == 0x000D18, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_39' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_38) == 0x000D98, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_38' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_37) == 0x000E18, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_37' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_36) == 0x000E98, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_36' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_35) == 0x000F18, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_35' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_34) == 0x000F98, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_34' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_33) == 0x001018, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_33' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_32) == 0x001098, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_32' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_MirrorBones) == 0x001118, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_MirrorBones' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_ModifyBone_5) == 0x001160, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_LocalToComponentSpace_1) == 0x001268, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x001288, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_ModifyBone_4) == 0x0012A8, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_ModifyBone_3) == 0x0013B0, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_ModifyBone_2) == 0x0014B8, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_ModifyBone_1) == 0x0015C0, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_ModifyBone) == 0x0016C8, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_UseCachedPose_5) == 0x0017D0, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_31) == 0x0017F8, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_31' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_30) == 0x001878, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_30' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_29) == 0x0018F8, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_29' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_BlendListByInt_2) == 0x001978, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_BlendListByInt_2' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_28) == 0x001A20, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_28' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_27) == 0x001AA0, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_27' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_26) == 0x001B20, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_26' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_25) == 0x001BA0, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_25' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_KawaiiPhysics_9) == 0x001C20, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_KawaiiPhysics_9' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_LocalToComponentSpace) == 0x001E70, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_ComponentToLocalSpace) == 0x001E90, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_KawaiiPhysics_8) == 0x001EB0, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_KawaiiPhysics_7) == 0x002100, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_KawaiiPhysics_6) == 0x002350, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_KawaiiPhysics_5) == 0x0025A0, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_KawaiiPhysics_4) == 0x0027F0, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_KawaiiPhysics_3) == 0x002A40, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_KawaiiPhysics_2) == 0x002C90, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_KawaiiPhysics_1) == 0x002EE0, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_KawaiiPhysics) == 0x003130, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_24) == 0x003380, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_24' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_BlendListByInt_1) == 0x003400, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_BlendListByInt_1' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SaveCachedPose_1) == 0x0034A8, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_23) == 0x003600, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_23' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SaveCachedPose) == 0x003680, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_UseCachedPose_4) == 0x0037D8, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_UseCachedPose_3) == 0x003800, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_UseCachedPose_2) == 0x003828, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_22) == 0x003850, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_22' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_21) == 0x0038D0, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_21' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_20) == 0x003950, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_20' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_19) == 0x0039D0, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_19' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_HitReactionFourLegs_3) == 0x003A50, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_HitReactionFourLegs_3' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_HitReactionFourLegs_2) == 0x003C70, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_HitReactionFourLegs_2' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_18) == 0x003E90, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_18' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_17) == 0x003F10, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_17' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_UseCachedPose_1) == 0x003F90, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_UseCachedPose) == 0x003FB8, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_HitReactionFourLegs_1) == 0x003FE0, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_HitReactionFourLegs_1' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_HitReactionFourLegs) == 0x004200, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_HitReactionFourLegs' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_16) == 0x004420, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_16' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_15) == 0x0044A0, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_15' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_14) == 0x004520, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_14' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_13) == 0x0045A0, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_13' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_BlendListByInt) == 0x004620, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_12) == 0x0046C8, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_12' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_11) == 0x004748, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_11' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_10) == 0x0047C8, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_TwoWayBlend) == 0x004848, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_9) == 0x004910, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_8) == 0x004990, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_7) == 0x004A10, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_6) == 0x004A90, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_5) == 0x004B10, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_4) == 0x004B90, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_3) == 0x004C10, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_2) == 0x004C90, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer_1) == 0x004D10, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AnimGraphNode_SequencePlayer) == 0x004D90, "Member 'UBP_GutterRat_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, DieSequenceIndex) == 0x004E10, "Member 'UBP_GutterRat_Anim_C::DieSequenceIndex' has a wrong offset!");
static_assert(offsetof(UBP_GutterRat_Anim_C, AdditiveHitAnimIx) == 0x004E14, "Member 'UBP_GutterRat_Anim_C::AdditiveHitAnimIx' has a wrong offset!");

}

