#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GoldFragment_Normal

#include "Basic.hpp"

#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GoldFragment_Normal.BP_GoldFragment_Normal_C
// 0x0018 (0x0800 - 0x07E8)
class ABP_GoldFragment_Normal_C final : public ALootFragmentActor
{
public:
	class UBoxComponent*                          BoundBox;                                          // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GoldFragment_Normal_C">();
	}
	static class ABP_GoldFragment_Normal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GoldFragment_Normal_C>();
	}
};
static_assert(alignof(ABP_GoldFragment_Normal_C) == 0x000008, "Wrong alignment on ABP_GoldFragment_Normal_C");
static_assert(sizeof(ABP_GoldFragment_Normal_C) == 0x000800, "Wrong size on ABP_GoldFragment_Normal_C");
static_assert(offsetof(ABP_GoldFragment_Normal_C, BoundBox) == 0x0007E8, "Member 'ABP_GoldFragment_Normal_C::BoundBox' has a wrong offset!");
static_assert(offsetof(ABP_GoldFragment_Normal_C, ParticleSystem) == 0x0007F0, "Member 'ABP_GoldFragment_Normal_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABP_GoldFragment_Normal_C, DefaultSceneRoot) == 0x0007F8, "Member 'ABP_GoldFragment_Normal_C::DefaultSceneRoot' has a wrong offset!");

}

