#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GreenEye_PoisonTrail

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GreenEye_PoisonTrail.BP_GreenEye_PoisonTrail_C
// 0x0020 (0x07F8 - 0x07D8)
class ABP_GreenEye_PoisonTrail_C final : public AGreenEyePoisonActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHitBox*                                HitBox;                                            // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          VE;                                                // 0x07F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_GreenEye_PoisonTrail(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GreenEye_PoisonTrail_C">();
	}
	static class ABP_GreenEye_PoisonTrail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GreenEye_PoisonTrail_C>();
	}
};
static_assert(alignof(ABP_GreenEye_PoisonTrail_C) == 0x000008, "Wrong alignment on ABP_GreenEye_PoisonTrail_C");
static_assert(sizeof(ABP_GreenEye_PoisonTrail_C) == 0x0007F8, "Wrong size on ABP_GreenEye_PoisonTrail_C");
static_assert(offsetof(ABP_GreenEye_PoisonTrail_C, UberGraphFrame) == 0x0007D8, "Member 'ABP_GreenEye_PoisonTrail_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GreenEye_PoisonTrail_C, HitBox) == 0x0007E0, "Member 'ABP_GreenEye_PoisonTrail_C::HitBox' has a wrong offset!");
static_assert(offsetof(ABP_GreenEye_PoisonTrail_C, DefaultSceneRoot) == 0x0007E8, "Member 'ABP_GreenEye_PoisonTrail_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_GreenEye_PoisonTrail_C, VE) == 0x0007F0, "Member 'ABP_GreenEye_PoisonTrail_C::VE' has a wrong offset!");

}

