#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GeneralLightBrandStatusEffect

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GeneralLightBrandStatusEffect.BP_GeneralLightBrandStatusEffect_C.ExecuteUbergraph_BP_GeneralLightBrandStatusEffect
// 0x0028 (0x0028 - 0x0000)
struct BP_GeneralLightBrandStatusEffect_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMandragoraGameMode*                    CallFunc_GetGameMode_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_CustomName;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GeneralLightBrandStatusEffect_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffect) == 0x000008, "Wrong alignment on BP_GeneralLightBrandStatusEffect_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffect");
static_assert(sizeof(BP_GeneralLightBrandStatusEffect_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffect) == 0x000028, "Wrong size on BP_GeneralLightBrandStatusEffect_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffect");
static_assert(offsetof(BP_GeneralLightBrandStatusEffect_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffect, EntryPoint) == 0x000000, "Member 'BP_GeneralLightBrandStatusEffect_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GeneralLightBrandStatusEffect_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffect, CallFunc_GetGameMode_ReturnValue) == 0x000008, "Member 'BP_GeneralLightBrandStatusEffect_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffect::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GeneralLightBrandStatusEffect_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffect, K2Node_Event_CustomName) == 0x000010, "Member 'BP_GeneralLightBrandStatusEffect_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffect::K2Node_Event_CustomName' has a wrong offset!");
static_assert(offsetof(BP_GeneralLightBrandStatusEffect_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffect, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000018, "Member 'BP_GeneralLightBrandStatusEffect_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffect::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GeneralLightBrandStatusEffect_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffect, K2Node_SwitchName_CmpSuccess) == 0x000020, "Member 'BP_GeneralLightBrandStatusEffect_C_ExecuteUbergraph_BP_GeneralLightBrandStatusEffect::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function BP_GeneralLightBrandStatusEffect.BP_GeneralLightBrandStatusEffect_C.BPAbilityCustomEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_GeneralLightBrandStatusEffect_C_BPAbilityCustomEvent final
{
public:
	class FName                                   CustomName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GeneralLightBrandStatusEffect_C_BPAbilityCustomEvent) == 0x000004, "Wrong alignment on BP_GeneralLightBrandStatusEffect_C_BPAbilityCustomEvent");
static_assert(sizeof(BP_GeneralLightBrandStatusEffect_C_BPAbilityCustomEvent) == 0x000008, "Wrong size on BP_GeneralLightBrandStatusEffect_C_BPAbilityCustomEvent");
static_assert(offsetof(BP_GeneralLightBrandStatusEffect_C_BPAbilityCustomEvent, CustomName) == 0x000000, "Member 'BP_GeneralLightBrandStatusEffect_C_BPAbilityCustomEvent::CustomName' has a wrong offset!");

}

