#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GutterRat_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_GutterRat_Anim.BP_GutterRat_Anim_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct BP_GutterRat_Anim_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BP_GutterRat_Anim_C_AnimGraph) == 0x000008, "Wrong alignment on BP_GutterRat_Anim_C_AnimGraph");
static_assert(sizeof(BP_GutterRat_Anim_C_AnimGraph) == 0x000010, "Wrong size on BP_GutterRat_Anim_C_AnimGraph");
static_assert(offsetof(BP_GutterRat_Anim_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'BP_GutterRat_Anim_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function BP_GutterRat_Anim.BP_GutterRat_Anim_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct BP_GutterRat_Anim_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GutterRat_Anim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on BP_GutterRat_Anim_C_BlueprintUpdateAnimation");
static_assert(sizeof(BP_GutterRat_Anim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on BP_GutterRat_Anim_C_BlueprintUpdateAnimation");
static_assert(offsetof(BP_GutterRat_Anim_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'BP_GutterRat_Anim_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function BP_GutterRat_Anim.BP_GutterRat_Anim_C.OnFacingChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_GutterRat_Anim_C_OnFacingChanged final
{
public:
	bool                                          bForced;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GutterRat_Anim_C_OnFacingChanged) == 0x000001, "Wrong alignment on BP_GutterRat_Anim_C_OnFacingChanged");
static_assert(sizeof(BP_GutterRat_Anim_C_OnFacingChanged) == 0x000001, "Wrong size on BP_GutterRat_Anim_C_OnFacingChanged");
static_assert(offsetof(BP_GutterRat_Anim_C_OnFacingChanged, bForced) == 0x000000, "Member 'BP_GutterRat_Anim_C_OnFacingChanged::bForced' has a wrong offset!");

// Function BP_GutterRat_Anim.BP_GutterRat_Anim_C.OnAnimStartRequest
// 0x0008 (0x0008 - 0x0000)
struct BP_GutterRat_Anim_C_OnAnimStartRequest final
{
public:
	class UAnimID*                                AnimID;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GutterRat_Anim_C_OnAnimStartRequest) == 0x000008, "Wrong alignment on BP_GutterRat_Anim_C_OnAnimStartRequest");
static_assert(sizeof(BP_GutterRat_Anim_C_OnAnimStartRequest) == 0x000008, "Wrong size on BP_GutterRat_Anim_C_OnAnimStartRequest");
static_assert(offsetof(BP_GutterRat_Anim_C_OnAnimStartRequest, AnimID) == 0x000000, "Member 'BP_GutterRat_Anim_C_OnAnimStartRequest::AnimID' has a wrong offset!");

// Function BP_GutterRat_Anim.BP_GutterRat_Anim_C.ExecuteUbergraph_BP_GutterRat_Anim
// 0x00C8 (0x00C8 - 0x0000)
struct BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_4;                // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bForced;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_5;                // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue_5;                 // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFacing_ReturnValue;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimToggled_ReturnValue;                // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimToggled_ReturnValue_1;              // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimToggled_ReturnValue_2;              // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimToggled_ReturnValue_3;              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimToggled_ReturnValue_4;              // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimToggled_ReturnValue_5;              // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimID*                                K2Node_Event_AnimID;                               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim) == 0x000008, "Wrong alignment on BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim");
static_assert(sizeof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim) == 0x0000C8, "Wrong size on BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, EntryPoint) == 0x000000, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, CallFunc_MakeRotator_ReturnValue) == 0x000004, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, CallFunc_MakeRotator_ReturnValue_1) == 0x000010, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, CallFunc_MakeVector_ReturnValue) == 0x00001C, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, CallFunc_MakeVector_ReturnValue_1) == 0x000028, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, CallFunc_MakeRotator_ReturnValue_2) == 0x000034, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, CallFunc_MakeRotator_ReturnValue_3) == 0x000040, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::CallFunc_MakeRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, CallFunc_MakeVector_ReturnValue_2) == 0x00004C, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, CallFunc_MakeVector_ReturnValue_3) == 0x000058, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, CallFunc_MakeRotator_ReturnValue_4) == 0x000064, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::CallFunc_MakeRotator_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, CallFunc_MakeVector_ReturnValue_4) == 0x000070, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::CallFunc_MakeVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, CallFunc_SelectInt_ReturnValue) == 0x00007C, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, CallFunc_SelectFloat_ReturnValue) == 0x000080, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, K2Node_Event_DeltaTimeX) == 0x000084, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, K2Node_Event_bForced) == 0x000088, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::K2Node_Event_bForced' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, CallFunc_MakeRotator_ReturnValue_5) == 0x00008C, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::CallFunc_MakeRotator_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, CallFunc_MakeVector_ReturnValue_5) == 0x000098, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::CallFunc_MakeVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, CallFunc_GetFacing_ReturnValue) == 0x0000A4, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::CallFunc_GetFacing_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0000A8, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, CallFunc_IsAnimToggled_ReturnValue) == 0x0000AC, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::CallFunc_IsAnimToggled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, CallFunc_IsAnimToggled_ReturnValue_1) == 0x0000AD, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::CallFunc_IsAnimToggled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, CallFunc_IsAnimToggled_ReturnValue_2) == 0x0000AE, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::CallFunc_IsAnimToggled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, CallFunc_BooleanOR_ReturnValue) == 0x0000AF, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, CallFunc_Not_PreBool_ReturnValue) == 0x0000B0, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, CallFunc_IsAnimToggled_ReturnValue_3) == 0x0000B1, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::CallFunc_IsAnimToggled_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, CallFunc_IsAnimToggled_ReturnValue_4) == 0x0000B2, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::CallFunc_IsAnimToggled_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, CallFunc_IsAnimToggled_ReturnValue_5) == 0x0000B3, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::CallFunc_IsAnimToggled_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, K2Node_Event_AnimID) == 0x0000B8, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::K2Node_Event_AnimID' has a wrong offset!");
static_assert(offsetof(BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000C0, "Member 'BP_GutterRat_Anim_C_ExecuteUbergraph_BP_GutterRat_Anim::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

