#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Glossary_Textblock

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Glossary_Textblock.BP_Glossary_Textblock_C
// 0x0038 (0x02F8 - 0x02C0)
class UBP_Glossary_Textblock_C final : public UGlossarySlotUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UManRichTextBlock*                      DescriptionRichText;                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Separator;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManRichTextBlock*                      Title;                                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              TitleDecorLeft;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              TitleDecorRight;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsSmallScreen;                                     // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BP_Glossary_Textblock(int32 EntryPoint);
	void OnSetSeparatorVisible(bool bInVisible);
	void OnSetSlot(const class FText& InName, const class FText& InDescription);
	void PreConstruct(bool IsDesignTime);
	void ToggleSmallScreen(bool InIsSmallScreen);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Glossary_Textblock_C">();
	}
	static class UBP_Glossary_Textblock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Glossary_Textblock_C>();
	}
};
static_assert(alignof(UBP_Glossary_Textblock_C) == 0x000008, "Wrong alignment on UBP_Glossary_Textblock_C");
static_assert(sizeof(UBP_Glossary_Textblock_C) == 0x0002F8, "Wrong size on UBP_Glossary_Textblock_C");
static_assert(offsetof(UBP_Glossary_Textblock_C, UberGraphFrame) == 0x0002C0, "Member 'UBP_Glossary_Textblock_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Glossary_Textblock_C, DescriptionRichText) == 0x0002C8, "Member 'UBP_Glossary_Textblock_C::DescriptionRichText' has a wrong offset!");
static_assert(offsetof(UBP_Glossary_Textblock_C, Separator) == 0x0002D0, "Member 'UBP_Glossary_Textblock_C::Separator' has a wrong offset!");
static_assert(offsetof(UBP_Glossary_Textblock_C, Title) == 0x0002D8, "Member 'UBP_Glossary_Textblock_C::Title' has a wrong offset!");
static_assert(offsetof(UBP_Glossary_Textblock_C, TitleDecorLeft) == 0x0002E0, "Member 'UBP_Glossary_Textblock_C::TitleDecorLeft' has a wrong offset!");
static_assert(offsetof(UBP_Glossary_Textblock_C, TitleDecorRight) == 0x0002E8, "Member 'UBP_Glossary_Textblock_C::TitleDecorRight' has a wrong offset!");
static_assert(offsetof(UBP_Glossary_Textblock_C, IsSmallScreen) == 0x0002F0, "Member 'UBP_Glossary_Textblock_C::IsSmallScreen' has a wrong offset!");

}

