#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GooseFly

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GooseFly.BP_GooseFly_C
// 0x0030 (0x0808 - 0x07D8)
class ABP_GooseFly_C final : public AActorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           AkComponent;                                       // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GooseFly_Anim_C*                    Goose_Anim;                                        // 0x07F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Idle_Bridge_Chance;                                // 0x07F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Idle_Bridge_Start_Timer;                           // 0x07FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UAnimSequence*                          FlySequence;                                       // 0x0800(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_GooseFly(int32 EntryPoint);
	void FlyAway_Trigger(float Delay);
	void Done();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GooseFly_C">();
	}
	static class ABP_GooseFly_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GooseFly_C>();
	}
};
static_assert(alignof(ABP_GooseFly_C) == 0x000008, "Wrong alignment on ABP_GooseFly_C");
static_assert(sizeof(ABP_GooseFly_C) == 0x000808, "Wrong size on ABP_GooseFly_C");
static_assert(offsetof(ABP_GooseFly_C, UberGraphFrame) == 0x0007D8, "Member 'ABP_GooseFly_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GooseFly_C, AkComponent) == 0x0007E0, "Member 'ABP_GooseFly_C::AkComponent' has a wrong offset!");
static_assert(offsetof(ABP_GooseFly_C, SkeletalMesh) == 0x0007E8, "Member 'ABP_GooseFly_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_GooseFly_C, Goose_Anim) == 0x0007F0, "Member 'ABP_GooseFly_C::Goose_Anim' has a wrong offset!");
static_assert(offsetof(ABP_GooseFly_C, Idle_Bridge_Chance) == 0x0007F8, "Member 'ABP_GooseFly_C::Idle_Bridge_Chance' has a wrong offset!");
static_assert(offsetof(ABP_GooseFly_C, Idle_Bridge_Start_Timer) == 0x0007FC, "Member 'ABP_GooseFly_C::Idle_Bridge_Start_Timer' has a wrong offset!");
static_assert(offsetof(ABP_GooseFly_C, FlySequence) == 0x000800, "Member 'ABP_GooseFly_C::FlySequence' has a wrong offset!");

}

