#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GrabLine

#include "Basic.hpp"

#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GrabLine.BP_GrabLine_C
// 0x0018 (0x0268 - 0x0250)
class ABP_GrabLine_C final : public AGrabLine
{
public:
	class UStaticMeshComponent*                   EdgePlane;                                         // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_GrabPoint;                                      // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GrabLine_C">();
	}
	static class ABP_GrabLine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GrabLine_C>();
	}
};
static_assert(alignof(ABP_GrabLine_C) == 0x000008, "Wrong alignment on ABP_GrabLine_C");
static_assert(sizeof(ABP_GrabLine_C) == 0x000268, "Wrong size on ABP_GrabLine_C");
static_assert(offsetof(ABP_GrabLine_C, EdgePlane) == 0x000250, "Member 'ABP_GrabLine_C::EdgePlane' has a wrong offset!");
static_assert(offsetof(ABP_GrabLine_C, NS_GrabPoint) == 0x000258, "Member 'ABP_GrabLine_C::NS_GrabPoint' has a wrong offset!");
static_assert(offsetof(ABP_GrabLine_C, Cube) == 0x000260, "Member 'ABP_GrabLine_C::Cube' has a wrong offset!");

}

