#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GooseWalk

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GooseWalk.BP_GooseWalk_C.ExecuteUbergraph_BP_GooseWalk
// 0x0020 (0x0020 - 0x0000)
struct BP_GooseWalk_C_ExecuteUbergraph_BP_GooseWalk final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_GooseWalk_Anim_C*                   K2Node_DynamicCast_AsBP_Goose_Walk_Anim;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Delay;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GooseWalk_C_ExecuteUbergraph_BP_GooseWalk) == 0x000008, "Wrong alignment on BP_GooseWalk_C_ExecuteUbergraph_BP_GooseWalk");
static_assert(sizeof(BP_GooseWalk_C_ExecuteUbergraph_BP_GooseWalk) == 0x000020, "Wrong size on BP_GooseWalk_C_ExecuteUbergraph_BP_GooseWalk");
static_assert(offsetof(BP_GooseWalk_C_ExecuteUbergraph_BP_GooseWalk, EntryPoint) == 0x000000, "Member 'BP_GooseWalk_C_ExecuteUbergraph_BP_GooseWalk::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GooseWalk_C_ExecuteUbergraph_BP_GooseWalk, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'BP_GooseWalk_C_ExecuteUbergraph_BP_GooseWalk::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GooseWalk_C_ExecuteUbergraph_BP_GooseWalk, K2Node_DynamicCast_AsBP_Goose_Walk_Anim) == 0x000010, "Member 'BP_GooseWalk_C_ExecuteUbergraph_BP_GooseWalk::K2Node_DynamicCast_AsBP_Goose_Walk_Anim' has a wrong offset!");
static_assert(offsetof(BP_GooseWalk_C_ExecuteUbergraph_BP_GooseWalk, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_GooseWalk_C_ExecuteUbergraph_BP_GooseWalk::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GooseWalk_C_ExecuteUbergraph_BP_GooseWalk, K2Node_CustomEvent_Delay) == 0x00001C, "Member 'BP_GooseWalk_C_ExecuteUbergraph_BP_GooseWalk::K2Node_CustomEvent_Delay' has a wrong offset!");

// Function BP_GooseWalk.BP_GooseWalk_C.WalkAway_Trigger
// 0x0004 (0x0004 - 0x0000)
struct BP_GooseWalk_C_WalkAway_Trigger final
{
public:
	float                                         Delay;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GooseWalk_C_WalkAway_Trigger) == 0x000004, "Wrong alignment on BP_GooseWalk_C_WalkAway_Trigger");
static_assert(sizeof(BP_GooseWalk_C_WalkAway_Trigger) == 0x000004, "Wrong size on BP_GooseWalk_C_WalkAway_Trigger");
static_assert(offsetof(BP_GooseWalk_C_WalkAway_Trigger, Delay) == 0x000000, "Member 'BP_GooseWalk_C_WalkAway_Trigger::Delay' has a wrong offset!");

}

