#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_General_OnPreInteract

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_General_OnPreInteract.BP_General_OnPreInteract_C.ExecuteUbergraph_BP_General_OnPreInteract
// 0x0048 (0x0048 - 0x0000)
struct BP_General_OnPreInteract_C_ExecuteUbergraph_BP_General_OnPreInteract final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetActor_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActorBase*                             K2Node_DynamicCast_AsActor_Base;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUDUserWidget*                         CallFunc_BPGetHudWidget_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHUDUserWidget*                         CallFunc_BPGetHudWidget_ReturnValue_1;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_BPGetInteractText_ReturnValue;            // 0x0030(0x0018)()
};
static_assert(alignof(BP_General_OnPreInteract_C_ExecuteUbergraph_BP_General_OnPreInteract) == 0x000008, "Wrong alignment on BP_General_OnPreInteract_C_ExecuteUbergraph_BP_General_OnPreInteract");
static_assert(sizeof(BP_General_OnPreInteract_C_ExecuteUbergraph_BP_General_OnPreInteract) == 0x000048, "Wrong size on BP_General_OnPreInteract_C_ExecuteUbergraph_BP_General_OnPreInteract");
static_assert(offsetof(BP_General_OnPreInteract_C_ExecuteUbergraph_BP_General_OnPreInteract, EntryPoint) == 0x000000, "Member 'BP_General_OnPreInteract_C_ExecuteUbergraph_BP_General_OnPreInteract::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_General_OnPreInteract_C_ExecuteUbergraph_BP_General_OnPreInteract, CallFunc_GetActor_ReturnValue) == 0x000008, "Member 'BP_General_OnPreInteract_C_ExecuteUbergraph_BP_General_OnPreInteract::CallFunc_GetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_General_OnPreInteract_C_ExecuteUbergraph_BP_General_OnPreInteract, K2Node_DynamicCast_AsActor_Base) == 0x000010, "Member 'BP_General_OnPreInteract_C_ExecuteUbergraph_BP_General_OnPreInteract::K2Node_DynamicCast_AsActor_Base' has a wrong offset!");
static_assert(offsetof(BP_General_OnPreInteract_C_ExecuteUbergraph_BP_General_OnPreInteract, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_General_OnPreInteract_C_ExecuteUbergraph_BP_General_OnPreInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_General_OnPreInteract_C_ExecuteUbergraph_BP_General_OnPreInteract, CallFunc_BPGetHudWidget_ReturnValue) == 0x000020, "Member 'BP_General_OnPreInteract_C_ExecuteUbergraph_BP_General_OnPreInteract::CallFunc_BPGetHudWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_General_OnPreInteract_C_ExecuteUbergraph_BP_General_OnPreInteract, CallFunc_BPGetHudWidget_ReturnValue_1) == 0x000028, "Member 'BP_General_OnPreInteract_C_ExecuteUbergraph_BP_General_OnPreInteract::CallFunc_BPGetHudWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_General_OnPreInteract_C_ExecuteUbergraph_BP_General_OnPreInteract, CallFunc_BPGetInteractText_ReturnValue) == 0x000030, "Member 'BP_General_OnPreInteract_C_ExecuteUbergraph_BP_General_OnPreInteract::CallFunc_BPGetInteractText_ReturnValue' has a wrong offset!");

}

