#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GeneralQuest_Interact

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GeneralQuest_Interact.BP_GeneralQuest_Interact_C
// 0x0028 (0x0800 - 0x07D8)
class ABP_GeneralQuest_Interact_C final : public AActorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_InteractPrompWidgetComponent_C*     BP_InteractPrompWidgetComponent;                   // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoundingBoxComponent*                  BoundingBox;                                       // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void CustomEvent_0(class UAbilityBase* pAbility, bool bDesired);
	void ExecuteUbergraph_BP_GeneralQuest_Interact(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GeneralQuest_Interact_C">();
	}
	static class ABP_GeneralQuest_Interact_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GeneralQuest_Interact_C>();
	}
};
static_assert(alignof(ABP_GeneralQuest_Interact_C) == 0x000008, "Wrong alignment on ABP_GeneralQuest_Interact_C");
static_assert(sizeof(ABP_GeneralQuest_Interact_C) == 0x000800, "Wrong size on ABP_GeneralQuest_Interact_C");
static_assert(offsetof(ABP_GeneralQuest_Interact_C, UberGraphFrame) == 0x0007D8, "Member 'ABP_GeneralQuest_Interact_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GeneralQuest_Interact_C, Niagara) == 0x0007E0, "Member 'ABP_GeneralQuest_Interact_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_GeneralQuest_Interact_C, BP_InteractPrompWidgetComponent) == 0x0007E8, "Member 'ABP_GeneralQuest_Interact_C::BP_InteractPrompWidgetComponent' has a wrong offset!");
static_assert(offsetof(ABP_GeneralQuest_Interact_C, BoundingBox) == 0x0007F0, "Member 'ABP_GeneralQuest_Interact_C::BoundingBox' has a wrong offset!");
static_assert(offsetof(ABP_GeneralQuest_Interact_C, SkeletalMesh) == 0x0007F8, "Member 'ABP_GeneralQuest_Interact_C::SkeletalMesh' has a wrong offset!");

}

