#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GrabPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GrabPoint.BP_GrabPoint_C
// 0x0030 (0x02E0 - 0x02B0)
class ABP_GrabPoint_C final : public AGrabPoint
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_GrabPoint;                                      // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere;                                            // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HighlightOffset;                                   // 0x02C8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HighlightSize;                                     // 0x02D4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_GrabPoint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GrabPoint_C">();
	}
	static class ABP_GrabPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GrabPoint_C>();
	}
};
static_assert(alignof(ABP_GrabPoint_C) == 0x000008, "Wrong alignment on ABP_GrabPoint_C");
static_assert(sizeof(ABP_GrabPoint_C) == 0x0002E0, "Wrong size on ABP_GrabPoint_C");
static_assert(offsetof(ABP_GrabPoint_C, UberGraphFrame) == 0x0002B0, "Member 'ABP_GrabPoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GrabPoint_C, NS_GrabPoint) == 0x0002B8, "Member 'ABP_GrabPoint_C::NS_GrabPoint' has a wrong offset!");
static_assert(offsetof(ABP_GrabPoint_C, Sphere) == 0x0002C0, "Member 'ABP_GrabPoint_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_GrabPoint_C, HighlightOffset) == 0x0002C8, "Member 'ABP_GrabPoint_C::HighlightOffset' has a wrong offset!");
static_assert(offsetof(ABP_GrabPoint_C, HighlightSize) == 0x0002D4, "Member 'ABP_GrabPoint_C::HighlightSize' has a wrong offset!");

}

