#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GoatCaravan

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Dudley_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GoatCaravan.BP_GoatCaravan_C
// 0x0038 (0x0850 - 0x0818)
class ABP_GoatCaravan_C final : public ABP_Dudley_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_GoatCaravan_C;                   // 0x0818(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           AkHead;                                            // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGroomComponent*                        Groom;                                             // 0x0828(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Crow_Anim_C*                        Crow_Anim;                                         // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Idle_Bridge_Chance;                                // 0x0838(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Idle_Bridge_Start_Timer;                           // 0x083C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Direction;                                         // 0x0840(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_844[0x4];                                      // 0x0844(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 SK_Goat;                                           // 0x0848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void VisualVolumeEnter(class ALevelVisualVolume* Volume);
	void ExecuteUbergraph_BP_GoatCaravan(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GoatCaravan_C">();
	}
	static class ABP_GoatCaravan_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GoatCaravan_C>();
	}
};
static_assert(alignof(ABP_GoatCaravan_C) == 0x000008, "Wrong alignment on ABP_GoatCaravan_C");
static_assert(sizeof(ABP_GoatCaravan_C) == 0x000850, "Wrong size on ABP_GoatCaravan_C");
static_assert(offsetof(ABP_GoatCaravan_C, UberGraphFrame_BP_GoatCaravan_C) == 0x000818, "Member 'ABP_GoatCaravan_C::UberGraphFrame_BP_GoatCaravan_C' has a wrong offset!");
static_assert(offsetof(ABP_GoatCaravan_C, AkHead) == 0x000820, "Member 'ABP_GoatCaravan_C::AkHead' has a wrong offset!");
static_assert(offsetof(ABP_GoatCaravan_C, Groom) == 0x000828, "Member 'ABP_GoatCaravan_C::Groom' has a wrong offset!");
static_assert(offsetof(ABP_GoatCaravan_C, Crow_Anim) == 0x000830, "Member 'ABP_GoatCaravan_C::Crow_Anim' has a wrong offset!");
static_assert(offsetof(ABP_GoatCaravan_C, Idle_Bridge_Chance) == 0x000838, "Member 'ABP_GoatCaravan_C::Idle_Bridge_Chance' has a wrong offset!");
static_assert(offsetof(ABP_GoatCaravan_C, Idle_Bridge_Start_Timer) == 0x00083C, "Member 'ABP_GoatCaravan_C::Idle_Bridge_Start_Timer' has a wrong offset!");
static_assert(offsetof(ABP_GoatCaravan_C, Direction) == 0x000840, "Member 'ABP_GoatCaravan_C::Direction' has a wrong offset!");
static_assert(offsetof(ABP_GoatCaravan_C, SK_Goat) == 0x000848, "Member 'ABP_GoatCaravan_C::SK_Goat' has a wrong offset!");

}

