#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GoatCaravan

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GoatCaravan.BP_GoatCaravan_C.VisualVolumeEnter
// 0x0008 (0x0008 - 0x0000)
struct BP_GoatCaravan_C_VisualVolumeEnter final
{
public:
	class ALevelVisualVolume*                     Volume;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GoatCaravan_C_VisualVolumeEnter) == 0x000008, "Wrong alignment on BP_GoatCaravan_C_VisualVolumeEnter");
static_assert(sizeof(BP_GoatCaravan_C_VisualVolumeEnter) == 0x000008, "Wrong size on BP_GoatCaravan_C_VisualVolumeEnter");
static_assert(offsetof(BP_GoatCaravan_C_VisualVolumeEnter, Volume) == 0x000000, "Member 'BP_GoatCaravan_C_VisualVolumeEnter::Volume' has a wrong offset!");

// Function BP_GoatCaravan.BP_GoatCaravan_C.ExecuteUbergraph_BP_GoatCaravan
// 0x0048 (0x0048 - 0x0000)
struct BP_GoatCaravan_C_ExecuteUbergraph_BP_GoatCaravan final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ALevelVisualVolume* Volume)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UBP_GoatCaravan_Anim_C*                 K2Node_DynamicCast_AsBP_Goat_Caravan_Anim;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelVisualVolume*                     K2Node_CustomEvent_Volume;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GoatCaravan_C_ExecuteUbergraph_BP_GoatCaravan) == 0x000008, "Wrong alignment on BP_GoatCaravan_C_ExecuteUbergraph_BP_GoatCaravan");
static_assert(sizeof(BP_GoatCaravan_C_ExecuteUbergraph_BP_GoatCaravan) == 0x000048, "Wrong size on BP_GoatCaravan_C_ExecuteUbergraph_BP_GoatCaravan");
static_assert(offsetof(BP_GoatCaravan_C_ExecuteUbergraph_BP_GoatCaravan, EntryPoint) == 0x000000, "Member 'BP_GoatCaravan_C_ExecuteUbergraph_BP_GoatCaravan::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GoatCaravan_C_ExecuteUbergraph_BP_GoatCaravan, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'BP_GoatCaravan_C_ExecuteUbergraph_BP_GoatCaravan::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GoatCaravan_C_ExecuteUbergraph_BP_GoatCaravan, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_GoatCaravan_C_ExecuteUbergraph_BP_GoatCaravan::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GoatCaravan_C_ExecuteUbergraph_BP_GoatCaravan, K2Node_DynamicCast_AsBP_Goat_Caravan_Anim) == 0x000020, "Member 'BP_GoatCaravan_C_ExecuteUbergraph_BP_GoatCaravan::K2Node_DynamicCast_AsBP_Goat_Caravan_Anim' has a wrong offset!");
static_assert(offsetof(BP_GoatCaravan_C_ExecuteUbergraph_BP_GoatCaravan, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_GoatCaravan_C_ExecuteUbergraph_BP_GoatCaravan::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GoatCaravan_C_ExecuteUbergraph_BP_GoatCaravan, K2Node_CustomEvent_Volume) == 0x000030, "Member 'BP_GoatCaravan_C_ExecuteUbergraph_BP_GoatCaravan::K2Node_CustomEvent_Volume' has a wrong offset!");
static_assert(offsetof(BP_GoatCaravan_C_ExecuteUbergraph_BP_GoatCaravan, CallFunc_GetManGameMode_ReturnValue) == 0x000038, "Member 'BP_GoatCaravan_C_ExecuteUbergraph_BP_GoatCaravan::CallFunc_GetManGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GoatCaravan_C_ExecuteUbergraph_BP_GoatCaravan, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000040, "Member 'BP_GoatCaravan_C_ExecuteUbergraph_BP_GoatCaravan::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

}

