#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GooseWalk_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_GooseWalk_Anim.BP_GooseWalk_Anim_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct BP_GooseWalk_Anim_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BP_GooseWalk_Anim_C_AnimGraph) == 0x000008, "Wrong alignment on BP_GooseWalk_Anim_C_AnimGraph");
static_assert(sizeof(BP_GooseWalk_Anim_C_AnimGraph) == 0x000010, "Wrong size on BP_GooseWalk_Anim_C_AnimGraph");
static_assert(offsetof(BP_GooseWalk_Anim_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'BP_GooseWalk_Anim_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function BP_GooseWalk_Anim.BP_GooseWalk_Anim_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct BP_GooseWalk_Anim_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GooseWalk_Anim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on BP_GooseWalk_Anim_C_BlueprintUpdateAnimation");
static_assert(sizeof(BP_GooseWalk_Anim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on BP_GooseWalk_Anim_C_BlueprintUpdateAnimation");
static_assert(offsetof(BP_GooseWalk_Anim_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'BP_GooseWalk_Anim_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function BP_GooseWalk_Anim.BP_GooseWalk_Anim_C.ExecuteUbergraph_BP_GooseWalk_Anim
// 0x00A0 (0x00A0 - 0x0000)
struct BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomInteger_ReturnValue_1;              // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimToggled_ReturnValue;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim) == 0x000010, "Wrong alignment on BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim");
static_assert(sizeof(BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim) == 0x0000A0, "Wrong size on BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim");
static_assert(offsetof(BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim, EntryPoint) == 0x000000, "Member 'BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim, CallFunc_GetOwningComponent_ReturnValue) == 0x000008, "Member 'BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000010, "Member 'BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim, CallFunc_GetSocketTransform_ReturnValue) == 0x000020, "Member 'BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000050, "Member 'BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim, CallFunc_BreakTransform_Location) == 0x000054, "Member 'BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim, CallFunc_BreakTransform_Rotation) == 0x000060, "Member 'BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim, CallFunc_BreakTransform_Scale) == 0x00006C, "Member 'BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim, K2Node_Event_DeltaTimeX) == 0x000078, "Member 'BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim, CallFunc_Add_FloatFloat_ReturnValue) == 0x00007C, "Member 'BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000080, "Member 'BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim, CallFunc_RandomInteger_ReturnValue) == 0x000084, "Member 'BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim, CallFunc_RandomInteger_ReturnValue_1) == 0x00008C, "Member 'BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim::CallFunc_RandomInteger_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim, CallFunc_IsAnimToggled_ReturnValue) == 0x000090, "Member 'BP_GooseWalk_Anim_C_ExecuteUbergraph_BP_GooseWalk_Anim::CallFunc_IsAnimToggled_ReturnValue' has a wrong offset!");

}

