#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GeneralLightBrandStatusEffectVisual

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GeneralLightBrandStatusEffectVisual.BP_GeneralLightBrandStatusEffectVisual_C
// 0x0020 (0x0650 - 0x0630)
class UBP_GeneralLightBrandStatusEffectVisual_C final : public UEmptyPassiveAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0630(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Owner;                                             // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverrideFound;                                     // 0x0640(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_641[0x7];                                      // 0x0641(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVisualEntity*                          VisualEntity;                                      // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_GeneralLightBrandStatusEffectVisual(int32 EntryPoint);
	void BPOnEnd();
	void BPOnStart();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GeneralLightBrandStatusEffectVisual_C">();
	}
	static class UBP_GeneralLightBrandStatusEffectVisual_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GeneralLightBrandStatusEffectVisual_C>();
	}
};
static_assert(alignof(UBP_GeneralLightBrandStatusEffectVisual_C) == 0x000008, "Wrong alignment on UBP_GeneralLightBrandStatusEffectVisual_C");
static_assert(sizeof(UBP_GeneralLightBrandStatusEffectVisual_C) == 0x000650, "Wrong size on UBP_GeneralLightBrandStatusEffectVisual_C");
static_assert(offsetof(UBP_GeneralLightBrandStatusEffectVisual_C, UberGraphFrame) == 0x000630, "Member 'UBP_GeneralLightBrandStatusEffectVisual_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_GeneralLightBrandStatusEffectVisual_C, Owner) == 0x000638, "Member 'UBP_GeneralLightBrandStatusEffectVisual_C::Owner' has a wrong offset!");
static_assert(offsetof(UBP_GeneralLightBrandStatusEffectVisual_C, OverrideFound) == 0x000640, "Member 'UBP_GeneralLightBrandStatusEffectVisual_C::OverrideFound' has a wrong offset!");
static_assert(offsetof(UBP_GeneralLightBrandStatusEffectVisual_C, VisualEntity) == 0x000648, "Member 'UBP_GeneralLightBrandStatusEffectVisual_C::VisualEntity' has a wrong offset!");

}

