#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GroundSlam_Trail_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GroundSlam_Trail_VisualEntity.BP_GroundSlam_Trail_VisualEntity_C
// 0x0020 (0x0370 - 0x0350)
class ABP_GroundSlam_Trail_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      SurfaceTypeVFX;                                    // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_GroundSlam_Impact;                              // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_GroundSlam_Trail_VisualEntity(int32 EntryPoint);
	void OnKill();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GroundSlam_Trail_VisualEntity_C">();
	}
	static class ABP_GroundSlam_Trail_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GroundSlam_Trail_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_GroundSlam_Trail_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_GroundSlam_Trail_VisualEntity_C");
static_assert(sizeof(ABP_GroundSlam_Trail_VisualEntity_C) == 0x000370, "Wrong size on ABP_GroundSlam_Trail_VisualEntity_C");
static_assert(offsetof(ABP_GroundSlam_Trail_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_GroundSlam_Trail_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GroundSlam_Trail_VisualEntity_C, SurfaceTypeVFX) == 0x000358, "Member 'ABP_GroundSlam_Trail_VisualEntity_C::SurfaceTypeVFX' has a wrong offset!");
static_assert(offsetof(ABP_GroundSlam_Trail_VisualEntity_C, NS_GroundSlam_Impact) == 0x000360, "Member 'ABP_GroundSlam_Trail_VisualEntity_C::NS_GroundSlam_Impact' has a wrong offset!");
static_assert(offsetof(ABP_GroundSlam_Trail_VisualEntity_C, Niagara) == 0x000368, "Member 'ABP_GroundSlam_Trail_VisualEntity_C::Niagara' has a wrong offset!");

}

