#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GeneralPoisonedStatusEffectVisual

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GeneralPoisonedStatusEffectVisual.BP_GeneralPoisonedStatusEffectVisual_C.ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual
// 0x0190 (0x0190 - 0x0000)
struct BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetGameMode_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetActor_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHeroBase*                              K2Node_DynamicCast_AsHero_Base;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue_1;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorRelativeLocation_SweepHitResult; // 0x0040(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetActorRelativeLocation_SweepHitResult_1; // 0x00C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<class USceneComponent*>                CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0150(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17A[0x2];                                      // 0x017A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual) == 0x000008, "Wrong alignment on BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual");
static_assert(sizeof(BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual) == 0x000190, "Wrong size on BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual");
static_assert(offsetof(BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual, EntryPoint) == 0x000000, "Member 'BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual, CallFunc_GetGameMode_ReturnValue) == 0x000008, "Member 'BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual, CallFunc_GetActor_ReturnValue) == 0x000010, "Member 'BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual::CallFunc_GetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual, K2Node_DynamicCast_AsHero_Base) == 0x000020, "Member 'BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual::K2Node_DynamicCast_AsHero_Base' has a wrong offset!");
static_assert(offsetof(BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000030, "Member 'BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual, CallFunc_SpawnVisualEntity_ReturnValue_1) == 0x000038, "Member 'BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual::CallFunc_SpawnVisualEntity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual, CallFunc_K2_SetActorRelativeLocation_SweepHitResult) == 0x000040, "Member 'BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual::CallFunc_K2_SetActorRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual, CallFunc_K2_SetActorRelativeLocation_SweepHitResult_1) == 0x0000C8, "Member 'BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual::CallFunc_K2_SetActorRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000150, "Member 'BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual, CallFunc_Array_Get_Item) == 0x000160, "Member 'BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual, CallFunc_GetObjectName_ReturnValue) == 0x000168, "Member 'BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual, CallFunc_IsValid_ReturnValue_2) == 0x000178, "Member 'BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000179, "Member 'BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual, CallFunc_Array_Length_ReturnValue) == 0x00017C, "Member 'BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual, Temp_int_Loop_Counter_Variable) == 0x000180, "Member 'BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual, CallFunc_Less_IntInt_ReturnValue) == 0x000184, "Member 'BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual, CallFunc_Add_IntInt_ReturnValue) == 0x000188, "Member 'BP_GeneralPoisonedStatusEffectVisual_C_ExecuteUbergraph_BP_GeneralPoisonedStatusEffectVisual::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

