#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HUD

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "man_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_HUD.BP_HUD_C.ExecuteUbergraph_BP_HUD
// 0x02B8 (0x02B8 - 0x0000)
struct BP_HUD_C_ExecuteUbergraph_BP_HUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UManUserWidgetBase* ManUserWidgetBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UTutorialScreenUserWidget*              CallFunc_ShowTutorialScreen_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue_1;    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UManQuest*                              K2Node_Event_ManQuest_2;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UManQuestObjective*>             K2Node_Event_Objectives_1;                         // 0x0048(0x0010)(ConstParm, ReferenceParm)
	class UManQuest*                              K2Node_Event_ManQuest_1;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UManQuestObjective*>             K2Node_Event_Objectives;                           // 0x0060(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UManQuest*                              K2Node_Event_ManQuest;                             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHUDNotificationUserWidget*             K2Node_Event_HUDNotificationUserWidget_1;          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_ItemName_1;                           // 0x0088(0x0018)(ConstParm)
	class FText                                   K2Node_Event_ItemDescription;                      // 0x00A0(0x0018)(ConstParm)
	class UTexture2D*                             K2Node_Event_Icon_1;                               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Timeout_2;                            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Number_1;                             // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemAbility*                           K2Node_Event_ItemAbility;                          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHideNewItemTitle;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_QuestNotification_C*                CallFunc_GetQuestNotification_ReturnValue;         // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUDNotificationUserWidget*             K2Node_Event_HUDNotificationUserWidget;            // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_ItemName;                             // 0x00F0(0x0018)(ConstParm)
	class UTexture2D*                             K2Node_Event_Icon;                                 // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Timeout_1;                            // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Number;                               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bMatchHasStarted;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInVisible_4;                         // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bAnimate_4;                           // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInVisible_3;                         // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInVisible_2;                         // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlay;                                // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHeroProperty                                 K2Node_Event_PropertyType_1;                       // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11F[0x1];                                      // 0x011F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Value_1;                              // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RoundedFloatValue;                    // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_RoundedIntValue;                      // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAnimate_3;                           // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHUDBarType                                   K2Node_Event_HUDBarType_4;                         // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12E[0x2];                                      // 0x012E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_HudBarTitle;                          // 0x0130(0x0018)(ConstParm)
	float                                         K2Node_Event_MinValue;                             // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_MaxValue;                             // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_CurrentValue_1;                       // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ReferencePointValue;                  // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_LengthRatio;                          // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHUDBarType                                   K2Node_Event_HUDBarType_3;                         // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_CurrentValue;                         // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHUDBarType                                   K2Node_Event_HUDBarType_2;                         // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInVisible_1;                         // 0x0166(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsHPLow;                             // 0x0167(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Event_CurrentComboPointFraction;            // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_CurrentComboPoint;                    // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_MaxComboPoint;                        // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsBelowZero;                         // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bComboPointBarVisible;                // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0176(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_177[0x1];                                      // 0x0177(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0178(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInVisible;                           // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_LevelProgress;                        // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInCanInteract;                       // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EScreenSideEffect                             K2Node_Event_Effect;                               // 0x01BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bActive_1;                            // 0x01BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESideEffectWarningType                        K2Node_Event_SideEffectWarningType;                // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bDownPosition;                        // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C3[0x5];                                      // 0x01C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHUDPopupQueue                         K2Node_Event_HUDPopupQueue;                        // 0x01C8(0x0058)()
	bool                                          K2Node_Event_bInShow;                              // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InWarningText;                        // 0x0228(0x0018)(ConstParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHUDBarType                                   K2Node_Event_HUDBarType_1;                         // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bMiniBoss;                            // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bTwoStageBossBar;                     // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bMandragora;                          // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHUDBarType                                   K2Node_Event_HUDBarType;                           // 0x0245(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_246[0x2];                                      // 0x0246(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_LightBarrierCurrentValue;             // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_LightBarrierMaxValue;                 // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Timeout;                              // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_RiftID;                               // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_ItemSetIndex;                         // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAnimate_2;                           // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_SkillSetIndex;                        // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAnimate_1;                           // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0265(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0266(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bActive;                              // 0x0267(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHeroProperty                                 K2Node_Event_PropertyType;                         // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Value;                                // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShowing;                             // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bAnimate;                             // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_272[0x2];                                      // 0x0272(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 VisibleSlots)>           K2Node_CreateDelegate_OutputDelegate_1;            // 0x0274(0x0010)(ZeroConstructor, NoDestructor)
	ESpecialMovementType                          K2Node_Event_SpecialMovementType;                  // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0285(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_286[0x2];                                      // 0x0286(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UManUserWidgetBase*                     K2Node_CustomEvent_ManUserWidgetBase;              // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInInputRestrict;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InInteractText;                       // 0x0298(0x0018)(ConstParm)
	class UAbilityBase*                           K2Node_Event_InAbilityBase;                        // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_ExecuteUbergraph_BP_HUD) == 0x000008, "Wrong alignment on BP_HUD_C_ExecuteUbergraph_BP_HUD");
static_assert(sizeof(BP_HUD_C_ExecuteUbergraph_BP_HUD) == 0x0002B8, "Wrong size on BP_HUD_C_ExecuteUbergraph_BP_HUD");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, EntryPoint) == 0x000000, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, Temp_byte_Variable) == 0x000004, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, Temp_bool_Variable) == 0x000005, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_ShowTutorialScreen_ReturnValue) == 0x000018, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_ShowTutorialScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000020, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_GetAnimationCurrentTime_ReturnValue_1) == 0x000024, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_GetAnimationCurrentTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_IsDesignTime) == 0x000038, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_ManQuest_2) == 0x000040, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_ManQuest_2' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Objectives_1) == 0x000048, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Objectives_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_ManQuest_1) == 0x000058, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_ManQuest_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Objectives) == 0x000060, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Objectives' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_ManQuest) == 0x000078, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_ManQuest' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_HUDNotificationUserWidget_1) == 0x000080, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_HUDNotificationUserWidget_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_ItemName_1) == 0x000088, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_ItemName_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_ItemDescription) == 0x0000A0, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_ItemDescription' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Icon_1) == 0x0000B8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Icon_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Timeout_2) == 0x0000C0, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Timeout_2' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Number_1) == 0x0000C4, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Number_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_ItemAbility) == 0x0000C8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_ItemAbility' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bHideNewItemTitle) == 0x0000D0, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bHideNewItemTitle' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_GetQuestNotification_ReturnValue) == 0x0000D8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_GetQuestNotification_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_1) == 0x0000E0, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_HUDNotificationUserWidget) == 0x0000E8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_HUDNotificationUserWidget' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_ItemName) == 0x0000F0, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_ItemName' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Icon) == 0x000108, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Icon' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Timeout_1) == 0x000110, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Timeout_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Number) == 0x000114, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Number' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bMatchHasStarted) == 0x000118, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bMatchHasStarted' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bInVisible_4) == 0x000119, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bInVisible_4' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bAnimate_4) == 0x00011A, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bAnimate_4' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bInVisible_3) == 0x00011B, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bInVisible_3' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bInVisible_2) == 0x00011C, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bInVisible_2' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bPlay) == 0x00011D, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bPlay' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_PropertyType_1) == 0x00011E, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_PropertyType_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Value_1) == 0x000120, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Value_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_RoundedFloatValue) == 0x000124, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_RoundedFloatValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_RoundedIntValue) == 0x000128, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_RoundedIntValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bAnimate_3) == 0x00012C, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bAnimate_3' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_HUDBarType_4) == 0x00012D, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_HUDBarType_4' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_HudBarTitle) == 0x000130, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_HudBarTitle' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_MinValue) == 0x000148, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_MinValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_MaxValue) == 0x00014C, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_MaxValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_CurrentValue_1) == 0x000150, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_CurrentValue_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_ReferencePointValue) == 0x000154, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_ReferencePointValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_LengthRatio) == 0x000158, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_LengthRatio' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_HUDBarType_3) == 0x00015C, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_HUDBarType_3' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_CurrentValue) == 0x000160, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_CurrentValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_HUDBarType_2) == 0x000164, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_HUDBarType_2' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, Temp_byte_Variable_1) == 0x000165, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bInVisible_1) == 0x000166, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bInVisible_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bIsHPLow) == 0x000167, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bIsHPLow' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_CurrentComboPointFraction) == 0x000168, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_CurrentComboPointFraction' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_CurrentComboPoint) == 0x00016C, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_CurrentComboPoint' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_MaxComboPoint) == 0x000170, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_MaxComboPoint' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bIsBelowZero) == 0x000174, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bIsBelowZero' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bComboPointBarVisible) == 0x000175, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bComboPointBarVisible' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Select_Default) == 0x000176, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_MyGeometry) == 0x000178, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_InDeltaTime) == 0x0001B0, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bInVisible) == 0x0001B4, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bInVisible' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_LevelProgress) == 0x0001B8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_LevelProgress' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bInCanInteract) == 0x0001BC, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bInCanInteract' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_Not_PreBool_ReturnValue) == 0x0001BD, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Effect) == 0x0001BE, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Effect' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bActive_1) == 0x0001BF, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bActive_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_SideEffectWarningType) == 0x0001C0, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_SideEffectWarningType' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_SwitchEnum_CmpSuccess) == 0x0001C1, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bDownPosition) == 0x0001C2, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bDownPosition' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_HUDPopupQueue) == 0x0001C8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_HUDPopupQueue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bInShow) == 0x000220, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bInShow' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_InWarningText) == 0x000228, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_InWarningText' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_SwitchEnum_CmpSuccess_1) == 0x000240, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_HUDBarType_1) == 0x000241, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_HUDBarType_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bMiniBoss) == 0x000242, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bMiniBoss' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bTwoStageBossBar) == 0x000243, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bTwoStageBossBar' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bMandragora) == 0x000244, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bMandragora' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_HUDBarType) == 0x000245, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_HUDBarType' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_LightBarrierCurrentValue) == 0x000248, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_LightBarrierCurrentValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_LightBarrierMaxValue) == 0x00024C, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_LightBarrierMaxValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Timeout) == 0x000250, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Timeout' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_RiftID) == 0x000254, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_RiftID' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_ItemSetIndex) == 0x000258, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_ItemSetIndex' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bAnimate_2) == 0x00025C, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bAnimate_2' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_SkillSetIndex) == 0x000260, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_SkillSetIndex' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bAnimate_1) == 0x000264, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bAnimate_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000265, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000266, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bActive) == 0x000267, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bActive' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_PropertyType) == 0x000268, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_PropertyType' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Value) == 0x00026C, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bShowing) == 0x000270, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bShowing' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bAnimate) == 0x000271, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bAnimate' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_CreateDelegate_OutputDelegate_1) == 0x000274, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_SpecialMovementType) == 0x000284, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_SpecialMovementType' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_SwitchEnum_CmpSuccess_2) == 0x000285, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_CustomEvent_ManUserWidgetBase) == 0x000288, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_CustomEvent_ManUserWidgetBase' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bInInputRestrict) == 0x000290, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bInInputRestrict' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_Not_PreBool_ReturnValue_1) == 0x000291, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_InInteractText) == 0x000298, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_InInteractText' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_InAbilityBase) == 0x0002B0, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_InAbilityBase' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.OnShowInteract
// 0x0020 (0x0020 - 0x0000)
struct BP_HUD_C_OnShowInteract final
{
public:
	class FText                                   InInteractText;                                    // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UAbilityBase*                           InAbilityBase;                                     // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_OnShowInteract) == 0x000008, "Wrong alignment on BP_HUD_C_OnShowInteract");
static_assert(sizeof(BP_HUD_C_OnShowInteract) == 0x000020, "Wrong size on BP_HUD_C_OnShowInteract");
static_assert(offsetof(BP_HUD_C_OnShowInteract, InInteractText) == 0x000000, "Member 'BP_HUD_C_OnShowInteract::InInteractText' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_OnShowInteract, InAbilityBase) == 0x000018, "Member 'BP_HUD_C_OnShowInteract::InAbilityBase' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.OnInputRestrict
// 0x0001 (0x0001 - 0x0000)
struct BP_HUD_C_OnInputRestrict final
{
public:
	bool                                          bInInputRestrict;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HUD_C_OnInputRestrict) == 0x000001, "Wrong alignment on BP_HUD_C_OnInputRestrict");
static_assert(sizeof(BP_HUD_C_OnInputRestrict) == 0x000001, "Wrong size on BP_HUD_C_OnInputRestrict");
static_assert(offsetof(BP_HUD_C_OnInputRestrict, bInInputRestrict) == 0x000000, "Member 'BP_HUD_C_OnInputRestrict::bInInputRestrict' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.CustomEvent_1
// 0x0008 (0x0008 - 0x0000)
struct BP_HUD_C_CustomEvent_1 final
{
public:
	class UManUserWidgetBase*                     ManUserWidgetBase;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_CustomEvent_1) == 0x000008, "Wrong alignment on BP_HUD_C_CustomEvent_1");
static_assert(sizeof(BP_HUD_C_CustomEvent_1) == 0x000008, "Wrong size on BP_HUD_C_CustomEvent_1");
static_assert(offsetof(BP_HUD_C_CustomEvent_1, ManUserWidgetBase) == 0x000000, "Member 'BP_HUD_C_CustomEvent_1::ManUserWidgetBase' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.OnSpecialMovementUlnocked
// 0x0001 (0x0001 - 0x0000)
struct BP_HUD_C_OnSpecialMovementUlnocked final
{
public:
	ESpecialMovementType                          SpecialMovementType;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_OnSpecialMovementUlnocked) == 0x000001, "Wrong alignment on BP_HUD_C_OnSpecialMovementUlnocked");
static_assert(sizeof(BP_HUD_C_OnSpecialMovementUlnocked) == 0x000001, "Wrong size on BP_HUD_C_OnSpecialMovementUlnocked");
static_assert(offsetof(BP_HUD_C_OnSpecialMovementUlnocked, SpecialMovementType) == 0x000000, "Member 'BP_HUD_C_OnSpecialMovementUlnocked::SpecialMovementType' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.OnToggleAddedResource
// 0x000C (0x000C - 0x0000)
struct BP_HUD_C_OnToggleAddedResource final
{
public:
	EHeroProperty                                 PropertyType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Value;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowing;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bAnimate;                                          // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HUD_C_OnToggleAddedResource) == 0x000004, "Wrong alignment on BP_HUD_C_OnToggleAddedResource");
static_assert(sizeof(BP_HUD_C_OnToggleAddedResource) == 0x00000C, "Wrong size on BP_HUD_C_OnToggleAddedResource");
static_assert(offsetof(BP_HUD_C_OnToggleAddedResource, PropertyType) == 0x000000, "Member 'BP_HUD_C_OnToggleAddedResource::PropertyType' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_OnToggleAddedResource, Value) == 0x000004, "Member 'BP_HUD_C_OnToggleAddedResource::Value' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_OnToggleAddedResource, bShowing) == 0x000008, "Member 'BP_HUD_C_OnToggleAddedResource::bShowing' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_OnToggleAddedResource, bAnimate) == 0x000009, "Member 'BP_HUD_C_OnToggleAddedResource::bAnimate' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.OnToggleExtraLanternDrainEffect
// 0x0001 (0x0001 - 0x0000)
struct BP_HUD_C_OnToggleExtraLanternDrainEffect final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HUD_C_OnToggleExtraLanternDrainEffect) == 0x000001, "Wrong alignment on BP_HUD_C_OnToggleExtraLanternDrainEffect");
static_assert(sizeof(BP_HUD_C_OnToggleExtraLanternDrainEffect) == 0x000001, "Wrong size on BP_HUD_C_OnToggleExtraLanternDrainEffect");
static_assert(offsetof(BP_HUD_C_OnToggleExtraLanternDrainEffect, bActive) == 0x000000, "Member 'BP_HUD_C_OnToggleExtraLanternDrainEffect::bActive' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.OnChangeSkillSetIndex
// 0x0008 (0x0008 - 0x0000)
struct BP_HUD_C_OnChangeSkillSetIndex final
{
public:
	int32                                         SkillSetIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAnimate;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HUD_C_OnChangeSkillSetIndex) == 0x000004, "Wrong alignment on BP_HUD_C_OnChangeSkillSetIndex");
static_assert(sizeof(BP_HUD_C_OnChangeSkillSetIndex) == 0x000008, "Wrong size on BP_HUD_C_OnChangeSkillSetIndex");
static_assert(offsetof(BP_HUD_C_OnChangeSkillSetIndex, SkillSetIndex) == 0x000000, "Member 'BP_HUD_C_OnChangeSkillSetIndex::SkillSetIndex' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_OnChangeSkillSetIndex, bAnimate) == 0x000004, "Member 'BP_HUD_C_OnChangeSkillSetIndex::bAnimate' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.OnChangeItemSetIndex
// 0x0008 (0x0008 - 0x0000)
struct BP_HUD_C_OnChangeItemSetIndex final
{
public:
	int32                                         ItemSetIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAnimate;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HUD_C_OnChangeItemSetIndex) == 0x000004, "Wrong alignment on BP_HUD_C_OnChangeItemSetIndex");
static_assert(sizeof(BP_HUD_C_OnChangeItemSetIndex) == 0x000008, "Wrong size on BP_HUD_C_OnChangeItemSetIndex");
static_assert(offsetof(BP_HUD_C_OnChangeItemSetIndex, ItemSetIndex) == 0x000000, "Member 'BP_HUD_C_OnChangeItemSetIndex::ItemSetIndex' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_OnChangeItemSetIndex, bAnimate) == 0x000004, "Member 'BP_HUD_C_OnChangeItemSetIndex::bAnimate' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.OnPlayRiftCombatStartAnim
// 0x0004 (0x0004 - 0x0000)
struct BP_HUD_C_OnPlayRiftCombatStartAnim final
{
public:
	int32                                         RiftID;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_OnPlayRiftCombatStartAnim) == 0x000004, "Wrong alignment on BP_HUD_C_OnPlayRiftCombatStartAnim");
static_assert(sizeof(BP_HUD_C_OnPlayRiftCombatStartAnim) == 0x000004, "Wrong size on BP_HUD_C_OnPlayRiftCombatStartAnim");
static_assert(offsetof(BP_HUD_C_OnPlayRiftCombatStartAnim, RiftID) == 0x000000, "Member 'BP_HUD_C_OnPlayRiftCombatStartAnim::RiftID' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.OnShowBestiaryUpdatedNotification
// 0x0004 (0x0004 - 0x0000)
struct BP_HUD_C_OnShowBestiaryUpdatedNotification final
{
public:
	float                                         Timeout;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_OnShowBestiaryUpdatedNotification) == 0x000004, "Wrong alignment on BP_HUD_C_OnShowBestiaryUpdatedNotification");
static_assert(sizeof(BP_HUD_C_OnShowBestiaryUpdatedNotification) == 0x000004, "Wrong size on BP_HUD_C_OnShowBestiaryUpdatedNotification");
static_assert(offsetof(BP_HUD_C_OnShowBestiaryUpdatedNotification, Timeout) == 0x000000, "Member 'BP_HUD_C_OnShowBestiaryUpdatedNotification::Timeout' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.OnSetLightBarrier
// 0x000C (0x000C - 0x0000)
struct BP_HUD_C_OnSetLightBarrier final
{
public:
	EHUDBarType                                   HUDBarType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LightBarrierCurrentValue;                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightBarrierMaxValue;                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_OnSetLightBarrier) == 0x000004, "Wrong alignment on BP_HUD_C_OnSetLightBarrier");
static_assert(sizeof(BP_HUD_C_OnSetLightBarrier) == 0x00000C, "Wrong size on BP_HUD_C_OnSetLightBarrier");
static_assert(offsetof(BP_HUD_C_OnSetLightBarrier, HUDBarType) == 0x000000, "Member 'BP_HUD_C_OnSetLightBarrier::HUDBarType' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_OnSetLightBarrier, LightBarrierCurrentValue) == 0x000004, "Member 'BP_HUD_C_OnSetLightBarrier::LightBarrierCurrentValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_OnSetLightBarrier, LightBarrierMaxValue) == 0x000008, "Member 'BP_HUD_C_OnSetLightBarrier::LightBarrierMaxValue' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.OnSetBossBar
// 0x0004 (0x0004 - 0x0000)
struct BP_HUD_C_OnSetBossBar final
{
public:
	EHUDBarType                                   HUDBarType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bMiniBoss;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bTwoStageBossBar;                                  // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bMandragora;                                       // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HUD_C_OnSetBossBar) == 0x000001, "Wrong alignment on BP_HUD_C_OnSetBossBar");
static_assert(sizeof(BP_HUD_C_OnSetBossBar) == 0x000004, "Wrong size on BP_HUD_C_OnSetBossBar");
static_assert(offsetof(BP_HUD_C_OnSetBossBar, HUDBarType) == 0x000000, "Member 'BP_HUD_C_OnSetBossBar::HUDBarType' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_OnSetBossBar, bMiniBoss) == 0x000001, "Member 'BP_HUD_C_OnSetBossBar::bMiniBoss' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_OnSetBossBar, bTwoStageBossBar) == 0x000002, "Member 'BP_HUD_C_OnSetBossBar::bTwoStageBossBar' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_OnSetBossBar, bMandragora) == 0x000003, "Member 'BP_HUD_C_OnSetBossBar::bMandragora' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.OnSetWarningText
// 0x0020 (0x0020 - 0x0000)
struct BP_HUD_C_OnSetWarningText final
{
public:
	bool                                          bInShow;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   InWarningText;                                     // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_HUD_C_OnSetWarningText) == 0x000008, "Wrong alignment on BP_HUD_C_OnSetWarningText");
static_assert(sizeof(BP_HUD_C_OnSetWarningText) == 0x000020, "Wrong size on BP_HUD_C_OnSetWarningText");
static_assert(offsetof(BP_HUD_C_OnSetWarningText, bInShow) == 0x000000, "Member 'BP_HUD_C_OnSetWarningText::bInShow' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_OnSetWarningText, InWarningText) == 0x000008, "Member 'BP_HUD_C_OnSetWarningText::InWarningText' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.OnShowHUDPopup
// 0x0058 (0x0058 - 0x0000)
struct BP_HUD_C_OnShowHUDPopup final
{
public:
	struct FHUDPopupQueue                         HUDPopupQueue;                                     // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_HUD_C_OnShowHUDPopup) == 0x000008, "Wrong alignment on BP_HUD_C_OnShowHUDPopup");
static_assert(sizeof(BP_HUD_C_OnShowHUDPopup) == 0x000058, "Wrong size on BP_HUD_C_OnShowHUDPopup");
static_assert(offsetof(BP_HUD_C_OnShowHUDPopup, HUDPopupQueue) == 0x000000, "Member 'BP_HUD_C_OnShowHUDPopup::HUDPopupQueue' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.OnToggleResourceBarPosition
// 0x0001 (0x0001 - 0x0000)
struct BP_HUD_C_OnToggleResourceBarPosition final
{
public:
	bool                                          bDownPosition;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HUD_C_OnToggleResourceBarPosition) == 0x000001, "Wrong alignment on BP_HUD_C_OnToggleResourceBarPosition");
static_assert(sizeof(BP_HUD_C_OnToggleResourceBarPosition) == 0x000001, "Wrong size on BP_HUD_C_OnToggleResourceBarPosition");
static_assert(offsetof(BP_HUD_C_OnToggleResourceBarPosition, bDownPosition) == 0x000000, "Member 'BP_HUD_C_OnToggleResourceBarPosition::bDownPosition' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.OnToggleSideEffectWarning
// 0x0003 (0x0003 - 0x0000)
struct BP_HUD_C_OnToggleSideEffectWarning final
{
public:
	EScreenSideEffect                             Effect;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bActive;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESideEffectWarningType                        SideEffectWarningType;                             // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_OnToggleSideEffectWarning) == 0x000001, "Wrong alignment on BP_HUD_C_OnToggleSideEffectWarning");
static_assert(sizeof(BP_HUD_C_OnToggleSideEffectWarning) == 0x000003, "Wrong size on BP_HUD_C_OnToggleSideEffectWarning");
static_assert(offsetof(BP_HUD_C_OnToggleSideEffectWarning, Effect) == 0x000000, "Member 'BP_HUD_C_OnToggleSideEffectWarning::Effect' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_OnToggleSideEffectWarning, bActive) == 0x000001, "Member 'BP_HUD_C_OnToggleSideEffectWarning::bActive' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_OnToggleSideEffectWarning, SideEffectWarningType) == 0x000002, "Member 'BP_HUD_C_OnToggleSideEffectWarning::SideEffectWarningType' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.OnSetInteractMode
// 0x0001 (0x0001 - 0x0000)
struct BP_HUD_C_OnSetInteractMode final
{
public:
	bool                                          bInCanInteract;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HUD_C_OnSetInteractMode) == 0x000001, "Wrong alignment on BP_HUD_C_OnSetInteractMode");
static_assert(sizeof(BP_HUD_C_OnSetInteractMode) == 0x000001, "Wrong size on BP_HUD_C_OnSetInteractMode");
static_assert(offsetof(BP_HUD_C_OnSetInteractMode, bInCanInteract) == 0x000000, "Member 'BP_HUD_C_OnSetInteractMode::bInCanInteract' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.OnSetLevelProgress
// 0x0004 (0x0004 - 0x0000)
struct BP_HUD_C_OnSetLevelProgress final
{
public:
