#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HeavyAttack_ActiveAbility

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HeavyAttack_ActiveAbility.BP_HeavyAttack_ActiveAbility_C
// 0x0018 (0x0928 - 0x0910)
class UBP_HeavyAttack_ActiveAbility_C final : public UHeavyAttackAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0910(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_WeaponActor_C*                      CurWeapon;                                         // 0x0918(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          WeaponTrailVE;                                     // 0x0920(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_HeavyAttack_ActiveAbility(int32 EntryPoint);
	void OnStaggeredEvent_Event_0();
	void BPOnEnd();
	void BPOnStart();
	void OnAbilityCustomEvent(class FName CustomName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HeavyAttack_ActiveAbility_C">();
	}
	static class UBP_HeavyAttack_ActiveAbility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_HeavyAttack_ActiveAbility_C>();
	}
};
static_assert(alignof(UBP_HeavyAttack_ActiveAbility_C) == 0x000008, "Wrong alignment on UBP_HeavyAttack_ActiveAbility_C");
static_assert(sizeof(UBP_HeavyAttack_ActiveAbility_C) == 0x000928, "Wrong size on UBP_HeavyAttack_ActiveAbility_C");
static_assert(offsetof(UBP_HeavyAttack_ActiveAbility_C, UberGraphFrame) == 0x000910, "Member 'UBP_HeavyAttack_ActiveAbility_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_HeavyAttack_ActiveAbility_C, CurWeapon) == 0x000918, "Member 'UBP_HeavyAttack_ActiveAbility_C::CurWeapon' has a wrong offset!");
static_assert(offsetof(UBP_HeavyAttack_ActiveAbility_C, WeaponTrailVE) == 0x000920, "Member 'UBP_HeavyAttack_ActiveAbility_C::WeaponTrailVE' has a wrong offset!");

}

