#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HealthFlaskEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HealthFlaskEffect.BP_HealthFlaskEffect_C
// 0x0010 (0x0640 - 0x0630)
class UBP_HealthFlaskEffect_C final : public UEmptyPassiveAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0630(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         BaseBPHealValue;                                   // 0x0638(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ModifiedBPHealValue;                               // 0x063C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_HealthFlaskEffect(int32 EntryPoint);
	void BPOnPreStart();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HealthFlaskEffect_C">();
	}
	static class UBP_HealthFlaskEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_HealthFlaskEffect_C>();
	}
};
static_assert(alignof(UBP_HealthFlaskEffect_C) == 0x000008, "Wrong alignment on UBP_HealthFlaskEffect_C");
static_assert(sizeof(UBP_HealthFlaskEffect_C) == 0x000640, "Wrong size on UBP_HealthFlaskEffect_C");
static_assert(offsetof(UBP_HealthFlaskEffect_C, UberGraphFrame) == 0x000630, "Member 'UBP_HealthFlaskEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_HealthFlaskEffect_C, BaseBPHealValue) == 0x000638, "Member 'UBP_HealthFlaskEffect_C::BaseBPHealValue' has a wrong offset!");
static_assert(offsetof(UBP_HealthFlaskEffect_C, ModifiedBPHealValue) == 0x00063C, "Member 'UBP_HealthFlaskEffect_C::ModifiedBPHealValue' has a wrong offset!");

}

