#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HUD_Level

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_HUD_Level.BP_HUD_Level_C
// 0x0040 (0x02A0 - 0x0260)
class UBP_HUD_Level_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PulseAnim;                                         // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HighlightAnim;                                     // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LevelText;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Progress;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Pulse;                                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Level;                                             // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          PulseAnimRunning;                                  // 0x029C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_HUD_Level(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetLevel(int32 NewLevel);
	void StartPulseAnim();
	void StopPulseAnim();
	void PlayHighlightAnim();
	void SetProgress(float InProgress);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HUD_Level_C">();
	}
	static class UBP_HUD_Level_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_HUD_Level_C>();
	}
};
static_assert(alignof(UBP_HUD_Level_C) == 0x000008, "Wrong alignment on UBP_HUD_Level_C");
static_assert(sizeof(UBP_HUD_Level_C) == 0x0002A0, "Wrong size on UBP_HUD_Level_C");
static_assert(offsetof(UBP_HUD_Level_C, UberGraphFrame) == 0x000260, "Member 'UBP_HUD_Level_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_HUD_Level_C, PulseAnim) == 0x000268, "Member 'UBP_HUD_Level_C::PulseAnim' has a wrong offset!");
static_assert(offsetof(UBP_HUD_Level_C, HighlightAnim) == 0x000270, "Member 'UBP_HUD_Level_C::HighlightAnim' has a wrong offset!");
static_assert(offsetof(UBP_HUD_Level_C, Frame) == 0x000278, "Member 'UBP_HUD_Level_C::Frame' has a wrong offset!");
static_assert(offsetof(UBP_HUD_Level_C, LevelText) == 0x000280, "Member 'UBP_HUD_Level_C::LevelText' has a wrong offset!");
static_assert(offsetof(UBP_HUD_Level_C, Progress) == 0x000288, "Member 'UBP_HUD_Level_C::Progress' has a wrong offset!");
static_assert(offsetof(UBP_HUD_Level_C, Pulse) == 0x000290, "Member 'UBP_HUD_Level_C::Pulse' has a wrong offset!");
static_assert(offsetof(UBP_HUD_Level_C, Level) == 0x000298, "Member 'UBP_HUD_Level_C::Level' has a wrong offset!");
static_assert(offsetof(UBP_HUD_Level_C, PulseAnimRunning) == 0x00029C, "Member 'UBP_HUD_Level_C::PulseAnimRunning' has a wrong offset!");

}

