#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HUD_BuffBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_HUD_BuffBar.BP_HUD_BuffBar_C
// 0x0020 (0x02A8 - 0x0288)
class UBP_HUD_BuffBar_C final : public UHUDBuffBarUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_78;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         BuffBarContainer;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsSmallScreen;                                     // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BP_HUD_BuffBar(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void ToggleSmallScreen(bool InIsSmallScreen);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HUD_BuffBar_C">();
	}
	static class UBP_HUD_BuffBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_HUD_BuffBar_C>();
	}
};
static_assert(alignof(UBP_HUD_BuffBar_C) == 0x000008, "Wrong alignment on UBP_HUD_BuffBar_C");
static_assert(sizeof(UBP_HUD_BuffBar_C) == 0x0002A8, "Wrong size on UBP_HUD_BuffBar_C");
static_assert(offsetof(UBP_HUD_BuffBar_C, UberGraphFrame) == 0x000288, "Member 'UBP_HUD_BuffBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_HUD_BuffBar_C, Border_78) == 0x000290, "Member 'UBP_HUD_BuffBar_C::Border_78' has a wrong offset!");
static_assert(offsetof(UBP_HUD_BuffBar_C, BuffBarContainer) == 0x000298, "Member 'UBP_HUD_BuffBar_C::BuffBarContainer' has a wrong offset!");
static_assert(offsetof(UBP_HUD_BuffBar_C, IsSmallScreen) == 0x0002A0, "Member 'UBP_HUD_BuffBar_C::IsSmallScreen' has a wrong offset!");

}

