#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HangingLanternBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_HangingLanternBase.BP_HangingLanternBase_C.UpdateMaterialValues
// 0x01A8 (0x01A8 - 0x0000)
struct BP_HangingLanternBase_C_UpdateMaterialValues final
{
public:
	bool                                          CurrentObjTag;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0044(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x00CC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0168(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FVector                                K2Node_Select_Default;                             // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HangingLanternBase_C_UpdateMaterialValues) == 0x000008, "Wrong alignment on BP_HangingLanternBase_C_UpdateMaterialValues");
static_assert(sizeof(BP_HangingLanternBase_C_UpdateMaterialValues) == 0x0001A8, "Wrong size on BP_HangingLanternBase_C_UpdateMaterialValues");
static_assert(offsetof(BP_HangingLanternBase_C_UpdateMaterialValues, CurrentObjTag) == 0x000000, "Member 'BP_HangingLanternBase_C_UpdateMaterialValues::CurrentObjTag' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_UpdateMaterialValues, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_HangingLanternBase_C_UpdateMaterialValues::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_UpdateMaterialValues, CallFunc_GetActorRightVector_ReturnValue) == 0x000008, "Member 'BP_HangingLanternBase_C_UpdateMaterialValues::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_UpdateMaterialValues, CallFunc_BreakTransform_Location) == 0x000014, "Member 'BP_HangingLanternBase_C_UpdateMaterialValues::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_UpdateMaterialValues, CallFunc_BreakTransform_Rotation) == 0x000020, "Member 'BP_HangingLanternBase_C_UpdateMaterialValues::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_UpdateMaterialValues, CallFunc_BreakTransform_Scale) == 0x00002C, "Member 'BP_HangingLanternBase_C_UpdateMaterialValues::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_UpdateMaterialValues, CallFunc_MakeVector_ReturnValue) == 0x000038, "Member 'BP_HangingLanternBase_C_UpdateMaterialValues::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_UpdateMaterialValues, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000044, "Member 'BP_HangingLanternBase_C_UpdateMaterialValues::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_UpdateMaterialValues, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0000CC, "Member 'BP_HangingLanternBase_C_UpdateMaterialValues::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_UpdateMaterialValues, Temp_int_Loop_Counter_Variable) == 0x000154, "Member 'BP_HangingLanternBase_C_UpdateMaterialValues::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_UpdateMaterialValues, CallFunc_Add_IntInt_ReturnValue) == 0x000158, "Member 'BP_HangingLanternBase_C_UpdateMaterialValues::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_UpdateMaterialValues, Temp_bool_Variable) == 0x00015C, "Member 'BP_HangingLanternBase_C_UpdateMaterialValues::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_UpdateMaterialValues, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000160, "Member 'BP_HangingLanternBase_C_UpdateMaterialValues::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_UpdateMaterialValues, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000164, "Member 'BP_HangingLanternBase_C_UpdateMaterialValues::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_UpdateMaterialValues, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000168, "Member 'BP_HangingLanternBase_C_UpdateMaterialValues::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_UpdateMaterialValues, K2Node_Select_Default) == 0x000178, "Member 'BP_HangingLanternBase_C_UpdateMaterialValues::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_UpdateMaterialValues, CallFunc_Array_Get_Item) == 0x000188, "Member 'BP_HangingLanternBase_C_UpdateMaterialValues::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_UpdateMaterialValues, CallFunc_Array_Length_ReturnValue) == 0x000190, "Member 'BP_HangingLanternBase_C_UpdateMaterialValues::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_UpdateMaterialValues, CallFunc_Less_IntInt_ReturnValue) == 0x000194, "Member 'BP_HangingLanternBase_C_UpdateMaterialValues::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_UpdateMaterialValues, CallFunc_Array_Get_Item_1) == 0x000198, "Member 'BP_HangingLanternBase_C_UpdateMaterialValues::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_UpdateMaterialValues, CallFunc_Array_Length_ReturnValue_1) == 0x0001A0, "Member 'BP_HangingLanternBase_C_UpdateMaterialValues::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_UpdateMaterialValues, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0001A4, "Member 'BP_HangingLanternBase_C_UpdateMaterialValues::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_UpdateMaterialValues, CallFunc_Greater_IntInt_ReturnValue) == 0x0001A5, "Member 'BP_HangingLanternBase_C_UpdateMaterialValues::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BP_HangingLanternBase.BP_HangingLanternBase_C.RandomizeValues
// 0x002C (0x002C - 0x0000)
struct BP_HangingLanternBase_C_RandomizeValues final
{
public:
	float                                         RandomDistribution;                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomOverall;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue_1;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue_2;                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Fraction_ReturnValue;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HangingLanternBase_C_RandomizeValues) == 0x000004, "Wrong alignment on BP_HangingLanternBase_C_RandomizeValues");
static_assert(sizeof(BP_HangingLanternBase_C_RandomizeValues) == 0x00002C, "Wrong size on BP_HangingLanternBase_C_RandomizeValues");
static_assert(offsetof(BP_HangingLanternBase_C_RandomizeValues, RandomDistribution) == 0x000000, "Member 'BP_HangingLanternBase_C_RandomizeValues::RandomDistribution' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_RandomizeValues, RandomOverall) == 0x000004, "Member 'BP_HangingLanternBase_C_RandomizeValues::RandomOverall' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_RandomizeValues, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'BP_HangingLanternBase_C_RandomizeValues::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_RandomizeValues, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_HangingLanternBase_C_RandomizeValues::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_RandomizeValues, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_HangingLanternBase_C_RandomizeValues::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_RandomizeValues, CallFunc_RandomFloat_ReturnValue) == 0x000014, "Member 'BP_HangingLanternBase_C_RandomizeValues::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_RandomizeValues, CallFunc_RandomFloat_ReturnValue_1) == 0x000018, "Member 'BP_HangingLanternBase_C_RandomizeValues::CallFunc_RandomFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_RandomizeValues, CallFunc_RandomFloat_ReturnValue_2) == 0x00001C, "Member 'BP_HangingLanternBase_C_RandomizeValues::CallFunc_RandomFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_RandomizeValues, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000020, "Member 'BP_HangingLanternBase_C_RandomizeValues::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_RandomizeValues, CallFunc_Fraction_ReturnValue) == 0x000024, "Member 'BP_HangingLanternBase_C_RandomizeValues::CallFunc_Fraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_RandomizeValues, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000028, "Member 'BP_HangingLanternBase_C_RandomizeValues::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");

// Function BP_HangingLanternBase.BP_HangingLanternBase_C.ExecuteUbergraph_BP_HangingLanternBase
// 0x0018 (0x0018 - 0x0000)
struct BP_HangingLanternBase_C_ExecuteUbergraph_BP_HangingLanternBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HangingLanternBase_C_ExecuteUbergraph_BP_HangingLanternBase) == 0x000004, "Wrong alignment on BP_HangingLanternBase_C_ExecuteUbergraph_BP_HangingLanternBase");
static_assert(sizeof(BP_HangingLanternBase_C_ExecuteUbergraph_BP_HangingLanternBase) == 0x000018, "Wrong size on BP_HangingLanternBase_C_ExecuteUbergraph_BP_HangingLanternBase");
static_assert(offsetof(BP_HangingLanternBase_C_ExecuteUbergraph_BP_HangingLanternBase, EntryPoint) == 0x000000, "Member 'BP_HangingLanternBase_C_ExecuteUbergraph_BP_HangingLanternBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_ExecuteUbergraph_BP_HangingLanternBase, Temp_delegate_Variable) == 0x000004, "Member 'BP_HangingLanternBase_C_ExecuteUbergraph_BP_HangingLanternBase::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_HangingLanternBase_C_ExecuteUbergraph_BP_HangingLanternBase, CallFunc_PostAkEvent_ReturnValue) == 0x000014, "Member 'BP_HangingLanternBase_C_ExecuteUbergraph_BP_HangingLanternBase::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

}

