#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HUDTimer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_HUDTimer.BP_HUDTimer_C
// 0x0020 (0x04D8 - 0x04B8)
class UBP_HUDTimer_C final : public UHUDTimerUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas;                                            // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Caption;                                           // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_HUDTimer(int32 EntryPoint);
	void OnSetTimer(const class FText& InTimerText);
	void OnHide(float AnimDuration);
	void OnShow(float AnimDuration);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HUDTimer_C">();
	}
	static class UBP_HUDTimer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_HUDTimer_C>();
	}
};
static_assert(alignof(UBP_HUDTimer_C) == 0x000008, "Wrong alignment on UBP_HUDTimer_C");
static_assert(sizeof(UBP_HUDTimer_C) == 0x0004D8, "Wrong size on UBP_HUDTimer_C");
static_assert(offsetof(UBP_HUDTimer_C, UberGraphFrame) == 0x0004B8, "Member 'UBP_HUDTimer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_HUDTimer_C, FadeOutAnim) == 0x0004C0, "Member 'UBP_HUDTimer_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_HUDTimer_C, Canvas) == 0x0004C8, "Member 'UBP_HUDTimer_C::Canvas' has a wrong offset!");
static_assert(offsetof(UBP_HUDTimer_C, Caption) == 0x0004D0, "Member 'UBP_HUDTimer_C::Caption' has a wrong offset!");

}

