#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HUD_Warning

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_HUD_Warning.BP_HUD_Warning_C.ExecuteUbergraph_BP_HUD_Warning
// 0x0008 (0x0008 - 0x0000)
struct BP_HUD_Warning_C_ExecuteUbergraph_BP_HUD_Warning final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HUD_Warning_C_ExecuteUbergraph_BP_HUD_Warning) == 0x000004, "Wrong alignment on BP_HUD_Warning_C_ExecuteUbergraph_BP_HUD_Warning");
static_assert(sizeof(BP_HUD_Warning_C_ExecuteUbergraph_BP_HUD_Warning) == 0x000008, "Wrong size on BP_HUD_Warning_C_ExecuteUbergraph_BP_HUD_Warning");
static_assert(offsetof(BP_HUD_Warning_C_ExecuteUbergraph_BP_HUD_Warning, EntryPoint) == 0x000000, "Member 'BP_HUD_Warning_C_ExecuteUbergraph_BP_HUD_Warning::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HUD_Warning_C_ExecuteUbergraph_BP_HUD_Warning, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BP_HUD_Warning_C_ExecuteUbergraph_BP_HUD_Warning::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function BP_HUD_Warning.BP_HUD_Warning_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_HUD_Warning_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HUD_Warning_C_PreConstruct) == 0x000001, "Wrong alignment on BP_HUD_Warning_C_PreConstruct");
static_assert(sizeof(BP_HUD_Warning_C_PreConstruct) == 0x000001, "Wrong size on BP_HUD_Warning_C_PreConstruct");
static_assert(offsetof(BP_HUD_Warning_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_HUD_Warning_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_HUD_Warning.BP_HUD_Warning_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct BP_HUD_Warning_C_SetText final
{
public:
	class FText                                   InCaption;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_HUD_Warning_C_SetText) == 0x000008, "Wrong alignment on BP_HUD_Warning_C_SetText");
static_assert(sizeof(BP_HUD_Warning_C_SetText) == 0x000018, "Wrong size on BP_HUD_Warning_C_SetText");
static_assert(offsetof(BP_HUD_Warning_C_SetText, InCaption) == 0x000000, "Member 'BP_HUD_Warning_C_SetText::InCaption' has a wrong offset!");

// Function BP_HUD_Warning.BP_HUD_Warning_C.FadeIn
// 0x0010 (0x0010 - 0x0000)
struct BP_HUD_Warning_C_FadeIn final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_Warning_C_FadeIn) == 0x000008, "Wrong alignment on BP_HUD_Warning_C_FadeIn");
static_assert(sizeof(BP_HUD_Warning_C_FadeIn) == 0x000010, "Wrong size on BP_HUD_Warning_C_FadeIn");
static_assert(offsetof(BP_HUD_Warning_C_FadeIn, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'BP_HUD_Warning_C_FadeIn::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_Warning_C_FadeIn, CallFunc_PlayAnimation_ReturnValue_1) == 0x000008, "Member 'BP_HUD_Warning_C_FadeIn::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function BP_HUD_Warning.BP_HUD_Warning_C.FadeOut
// 0x0008 (0x0008 - 0x0000)
struct BP_HUD_Warning_C_FadeOut final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_Warning_C_FadeOut) == 0x000008, "Wrong alignment on BP_HUD_Warning_C_FadeOut");
static_assert(sizeof(BP_HUD_Warning_C_FadeOut) == 0x000008, "Wrong size on BP_HUD_Warning_C_FadeOut");
static_assert(offsetof(BP_HUD_Warning_C_FadeOut, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'BP_HUD_Warning_C_FadeOut::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

