#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HUD_KeyItemSlot

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_HUD_KeyItemSlot.BP_HUD_KeyItemSlot_C.ExecuteUbergraph_BP_HUD_KeyItemSlot
// 0x0050 (0x0050 - 0x0000)
struct BP_HUD_KeyItemSlot_C_ExecuteUbergraph_BP_HUD_KeyItemSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_KeyItemSlot_C_ExecuteUbergraph_BP_HUD_KeyItemSlot) == 0x000008, "Wrong alignment on BP_HUD_KeyItemSlot_C_ExecuteUbergraph_BP_HUD_KeyItemSlot");
static_assert(sizeof(BP_HUD_KeyItemSlot_C_ExecuteUbergraph_BP_HUD_KeyItemSlot) == 0x000050, "Wrong size on BP_HUD_KeyItemSlot_C_ExecuteUbergraph_BP_HUD_KeyItemSlot");
static_assert(offsetof(BP_HUD_KeyItemSlot_C_ExecuteUbergraph_BP_HUD_KeyItemSlot, EntryPoint) == 0x000000, "Member 'BP_HUD_KeyItemSlot_C_ExecuteUbergraph_BP_HUD_KeyItemSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HUD_KeyItemSlot_C_ExecuteUbergraph_BP_HUD_KeyItemSlot, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BP_HUD_KeyItemSlot_C_ExecuteUbergraph_BP_HUD_KeyItemSlot::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_HUD_KeyItemSlot_C_ExecuteUbergraph_BP_HUD_KeyItemSlot, K2Node_Event_MyGeometry) == 0x000008, "Member 'BP_HUD_KeyItemSlot_C_ExecuteUbergraph_BP_HUD_KeyItemSlot::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_HUD_KeyItemSlot_C_ExecuteUbergraph_BP_HUD_KeyItemSlot, K2Node_Event_InDeltaTime) == 0x000040, "Member 'BP_HUD_KeyItemSlot_C_ExecuteUbergraph_BP_HUD_KeyItemSlot::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_HUD_KeyItemSlot_C_ExecuteUbergraph_BP_HUD_KeyItemSlot, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000048, "Member 'BP_HUD_KeyItemSlot_C_ExecuteUbergraph_BP_HUD_KeyItemSlot::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function BP_HUD_KeyItemSlot.BP_HUD_KeyItemSlot_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_HUD_KeyItemSlot_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_KeyItemSlot_C_Tick) == 0x000004, "Wrong alignment on BP_HUD_KeyItemSlot_C_Tick");
static_assert(sizeof(BP_HUD_KeyItemSlot_C_Tick) == 0x00003C, "Wrong size on BP_HUD_KeyItemSlot_C_Tick");
static_assert(offsetof(BP_HUD_KeyItemSlot_C_Tick, MyGeometry) == 0x000000, "Member 'BP_HUD_KeyItemSlot_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_HUD_KeyItemSlot_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_HUD_KeyItemSlot_C_Tick::InDeltaTime' has a wrong offset!");

// Function BP_HUD_KeyItemSlot.BP_HUD_KeyItemSlot_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_HUD_KeyItemSlot_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HUD_KeyItemSlot_C_PreConstruct) == 0x000001, "Wrong alignment on BP_HUD_KeyItemSlot_C_PreConstruct");
static_assert(sizeof(BP_HUD_KeyItemSlot_C_PreConstruct) == 0x000001, "Wrong size on BP_HUD_KeyItemSlot_C_PreConstruct");
static_assert(offsetof(BP_HUD_KeyItemSlot_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_HUD_KeyItemSlot_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_HUD_KeyItemSlot.BP_HUD_KeyItemSlot_C.SetIcon
// 0x0018 (0x0018 - 0x0000)
struct BP_HUD_KeyItemSlot_C_SetIcon final
{
public:
	class UTexture2D*                             InIcon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_KeyItemSlot_C_SetIcon) == 0x000008, "Wrong alignment on BP_HUD_KeyItemSlot_C_SetIcon");
static_assert(sizeof(BP_HUD_KeyItemSlot_C_SetIcon) == 0x000018, "Wrong size on BP_HUD_KeyItemSlot_C_SetIcon");
static_assert(offsetof(BP_HUD_KeyItemSlot_C_SetIcon, InIcon) == 0x000000, "Member 'BP_HUD_KeyItemSlot_C_SetIcon::InIcon' has a wrong offset!");
static_assert(offsetof(BP_HUD_KeyItemSlot_C_SetIcon, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_HUD_KeyItemSlot_C_SetIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_KeyItemSlot_C_SetIcon, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'BP_HUD_KeyItemSlot_C_SetIcon::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function BP_HUD_KeyItemSlot.BP_HUD_KeyItemSlot_C.PlayHighlight
// 0x0008 (0x0008 - 0x0000)
struct BP_HUD_KeyItemSlot_C_PlayHighlight final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_KeyItemSlot_C_PlayHighlight) == 0x000008, "Wrong alignment on BP_HUD_KeyItemSlot_C_PlayHighlight");
static_assert(sizeof(BP_HUD_KeyItemSlot_C_PlayHighlight) == 0x000008, "Wrong size on BP_HUD_KeyItemSlot_C_PlayHighlight");
static_assert(offsetof(BP_HUD_KeyItemSlot_C_PlayHighlight, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'BP_HUD_KeyItemSlot_C_PlayHighlight::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

