#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HerbGardenVisualManager

#include "Basic.hpp"

#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HerbGardenVisualManager.BP_HerbGardenVisualManager_C
// 0x0018 (0x0818 - 0x0800)
class ABP_HerbGardenVisualManager_C final : public AHerbGardenVisualManager
{
public:
	class UBP_InteractPrompWidgetComponent_C*     BP_InteractPrompWidgetComponent;                   // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTriggerBoxComponent*                   TriggerBox;                                        // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HerbGardenVisualManager_C">();
	}
	static class ABP_HerbGardenVisualManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HerbGardenVisualManager_C>();
	}
};
static_assert(alignof(ABP_HerbGardenVisualManager_C) == 0x000008, "Wrong alignment on ABP_HerbGardenVisualManager_C");
static_assert(sizeof(ABP_HerbGardenVisualManager_C) == 0x000818, "Wrong size on ABP_HerbGardenVisualManager_C");
static_assert(offsetof(ABP_HerbGardenVisualManager_C, BP_InteractPrompWidgetComponent) == 0x000800, "Member 'ABP_HerbGardenVisualManager_C::BP_InteractPrompWidgetComponent' has a wrong offset!");
static_assert(offsetof(ABP_HerbGardenVisualManager_C, TriggerBox) == 0x000808, "Member 'ABP_HerbGardenVisualManager_C::TriggerBox' has a wrong offset!");
static_assert(offsetof(ABP_HerbGardenVisualManager_C, DefaultSceneRoot) == 0x000810, "Member 'ABP_HerbGardenVisualManager_C::DefaultSceneRoot' has a wrong offset!");

}

