#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Hilltop_Owl

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Hilltop_Owl.BP_Hilltop_Owl_C.Idle
// 0x00A0 (0x00A0 - 0x0000)
struct BP_Hilltop_Owl_C_Idle final
{
public:
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBoneRotationByName_ReturnValue;        // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_RotatorRotator_ReturnValue;    // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Hilltop_Owl_C_Idle) == 0x000004, "Wrong alignment on BP_Hilltop_Owl_C_Idle");
static_assert(sizeof(BP_Hilltop_Owl_C_Idle) == 0x0000A0, "Wrong size on BP_Hilltop_Owl_C_Idle");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000004, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00000C, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000010, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000014, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000020, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_BreakVector_X) == 0x000024, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_BreakVector_Y) == 0x000028, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_BreakVector_Z) == 0x00002C, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_Add_FloatFloat_ReturnValue) == 0x000030, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000034, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_MakeVector_ReturnValue) == 0x000038, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_GetBoneRotationByName_ReturnValue) == 0x000044, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_GetBoneRotationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000050, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_FindLookAtRotation_ReturnValue) == 0x00005C, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_BreakRotator_Roll) == 0x000068, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_BreakRotator_Pitch) == 0x00006C, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_BreakRotator_Yaw) == 0x000070, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000074, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x000078, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_FClamp_ReturnValue) == 0x00007C, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_FClamp_ReturnValue_1) == 0x000080, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_MakeRotator_ReturnValue) == 0x000084, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_RInterpTo_ReturnValue) == 0x000090, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_EqualEqual_RotatorRotator_ReturnValue) == 0x00009C, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_EqualEqual_RotatorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_Idle, CallFunc_BooleanAND_ReturnValue) == 0x00009D, "Member 'BP_Hilltop_Owl_C_Idle::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_Hilltop_Owl.BP_Hilltop_Owl_C.LookAtPlayer
// 0x0078 (0x0078 - 0x0000)
struct BP_Hilltop_Owl_C_LookAtPlayer final
{
public:
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBoneRotationByName_ReturnValue;        // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Hilltop_Owl_C_LookAtPlayer) == 0x000008, "Wrong alignment on BP_Hilltop_Owl_C_LookAtPlayer");
static_assert(sizeof(BP_Hilltop_Owl_C_LookAtPlayer) == 0x000078, "Wrong size on BP_Hilltop_Owl_C_LookAtPlayer");
static_assert(offsetof(BP_Hilltop_Owl_C_LookAtPlayer, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000000, "Member 'BP_Hilltop_Owl_C_LookAtPlayer::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_LookAtPlayer, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'BP_Hilltop_Owl_C_LookAtPlayer::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_LookAtPlayer, CallFunc_GetBoneRotationByName_ReturnValue) == 0x000010, "Member 'BP_Hilltop_Owl_C_LookAtPlayer::CallFunc_GetBoneRotationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_LookAtPlayer, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00001C, "Member 'BP_Hilltop_Owl_C_LookAtPlayer::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_LookAtPlayer, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000028, "Member 'BP_Hilltop_Owl_C_LookAtPlayer::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_LookAtPlayer, CallFunc_FindLookAtRotation_ReturnValue) == 0x000034, "Member 'BP_Hilltop_Owl_C_LookAtPlayer::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_LookAtPlayer, CallFunc_BreakRotator_Roll) == 0x000040, "Member 'BP_Hilltop_Owl_C_LookAtPlayer::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_LookAtPlayer, CallFunc_BreakRotator_Pitch) == 0x000044, "Member 'BP_Hilltop_Owl_C_LookAtPlayer::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_LookAtPlayer, CallFunc_BreakRotator_Yaw) == 0x000048, "Member 'BP_Hilltop_Owl_C_LookAtPlayer::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_LookAtPlayer, CallFunc_Add_FloatFloat_ReturnValue) == 0x00004C, "Member 'BP_Hilltop_Owl_C_LookAtPlayer::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_LookAtPlayer, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000050, "Member 'BP_Hilltop_Owl_C_LookAtPlayer::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_LookAtPlayer, CallFunc_FClamp_ReturnValue) == 0x000054, "Member 'BP_Hilltop_Owl_C_LookAtPlayer::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_LookAtPlayer, CallFunc_FClamp_ReturnValue_1) == 0x000058, "Member 'BP_Hilltop_Owl_C_LookAtPlayer::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_LookAtPlayer, CallFunc_MakeRotator_ReturnValue) == 0x00005C, "Member 'BP_Hilltop_Owl_C_LookAtPlayer::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_LookAtPlayer, CallFunc_RInterpTo_ReturnValue) == 0x000068, "Member 'BP_Hilltop_Owl_C_LookAtPlayer::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");

// Function BP_Hilltop_Owl.BP_Hilltop_Owl_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Hilltop_Owl_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hilltop_Owl_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Hilltop_Owl_C_ReceiveTick");
static_assert(sizeof(BP_Hilltop_Owl_C_ReceiveTick) == 0x000004, "Wrong size on BP_Hilltop_Owl_C_ReceiveTick");
static_assert(offsetof(BP_Hilltop_Owl_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Hilltop_Owl_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Hilltop_Owl.BP_Hilltop_Owl_C.ExecuteUbergraph_BP_Hilltop_Owl
// 0x0030 (0x0030 - 0x0000)
struct BP_Hilltop_Owl_C_ExecuteUbergraph_BP_Hilltop_Owl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrawlerHero_C*                      K2Node_DynamicCast_AsBP_Brawler_Hero;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAFKTime_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Hilltop_Owl_C_ExecuteUbergraph_BP_Hilltop_Owl) == 0x000008, "Wrong alignment on BP_Hilltop_Owl_C_ExecuteUbergraph_BP_Hilltop_Owl");
static_assert(sizeof(BP_Hilltop_Owl_C_ExecuteUbergraph_BP_Hilltop_Owl) == 0x000030, "Wrong size on BP_Hilltop_Owl_C_ExecuteUbergraph_BP_Hilltop_Owl");
static_assert(offsetof(BP_Hilltop_Owl_C_ExecuteUbergraph_BP_Hilltop_Owl, EntryPoint) == 0x000000, "Member 'BP_Hilltop_Owl_C_ExecuteUbergraph_BP_Hilltop_Owl::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_ExecuteUbergraph_BP_Hilltop_Owl, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_Hilltop_Owl_C_ExecuteUbergraph_BP_Hilltop_Owl::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_ExecuteUbergraph_BP_Hilltop_Owl, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_Hilltop_Owl_C_ExecuteUbergraph_BP_Hilltop_Owl::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_ExecuteUbergraph_BP_Hilltop_Owl, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'BP_Hilltop_Owl_C_ExecuteUbergraph_BP_Hilltop_Owl::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_ExecuteUbergraph_BP_Hilltop_Owl, K2Node_DynamicCast_AsBP_Brawler_Hero) == 0x000018, "Member 'BP_Hilltop_Owl_C_ExecuteUbergraph_BP_Hilltop_Owl::K2Node_DynamicCast_AsBP_Brawler_Hero' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_ExecuteUbergraph_BP_Hilltop_Owl, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Hilltop_Owl_C_ExecuteUbergraph_BP_Hilltop_Owl::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_ExecuteUbergraph_BP_Hilltop_Owl, CallFunc_GetAFKTime_ReturnValue) == 0x000024, "Member 'BP_Hilltop_Owl_C_ExecuteUbergraph_BP_Hilltop_Owl::CallFunc_GetAFKTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hilltop_Owl_C_ExecuteUbergraph_BP_Hilltop_Owl, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000028, "Member 'BP_Hilltop_Owl_C_ExecuteUbergraph_BP_Hilltop_Owl::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

