#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HUD_BuffBarSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_HUD_BuffBarSlot.BP_HUD_BuffBarSlot_C
// 0x0068 (0x0310 - 0x02A8)
class UBP_HUD_BuffBarSlot_C final : public UHUDBuffBarSlotUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowHighlightAnim;                                 // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideHighlightAnim;                                 // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CooldownWidget;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FrameWidget;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HighlightAnim;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HighlightImg;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconWidget;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InnerNumberFrame;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               InnerNumberOverlay;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             InnerNumberText;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             OuterNumberText;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         UpgradeID;                                         // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_HUD_BuffBarSlot(int32 EntryPoint);
	void OnSetIconID(int32 InBuffIconID);
	void OnSetHighlight(bool bInHighlight);
	void OnGreyedOut(bool bInGreyedOut);
	void OnSetMaxCooldown(float InMaxCooldown);
	void OnSetInnerNumberVisible(bool bInInnerNumberVisible);
	void OnSetInnerNumber(int32 InInnerNumber);
	void OnSetOuterNumberVisible(bool bInOuterNumberVisible);
	void OnSetOuterNumber(int32 InOuterNumber);
	void OnSetType(EBuffType InBuffType);
	void OnSetIcon(const class UTexture2D* InBuffIcon);
	void OnSetText(const class FText& InBuffText);
	void OnSetCooldown(float InCooldown);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void SetIcon(class UTexture2D* InIcon);
	void SetCooldown(float InCooldown);
	void SetType(EBuffType InBuffType);
	void SetUpgradeIcon(int32 InUpgradeID);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HUD_BuffBarSlot_C">();
	}
	static class UBP_HUD_BuffBarSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_HUD_BuffBarSlot_C>();
	}
};
static_assert(alignof(UBP_HUD_BuffBarSlot_C) == 0x000008, "Wrong alignment on UBP_HUD_BuffBarSlot_C");
static_assert(sizeof(UBP_HUD_BuffBarSlot_C) == 0x000310, "Wrong size on UBP_HUD_BuffBarSlot_C");
static_assert(offsetof(UBP_HUD_BuffBarSlot_C, UberGraphFrame) == 0x0002A8, "Member 'UBP_HUD_BuffBarSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_HUD_BuffBarSlot_C, ShowHighlightAnim) == 0x0002B0, "Member 'UBP_HUD_BuffBarSlot_C::ShowHighlightAnim' has a wrong offset!");
static_assert(offsetof(UBP_HUD_BuffBarSlot_C, HideHighlightAnim) == 0x0002B8, "Member 'UBP_HUD_BuffBarSlot_C::HideHighlightAnim' has a wrong offset!");
static_assert(offsetof(UBP_HUD_BuffBarSlot_C, CooldownWidget) == 0x0002C0, "Member 'UBP_HUD_BuffBarSlot_C::CooldownWidget' has a wrong offset!");
static_assert(offsetof(UBP_HUD_BuffBarSlot_C, FrameWidget) == 0x0002C8, "Member 'UBP_HUD_BuffBarSlot_C::FrameWidget' has a wrong offset!");
static_assert(offsetof(UBP_HUD_BuffBarSlot_C, HighlightAnim) == 0x0002D0, "Member 'UBP_HUD_BuffBarSlot_C::HighlightAnim' has a wrong offset!");
static_assert(offsetof(UBP_HUD_BuffBarSlot_C, HighlightImg) == 0x0002D8, "Member 'UBP_HUD_BuffBarSlot_C::HighlightImg' has a wrong offset!");
static_assert(offsetof(UBP_HUD_BuffBarSlot_C, IconWidget) == 0x0002E0, "Member 'UBP_HUD_BuffBarSlot_C::IconWidget' has a wrong offset!");
static_assert(offsetof(UBP_HUD_BuffBarSlot_C, InnerNumberFrame) == 0x0002E8, "Member 'UBP_HUD_BuffBarSlot_C::InnerNumberFrame' has a wrong offset!");
static_assert(offsetof(UBP_HUD_BuffBarSlot_C, InnerNumberOverlay) == 0x0002F0, "Member 'UBP_HUD_BuffBarSlot_C::InnerNumberOverlay' has a wrong offset!");
static_assert(offsetof(UBP_HUD_BuffBarSlot_C, InnerNumberText) == 0x0002F8, "Member 'UBP_HUD_BuffBarSlot_C::InnerNumberText' has a wrong offset!");
static_assert(offsetof(UBP_HUD_BuffBarSlot_C, OuterNumberText) == 0x000300, "Member 'UBP_HUD_BuffBarSlot_C::OuterNumberText' has a wrong offset!");
static_assert(offsetof(UBP_HUD_BuffBarSlot_C, UpgradeID) == 0x000308, "Member 'UBP_HUD_BuffBarSlot_C::UpgradeID' has a wrong offset!");

}

