#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HealthFlaskEffect

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_HealthFlaskEffect.BP_HealthFlaskEffect_C.ExecuteUbergraph_BP_HealthFlaskEffect
// 0x0028 (0x0028 - 0x0000)
struct BP_HealthFlaskEffect_C_ExecuteUbergraph_BP_HealthFlaskEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CallFunc_GetInventory_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHPFlaskEfficiencyModifier_ReturnValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HealthFlaskEffect_C_ExecuteUbergraph_BP_HealthFlaskEffect) == 0x000008, "Wrong alignment on BP_HealthFlaskEffect_C_ExecuteUbergraph_BP_HealthFlaskEffect");
static_assert(sizeof(BP_HealthFlaskEffect_C_ExecuteUbergraph_BP_HealthFlaskEffect) == 0x000028, "Wrong size on BP_HealthFlaskEffect_C_ExecuteUbergraph_BP_HealthFlaskEffect");
static_assert(offsetof(BP_HealthFlaskEffect_C_ExecuteUbergraph_BP_HealthFlaskEffect, EntryPoint) == 0x000000, "Member 'BP_HealthFlaskEffect_C_ExecuteUbergraph_BP_HealthFlaskEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HealthFlaskEffect_C_ExecuteUbergraph_BP_HealthFlaskEffect, CallFunc_GetAbilityController_ReturnValue) == 0x000008, "Member 'BP_HealthFlaskEffect_C_ExecuteUbergraph_BP_HealthFlaskEffect::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HealthFlaskEffect_C_ExecuteUbergraph_BP_HealthFlaskEffect, CallFunc_GetInventory_ReturnValue) == 0x000010, "Member 'BP_HealthFlaskEffect_C_ExecuteUbergraph_BP_HealthFlaskEffect::CallFunc_GetInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HealthFlaskEffect_C_ExecuteUbergraph_BP_HealthFlaskEffect, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_HealthFlaskEffect_C_ExecuteUbergraph_BP_HealthFlaskEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HealthFlaskEffect_C_ExecuteUbergraph_BP_HealthFlaskEffect, CallFunc_GetHPFlaskEfficiencyModifier_ReturnValue) == 0x00001C, "Member 'BP_HealthFlaskEffect_C_ExecuteUbergraph_BP_HealthFlaskEffect::CallFunc_GetHPFlaskEfficiencyModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HealthFlaskEffect_C_ExecuteUbergraph_BP_HealthFlaskEffect, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_HealthFlaskEffect_C_ExecuteUbergraph_BP_HealthFlaskEffect::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HealthFlaskEffect_C_ExecuteUbergraph_BP_HealthFlaskEffect, CallFunc_IsValid_ReturnValue_1) == 0x000024, "Member 'BP_HealthFlaskEffect_C_ExecuteUbergraph_BP_HealthFlaskEffect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

