#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HUD_Warning

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_HUD_Warning.BP_HUD_Warning_C
// 0x0040 (0x02A0 - 0x0260)
class UBP_HUD_Warning_C final : public UHUDWarningUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HighlightAnim;                                     // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             WaringText;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Caption;                                           // 0x0288(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BP_HUD_Warning(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetText(const class FText& InCaption);
	void FadeIn();
	void FadeOut();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HUD_Warning_C">();
	}
	static class UBP_HUD_Warning_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_HUD_Warning_C>();
	}
};
static_assert(alignof(UBP_HUD_Warning_C) == 0x000008, "Wrong alignment on UBP_HUD_Warning_C");
static_assert(sizeof(UBP_HUD_Warning_C) == 0x0002A0, "Wrong size on UBP_HUD_Warning_C");
static_assert(offsetof(UBP_HUD_Warning_C, UberGraphFrame) == 0x000260, "Member 'UBP_HUD_Warning_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_HUD_Warning_C, FadeOutAnim) == 0x000268, "Member 'UBP_HUD_Warning_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_HUD_Warning_C, FadeInAnim) == 0x000270, "Member 'UBP_HUD_Warning_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_HUD_Warning_C, HighlightAnim) == 0x000278, "Member 'UBP_HUD_Warning_C::HighlightAnim' has a wrong offset!");
static_assert(offsetof(UBP_HUD_Warning_C, WaringText) == 0x000280, "Member 'UBP_HUD_Warning_C::WaringText' has a wrong offset!");
static_assert(offsetof(UBP_HUD_Warning_C, Caption) == 0x000288, "Member 'UBP_HUD_Warning_C::Caption' has a wrong offset!");

}

