#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HeavyAttack_ActiveAbility

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_HeavyAttack_ActiveAbility.BP_HeavyAttack_ActiveAbility_C.ExecuteUbergraph_BP_HeavyAttack_ActiveAbility
// 0x00C0 (0x00C0 - 0x0000)
struct BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_CustomName;                     // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMandragoraGameMode*                    CallFunc_GetGameMode_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue_1;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHitReactionPassive*                    CallFunc_GetHitReactionPassive_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue_1;       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_WeaponActor_C*                      K2Node_DynamicCast_AsBP_Weapon_Actor;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_WeaponActor_OH_C*                   K2Node_DynamicCast_AsBP_Weapon_Actor_OH;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0084(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(class FName CustomName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x00A8(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue_2;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility) == 0x000008, "Wrong alignment on BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility");
static_assert(sizeof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility) == 0x0000C0, "Wrong size on BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility");
static_assert(offsetof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility, EntryPoint) == 0x000000, "Member 'BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility, Temp_delegate_Variable) == 0x000004, "Member 'BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility, CallFunc_IsValid_ReturnValue_2) == 0x000029, "Member 'BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility, CallFunc_IsValid_ReturnValue_3) == 0x00002A, "Member 'BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility, K2Node_CustomEvent_CustomName) == 0x00002C, "Member 'BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility::K2Node_CustomEvent_CustomName' has a wrong offset!");
static_assert(offsetof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility, K2Node_SwitchName_CmpSuccess) == 0x000034, "Member 'BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility, CallFunc_GetGameMode_ReturnValue) == 0x000038, "Member 'BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000040, "Member 'BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility, CallFunc_SpawnVisualEntity_ReturnValue_1) == 0x000048, "Member 'BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility::CallFunc_SpawnVisualEntity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility, CallFunc_GetAbilityController_ReturnValue) == 0x000050, "Member 'BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility, CallFunc_GetHitReactionPassive_ReturnValue) == 0x000058, "Member 'BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility::CallFunc_GetHitReactionPassive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility, CallFunc_GetAbilityController_ReturnValue_1) == 0x000060, "Member 'BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility::CallFunc_GetAbilityController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility, K2Node_DynamicCast_AsBP_Weapon_Actor) == 0x000068, "Member 'BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility::K2Node_DynamicCast_AsBP_Weapon_Actor' has a wrong offset!");
static_assert(offsetof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility, CallFunc_PostEvent_ReturnValue) == 0x000074, "Member 'BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility, K2Node_DynamicCast_AsBP_Weapon_Actor_OH) == 0x000078, "Member 'BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility::K2Node_DynamicCast_AsBP_Weapon_Actor_OH' has a wrong offset!");
static_assert(offsetof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility, Temp_delegate_Variable_1) == 0x000084, "Member 'BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility, K2Node_CreateDelegate_OutputDelegate_1) == 0x000094, "Member 'BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility, CallFunc_PostEvent_ReturnValue_1) == 0x0000A4, "Member 'BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility, Temp_delegate_Variable_2) == 0x0000A8, "Member 'BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility, CallFunc_PostEvent_ReturnValue_2) == 0x0000B8, "Member 'BP_HeavyAttack_ActiveAbility_C_ExecuteUbergraph_BP_HeavyAttack_ActiveAbility::CallFunc_PostEvent_ReturnValue_2' has a wrong offset!");

// Function BP_HeavyAttack_ActiveAbility.BP_HeavyAttack_ActiveAbility_C.OnAbilityCustomEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_HeavyAttack_ActiveAbility_C_OnAbilityCustomEvent final
{
public:
	class FName                                   CustomName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HeavyAttack_ActiveAbility_C_OnAbilityCustomEvent) == 0x000004, "Wrong alignment on BP_HeavyAttack_ActiveAbility_C_OnAbilityCustomEvent");
static_assert(sizeof(BP_HeavyAttack_ActiveAbility_C_OnAbilityCustomEvent) == 0x000008, "Wrong size on BP_HeavyAttack_ActiveAbility_C_OnAbilityCustomEvent");
static_assert(offsetof(BP_HeavyAttack_ActiveAbility_C_OnAbilityCustomEvent, CustomName) == 0x000000, "Member 'BP_HeavyAttack_ActiveAbility_C_OnAbilityCustomEvent::CustomName' has a wrong offset!");

}

