#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractButton_Double

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_InteractButton_Double.BP_InteractButton_Double_C
// 0x0108 (0x0460 - 0x0358)
class UBP_InteractButton_Double_C final : public UInteractButtonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                ButtonFrame;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Caption1;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Caption2;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Caption3;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HotkeyIcon;                                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HotkeyIcon2;                                       // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HotkeyIcon3;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HotkeyIcon4;                                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HotkeyText;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HotkeyText2;                                       // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HotkeyText3;                                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HotkeyText4;                                       // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HotkeyTextBorder;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HotkeyTextBorder2;                                 // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HotkeyTextBorder3;                                 // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HotkeyTextBorder4;                                 // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Slash;                                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Caption1Text;                                      // 0x03F0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   Caption2Text;                                      // 0x0408(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x0420(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnPressed;                                         // 0x0430(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   Caption3Text;                                      // 0x0440(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          Caption1Active;                                    // 0x0458(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Caption2Active;                                    // 0x0459(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Hovered;                                           // 0x045A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_InteractButton_Double(int32 EntryPoint);
	void OnSetHotkeyText(const TArray<class FText>& HotkeyTexts);
	void OnSetHotkeyImages(const TArray<class UTexture2D*>& HotkeyImages);
	void OnSetState(bool bInCaption1Active, bool bInCaption2Active);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void FadeIn(float AnimDuration);
	void FadeOut(float AnimDuration);
	void SetupInteract(const class FText& Caption1_0, bool Caption1Active_0, const class FText& Caption2_0, bool Caption2Active_0, const class FText& Captions3);
	void Set_Active();
	void SetInactive();
	void SetText(const class FText& Caption1_0, const class FText& Caption2_0, const class FText& Caption3_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InteractButton_Double_C">();
	}
	static class UBP_InteractButton_Double_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_InteractButton_Double_C>();
	}
};
static_assert(alignof(UBP_InteractButton_Double_C) == 0x000008, "Wrong alignment on UBP_InteractButton_Double_C");
static_assert(sizeof(UBP_InteractButton_Double_C) == 0x000460, "Wrong size on UBP_InteractButton_Double_C");
static_assert(offsetof(UBP_InteractButton_Double_C, UberGraphFrame) == 0x000358, "Member 'UBP_InteractButton_Double_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Double_C, FadeInAnim) == 0x000360, "Member 'UBP_InteractButton_Double_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Double_C, ButtonFrame) == 0x000368, "Member 'UBP_InteractButton_Double_C::ButtonFrame' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Double_C, Caption1) == 0x000370, "Member 'UBP_InteractButton_Double_C::Caption1' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Double_C, Caption2) == 0x000378, "Member 'UBP_InteractButton_Double_C::Caption2' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Double_C, Caption3) == 0x000380, "Member 'UBP_InteractButton_Double_C::Caption3' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Double_C, HotkeyIcon) == 0x000388, "Member 'UBP_InteractButton_Double_C::HotkeyIcon' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Double_C, HotkeyIcon2) == 0x000390, "Member 'UBP_InteractButton_Double_C::HotkeyIcon2' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Double_C, HotkeyIcon3) == 0x000398, "Member 'UBP_InteractButton_Double_C::HotkeyIcon3' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Double_C, HotkeyIcon4) == 0x0003A0, "Member 'UBP_InteractButton_Double_C::HotkeyIcon4' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Double_C, HotkeyText) == 0x0003A8, "Member 'UBP_InteractButton_Double_C::HotkeyText' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Double_C, HotkeyText2) == 0x0003B0, "Member 'UBP_InteractButton_Double_C::HotkeyText2' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Double_C, HotkeyText3) == 0x0003B8, "Member 'UBP_InteractButton_Double_C::HotkeyText3' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Double_C, HotkeyText4) == 0x0003C0, "Member 'UBP_InteractButton_Double_C::HotkeyText4' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Double_C, HotkeyTextBorder) == 0x0003C8, "Member 'UBP_InteractButton_Double_C::HotkeyTextBorder' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Double_C, HotkeyTextBorder2) == 0x0003D0, "Member 'UBP_InteractButton_Double_C::HotkeyTextBorder2' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Double_C, HotkeyTextBorder3) == 0x0003D8, "Member 'UBP_InteractButton_Double_C::HotkeyTextBorder3' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Double_C, HotkeyTextBorder4) == 0x0003E0, "Member 'UBP_InteractButton_Double_C::HotkeyTextBorder4' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Double_C, Slash) == 0x0003E8, "Member 'UBP_InteractButton_Double_C::Slash' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Double_C, Caption1Text) == 0x0003F0, "Member 'UBP_InteractButton_Double_C::Caption1Text' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Double_C, Caption2Text) == 0x000408, "Member 'UBP_InteractButton_Double_C::Caption2Text' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Double_C, OnClicked) == 0x000420, "Member 'UBP_InteractButton_Double_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Double_C, OnPressed) == 0x000430, "Member 'UBP_InteractButton_Double_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Double_C, Caption3Text) == 0x000440, "Member 'UBP_InteractButton_Double_C::Caption3Text' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Double_C, Caption1Active) == 0x000458, "Member 'UBP_InteractButton_Double_C::Caption1Active' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Double_C, Caption2Active) == 0x000459, "Member 'UBP_InteractButton_Double_C::Caption2Active' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Double_C, Hovered) == 0x00045A, "Member 'UBP_InteractButton_Double_C::Hovered' has a wrong offset!");

}

