#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IceImp_ShardProjectile

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_IceImp_ShardProjectile.BP_IceImp_ShardProjectile_C.ExecuteUbergraph_BP_IceImp_ShardProjectile
// 0x0018 (0x0018 - 0x0000)
struct BP_IceImp_ShardProjectile_C_ExecuteUbergraph_BP_IceImp_ShardProjectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IceImp_ShardProjectile_C_ExecuteUbergraph_BP_IceImp_ShardProjectile) == 0x000008, "Wrong alignment on BP_IceImp_ShardProjectile_C_ExecuteUbergraph_BP_IceImp_ShardProjectile");
static_assert(sizeof(BP_IceImp_ShardProjectile_C_ExecuteUbergraph_BP_IceImp_ShardProjectile) == 0x000018, "Wrong size on BP_IceImp_ShardProjectile_C_ExecuteUbergraph_BP_IceImp_ShardProjectile");
static_assert(offsetof(BP_IceImp_ShardProjectile_C_ExecuteUbergraph_BP_IceImp_ShardProjectile, EntryPoint) == 0x000000, "Member 'BP_IceImp_ShardProjectile_C_ExecuteUbergraph_BP_IceImp_ShardProjectile::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_IceImp_ShardProjectile_C_ExecuteUbergraph_BP_IceImp_ShardProjectile, CallFunc_GetManGameMode_ReturnValue) == 0x000008, "Member 'BP_IceImp_ShardProjectile_C_ExecuteUbergraph_BP_IceImp_ShardProjectile::CallFunc_GetManGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IceImp_ShardProjectile_C_ExecuteUbergraph_BP_IceImp_ShardProjectile, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000010, "Member 'BP_IceImp_ShardProjectile_C_ExecuteUbergraph_BP_IceImp_ShardProjectile::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");

}

