#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IceImp_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_IceImp_Anim.BP_IceImp_Anim_C.ExecuteUbergraph_BP_IceImp_Anim
// 0x0054 (0x0054 - 0x0000)
struct BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bForced;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFacing_ReturnValue;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_InterpolateBySpeed_ReturnValue;           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim) == 0x000004, "Wrong alignment on BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim");
static_assert(sizeof(BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim) == 0x000054, "Wrong size on BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim");
static_assert(offsetof(BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim, EntryPoint) == 0x000000, "Member 'BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim, CallFunc_MakeRotator_ReturnValue) == 0x000010, "Member 'BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim, CallFunc_MakeRotator_ReturnValue_1) == 0x00001C, "Member 'BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim, CallFunc_MakeRotator_ReturnValue_2) == 0x000028, "Member 'BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim, CallFunc_MakeRotator_ReturnValue_3) == 0x000034, "Member 'BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim::CallFunc_MakeRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim, K2Node_Event_bForced) == 0x000040, "Member 'BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim::K2Node_Event_bForced' has a wrong offset!");
static_assert(offsetof(BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim, CallFunc_GetFacing_ReturnValue) == 0x000044, "Member 'BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim::CallFunc_GetFacing_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000048, "Member 'BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00004C, "Member 'BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim, CallFunc_InterpolateBySpeed_ReturnValue) == 0x000050, "Member 'BP_IceImp_Anim_C_ExecuteUbergraph_BP_IceImp_Anim::CallFunc_InterpolateBySpeed_ReturnValue' has a wrong offset!");

// Function BP_IceImp_Anim.BP_IceImp_Anim_C.OnFacingChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_IceImp_Anim_C_OnFacingChanged final
{
public:
	bool                                          bForced;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_IceImp_Anim_C_OnFacingChanged) == 0x000001, "Wrong alignment on BP_IceImp_Anim_C_OnFacingChanged");
static_assert(sizeof(BP_IceImp_Anim_C_OnFacingChanged) == 0x000001, "Wrong size on BP_IceImp_Anim_C_OnFacingChanged");
static_assert(offsetof(BP_IceImp_Anim_C_OnFacingChanged, bForced) == 0x000000, "Member 'BP_IceImp_Anim_C_OnFacingChanged::bForced' has a wrong offset!");

// Function BP_IceImp_Anim.BP_IceImp_Anim_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct BP_IceImp_Anim_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IceImp_Anim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on BP_IceImp_Anim_C_BlueprintUpdateAnimation");
static_assert(sizeof(BP_IceImp_Anim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on BP_IceImp_Anim_C_BlueprintUpdateAnimation");
static_assert(offsetof(BP_IceImp_Anim_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'BP_IceImp_Anim_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function BP_IceImp_Anim.BP_IceImp_Anim_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct BP_IceImp_Anim_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BP_IceImp_Anim_C_AnimGraph) == 0x000008, "Wrong alignment on BP_IceImp_Anim_C_AnimGraph");
static_assert(sizeof(BP_IceImp_Anim_C_AnimGraph) == 0x000010, "Wrong size on BP_IceImp_Anim_C_AnimGraph");
static_assert(offsetof(BP_IceImp_Anim_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'BP_IceImp_Anim_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

