#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractiveDoor_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_InteractiveDoor_Anim.BP_InteractiveDoor_Anim_C
// 0x04E0 (0x0B80 - 0x06A0)
class UBP_InteractiveDoor_Anim_C final : public UAnimInstanceBase
{
public:
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0030)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x06D8(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0780(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0800(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0880(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0900(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0980(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0A00(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0AA8(0x0080)()
	struct FAnimNode_MirrorBones                  AnimGraphNode_MirrorBones;                         // 0x0B28(0x0048)()
	bool                                          IsOpen;                                            // 0x0B70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Mirrored;                                          // 0x0B71(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_InteractiveDoor_Anim_AnimGraphNode_MirrorBones_D64A3B9E46F12C6F3C994394BE1F754C();
	void OnAnimStartRequest(class UAnimID* AnimID);
	void BlueprintInitializeAnimation();
	void BlueprintBeginPlay();
	void ExecuteUbergraph_BP_InteractiveDoor_Anim(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InteractiveDoor_Anim_C">();
	}
	static class UBP_InteractiveDoor_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_InteractiveDoor_Anim_C>();
	}
};
static_assert(alignof(UBP_InteractiveDoor_Anim_C) == 0x000010, "Wrong alignment on UBP_InteractiveDoor_Anim_C");
static_assert(sizeof(UBP_InteractiveDoor_Anim_C) == 0x000B80, "Wrong size on UBP_InteractiveDoor_Anim_C");
static_assert(offsetof(UBP_InteractiveDoor_Anim_C, UberGraphFrame) == 0x0006A0, "Member 'UBP_InteractiveDoor_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDoor_Anim_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UBP_InteractiveDoor_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDoor_Anim_C, AnimGraphNode_BlendListByInt) == 0x0006D8, "Member 'UBP_InteractiveDoor_Anim_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDoor_Anim_C, AnimGraphNode_SequencePlayer_5) == 0x000780, "Member 'UBP_InteractiveDoor_Anim_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDoor_Anim_C, AnimGraphNode_SequencePlayer_4) == 0x000800, "Member 'UBP_InteractiveDoor_Anim_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDoor_Anim_C, AnimGraphNode_SequencePlayer_3) == 0x000880, "Member 'UBP_InteractiveDoor_Anim_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDoor_Anim_C, AnimGraphNode_SequencePlayer_2) == 0x000900, "Member 'UBP_InteractiveDoor_Anim_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDoor_Anim_C, AnimGraphNode_SequencePlayer_1) == 0x000980, "Member 'UBP_InteractiveDoor_Anim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDoor_Anim_C, AnimGraphNode_BlendListByBool) == 0x000A00, "Member 'UBP_InteractiveDoor_Anim_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDoor_Anim_C, AnimGraphNode_SequencePlayer) == 0x000AA8, "Member 'UBP_InteractiveDoor_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDoor_Anim_C, AnimGraphNode_MirrorBones) == 0x000B28, "Member 'UBP_InteractiveDoor_Anim_C::AnimGraphNode_MirrorBones' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDoor_Anim_C, IsOpen) == 0x000B70, "Member 'UBP_InteractiveDoor_Anim_C::IsOpen' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDoor_Anim_C, Mirrored) == 0x000B71, "Member 'UBP_InteractiveDoor_Anim_C::Mirrored' has a wrong offset!");

}

