#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InventoryWindow

#include "Basic.hpp"

#include "man_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_InventoryWindow.BP_InventoryWindow_C.ExecuteUbergraph_BP_InventoryWindow
// 0x01A0 (0x01A0 - 0x0000)
struct BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInStatsVisible;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x000C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration_1;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue;         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue_1;       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHeroProperty                                 K2Node_Event_PropertyType;                         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Value;                                // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RoundedFloatValue;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_RoundedIntValue;                      // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAnimate_1;                           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Event_Widget;                               // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemAbility*                           K2Node_Event_Item;                                 // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_12;     // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_11;     // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_10;     // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_9;      // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_8;      // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_7;      // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_6;      // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_5;      // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_4;      // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_3;      // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_2;      // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemSlot                                     K2Node_Event_ItemSlot;                             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_FilterName;                           // 0x0100(0x0018)(ConstParm)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_1;      // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_SortName;                             // 0x0120(0x0018)(ConstParm)
	class FText                                   K2Node_Event_ItemRequirementText;                  // 0x0138(0x0018)(ConstParm)
	class UItemAbility*                           K2Node_Event_InItem;                               // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemAbility*                           K2Node_Event_InComparedItem;                       // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEquipped;                            // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bAnimate;                             // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_163[0x5];                                      // 0x0163(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetHeroName_ReturnValue;                  // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0178(0x0018)()
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference;        // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDisplay                                 K2Node_Event_InInputDisplay;                       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDisplay                                 K2Node_Event_InControlDisplay;                     // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow) == 0x000008, "Wrong alignment on BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow");
static_assert(sizeof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow) == 0x0001A0, "Wrong size on BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, EntryPoint) == 0x000000, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_Event_bInStatsVisible) == 0x000004, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_Event_bInStatsVisible' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, Temp_bool_Variable) == 0x000005, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, Temp_byte_Variable) == 0x000006, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, Temp_byte_Variable_1) == 0x000007, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_Event_IsDesignTime) == 0x000008, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_Event_MyGeometry) == 0x00000C, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_Event_InDeltaTime) == 0x000044, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_Event_AnimDuration_1) == 0x000048, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_Event_AnimDuration_1' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, CallFunc_GetAnimPlaybackSpeed_ReturnValue) == 0x00004C, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::CallFunc_GetAnimPlaybackSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_Event_AnimDuration) == 0x000050, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_Event_AnimDuration' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, CallFunc_PlayAnimation_ReturnValue) == 0x000058, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, CallFunc_GetAnimPlaybackSpeed_ReturnValue_1) == 0x000060, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::CallFunc_GetAnimPlaybackSpeed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, CallFunc_PlayAnimation_ReturnValue_1) == 0x000068, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_Event_PropertyType) == 0x000070, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_Event_PropertyType' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_Event_Value) == 0x000074, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_Event_RoundedFloatValue) == 0x000078, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_Event_RoundedFloatValue' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_Event_RoundedIntValue) == 0x00007C, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_Event_RoundedIntValue' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_Event_bAnimate_1) == 0x000080, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_Event_bAnimate_1' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_Event_Widget) == 0x000088, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_Event_Widget' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_Event_Item) == 0x000090, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_Event_Item' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, CallFunc_Not_PreBool_ReturnValue) == 0x000098, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_ComponentBoundEvent_WidgetReference_12) == 0x0000A0, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_ComponentBoundEvent_WidgetReference_12' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_ComponentBoundEvent_WidgetReference_11) == 0x0000A8, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_ComponentBoundEvent_WidgetReference_11' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_ComponentBoundEvent_WidgetReference_10) == 0x0000B0, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_ComponentBoundEvent_WidgetReference_10' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_ComponentBoundEvent_WidgetReference_9) == 0x0000B8, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_ComponentBoundEvent_WidgetReference_9' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_ComponentBoundEvent_WidgetReference_8) == 0x0000C0, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_ComponentBoundEvent_WidgetReference_8' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_ComponentBoundEvent_WidgetReference_7) == 0x0000C8, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_ComponentBoundEvent_WidgetReference_7' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_ComponentBoundEvent_WidgetReference_6) == 0x0000D0, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_ComponentBoundEvent_WidgetReference_6' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_ComponentBoundEvent_WidgetReference_5) == 0x0000D8, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_ComponentBoundEvent_WidgetReference_5' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_ComponentBoundEvent_WidgetReference_4) == 0x0000E0, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_ComponentBoundEvent_WidgetReference_4' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_ComponentBoundEvent_WidgetReference_3) == 0x0000E8, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_ComponentBoundEvent_WidgetReference_3' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_ComponentBoundEvent_WidgetReference_2) == 0x0000F0, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_ComponentBoundEvent_WidgetReference_2' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_Event_ItemSlot) == 0x0000F8, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_Event_ItemSlot' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_Event_FilterName) == 0x000100, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_Event_FilterName' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_ComponentBoundEvent_WidgetReference_1) == 0x000118, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_ComponentBoundEvent_WidgetReference_1' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_Event_SortName) == 0x000120, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_Event_SortName' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_Event_ItemRequirementText) == 0x000138, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_Event_ItemRequirementText' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_Event_InItem) == 0x000150, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_Event_InItem' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_Event_InComparedItem) == 0x000158, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_Event_InComparedItem' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_Event_bEquipped) == 0x000160, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_Event_bEquipped' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_Event_bAnimate) == 0x000161, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_Event_bAnimate' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_Select_Default) == 0x000162, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, CallFunc_GetHeroName_ReturnValue) == 0x000168, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::CallFunc_GetHeroName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, CallFunc_Conv_StringToText_ReturnValue) == 0x000178, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_ComponentBoundEvent_WidgetReference) == 0x000190, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_ComponentBoundEvent_WidgetReference' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_Event_InInputDisplay) == 0x000198, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_Event_InInputDisplay' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow, K2Node_Event_InControlDisplay) == 0x000199, "Member 'BP_InventoryWindow_C_ExecuteUbergraph_BP_InventoryWindow::K2Node_Event_InControlDisplay' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.OnToggleStats
// 0x0001 (0x0001 - 0x0000)
struct BP_InventoryWindow_C_OnToggleStats final
{
public:
	bool                                          bInStatsVisible;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InventoryWindow_C_OnToggleStats) == 0x000001, "Wrong alignment on BP_InventoryWindow_C_OnToggleStats");
static_assert(sizeof(BP_InventoryWindow_C_OnToggleStats) == 0x000001, "Wrong size on BP_InventoryWindow_C_OnToggleStats");
static_assert(offsetof(BP_InventoryWindow_C_OnToggleStats, bInStatsVisible) == 0x000000, "Member 'BP_InventoryWindow_C_OnToggleStats::bInStatsVisible' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.OnSetInputDisplay
// 0x0002 (0x0002 - 0x0000)
struct BP_InventoryWindow_C_OnSetInputDisplay final
{
public:
	EInputDisplay                                 InInputDisplay;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDisplay                                 InControlDisplay;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InventoryWindow_C_OnSetInputDisplay) == 0x000001, "Wrong alignment on BP_InventoryWindow_C_OnSetInputDisplay");
static_assert(sizeof(BP_InventoryWindow_C_OnSetInputDisplay) == 0x000002, "Wrong size on BP_InventoryWindow_C_OnSetInputDisplay");
static_assert(offsetof(BP_InventoryWindow_C_OnSetInputDisplay, InInputDisplay) == 0x000000, "Member 'BP_InventoryWindow_C_OnSetInputDisplay::InInputDisplay' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_OnSetInputDisplay, InControlDisplay) == 0x000001, "Member 'BP_InventoryWindow_C_OnSetInputDisplay::InControlDisplay' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.BndEvt__BP_InventoryWindow_Filter_All_K2Node_ComponentBoundEvent_29_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_All_K2Node_ComponentBoundEvent_29_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_All_K2Node_ComponentBoundEvent_29_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_All_K2Node_ComponentBoundEvent_29_OnClicked__DelegateSignature");
static_assert(sizeof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_All_K2Node_ComponentBoundEvent_29_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_All_K2Node_ComponentBoundEvent_29_OnClicked__DelegateSignature");
static_assert(offsetof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_All_K2Node_ComponentBoundEvent_29_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_All_K2Node_ComponentBoundEvent_29_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.OnUpdateEquippedItemDetailsPanel
// 0x0030 (0x0030 - 0x0000)
struct BP_InventoryWindow_C_OnUpdateEquippedItemDetailsPanel final
{
public:
	class FText                                   ItemRequirementText;                               // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UItemAbility*                           InItem;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemAbility*                           InComparedItem;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEquipped;                                         // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bAnimate;                                          // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InventoryWindow_C_OnUpdateEquippedItemDetailsPanel) == 0x000008, "Wrong alignment on BP_InventoryWindow_C_OnUpdateEquippedItemDetailsPanel");
static_assert(sizeof(BP_InventoryWindow_C_OnUpdateEquippedItemDetailsPanel) == 0x000030, "Wrong size on BP_InventoryWindow_C_OnUpdateEquippedItemDetailsPanel");
static_assert(offsetof(BP_InventoryWindow_C_OnUpdateEquippedItemDetailsPanel, ItemRequirementText) == 0x000000, "Member 'BP_InventoryWindow_C_OnUpdateEquippedItemDetailsPanel::ItemRequirementText' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_OnUpdateEquippedItemDetailsPanel, InItem) == 0x000018, "Member 'BP_InventoryWindow_C_OnUpdateEquippedItemDetailsPanel::InItem' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_OnUpdateEquippedItemDetailsPanel, InComparedItem) == 0x000020, "Member 'BP_InventoryWindow_C_OnUpdateEquippedItemDetailsPanel::InComparedItem' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_OnUpdateEquippedItemDetailsPanel, bEquipped) == 0x000028, "Member 'BP_InventoryWindow_C_OnUpdateEquippedItemDetailsPanel::bEquipped' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_OnUpdateEquippedItemDetailsPanel, bAnimate) == 0x000029, "Member 'BP_InventoryWindow_C_OnUpdateEquippedItemDetailsPanel::bAnimate' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.OnSortChanged
// 0x0018 (0x0018 - 0x0000)
struct BP_InventoryWindow_C_OnSortChanged final
{
public:
	class FText                                   SortName;                                          // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_InventoryWindow_C_OnSortChanged) == 0x000008, "Wrong alignment on BP_InventoryWindow_C_OnSortChanged");
static_assert(sizeof(BP_InventoryWindow_C_OnSortChanged) == 0x000018, "Wrong size on BP_InventoryWindow_C_OnSortChanged");
static_assert(offsetof(BP_InventoryWindow_C_OnSortChanged, SortName) == 0x000000, "Member 'BP_InventoryWindow_C_OnSortChanged::SortName' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.BndEvt__BP_InventoryWindow_Filter_Diagrams_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Diagrams_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Diagrams_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Diagrams_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature");
static_assert(sizeof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Diagrams_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Diagrams_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature");
static_assert(offsetof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Diagrams_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Diagrams_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.OnSetFilterSlot
// 0x0020 (0x0020 - 0x0000)
struct BP_InventoryWindow_C_OnSetFilterSlot final
{
public:
	EItemSlot                                     ItemSlot;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   FilterName;                                        // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_InventoryWindow_C_OnSetFilterSlot) == 0x000008, "Wrong alignment on BP_InventoryWindow_C_OnSetFilterSlot");
static_assert(sizeof(BP_InventoryWindow_C_OnSetFilterSlot) == 0x000020, "Wrong size on BP_InventoryWindow_C_OnSetFilterSlot");
static_assert(offsetof(BP_InventoryWindow_C_OnSetFilterSlot, ItemSlot) == 0x000000, "Member 'BP_InventoryWindow_C_OnSetFilterSlot::ItemSlot' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_OnSetFilterSlot, FilterName) == 0x000008, "Member 'BP_InventoryWindow_C_OnSetFilterSlot::FilterName' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.BndEvt__BP_InventoryWindow_Filter_QuickUse_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_QuickUse_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_QuickUse_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_QuickUse_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature");
static_assert(sizeof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_QuickUse_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_QuickUse_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature");
static_assert(offsetof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_QuickUse_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_QuickUse_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.BndEvt__BP_InventoryWindow_Filter_QuestItems_K2Node_ComponentBoundEvent_24_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_QuestItems_K2Node_ComponentBoundEvent_24_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_QuestItems_K2Node_ComponentBoundEvent_24_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_QuestItems_K2Node_ComponentBoundEvent_24_OnClicked__DelegateSignature");
static_assert(sizeof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_QuestItems_K2Node_ComponentBoundEvent_24_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_QuestItems_K2Node_ComponentBoundEvent_24_OnClicked__DelegateSignature");
static_assert(offsetof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_QuestItems_K2Node_ComponentBoundEvent_24_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_QuestItems_K2Node_ComponentBoundEvent_24_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.BndEvt__BP_InventoryWindow_Filter_Materials_K2Node_ComponentBoundEvent_23_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Materials_K2Node_ComponentBoundEvent_23_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Materials_K2Node_ComponentBoundEvent_23_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Materials_K2Node_ComponentBoundEvent_23_OnClicked__DelegateSignature");
static_assert(sizeof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Materials_K2Node_ComponentBoundEvent_23_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Materials_K2Node_ComponentBoundEvent_23_OnClicked__DelegateSignature");
static_assert(offsetof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Materials_K2Node_ComponentBoundEvent_23_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Materials_K2Node_ComponentBoundEvent_23_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.BndEvt__BP_InventoryWindow_Filter_Ring_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Ring_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Ring_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Ring_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature");
static_assert(sizeof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Ring_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Ring_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature");
static_assert(offsetof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Ring_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Ring_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.BndEvt__BP_InventoryWindow_Filter_Back_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Back_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Back_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Back_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature");
static_assert(sizeof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Back_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Back_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature");
static_assert(offsetof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Back_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Back_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.BndEvt__BP_InventoryWindow_Filter_Legs_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Legs_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Legs_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Legs_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature");
static_assert(sizeof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Legs_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Legs_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature");
static_assert(offsetof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Legs_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Legs_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.BndEvt__BP_InventoryWindow_Filter_Hands_K2Node_ComponentBoundEvent_18_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Hands_K2Node_ComponentBoundEvent_18_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Hands_K2Node_ComponentBoundEvent_18_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Hands_K2Node_ComponentBoundEvent_18_OnClicked__DelegateSignature");
static_assert(sizeof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Hands_K2Node_ComponentBoundEvent_18_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Hands_K2Node_ComponentBoundEvent_18_OnClicked__DelegateSignature");
static_assert(offsetof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Hands_K2Node_ComponentBoundEvent_18_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Hands_K2Node_ComponentBoundEvent_18_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.BndEvt__BP_InventoryWindow_Filter_Head_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Head_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Head_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Head_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature");
static_assert(sizeof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Head_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Head_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature");
static_assert(offsetof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Head_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Head_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.BndEvt__BP_InventoryWindow_Filter_Chest_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Chest_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Chest_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Chest_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature");
static_assert(sizeof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Chest_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Chest_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature");
static_assert(offsetof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Chest_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Chest_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.BndEvt__BP_InventoryWindow_Filter_Offhand_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Offhand_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Offhand_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Offhand_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature");
static_assert(sizeof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Offhand_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Offhand_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature");
static_assert(offsetof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Offhand_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_Offhand_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.BndEvt__BP_InventoryWindow_Filter_MainHand_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_MainHand_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_MainHand_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_MainHand_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature");
static_assert(sizeof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_MainHand_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_MainHand_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature");
static_assert(offsetof(BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_MainHand_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_InventoryWindow_C_BndEvt__BP_InventoryWindow_Filter_MainHand_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.OnUseItem
// 0x0010 (0x0010 - 0x0000)
struct BP_InventoryWindow_C_OnUseItem final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemAbility*                           Item;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InventoryWindow_C_OnUseItem) == 0x000008, "Wrong alignment on BP_InventoryWindow_C_OnUseItem");
static_assert(sizeof(BP_InventoryWindow_C_OnUseItem) == 0x000010, "Wrong size on BP_InventoryWindow_C_OnUseItem");
static_assert(offsetof(BP_InventoryWindow_C_OnUseItem, Widget) == 0x000000, "Member 'BP_InventoryWindow_C_OnUseItem::Widget' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_OnUseItem, Item) == 0x000008, "Member 'BP_InventoryWindow_C_OnUseItem::Item' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.OnPropertyChanged
// 0x0014 (0x0014 - 0x0000)
struct BP_InventoryWindow_C_OnPropertyChanged final
{
public:
	EHeroProperty                                 PropertyType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Value;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RoundedFloatValue;                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RoundedIntValue;                                   // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAnimate;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InventoryWindow_C_OnPropertyChanged) == 0x000004, "Wrong alignment on BP_InventoryWindow_C_OnPropertyChanged");
static_assert(sizeof(BP_InventoryWindow_C_OnPropertyChanged) == 0x000014, "Wrong size on BP_InventoryWindow_C_OnPropertyChanged");
static_assert(offsetof(BP_InventoryWindow_C_OnPropertyChanged, PropertyType) == 0x000000, "Member 'BP_InventoryWindow_C_OnPropertyChanged::PropertyType' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_OnPropertyChanged, Value) == 0x000004, "Member 'BP_InventoryWindow_C_OnPropertyChanged::Value' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_OnPropertyChanged, RoundedFloatValue) == 0x000008, "Member 'BP_InventoryWindow_C_OnPropertyChanged::RoundedFloatValue' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_OnPropertyChanged, RoundedIntValue) == 0x00000C, "Member 'BP_InventoryWindow_C_OnPropertyChanged::RoundedIntValue' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_OnPropertyChanged, bAnimate) == 0x000010, "Member 'BP_InventoryWindow_C_OnPropertyChanged::bAnimate' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.OnHide
// 0x0004 (0x0004 - 0x0000)
struct BP_InventoryWindow_C_OnHide final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InventoryWindow_C_OnHide) == 0x000004, "Wrong alignment on BP_InventoryWindow_C_OnHide");
static_assert(sizeof(BP_InventoryWindow_C_OnHide) == 0x000004, "Wrong size on BP_InventoryWindow_C_OnHide");
static_assert(offsetof(BP_InventoryWindow_C_OnHide, AnimDuration) == 0x000000, "Member 'BP_InventoryWindow_C_OnHide::AnimDuration' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.OnShow
// 0x0004 (0x0004 - 0x0000)
struct BP_InventoryWindow_C_OnShow final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InventoryWindow_C_OnShow) == 0x000004, "Wrong alignment on BP_InventoryWindow_C_OnShow");
static_assert(sizeof(BP_InventoryWindow_C_OnShow) == 0x000004, "Wrong size on BP_InventoryWindow_C_OnShow");
static_assert(offsetof(BP_InventoryWindow_C_OnShow, AnimDuration) == 0x000000, "Member 'BP_InventoryWindow_C_OnShow::AnimDuration' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_InventoryWindow_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InventoryWindow_C_Tick) == 0x000004, "Wrong alignment on BP_InventoryWindow_C_Tick");
static_assert(sizeof(BP_InventoryWindow_C_Tick) == 0x00003C, "Wrong size on BP_InventoryWindow_C_Tick");
static_assert(offsetof(BP_InventoryWindow_C_Tick, MyGeometry) == 0x000000, "Member 'BP_InventoryWindow_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_InventoryWindow_C_Tick::InDeltaTime' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_InventoryWindow_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InventoryWindow_C_PreConstruct) == 0x000001, "Wrong alignment on BP_InventoryWindow_C_PreConstruct");
static_assert(sizeof(BP_InventoryWindow_C_PreConstruct) == 0x000001, "Wrong size on BP_InventoryWindow_C_PreConstruct");
static_assert(offsetof(BP_InventoryWindow_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_InventoryWindow_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.BtnHotkeyBClicked
// 0x0002 (0x0002 - 0x0000)
struct BP_InventoryWindow_C_BtnHotkeyBClicked final
{
public:
	bool                                          OpenPauseMenu;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OnlyClose;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InventoryWindow_C_BtnHotkeyBClicked) == 0x000001, "Wrong alignment on BP_InventoryWindow_C_BtnHotkeyBClicked");
static_assert(sizeof(BP_InventoryWindow_C_BtnHotkeyBClicked) == 0x000002, "Wrong size on BP_InventoryWindow_C_BtnHotkeyBClicked");
static_assert(offsetof(BP_InventoryWindow_C_BtnHotkeyBClicked, OpenPauseMenu) == 0x000000, "Member 'BP_InventoryWindow_C_BtnHotkeyBClicked::OpenPauseMenu' has a wrong offset!");
static_assert(offsetof(BP_InventoryWindow_C_BtnHotkeyBClicked, OnlyClose) == 0x000001, "Member 'BP_InventoryWindow_C_BtnHotkeyBClicked::OnlyClose' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.BtnHotkeyLS_PressClicked
// 0x0001 (0x0001 - 0x0000)
struct BP_InventoryWindow_C_BtnHotkeyLS_PressClicked final
{
public:
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InventoryWindow_C_BtnHotkeyLS_PressClicked) == 0x000001, "Wrong alignment on BP_InventoryWindow_C_BtnHotkeyLS_PressClicked");
static_assert(sizeof(BP_InventoryWindow_C_BtnHotkeyLS_PressClicked) == 0x000001, "Wrong size on BP_InventoryWindow_C_BtnHotkeyLS_PressClicked");
static_assert(offsetof(BP_InventoryWindow_C_BtnHotkeyLS_PressClicked, CallFunc_IsActive_ReturnValue) == 0x000000, "Member 'BP_InventoryWindow_C_BtnHotkeyLS_PressClicked::CallFunc_IsActive_ReturnValue' has a wrong offset!");

// Function BP_InventoryWindow.BP_InventoryWindow_C.BP_PropertyChanged
// 0x0030 (0x0030 - 0x0000)
struct BP_InventoryWindow_C_BP_PropertyChanged final
{
public:
	EHeroProperty                                 HeroProperty;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Value;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RoundedFloatValue;                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RoundedIntValue;                                   // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Animate;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
