#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractiveDummy_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_InteractiveDummy_Anim.BP_InteractiveDummy_Anim_C
// 0x0C20 (0x12C0 - 0x06A0)
class UBP_InteractiveDummy_Anim_C final : public UAnimInstanceBase
{
public:
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0030)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_1;                    // 0x06D8(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x0780(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0800(0x0158)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x0958(0x0080)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x09D8(0x00A8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0x0A80(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0B48(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x0BC8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0BF0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0C18(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0C40(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0C88(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0D08(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0D88(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0DB0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0DD8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0E58(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0ED8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0F58(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0FD8(0x0080)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x1058(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x1120(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x11E8(0x00C8)()
	int32                                         AdditiveHitAnimIx;                                 // 0x12B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void OnFacingChanged(bool bForced);
	void ExecuteUbergraph_BP_InteractiveDummy_Anim(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InteractiveDummy_Anim_C">();
	}
	static class UBP_InteractiveDummy_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_InteractiveDummy_Anim_C>();
	}
};
static_assert(alignof(UBP_InteractiveDummy_Anim_C) == 0x000010, "Wrong alignment on UBP_InteractiveDummy_Anim_C");
static_assert(sizeof(UBP_InteractiveDummy_Anim_C) == 0x0012C0, "Wrong size on UBP_InteractiveDummy_Anim_C");
static_assert(offsetof(UBP_InteractiveDummy_Anim_C, UberGraphFrame) == 0x0006A0, "Member 'UBP_InteractiveDummy_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDummy_Anim_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UBP_InteractiveDummy_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDummy_Anim_C, AnimGraphNode_BlendListByInt_1) == 0x0006D8, "Member 'UBP_InteractiveDummy_Anim_C::AnimGraphNode_BlendListByInt_1' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDummy_Anim_C, AnimGraphNode_SequencePlayer_9) == 0x000780, "Member 'UBP_InteractiveDummy_Anim_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDummy_Anim_C, AnimGraphNode_SaveCachedPose) == 0x000800, "Member 'UBP_InteractiveDummy_Anim_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDummy_Anim_C, AnimGraphNode_SequencePlayer_8) == 0x000958, "Member 'UBP_InteractiveDummy_Anim_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDummy_Anim_C, AnimGraphNode_BlendListByInt) == 0x0009D8, "Member 'UBP_InteractiveDummy_Anim_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDummy_Anim_C, AnimGraphNode_ApplyAdditive_3) == 0x000A80, "Member 'UBP_InteractiveDummy_Anim_C::AnimGraphNode_ApplyAdditive_3' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDummy_Anim_C, AnimGraphNode_SequencePlayer_7) == 0x000B48, "Member 'UBP_InteractiveDummy_Anim_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDummy_Anim_C, AnimGraphNode_UseCachedPose_4) == 0x000BC8, "Member 'UBP_InteractiveDummy_Anim_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDummy_Anim_C, AnimGraphNode_UseCachedPose_3) == 0x000BF0, "Member 'UBP_InteractiveDummy_Anim_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDummy_Anim_C, AnimGraphNode_UseCachedPose_2) == 0x000C18, "Member 'UBP_InteractiveDummy_Anim_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDummy_Anim_C, AnimGraphNode_Slot) == 0x000C40, "Member 'UBP_InteractiveDummy_Anim_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDummy_Anim_C, AnimGraphNode_SequencePlayer_6) == 0x000C88, "Member 'UBP_InteractiveDummy_Anim_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDummy_Anim_C, AnimGraphNode_SequencePlayer_5) == 0x000D08, "Member 'UBP_InteractiveDummy_Anim_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDummy_Anim_C, AnimGraphNode_UseCachedPose_1) == 0x000D88, "Member 'UBP_InteractiveDummy_Anim_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDummy_Anim_C, AnimGraphNode_UseCachedPose) == 0x000DB0, "Member 'UBP_InteractiveDummy_Anim_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDummy_Anim_C, AnimGraphNode_SequencePlayer_4) == 0x000DD8, "Member 'UBP_InteractiveDummy_Anim_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDummy_Anim_C, AnimGraphNode_SequencePlayer_3) == 0x000E58, "Member 'UBP_InteractiveDummy_Anim_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDummy_Anim_C, AnimGraphNode_SequencePlayer_2) == 0x000ED8, "Member 'UBP_InteractiveDummy_Anim_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDummy_Anim_C, AnimGraphNode_SequencePlayer_1) == 0x000F58, "Member 'UBP_InteractiveDummy_Anim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDummy_Anim_C, AnimGraphNode_SequencePlayer) == 0x000FD8, "Member 'UBP_InteractiveDummy_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDummy_Anim_C, AnimGraphNode_ApplyAdditive_2) == 0x001058, "Member 'UBP_InteractiveDummy_Anim_C::AnimGraphNode_ApplyAdditive_2' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDummy_Anim_C, AnimGraphNode_ApplyAdditive_1) == 0x001120, "Member 'UBP_InteractiveDummy_Anim_C::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDummy_Anim_C, AnimGraphNode_ApplyAdditive) == 0x0011E8, "Member 'UBP_InteractiveDummy_Anim_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveDummy_Anim_C, AdditiveHitAnimIx) == 0x0012B0, "Member 'UBP_InteractiveDummy_Anim_C::AdditiveHitAnimIx' has a wrong offset!");

}

