#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractText

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_InteractText.BP_InteractText_C
// 0x00C0 (0x0350 - 0x0290)
class UBP_InteractText_C final : public UInteractTextUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       BackgroundDissolveIn;                              // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Caption;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Caption2;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Caption2HorizontalBox;                             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Caption_Double;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         DefaultCaption;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DoubleArrow;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         DoubleCaption;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            Hotkey1;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            Hotkey2;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         InteractText;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Item;                                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemCountText;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemIcon;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockIcon;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_1;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   CaptionText;                                       // 0x0328(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          Visible_;                                          // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumberOfFadeInCalles;                              // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSmallScreen;                                     // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BP_InteractText(int32 EntryPoint);
	void OnShow(bool bDoubleInteractBtn);
	void PreConstruct(bool IsDesignTime);
	void FadeIn();
	void FadeOut();
	void SetInteractText(const class FText& Caption_0, const struct FInteractParams& InteractParams);
	void ToggleInCombatMode(bool InCombat);
	void ToggleDouble(bool IsDouble);
	void ToggleSmallScreen(bool InIsSmallScreen);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InteractText_C">();
	}
	static class UBP_InteractText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_InteractText_C>();
	}
};
static_assert(alignof(UBP_InteractText_C) == 0x000008, "Wrong alignment on UBP_InteractText_C");
static_assert(sizeof(UBP_InteractText_C) == 0x000350, "Wrong size on UBP_InteractText_C");
static_assert(offsetof(UBP_InteractText_C, UberGraphFrame) == 0x000290, "Member 'UBP_InteractText_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_InteractText_C, BackgroundDissolveIn) == 0x000298, "Member 'UBP_InteractText_C::BackgroundDissolveIn' has a wrong offset!");
static_assert(offsetof(UBP_InteractText_C, FadeInAnim) == 0x0002A0, "Member 'UBP_InteractText_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_InteractText_C, Background) == 0x0002A8, "Member 'UBP_InteractText_C::Background' has a wrong offset!");
static_assert(offsetof(UBP_InteractText_C, Caption) == 0x0002B0, "Member 'UBP_InteractText_C::Caption' has a wrong offset!");
static_assert(offsetof(UBP_InteractText_C, Caption2) == 0x0002B8, "Member 'UBP_InteractText_C::Caption2' has a wrong offset!");
static_assert(offsetof(UBP_InteractText_C, Caption2HorizontalBox) == 0x0002C0, "Member 'UBP_InteractText_C::Caption2HorizontalBox' has a wrong offset!");
static_assert(offsetof(UBP_InteractText_C, Caption_Double) == 0x0002C8, "Member 'UBP_InteractText_C::Caption_Double' has a wrong offset!");
static_assert(offsetof(UBP_InteractText_C, DefaultCaption) == 0x0002D0, "Member 'UBP_InteractText_C::DefaultCaption' has a wrong offset!");
static_assert(offsetof(UBP_InteractText_C, DoubleArrow) == 0x0002D8, "Member 'UBP_InteractText_C::DoubleArrow' has a wrong offset!");
static_assert(offsetof(UBP_InteractText_C, DoubleCaption) == 0x0002E0, "Member 'UBP_InteractText_C::DoubleCaption' has a wrong offset!");
static_assert(offsetof(UBP_InteractText_C, Hotkey1) == 0x0002E8, "Member 'UBP_InteractText_C::Hotkey1' has a wrong offset!");
static_assert(offsetof(UBP_InteractText_C, Hotkey2) == 0x0002F0, "Member 'UBP_InteractText_C::Hotkey2' has a wrong offset!");
static_assert(offsetof(UBP_InteractText_C, InteractText) == 0x0002F8, "Member 'UBP_InteractText_C::InteractText' has a wrong offset!");
static_assert(offsetof(UBP_InteractText_C, Item) == 0x000300, "Member 'UBP_InteractText_C::Item' has a wrong offset!");
static_assert(offsetof(UBP_InteractText_C, ItemCountText) == 0x000308, "Member 'UBP_InteractText_C::ItemCountText' has a wrong offset!");
static_assert(offsetof(UBP_InteractText_C, ItemIcon) == 0x000310, "Member 'UBP_InteractText_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UBP_InteractText_C, LockIcon) == 0x000318, "Member 'UBP_InteractText_C::LockIcon' has a wrong offset!");
static_assert(offsetof(UBP_InteractText_C, ScaleBox_1) == 0x000320, "Member 'UBP_InteractText_C::ScaleBox_1' has a wrong offset!");
static_assert(offsetof(UBP_InteractText_C, CaptionText) == 0x000328, "Member 'UBP_InteractText_C::CaptionText' has a wrong offset!");
static_assert(offsetof(UBP_InteractText_C, Visible_) == 0x000340, "Member 'UBP_InteractText_C::Visible_' has a wrong offset!");
static_assert(offsetof(UBP_InteractText_C, NumberOfFadeInCalles) == 0x000344, "Member 'UBP_InteractText_C::NumberOfFadeInCalles' has a wrong offset!");
static_assert(offsetof(UBP_InteractText_C, IsSmallScreen) == 0x000348, "Member 'UBP_InteractText_C::IsSmallScreen' has a wrong offset!");

}

