#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InquisitorBG2_Olen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InquisitorBG2_Olen.BP_InquisitorBG2_Olen_C
// 0x0040 (0x0818 - 0x07D8)
class ABP_InquisitorBG2_Olen_C final : public AActorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CameraSphere;                                      // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTriggerBoxComponent*                   TriggerBox;                                        // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 RightSkeletalMesh;                                 // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Inquisitor;                                     // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SpeechBubbleComponent_C*            BP_SpeechBubbleComponent;                          // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_InquisitorBG2_Olen(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InquisitorBG2_Olen_C">();
	}
	static class ABP_InquisitorBG2_Olen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_InquisitorBG2_Olen_C>();
	}
};
static_assert(alignof(ABP_InquisitorBG2_Olen_C) == 0x000008, "Wrong alignment on ABP_InquisitorBG2_Olen_C");
static_assert(sizeof(ABP_InquisitorBG2_Olen_C) == 0x000818, "Wrong size on ABP_InquisitorBG2_Olen_C");
static_assert(offsetof(ABP_InquisitorBG2_Olen_C, UberGraphFrame) == 0x0007D8, "Member 'ABP_InquisitorBG2_Olen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_InquisitorBG2_Olen_C, Ak) == 0x0007E0, "Member 'ABP_InquisitorBG2_Olen_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_InquisitorBG2_Olen_C, CameraSphere) == 0x0007E8, "Member 'ABP_InquisitorBG2_Olen_C::CameraSphere' has a wrong offset!");
static_assert(offsetof(ABP_InquisitorBG2_Olen_C, TriggerBox) == 0x0007F0, "Member 'ABP_InquisitorBG2_Olen_C::TriggerBox' has a wrong offset!");
static_assert(offsetof(ABP_InquisitorBG2_Olen_C, RightSkeletalMesh) == 0x0007F8, "Member 'ABP_InquisitorBG2_Olen_C::RightSkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_InquisitorBG2_Olen_C, SK_Inquisitor) == 0x000800, "Member 'ABP_InquisitorBG2_Olen_C::SK_Inquisitor' has a wrong offset!");
static_assert(offsetof(ABP_InquisitorBG2_Olen_C, BP_SpeechBubbleComponent) == 0x000808, "Member 'ABP_InquisitorBG2_Olen_C::BP_SpeechBubbleComponent' has a wrong offset!");
static_assert(offsetof(ABP_InquisitorBG2_Olen_C, DefaultSceneRoot) == 0x000810, "Member 'ABP_InquisitorBG2_Olen_C::DefaultSceneRoot' has a wrong offset!");

}

