#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IceImp_IceShard_VisualEntity

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_IceImp_IceShard_VisualEntity.BP_IceImp_IceShard_VisualEntity_C.ExecuteUbergraph_BP_IceImp_IceShard_VisualEntity
// 0x003C (0x003C - 0x0000)
struct BP_IceImp_IceShard_VisualEntity_C_ExecuteUbergraph_BP_IceImp_IceShard_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0028(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IceImp_IceShard_VisualEntity_C_ExecuteUbergraph_BP_IceImp_IceShard_VisualEntity) == 0x000004, "Wrong alignment on BP_IceImp_IceShard_VisualEntity_C_ExecuteUbergraph_BP_IceImp_IceShard_VisualEntity");
static_assert(sizeof(BP_IceImp_IceShard_VisualEntity_C_ExecuteUbergraph_BP_IceImp_IceShard_VisualEntity) == 0x00003C, "Wrong size on BP_IceImp_IceShard_VisualEntity_C_ExecuteUbergraph_BP_IceImp_IceShard_VisualEntity");
static_assert(offsetof(BP_IceImp_IceShard_VisualEntity_C_ExecuteUbergraph_BP_IceImp_IceShard_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_IceImp_IceShard_VisualEntity_C_ExecuteUbergraph_BP_IceImp_IceShard_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_IceImp_IceShard_VisualEntity_C_ExecuteUbergraph_BP_IceImp_IceShard_VisualEntity, Temp_delegate_Variable) == 0x000004, "Member 'BP_IceImp_IceShard_VisualEntity_C_ExecuteUbergraph_BP_IceImp_IceShard_VisualEntity::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_IceImp_IceShard_VisualEntity_C_ExecuteUbergraph_BP_IceImp_IceShard_VisualEntity, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000014, "Member 'BP_IceImp_IceShard_VisualEntity_C_ExecuteUbergraph_BP_IceImp_IceShard_VisualEntity::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IceImp_IceShard_VisualEntity_C_ExecuteUbergraph_BP_IceImp_IceShard_VisualEntity, CallFunc_PostAkEvent_ReturnValue) == 0x000020, "Member 'BP_IceImp_IceShard_VisualEntity_C_ExecuteUbergraph_BP_IceImp_IceShard_VisualEntity::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IceImp_IceShard_VisualEntity_C_ExecuteUbergraph_BP_IceImp_IceShard_VisualEntity, CallFunc_PostEventAtLocation_ReturnValue) == 0x000024, "Member 'BP_IceImp_IceShard_VisualEntity_C_ExecuteUbergraph_BP_IceImp_IceShard_VisualEntity::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IceImp_IceShard_VisualEntity_C_ExecuteUbergraph_BP_IceImp_IceShard_VisualEntity, Temp_delegate_Variable_1) == 0x000028, "Member 'BP_IceImp_IceShard_VisualEntity_C_ExecuteUbergraph_BP_IceImp_IceShard_VisualEntity::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_IceImp_IceShard_VisualEntity_C_ExecuteUbergraph_BP_IceImp_IceShard_VisualEntity, CallFunc_PostAkEvent_ReturnValue_1) == 0x000038, "Member 'BP_IceImp_IceShard_VisualEntity_C_ExecuteUbergraph_BP_IceImp_IceShard_VisualEntity::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");

}

