#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractiveDummy_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_InteractiveDummy_Anim.BP_InteractiveDummy_Anim_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct BP_InteractiveDummy_Anim_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BP_InteractiveDummy_Anim_C_AnimGraph) == 0x000008, "Wrong alignment on BP_InteractiveDummy_Anim_C_AnimGraph");
static_assert(sizeof(BP_InteractiveDummy_Anim_C_AnimGraph) == 0x000010, "Wrong size on BP_InteractiveDummy_Anim_C_AnimGraph");
static_assert(offsetof(BP_InteractiveDummy_Anim_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'BP_InteractiveDummy_Anim_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function BP_InteractiveDummy_Anim.BP_InteractiveDummy_Anim_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct BP_InteractiveDummy_Anim_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractiveDummy_Anim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on BP_InteractiveDummy_Anim_C_BlueprintUpdateAnimation");
static_assert(sizeof(BP_InteractiveDummy_Anim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on BP_InteractiveDummy_Anim_C_BlueprintUpdateAnimation");
static_assert(offsetof(BP_InteractiveDummy_Anim_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'BP_InteractiveDummy_Anim_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function BP_InteractiveDummy_Anim.BP_InteractiveDummy_Anim_C.OnFacingChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractiveDummy_Anim_C_OnFacingChanged final
{
public:
	bool                                          bForced;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InteractiveDummy_Anim_C_OnFacingChanged) == 0x000001, "Wrong alignment on BP_InteractiveDummy_Anim_C_OnFacingChanged");
static_assert(sizeof(BP_InteractiveDummy_Anim_C_OnFacingChanged) == 0x000001, "Wrong size on BP_InteractiveDummy_Anim_C_OnFacingChanged");
static_assert(offsetof(BP_InteractiveDummy_Anim_C_OnFacingChanged, bForced) == 0x000000, "Member 'BP_InteractiveDummy_Anim_C_OnFacingChanged::bForced' has a wrong offset!");

// Function BP_InteractiveDummy_Anim.BP_InteractiveDummy_Anim_C.ExecuteUbergraph_BP_InteractiveDummy_Anim
// 0x0014 (0x0014 - 0x0000)
struct BP_InteractiveDummy_Anim_C_ExecuteUbergraph_BP_InteractiveDummy_Anim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bForced;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFacing_ReturnValue;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimToggled_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimToggled_ReturnValue_1;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimToggled_ReturnValue_2;              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimToggled_ReturnValue_3;              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InteractiveDummy_Anim_C_ExecuteUbergraph_BP_InteractiveDummy_Anim) == 0x000004, "Wrong alignment on BP_InteractiveDummy_Anim_C_ExecuteUbergraph_BP_InteractiveDummy_Anim");
static_assert(sizeof(BP_InteractiveDummy_Anim_C_ExecuteUbergraph_BP_InteractiveDummy_Anim) == 0x000014, "Wrong size on BP_InteractiveDummy_Anim_C_ExecuteUbergraph_BP_InteractiveDummy_Anim");
static_assert(offsetof(BP_InteractiveDummy_Anim_C_ExecuteUbergraph_BP_InteractiveDummy_Anim, EntryPoint) == 0x000000, "Member 'BP_InteractiveDummy_Anim_C_ExecuteUbergraph_BP_InteractiveDummy_Anim::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_InteractiveDummy_Anim_C_ExecuteUbergraph_BP_InteractiveDummy_Anim, K2Node_Event_bForced) == 0x000004, "Member 'BP_InteractiveDummy_Anim_C_ExecuteUbergraph_BP_InteractiveDummy_Anim::K2Node_Event_bForced' has a wrong offset!");
static_assert(offsetof(BP_InteractiveDummy_Anim_C_ExecuteUbergraph_BP_InteractiveDummy_Anim, K2Node_Event_DeltaTimeX) == 0x000008, "Member 'BP_InteractiveDummy_Anim_C_ExecuteUbergraph_BP_InteractiveDummy_Anim::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(BP_InteractiveDummy_Anim_C_ExecuteUbergraph_BP_InteractiveDummy_Anim, CallFunc_GetFacing_ReturnValue) == 0x00000C, "Member 'BP_InteractiveDummy_Anim_C_ExecuteUbergraph_BP_InteractiveDummy_Anim::CallFunc_GetFacing_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveDummy_Anim_C_ExecuteUbergraph_BP_InteractiveDummy_Anim, CallFunc_IsAnimToggled_ReturnValue) == 0x000010, "Member 'BP_InteractiveDummy_Anim_C_ExecuteUbergraph_BP_InteractiveDummy_Anim::CallFunc_IsAnimToggled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveDummy_Anim_C_ExecuteUbergraph_BP_InteractiveDummy_Anim, CallFunc_IsAnimToggled_ReturnValue_1) == 0x000011, "Member 'BP_InteractiveDummy_Anim_C_ExecuteUbergraph_BP_InteractiveDummy_Anim::CallFunc_IsAnimToggled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractiveDummy_Anim_C_ExecuteUbergraph_BP_InteractiveDummy_Anim, CallFunc_IsAnimToggled_ReturnValue_2) == 0x000012, "Member 'BP_InteractiveDummy_Anim_C_ExecuteUbergraph_BP_InteractiveDummy_Anim::CallFunc_IsAnimToggled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InteractiveDummy_Anim_C_ExecuteUbergraph_BP_InteractiveDummy_Anim, CallFunc_IsAnimToggled_ReturnValue_3) == 0x000013, "Member 'BP_InteractiveDummy_Anim_C_ExecuteUbergraph_BP_InteractiveDummy_Anim::CallFunc_IsAnimToggled_ReturnValue_3' has a wrong offset!");

}

