#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractButton_Normal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_InteractButton_Normal.BP_InteractButton_Normal_C
// 0x0120 (0x0478 - 0x0358)
class UBP_InteractButton_Normal_C final : public UInteractButtonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                ButtonDisabled;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonFrame;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Caption;                                           // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HotkeyHold;                                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HotkeyIcon;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HotkeyIcon2;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HotkeyIcon3;                                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HotkeyIcon4;                                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_LongPressIndicator_C*               HotkeyLongPressIndicator;                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HotkeyText;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HotkeyText2;                                       // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HotkeyText3;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HotkeyText4;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HotkeyTextBorder;                                  // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HotkeyTextBorder2;                                 // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HotkeyTextBorder3;                                 // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HotkeyTextBorder4;                                 // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlaceHolderText1;                                  // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlaceHolderText2;                                  // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlaceHolderText3;                                  // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlaceHolderText4;                                  // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlaceHolderText5;                                  // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlaceHolderText6;                                  // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlaceHolderText7;                                  // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   CaptionText;                                       // 0x0438(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnPressed;                                         // 0x0460(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Clickable;                                         // 0x0470(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BP_InteractButton_Normal(int32 EntryPoint);
	void BndEvt__BP_InteractButton_Normal_ButtonDisabled_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void OnSetHold(bool bInHold);
	void OnSetHotkeyText(const TArray<class FText>& HotkeyTexts);
	void OnSetHotkeyImages(const TArray<class UTexture2D*>& HotkeyImages);
	void OnSetState(bool bInCaption1Active, bool bInCaption2Active);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void FadeIn(float AnimDuration);
	void FadeOut(float AnimDuration);
	void SetupInteract(const class FText& Caption_0);
	void ToggleActive(bool InIsActive);
	void SetText(const class FText& Caption_0);
	void SetHold();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InteractButton_Normal_C">();
	}
	static class UBP_InteractButton_Normal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_InteractButton_Normal_C>();
	}
};
static_assert(alignof(UBP_InteractButton_Normal_C) == 0x000008, "Wrong alignment on UBP_InteractButton_Normal_C");
static_assert(sizeof(UBP_InteractButton_Normal_C) == 0x000478, "Wrong size on UBP_InteractButton_Normal_C");
static_assert(offsetof(UBP_InteractButton_Normal_C, UberGraphFrame) == 0x000358, "Member 'UBP_InteractButton_Normal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, FadeInAnim) == 0x000360, "Member 'UBP_InteractButton_Normal_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, ButtonDisabled) == 0x000368, "Member 'UBP_InteractButton_Normal_C::ButtonDisabled' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, ButtonFrame) == 0x000370, "Member 'UBP_InteractButton_Normal_C::ButtonFrame' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, Caption) == 0x000378, "Member 'UBP_InteractButton_Normal_C::Caption' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, HorizontalBox_0) == 0x000380, "Member 'UBP_InteractButton_Normal_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, HotkeyHold) == 0x000388, "Member 'UBP_InteractButton_Normal_C::HotkeyHold' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, HotkeyIcon) == 0x000390, "Member 'UBP_InteractButton_Normal_C::HotkeyIcon' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, HotkeyIcon2) == 0x000398, "Member 'UBP_InteractButton_Normal_C::HotkeyIcon2' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, HotkeyIcon3) == 0x0003A0, "Member 'UBP_InteractButton_Normal_C::HotkeyIcon3' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, HotkeyIcon4) == 0x0003A8, "Member 'UBP_InteractButton_Normal_C::HotkeyIcon4' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, HotkeyLongPressIndicator) == 0x0003B0, "Member 'UBP_InteractButton_Normal_C::HotkeyLongPressIndicator' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, HotkeyText) == 0x0003B8, "Member 'UBP_InteractButton_Normal_C::HotkeyText' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, HotkeyText2) == 0x0003C0, "Member 'UBP_InteractButton_Normal_C::HotkeyText2' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, HotkeyText3) == 0x0003C8, "Member 'UBP_InteractButton_Normal_C::HotkeyText3' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, HotkeyText4) == 0x0003D0, "Member 'UBP_InteractButton_Normal_C::HotkeyText4' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, HotkeyTextBorder) == 0x0003D8, "Member 'UBP_InteractButton_Normal_C::HotkeyTextBorder' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, HotkeyTextBorder2) == 0x0003E0, "Member 'UBP_InteractButton_Normal_C::HotkeyTextBorder2' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, HotkeyTextBorder3) == 0x0003E8, "Member 'UBP_InteractButton_Normal_C::HotkeyTextBorder3' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, HotkeyTextBorder4) == 0x0003F0, "Member 'UBP_InteractButton_Normal_C::HotkeyTextBorder4' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, Overlay_0) == 0x0003F8, "Member 'UBP_InteractButton_Normal_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, PlaceHolderText1) == 0x000400, "Member 'UBP_InteractButton_Normal_C::PlaceHolderText1' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, PlaceHolderText2) == 0x000408, "Member 'UBP_InteractButton_Normal_C::PlaceHolderText2' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, PlaceHolderText3) == 0x000410, "Member 'UBP_InteractButton_Normal_C::PlaceHolderText3' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, PlaceHolderText4) == 0x000418, "Member 'UBP_InteractButton_Normal_C::PlaceHolderText4' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, PlaceHolderText5) == 0x000420, "Member 'UBP_InteractButton_Normal_C::PlaceHolderText5' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, PlaceHolderText6) == 0x000428, "Member 'UBP_InteractButton_Normal_C::PlaceHolderText6' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, PlaceHolderText7) == 0x000430, "Member 'UBP_InteractButton_Normal_C::PlaceHolderText7' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, CaptionText) == 0x000438, "Member 'UBP_InteractButton_Normal_C::CaptionText' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, OnClicked) == 0x000450, "Member 'UBP_InteractButton_Normal_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, OnPressed) == 0x000460, "Member 'UBP_InteractButton_Normal_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UBP_InteractButton_Normal_C, Clickable) == 0x000470, "Member 'UBP_InteractButton_Normal_C::Clickable' has a wrong offset!");

}

