#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Inquisitor

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Inquisitor.BP_Inquisitor_C.ExecuteUbergraph_BP_Inquisitor
// 0x000C (0x000C - 0x0000)
struct BP_Inquisitor_C_ExecuteUbergraph_BP_Inquisitor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_asd;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_wg;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Inquisitor_C_ExecuteUbergraph_BP_Inquisitor) == 0x000004, "Wrong alignment on BP_Inquisitor_C_ExecuteUbergraph_BP_Inquisitor");
static_assert(sizeof(BP_Inquisitor_C_ExecuteUbergraph_BP_Inquisitor) == 0x00000C, "Wrong size on BP_Inquisitor_C_ExecuteUbergraph_BP_Inquisitor");
static_assert(offsetof(BP_Inquisitor_C_ExecuteUbergraph_BP_Inquisitor, EntryPoint) == 0x000000, "Member 'BP_Inquisitor_C_ExecuteUbergraph_BP_Inquisitor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Inquisitor_C_ExecuteUbergraph_BP_Inquisitor, K2Node_CustomEvent_asd) == 0x000004, "Member 'BP_Inquisitor_C_ExecuteUbergraph_BP_Inquisitor::K2Node_CustomEvent_asd' has a wrong offset!");
static_assert(offsetof(BP_Inquisitor_C_ExecuteUbergraph_BP_Inquisitor, K2Node_CustomEvent_wg) == 0x000008, "Member 'BP_Inquisitor_C_ExecuteUbergraph_BP_Inquisitor::K2Node_CustomEvent_wg' has a wrong offset!");

// Function BP_Inquisitor.BP_Inquisitor_C.charBaseEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_Inquisitor_C_charBaseEvent final
{
public:
	bool                                          asd;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         wg;                                                // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Inquisitor_C_charBaseEvent) == 0x000004, "Wrong alignment on BP_Inquisitor_C_charBaseEvent");
static_assert(sizeof(BP_Inquisitor_C_charBaseEvent) == 0x000008, "Wrong size on BP_Inquisitor_C_charBaseEvent");
static_assert(offsetof(BP_Inquisitor_C_charBaseEvent, asd) == 0x000000, "Member 'BP_Inquisitor_C_charBaseEvent::asd' has a wrong offset!");
static_assert(offsetof(BP_Inquisitor_C_charBaseEvent, wg) == 0x000004, "Member 'BP_Inquisitor_C_charBaseEvent::wg' has a wrong offset!");

}

