#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InnerStrengthGroundActor

#include "Basic.hpp"

#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InnerStrengthGroundActor.BP_InnerStrengthGroundActor_C
// 0x0018 (0x07F0 - 0x07D8)
class ABP_InnerStrengthGroundActor_C final : public AActorBase
{
public:
	class USceneComponent*                        VFXSpawnPoint;                                     // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InnerStrengthGroundActor_C">();
	}
	static class ABP_InnerStrengthGroundActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_InnerStrengthGroundActor_C>();
	}
};
static_assert(alignof(ABP_InnerStrengthGroundActor_C) == 0x000008, "Wrong alignment on ABP_InnerStrengthGroundActor_C");
static_assert(sizeof(ABP_InnerStrengthGroundActor_C) == 0x0007F0, "Wrong size on ABP_InnerStrengthGroundActor_C");
static_assert(offsetof(ABP_InnerStrengthGroundActor_C, VFXSpawnPoint) == 0x0007D8, "Member 'ABP_InnerStrengthGroundActor_C::VFXSpawnPoint' has a wrong offset!");
static_assert(offsetof(ABP_InnerStrengthGroundActor_C, Box) == 0x0007E0, "Member 'ABP_InnerStrengthGroundActor_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_InnerStrengthGroundActor_C, DefaultSceneRoot) == 0x0007E8, "Member 'ABP_InnerStrengthGroundActor_C::DefaultSceneRoot' has a wrong offset!");

}

