#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Judgement_VisualEntity

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Judgement_VisualEntity.BP_Judgement_VisualEntity_C.ExecuteUbergraph_BP_Judgement_VisualEntity
// 0x0090 (0x0090 - 0x0000)
struct BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMaxCharge_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName Msg, class UObject* Object)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesExecute_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Msg;                            // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AManProjectile*                         K2Node_DynamicCast_AsMan_Projectile;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USmiteAbility*                          K2Node_DynamicCast_AsSmite_Ability;                // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity) == 0x000008, "Wrong alignment on BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity");
static_assert(sizeof(BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity) == 0x000090, "Wrong size on BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity");
static_assert(offsetof(BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity, CallFunc_HasMaxCharge_ReturnValue) == 0x000004, "Member 'BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity::CallFunc_HasMaxCharge_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity, CallFunc_DoesExecute_ReturnValue) == 0x00001C, "Member 'BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity::CallFunc_DoesExecute_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity, CallFunc_SelectFloat_ReturnValue_1) == 0x000020, "Member 'BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity, K2Node_CustomEvent_Msg) == 0x000024, "Member 'BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity::K2Node_CustomEvent_Msg' has a wrong offset!");
static_assert(offsetof(BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity, K2Node_CustomEvent_Object) == 0x000030, "Member 'BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity::K2Node_CustomEvent_Object' has a wrong offset!");
static_assert(offsetof(BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000038, "Member 'BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity, K2Node_Event_DeltaSeconds) == 0x00003C, "Member 'BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity, CallFunc_FInterpTo_ReturnValue) == 0x000040, "Member 'BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity, K2Node_DynamicCast_AsMan_Projectile) == 0x000050, "Member 'BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity::K2Node_DynamicCast_AsMan_Projectile' has a wrong offset!");
static_assert(offsetof(BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity, K2Node_DynamicCast_AsCharacter_Base) == 0x000060, "Member 'BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity, CallFunc_GetAbilityController_ReturnValue) == 0x000070, "Member 'BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000078, "Member 'BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity, K2Node_DynamicCast_AsSmite_Ability) == 0x000080, "Member 'BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity::K2Node_DynamicCast_AsSmite_Ability' has a wrong offset!");
static_assert(offsetof(BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity, K2Node_DynamicCast_bSuccess_2) == 0x000088, "Member 'BP_Judgement_VisualEntity_C_ExecuteUbergraph_BP_Judgement_VisualEntity::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BP_Judgement_VisualEntity.BP_Judgement_VisualEntity_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Judgement_VisualEntity_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Judgement_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Judgement_VisualEntity_C_ReceiveTick");
static_assert(sizeof(BP_Judgement_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong size on BP_Judgement_VisualEntity_C_ReceiveTick");
static_assert(offsetof(BP_Judgement_VisualEntity_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Judgement_VisualEntity_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Judgement_VisualEntity.BP_Judgement_VisualEntity_C.CustomMessage
// 0x0010 (0x0010 - 0x0000)
struct BP_Judgement_VisualEntity_C_CustomMessage final
{
public:
	class FName                                   Msg;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Object;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Judgement_VisualEntity_C_CustomMessage) == 0x000008, "Wrong alignment on BP_Judgement_VisualEntity_C_CustomMessage");
static_assert(sizeof(BP_Judgement_VisualEntity_C_CustomMessage) == 0x000010, "Wrong size on BP_Judgement_VisualEntity_C_CustomMessage");
static_assert(offsetof(BP_Judgement_VisualEntity_C_CustomMessage, Msg) == 0x000000, "Member 'BP_Judgement_VisualEntity_C_CustomMessage::Msg' has a wrong offset!");
static_assert(offsetof(BP_Judgement_VisualEntity_C_CustomMessage, Object) == 0x000008, "Member 'BP_Judgement_VisualEntity_C_CustomMessage::Object' has a wrong offset!");

}

