#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Judgement_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Judgement_VisualEntity.BP_Judgement_VisualEntity_C
// 0x0028 (0x0378 - 0x0350)
class ABP_Judgement_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          AlterVE;                                           // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FallDownTime;                                      // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentAlterValue;                                 // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USmiteAbility*                          As_Smite_Ability_0;                                // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Judgement_VisualEntity(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void VisualEntityConstructionFinished();
	void CustomMessage(class FName Msg, class UObject* Object);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Judgement_VisualEntity_C">();
	}
	static class ABP_Judgement_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Judgement_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_Judgement_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_Judgement_VisualEntity_C");
static_assert(sizeof(ABP_Judgement_VisualEntity_C) == 0x000378, "Wrong size on ABP_Judgement_VisualEntity_C");
static_assert(offsetof(ABP_Judgement_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_Judgement_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Judgement_VisualEntity_C, Niagara) == 0x000358, "Member 'ABP_Judgement_VisualEntity_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_Judgement_VisualEntity_C, AlterVE) == 0x000360, "Member 'ABP_Judgement_VisualEntity_C::AlterVE' has a wrong offset!");
static_assert(offsetof(ABP_Judgement_VisualEntity_C, FallDownTime) == 0x000364, "Member 'ABP_Judgement_VisualEntity_C::FallDownTime' has a wrong offset!");
static_assert(offsetof(ABP_Judgement_VisualEntity_C, CurrentAlterValue) == 0x000368, "Member 'ABP_Judgement_VisualEntity_C::CurrentAlterValue' has a wrong offset!");
static_assert(offsetof(ABP_Judgement_VisualEntity_C, As_Smite_Ability_0) == 0x000370, "Member 'ABP_Judgement_VisualEntity_C::As_Smite_Ability_0' has a wrong offset!");

}

