#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_KezkaDivineHammerProjectile

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_KezkaDivineHammerProjectile.BP_KezkaDivineHammerProjectile_C.ExecuteUbergraph_BP_KezkaDivineHammerProjectile
// 0x0058 (0x0058 - 0x0000)
struct BP_KezkaDivineHammerProjectile_C_ExecuteUbergraph_BP_KezkaDivineHammerProjectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0034(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KezkaDivineHammerProjectile_C_ExecuteUbergraph_BP_KezkaDivineHammerProjectile) == 0x000008, "Wrong alignment on BP_KezkaDivineHammerProjectile_C_ExecuteUbergraph_BP_KezkaDivineHammerProjectile");
static_assert(sizeof(BP_KezkaDivineHammerProjectile_C_ExecuteUbergraph_BP_KezkaDivineHammerProjectile) == 0x000058, "Wrong size on BP_KezkaDivineHammerProjectile_C_ExecuteUbergraph_BP_KezkaDivineHammerProjectile");
static_assert(offsetof(BP_KezkaDivineHammerProjectile_C_ExecuteUbergraph_BP_KezkaDivineHammerProjectile, EntryPoint) == 0x000000, "Member 'BP_KezkaDivineHammerProjectile_C_ExecuteUbergraph_BP_KezkaDivineHammerProjectile::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_KezkaDivineHammerProjectile_C_ExecuteUbergraph_BP_KezkaDivineHammerProjectile, Temp_delegate_Variable) == 0x000004, "Member 'BP_KezkaDivineHammerProjectile_C_ExecuteUbergraph_BP_KezkaDivineHammerProjectile::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_KezkaDivineHammerProjectile_C_ExecuteUbergraph_BP_KezkaDivineHammerProjectile, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000014, "Member 'BP_KezkaDivineHammerProjectile_C_ExecuteUbergraph_BP_KezkaDivineHammerProjectile::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KezkaDivineHammerProjectile_C_ExecuteUbergraph_BP_KezkaDivineHammerProjectile, CallFunc_PostEventAtLocation_ReturnValue) == 0x000020, "Member 'BP_KezkaDivineHammerProjectile_C_ExecuteUbergraph_BP_KezkaDivineHammerProjectile::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KezkaDivineHammerProjectile_C_ExecuteUbergraph_BP_KezkaDivineHammerProjectile, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'BP_KezkaDivineHammerProjectile_C_ExecuteUbergraph_BP_KezkaDivineHammerProjectile::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_KezkaDivineHammerProjectile_C_ExecuteUbergraph_BP_KezkaDivineHammerProjectile, Temp_delegate_Variable_1) == 0x000034, "Member 'BP_KezkaDivineHammerProjectile_C_ExecuteUbergraph_BP_KezkaDivineHammerProjectile::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_KezkaDivineHammerProjectile_C_ExecuteUbergraph_BP_KezkaDivineHammerProjectile, CallFunc_PostAkEvent_ReturnValue) == 0x000044, "Member 'BP_KezkaDivineHammerProjectile_C_ExecuteUbergraph_BP_KezkaDivineHammerProjectile::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KezkaDivineHammerProjectile_C_ExecuteUbergraph_BP_KezkaDivineHammerProjectile, K2Node_CustomEvent_DestroyedActor) == 0x000048, "Member 'BP_KezkaDivineHammerProjectile_C_ExecuteUbergraph_BP_KezkaDivineHammerProjectile::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(BP_KezkaDivineHammerProjectile_C_ExecuteUbergraph_BP_KezkaDivineHammerProjectile, CallFunc_PostAkEvent_ReturnValue_1) == 0x000050, "Member 'BP_KezkaDivineHammerProjectile_C_ExecuteUbergraph_BP_KezkaDivineHammerProjectile::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");

// Function BP_KezkaDivineHammerProjectile.BP_KezkaDivineHammerProjectile_C.OnDestroyed_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BP_KezkaDivineHammerProjectile_C_OnDestroyed_Event_0 final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KezkaDivineHammerProjectile_C_OnDestroyed_Event_0) == 0x000008, "Wrong alignment on BP_KezkaDivineHammerProjectile_C_OnDestroyed_Event_0");
static_assert(sizeof(BP_KezkaDivineHammerProjectile_C_OnDestroyed_Event_0) == 0x000008, "Wrong size on BP_KezkaDivineHammerProjectile_C_OnDestroyed_Event_0");
static_assert(offsetof(BP_KezkaDivineHammerProjectile_C_OnDestroyed_Event_0, DestroyedActor) == 0x000000, "Member 'BP_KezkaDivineHammerProjectile_C_OnDestroyed_Event_0::DestroyedActor' has a wrong offset!");

}

