#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ket_CS_A004_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_Ket_CS_A004_Anim.BP_Ket_CS_A004_Anim_C
// 0x0100 (0x07F0 - 0x06F0)
class UBP_Ket_CS_A004_Anim_C final : public UNpcAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06F8(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0728(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0770(0x0080)()

public:
	void ExecuteUbergraph_BP_Ket_CS_A004_Anim(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Ket_CS_A004_Anim_C">();
	}
	static class UBP_Ket_CS_A004_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Ket_CS_A004_Anim_C>();
	}
};
static_assert(alignof(UBP_Ket_CS_A004_Anim_C) == 0x000010, "Wrong alignment on UBP_Ket_CS_A004_Anim_C");
static_assert(sizeof(UBP_Ket_CS_A004_Anim_C) == 0x0007F0, "Wrong size on UBP_Ket_CS_A004_Anim_C");
static_assert(offsetof(UBP_Ket_CS_A004_Anim_C, UberGraphFrame) == 0x0006F0, "Member 'UBP_Ket_CS_A004_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Ket_CS_A004_Anim_C, AnimGraphNode_Root) == 0x0006F8, "Member 'UBP_Ket_CS_A004_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_Ket_CS_A004_Anim_C, AnimGraphNode_Slot) == 0x000728, "Member 'UBP_Ket_CS_A004_Anim_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UBP_Ket_CS_A004_Anim_C, AnimGraphNode_SequencePlayer) == 0x000770, "Member 'UBP_Ket_CS_A004_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");

}

