#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LibrarianArcaneBlastProjectilePoison

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_LibrarianArcaneBlastProjectilePoison.BP_LibrarianArcaneBlastProjectilePoison_C.ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison
// 0x0058 (0x0058 - 0x0000)
struct BP_LibrarianArcaneBlastProjectilePoison_C_ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LibrarianArcaneBlastProjectilePoison_C_ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison) == 0x000008, "Wrong alignment on BP_LibrarianArcaneBlastProjectilePoison_C_ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison");
static_assert(sizeof(BP_LibrarianArcaneBlastProjectilePoison_C_ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison) == 0x000058, "Wrong size on BP_LibrarianArcaneBlastProjectilePoison_C_ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison");
static_assert(offsetof(BP_LibrarianArcaneBlastProjectilePoison_C_ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison, EntryPoint) == 0x000000, "Member 'BP_LibrarianArcaneBlastProjectilePoison_C_ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LibrarianArcaneBlastProjectilePoison_C_ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison, Temp_delegate_Variable) == 0x000004, "Member 'BP_LibrarianArcaneBlastProjectilePoison_C_ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_LibrarianArcaneBlastProjectilePoison_C_ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison, Temp_delegate_Variable_1) == 0x000014, "Member 'BP_LibrarianArcaneBlastProjectilePoison_C_ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LibrarianArcaneBlastProjectilePoison_C_ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison, CallFunc_PostAkEvent_ReturnValue) == 0x000024, "Member 'BP_LibrarianArcaneBlastProjectilePoison_C_ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianArcaneBlastProjectilePoison_C_ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison, CallFunc_GetManGameMode_ReturnValue) == 0x000028, "Member 'BP_LibrarianArcaneBlastProjectilePoison_C_ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison::CallFunc_GetManGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianArcaneBlastProjectilePoison_C_ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison, K2Node_Event_EndPlayReason) == 0x000030, "Member 'BP_LibrarianArcaneBlastProjectilePoison_C_ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_LibrarianArcaneBlastProjectilePoison_C_ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000038, "Member 'BP_LibrarianArcaneBlastProjectilePoison_C_ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianArcaneBlastProjectilePoison_C_ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison, CallFunc_PostAkEvent_ReturnValue_1) == 0x000040, "Member 'BP_LibrarianArcaneBlastProjectilePoison_C_ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LibrarianArcaneBlastProjectilePoison_C_ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000044, "Member 'BP_LibrarianArcaneBlastProjectilePoison_C_ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianArcaneBlastProjectilePoison_C_ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison, CallFunc_PostEventAtLocation_ReturnValue) == 0x000050, "Member 'BP_LibrarianArcaneBlastProjectilePoison_C_ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");

// Function BP_LibrarianArcaneBlastProjectilePoison.BP_LibrarianArcaneBlastProjectilePoison_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_LibrarianArcaneBlastProjectilePoison_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LibrarianArcaneBlastProjectilePoison_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_LibrarianArcaneBlastProjectilePoison_C_ReceiveEndPlay");
static_assert(sizeof(BP_LibrarianArcaneBlastProjectilePoison_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_LibrarianArcaneBlastProjectilePoison_C_ReceiveEndPlay");
static_assert(offsetof(BP_LibrarianArcaneBlastProjectilePoison_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_LibrarianArcaneBlastProjectilePoison_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

