#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LibrarianBombardBook

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "BP_SummonedBook_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LibrarianBombardBook.BP_LibrarianBombardBook_C
// 0x0030 (0x1B50 - 0x1B20)
class ABP_LibrarianBombardBook_C final : public ABP_SummonedBook_C
{
public:
	uint8                                         Pad_1B11[0x7];                                     // 0x1B11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_LibrarianBombardBook_C;          // 0x1B18(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        VFXBeamStart;                                      // 0x1B20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         VisibilityTimeline_Alpha_97C0F0F2406923E2BD24A08C1170EDD6; // 0x1B28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            VisibilityTimeline__Direction_97C0F0F2406923E2BD24A08C1170EDD6; // 0x1B2C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2D[0x3];                                     // 0x1B2D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     VisibilityTimeline;                                // 0x1B30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LibrarianBoss_C*                    LibrarianBoss;                                     // 0x1B38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Disappear;                                         // 0x1B40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_LibrarianBombardBook(int32 EntryPoint);
	void BPPostBeginPlay();
	void OnGameplayEvent_Event_0(class UAbilityController* OwnerAbilityController, class UGameplayEventID* GameplayEventID, class FName GameplayEventName, class AActorSoul* paramActorSoul);
	void VisibilityTimeline__UpdateFunc();
	void VisibilityTimeline__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LibrarianBombardBook_C">();
	}
	static class ABP_LibrarianBombardBook_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LibrarianBombardBook_C>();
	}
};
static_assert(alignof(ABP_LibrarianBombardBook_C) == 0x000010, "Wrong alignment on ABP_LibrarianBombardBook_C");
static_assert(sizeof(ABP_LibrarianBombardBook_C) == 0x001B50, "Wrong size on ABP_LibrarianBombardBook_C");
static_assert(offsetof(ABP_LibrarianBombardBook_C, UberGraphFrame_BP_LibrarianBombardBook_C) == 0x001B18, "Member 'ABP_LibrarianBombardBook_C::UberGraphFrame_BP_LibrarianBombardBook_C' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBombardBook_C, VFXBeamStart) == 0x001B20, "Member 'ABP_LibrarianBombardBook_C::VFXBeamStart' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBombardBook_C, VisibilityTimeline_Alpha_97C0F0F2406923E2BD24A08C1170EDD6) == 0x001B28, "Member 'ABP_LibrarianBombardBook_C::VisibilityTimeline_Alpha_97C0F0F2406923E2BD24A08C1170EDD6' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBombardBook_C, VisibilityTimeline__Direction_97C0F0F2406923E2BD24A08C1170EDD6) == 0x001B2C, "Member 'ABP_LibrarianBombardBook_C::VisibilityTimeline__Direction_97C0F0F2406923E2BD24A08C1170EDD6' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBombardBook_C, VisibilityTimeline) == 0x001B30, "Member 'ABP_LibrarianBombardBook_C::VisibilityTimeline' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBombardBook_C, LibrarianBoss) == 0x001B38, "Member 'ABP_LibrarianBombardBook_C::LibrarianBoss' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBombardBook_C, Disappear) == 0x001B40, "Member 'ABP_LibrarianBombardBook_C::Disappear' has a wrong offset!");

}

