#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LibrarianBombardBook

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_LibrarianBombardBook.BP_LibrarianBombardBook_C.ExecuteUbergraph_BP_LibrarianBombardBook
// 0x00E0 (0x00E0 - 0x0000)
struct BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAbilityController* OwnerAbilityController, class UGameplayEventID* GameplayEventID, class FName GameplayEventName, class AActorSoul* paramActorSoul)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0024(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0034(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0044(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     K2Node_CustomEvent_OwnerAbilityController;         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayEventID*                       K2Node_CustomEvent_GameplayEventID;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_GameplayEventName;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActorSoul*                             K2Node_CustomEvent_paramActorSoul;                 // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue_1;       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_LibrarianBombardBookActorAbility_C* K2Node_DynamicCast_AsBP_Librarian_Bombard_Book_Actor_Ability; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPGetSummoner_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LibrarianBoss_C*                    K2Node_DynamicCast_AsBP_Librarian_Boss;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDamageType_Poison;                     // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDamageType_IsValid;                    // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue_1;   // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue_2;   // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook) == 0x000008, "Wrong alignment on BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook");
static_assert(sizeof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook) == 0x0000E0, "Wrong size on BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, EntryPoint) == 0x000000, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000004, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, Temp_delegate_Variable) == 0x000024, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, Temp_delegate_Variable_1) == 0x000034, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, Temp_delegate_Variable_2) == 0x000044, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, CallFunc_GetAbilityController_ReturnValue) == 0x000058, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, K2Node_CustomEvent_OwnerAbilityController) == 0x000060, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::K2Node_CustomEvent_OwnerAbilityController' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, K2Node_CustomEvent_GameplayEventID) == 0x000068, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::K2Node_CustomEvent_GameplayEventID' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, K2Node_CustomEvent_GameplayEventName) == 0x000070, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::K2Node_CustomEvent_GameplayEventName' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, K2Node_CustomEvent_paramActorSoul) == 0x000078, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::K2Node_CustomEvent_paramActorSoul' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, K2Node_SwitchName_CmpSuccess) == 0x000080, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, CallFunc_GetAbilityController_ReturnValue_1) == 0x000088, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::CallFunc_GetAbilityController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000090, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, K2Node_DynamicCast_AsBP_Librarian_Bombard_Book_Actor_Ability) == 0x000098, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::K2Node_DynamicCast_AsBP_Librarian_Bombard_Book_Actor_Ability' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, CallFunc_BPGetSummoner_ReturnValue) == 0x0000A8, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::CallFunc_BPGetSummoner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, K2Node_DynamicCast_AsBP_Librarian_Boss) == 0x0000B0, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::K2Node_DynamicCast_AsBP_Librarian_Boss' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, CallFunc_GetDamageType_Poison) == 0x0000B9, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::CallFunc_GetDamageType_Poison' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, CallFunc_GetDamageType_IsValid) == 0x0000BA, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::CallFunc_GetDamageType_IsValid' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, CallFunc_BooleanAND_ReturnValue) == 0x0000BB, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, CallFunc_PostAkEvent_ReturnValue) == 0x0000BC, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, CallFunc_PostAkEvent_ReturnValue_1) == 0x0000C0, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, CallFunc_PostAkEvent_ReturnValue_2) == 0x0000C4, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, CallFunc_Conv_LinearColorToVector_ReturnValue_1) == 0x0000C8, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::CallFunc_Conv_LinearColorToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook, CallFunc_Conv_LinearColorToVector_ReturnValue_2) == 0x0000D4, "Member 'BP_LibrarianBombardBook_C_ExecuteUbergraph_BP_LibrarianBombardBook::CallFunc_Conv_LinearColorToVector_ReturnValue_2' has a wrong offset!");

// Function BP_LibrarianBombardBook.BP_LibrarianBombardBook_C.OnGameplayEvent_Event_0
// 0x0020 (0x0020 - 0x0000)
struct BP_LibrarianBombardBook_C_OnGameplayEvent_Event_0 final
{
public:
	class UAbilityController*                     OwnerAbilityController;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayEventID*                       GameplayEventID;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GameplayEventName;                                 // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActorSoul*                             paramActorSoul;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LibrarianBombardBook_C_OnGameplayEvent_Event_0) == 0x000008, "Wrong alignment on BP_LibrarianBombardBook_C_OnGameplayEvent_Event_0");
static_assert(sizeof(BP_LibrarianBombardBook_C_OnGameplayEvent_Event_0) == 0x000020, "Wrong size on BP_LibrarianBombardBook_C_OnGameplayEvent_Event_0");
static_assert(offsetof(BP_LibrarianBombardBook_C_OnGameplayEvent_Event_0, OwnerAbilityController) == 0x000000, "Member 'BP_LibrarianBombardBook_C_OnGameplayEvent_Event_0::OwnerAbilityController' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_OnGameplayEvent_Event_0, GameplayEventID) == 0x000008, "Member 'BP_LibrarianBombardBook_C_OnGameplayEvent_Event_0::GameplayEventID' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_OnGameplayEvent_Event_0, GameplayEventName) == 0x000010, "Member 'BP_LibrarianBombardBook_C_OnGameplayEvent_Event_0::GameplayEventName' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBombardBook_C_OnGameplayEvent_Event_0, paramActorSoul) == 0x000018, "Member 'BP_LibrarianBombardBook_C_OnGameplayEvent_Event_0::paramActorSoul' has a wrong offset!");

}

