#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LongPressIndicator

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_LongPressIndicator.BP_LongPressIndicator_C.ExecuteUbergraph_BP_LongPressIndicator
// 0x0020 (0x0020 - 0x0000)
struct BP_LongPressIndicator_C_ExecuteUbergraph_BP_LongPressIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InIndicatorRatio;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LongPressIndicator_C_ExecuteUbergraph_BP_LongPressIndicator) == 0x000008, "Wrong alignment on BP_LongPressIndicator_C_ExecuteUbergraph_BP_LongPressIndicator");
static_assert(sizeof(BP_LongPressIndicator_C_ExecuteUbergraph_BP_LongPressIndicator) == 0x000020, "Wrong size on BP_LongPressIndicator_C_ExecuteUbergraph_BP_LongPressIndicator");
static_assert(offsetof(BP_LongPressIndicator_C_ExecuteUbergraph_BP_LongPressIndicator, EntryPoint) == 0x000000, "Member 'BP_LongPressIndicator_C_ExecuteUbergraph_BP_LongPressIndicator::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LongPressIndicator_C_ExecuteUbergraph_BP_LongPressIndicator, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'BP_LongPressIndicator_C_ExecuteUbergraph_BP_LongPressIndicator::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LongPressIndicator_C_ExecuteUbergraph_BP_LongPressIndicator, K2Node_Event_IsDesignTime) == 0x000010, "Member 'BP_LongPressIndicator_C_ExecuteUbergraph_BP_LongPressIndicator::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_LongPressIndicator_C_ExecuteUbergraph_BP_LongPressIndicator, K2Node_Event_InIndicatorRatio) == 0x000014, "Member 'BP_LongPressIndicator_C_ExecuteUbergraph_BP_LongPressIndicator::K2Node_Event_InIndicatorRatio' has a wrong offset!");
static_assert(offsetof(BP_LongPressIndicator_C_ExecuteUbergraph_BP_LongPressIndicator, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000018, "Member 'BP_LongPressIndicator_C_ExecuteUbergraph_BP_LongPressIndicator::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");

// Function BP_LongPressIndicator.BP_LongPressIndicator_C.OnSetIndicatorRatio
// 0x0004 (0x0004 - 0x0000)
struct BP_LongPressIndicator_C_OnSetIndicatorRatio final
{
public:
	float                                         InIndicatorRatio;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LongPressIndicator_C_OnSetIndicatorRatio) == 0x000004, "Wrong alignment on BP_LongPressIndicator_C_OnSetIndicatorRatio");
static_assert(sizeof(BP_LongPressIndicator_C_OnSetIndicatorRatio) == 0x000004, "Wrong size on BP_LongPressIndicator_C_OnSetIndicatorRatio");
static_assert(offsetof(BP_LongPressIndicator_C_OnSetIndicatorRatio, InIndicatorRatio) == 0x000000, "Member 'BP_LongPressIndicator_C_OnSetIndicatorRatio::InIndicatorRatio' has a wrong offset!");

// Function BP_LongPressIndicator.BP_LongPressIndicator_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_LongPressIndicator_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LongPressIndicator_C_PreConstruct) == 0x000001, "Wrong alignment on BP_LongPressIndicator_C_PreConstruct");
static_assert(sizeof(BP_LongPressIndicator_C_PreConstruct) == 0x000001, "Wrong size on BP_LongPressIndicator_C_PreConstruct");
static_assert(offsetof(BP_LongPressIndicator_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_LongPressIndicator_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_LongPressIndicator.BP_LongPressIndicator_C.SetupIndicator
// 0x0010 (0x0010 - 0x0000)
struct BP_LongPressIndicator_C_SetupIndicator final
{
public:
	float                                         StartPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CompleteRange;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LongPressIndicator_C_SetupIndicator) == 0x000008, "Wrong alignment on BP_LongPressIndicator_C_SetupIndicator");
static_assert(sizeof(BP_LongPressIndicator_C_SetupIndicator) == 0x000010, "Wrong size on BP_LongPressIndicator_C_SetupIndicator");
static_assert(offsetof(BP_LongPressIndicator_C_SetupIndicator, StartPoint) == 0x000000, "Member 'BP_LongPressIndicator_C_SetupIndicator::StartPoint' has a wrong offset!");
static_assert(offsetof(BP_LongPressIndicator_C_SetupIndicator, CompleteRange) == 0x000004, "Member 'BP_LongPressIndicator_C_SetupIndicator::CompleteRange' has a wrong offset!");
static_assert(offsetof(BP_LongPressIndicator_C_SetupIndicator, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'BP_LongPressIndicator_C_SetupIndicator::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

