#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity.BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C.ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity
// 0x0080 (0x0080 - 0x0000)
struct BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LibrarianBookPageProjectile_C*      K2Node_DynamicCast_AsBP_Librarian_Book_Page_Projectile; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LibrarianBookOfEnlightenmentExplosionActor_C* K2Node_DynamicCast_AsBP_Librarian_Book_Of_Enlightenment_Explosion_Actor; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPGetSummoner_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LibrarianBoss_C*                    K2Node_DynamicCast_AsBP_Librarian_Boss;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue_1;       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_LibrarianBookOfEnlightenment_C*     K2Node_DynamicCast_AsBP_Librarian_Book_Of_Enlightenment; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity) == 0x000008, "Wrong alignment on BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity");
static_assert(sizeof(BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity) == 0x000080, "Wrong size on BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity");
static_assert(offsetof(BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity, K2Node_DynamicCast_AsBP_Librarian_Book_Page_Projectile) == 0x000010, "Member 'BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity::K2Node_DynamicCast_AsBP_Librarian_Book_Page_Projectile' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity, CallFunc_GetAbilityController_ReturnValue) == 0x000020, "Member 'BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity, CallFunc_GetOwner_ReturnValue_1) == 0x000028, "Member 'BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity, CallFunc_GetOwner_ReturnValue_2) == 0x000030, "Member 'BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity, K2Node_DynamicCast_AsBP_Librarian_Book_Of_Enlightenment_Explosion_Actor) == 0x000038, "Member 'BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity::K2Node_DynamicCast_AsBP_Librarian_Book_Of_Enlightenment_Explosion_Actor' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity, CallFunc_BPGetSummoner_ReturnValue) == 0x000048, "Member 'BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity::CallFunc_BPGetSummoner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity, K2Node_DynamicCast_AsBP_Librarian_Boss) == 0x000050, "Member 'BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity::K2Node_DynamicCast_AsBP_Librarian_Boss' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity, CallFunc_GetAbilityController_ReturnValue_1) == 0x000060, "Member 'BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity::CallFunc_GetAbilityController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000068, "Member 'BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity, K2Node_DynamicCast_AsBP_Librarian_Book_Of_Enlightenment) == 0x000070, "Member 'BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity::K2Node_DynamicCast_AsBP_Librarian_Book_Of_Enlightenment' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity, K2Node_DynamicCast_bSuccess_3) == 0x000078, "Member 'BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity_C_ExecuteUbergraph_BP_LibrarianBoss_BookOfEnlightenmentProjectile_VisualEntity::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

}

