#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lantern02

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Lantern02.BP_Lantern02_C.UserConstructionScript
// 0x000C (0x000C - 0x0000)
struct BP_Lantern02_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lantern02_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_Lantern02_C_UserConstructionScript");
static_assert(sizeof(BP_Lantern02_C_UserConstructionScript) == 0x00000C, "Wrong size on BP_Lantern02_C_UserConstructionScript");
static_assert(offsetof(BP_Lantern02_C_UserConstructionScript, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000000, "Member 'BP_Lantern02_C_UserConstructionScript::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");

// Function BP_Lantern02.BP_Lantern02_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Lantern02_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lantern02_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Lantern02_C_ReceiveTick");
static_assert(sizeof(BP_Lantern02_C_ReceiveTick) == 0x000004, "Wrong size on BP_Lantern02_C_ReceiveTick");
static_assert(offsetof(BP_Lantern02_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Lantern02_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Lantern02.BP_Lantern02_C.ExecuteUbergraph_BP_Lantern02
// 0x0008 (0x0008 - 0x0000)
struct BP_Lantern02_C_ExecuteUbergraph_BP_Lantern02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lantern02_C_ExecuteUbergraph_BP_Lantern02) == 0x000004, "Wrong alignment on BP_Lantern02_C_ExecuteUbergraph_BP_Lantern02");
static_assert(sizeof(BP_Lantern02_C_ExecuteUbergraph_BP_Lantern02) == 0x000008, "Wrong size on BP_Lantern02_C_ExecuteUbergraph_BP_Lantern02");
static_assert(offsetof(BP_Lantern02_C_ExecuteUbergraph_BP_Lantern02, EntryPoint) == 0x000000, "Member 'BP_Lantern02_C_ExecuteUbergraph_BP_Lantern02::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Lantern02_C_ExecuteUbergraph_BP_Lantern02, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_Lantern02_C_ExecuteUbergraph_BP_Lantern02::K2Node_Event_DeltaSeconds' has a wrong offset!");

}

