#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Landing_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Landing_VisualEntity.BP_Landing_VisualEntity_C
// 0x0020 (0x0370 - 0x0350)
class ABP_Landing_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Sound;                                             // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      VFX;                                               // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USurfaceEffectTypeDataAsset*            SurfaceTypeDataAsset;                              // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Landing_VisualEntity(int32 EntryPoint);
	void VisualEntityConstructionFinished();
	float GetOwnerVelocity();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Landing_VisualEntity_C">();
	}
	static class ABP_Landing_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Landing_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_Landing_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_Landing_VisualEntity_C");
static_assert(sizeof(ABP_Landing_VisualEntity_C) == 0x000370, "Wrong size on ABP_Landing_VisualEntity_C");
static_assert(offsetof(ABP_Landing_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_Landing_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Landing_VisualEntity_C, Sound) == 0x000358, "Member 'ABP_Landing_VisualEntity_C::Sound' has a wrong offset!");
static_assert(offsetof(ABP_Landing_VisualEntity_C, VFX) == 0x000360, "Member 'ABP_Landing_VisualEntity_C::VFX' has a wrong offset!");
static_assert(offsetof(ABP_Landing_VisualEntity_C, SurfaceTypeDataAsset) == 0x000368, "Member 'ABP_Landing_VisualEntity_C::SurfaceTypeDataAsset' has a wrong offset!");

}

