#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Librarian_ArcaneBlastBurn_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Librarian_ArcaneBlastBurn_VisualEntity.BP_Librarian_ArcaneBlastBurn_VisualEntity_C
// 0x0018 (0x0368 - 0x0350)
class ABP_Librarian_ArcaneBlastBurn_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Impact;                                            // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Projectile;                                        // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Librarian_ArcaneBlastBurn_VisualEntity(int32 EntryPoint);
	void OnKill();
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Librarian_ArcaneBlastBurn_VisualEntity_C">();
	}
	static class ABP_Librarian_ArcaneBlastBurn_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Librarian_ArcaneBlastBurn_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_Librarian_ArcaneBlastBurn_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_Librarian_ArcaneBlastBurn_VisualEntity_C");
static_assert(sizeof(ABP_Librarian_ArcaneBlastBurn_VisualEntity_C) == 0x000368, "Wrong size on ABP_Librarian_ArcaneBlastBurn_VisualEntity_C");
static_assert(offsetof(ABP_Librarian_ArcaneBlastBurn_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_Librarian_ArcaneBlastBurn_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Librarian_ArcaneBlastBurn_VisualEntity_C, Impact) == 0x000358, "Member 'ABP_Librarian_ArcaneBlastBurn_VisualEntity_C::Impact' has a wrong offset!");
static_assert(offsetof(ABP_Librarian_ArcaneBlastBurn_VisualEntity_C, Projectile) == 0x000360, "Member 'ABP_Librarian_ArcaneBlastBurn_VisualEntity_C::Projectile' has a wrong offset!");

}

