#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LevelUpAltar

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_LevelUpAltar.BP_LevelUpAltar_C.InstantToggle
// 0x0001 (0x0001 - 0x0000)
struct BP_LevelUpAltar_C_InstantToggle final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LevelUpAltar_C_InstantToggle) == 0x000001, "Wrong alignment on BP_LevelUpAltar_C_InstantToggle");
static_assert(sizeof(BP_LevelUpAltar_C_InstantToggle) == 0x000001, "Wrong size on BP_LevelUpAltar_C_InstantToggle");
static_assert(offsetof(BP_LevelUpAltar_C_InstantToggle, On) == 0x000000, "Member 'BP_LevelUpAltar_C_InstantToggle::On' has a wrong offset!");

// Function BP_LevelUpAltar.BP_LevelUpAltar_C.ExecuteUbergraph_BP_LevelUpAltar
// 0x0060 (0x0060 - 0x0000)
struct BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0024(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGlobalBool_ReturnValue;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar) == 0x000008, "Wrong alignment on BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar");
static_assert(sizeof(BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar) == 0x000060, "Wrong size on BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar");
static_assert(offsetof(BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar, EntryPoint) == 0x000000, "Member 'BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar, Temp_delegate_Variable) == 0x000004, "Member 'BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar, Temp_delegate_Variable_1) == 0x000014, "Member 'BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar, Temp_delegate_Variable_2) == 0x000024, "Member 'BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar, CallFunc_PostAkEvent_ReturnValue) == 0x000034, "Member 'BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar, CallFunc_PostAkEvent_ReturnValue_1) == 0x000038, "Member 'BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar, CallFunc_GetGlobalBool_ReturnValue) == 0x00003C, "Member 'BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar::CallFunc_GetGlobalBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar, CallFunc_Not_PreBool_ReturnValue) == 0x00003D, "Member 'BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000040, "Member 'BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000050, "Member 'BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar, CallFunc_PostAkEvent_ReturnValue_2) == 0x000058, "Member 'BP_LevelUpAltar_C_ExecuteUbergraph_BP_LevelUpAltar::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");

}

