#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LevelupVFX1

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_LevelupVFX1.BP_LevelupVFX1_C.ExecuteUbergraph_BP_LevelupVFX1
// 0x0090 (0x0090 - 0x0000)
struct BP_LevelupVFX1_C_ExecuteUbergraph_BP_LevelupVFX1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddLocalOffset_SweepHitResult;         // 0x0004(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelupVFX1_C_ExecuteUbergraph_BP_LevelupVFX1) == 0x000004, "Wrong alignment on BP_LevelupVFX1_C_ExecuteUbergraph_BP_LevelupVFX1");
static_assert(sizeof(BP_LevelupVFX1_C_ExecuteUbergraph_BP_LevelupVFX1) == 0x000090, "Wrong size on BP_LevelupVFX1_C_ExecuteUbergraph_BP_LevelupVFX1");
static_assert(offsetof(BP_LevelupVFX1_C_ExecuteUbergraph_BP_LevelupVFX1, EntryPoint) == 0x000000, "Member 'BP_LevelupVFX1_C_ExecuteUbergraph_BP_LevelupVFX1::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LevelupVFX1_C_ExecuteUbergraph_BP_LevelupVFX1, CallFunc_K2_AddLocalOffset_SweepHitResult) == 0x000004, "Member 'BP_LevelupVFX1_C_ExecuteUbergraph_BP_LevelupVFX1::CallFunc_K2_AddLocalOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_LevelupVFX1_C_ExecuteUbergraph_BP_LevelupVFX1, K2Node_Event_DeltaSeconds) == 0x00008C, "Member 'BP_LevelupVFX1_C_ExecuteUbergraph_BP_LevelupVFX1::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_LevelupVFX1.BP_LevelupVFX1_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_LevelupVFX1_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelupVFX1_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_LevelupVFX1_C_ReceiveTick");
static_assert(sizeof(BP_LevelupVFX1_C_ReceiveTick) == 0x000004, "Wrong size on BP_LevelupVFX1_C_ReceiveTick");
static_assert(offsetof(BP_LevelupVFX1_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_LevelupVFX1_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

