#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LoadMap_Slot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_LoadMap_Slot.BP_LoadMap_Slot_C
// 0x0090 (0x0320 - 0x0290)
class UBP_LoadMap_Slot_C final : public ULoadMapSlotUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoveredAnim;                                       // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HighlightAnim;                                     // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Bg;                                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bg_Highlight;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonFrame;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_HighlightAnim;                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnHovered;                                         // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUnhovered;                                       // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnReleased;                                        // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnPressed;                                         // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUnfocus;                                         // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_2_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void Construct();
	void OnFocused(bool bAnimate);
	void OnUnfocused(bool bAnimate);
	void OnSetSlot(class FName InSlotName);
	void ExecuteUbergraph_BP_LoadMap_Slot(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LoadMap_Slot_C">();
	}
	static class UBP_LoadMap_Slot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_LoadMap_Slot_C>();
	}
};
static_assert(alignof(UBP_LoadMap_Slot_C) == 0x000008, "Wrong alignment on UBP_LoadMap_Slot_C");
static_assert(sizeof(UBP_LoadMap_Slot_C) == 0x000320, "Wrong size on UBP_LoadMap_Slot_C");
static_assert(offsetof(UBP_LoadMap_Slot_C, UberGraphFrame) == 0x000290, "Member 'UBP_LoadMap_Slot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_LoadMap_Slot_C, HoveredAnim) == 0x000298, "Member 'UBP_LoadMap_Slot_C::HoveredAnim' has a wrong offset!");
static_assert(offsetof(UBP_LoadMap_Slot_C, HighlightAnim) == 0x0002A0, "Member 'UBP_LoadMap_Slot_C::HighlightAnim' has a wrong offset!");
static_assert(offsetof(UBP_LoadMap_Slot_C, Bg) == 0x0002A8, "Member 'UBP_LoadMap_Slot_C::Bg' has a wrong offset!");
static_assert(offsetof(UBP_LoadMap_Slot_C, Bg_Highlight) == 0x0002B0, "Member 'UBP_LoadMap_Slot_C::Bg_Highlight' has a wrong offset!");
static_assert(offsetof(UBP_LoadMap_Slot_C, ButtonFrame) == 0x0002B8, "Member 'UBP_LoadMap_Slot_C::ButtonFrame' has a wrong offset!");
static_assert(offsetof(UBP_LoadMap_Slot_C, Frame_HighlightAnim) == 0x0002C0, "Member 'UBP_LoadMap_Slot_C::Frame_HighlightAnim' has a wrong offset!");
static_assert(offsetof(UBP_LoadMap_Slot_C, Name_0) == 0x0002C8, "Member 'UBP_LoadMap_Slot_C::Name_0' has a wrong offset!");
static_assert(offsetof(UBP_LoadMap_Slot_C, OnHovered) == 0x0002D0, "Member 'UBP_LoadMap_Slot_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UBP_LoadMap_Slot_C, OnUnhovered) == 0x0002E0, "Member 'UBP_LoadMap_Slot_C::OnUnhovered' has a wrong offset!");
static_assert(offsetof(UBP_LoadMap_Slot_C, OnReleased) == 0x0002F0, "Member 'UBP_LoadMap_Slot_C::OnReleased' has a wrong offset!");
static_assert(offsetof(UBP_LoadMap_Slot_C, OnPressed) == 0x000300, "Member 'UBP_LoadMap_Slot_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UBP_LoadMap_Slot_C, OnUnfocus) == 0x000310, "Member 'UBP_LoadMap_Slot_C::OnUnfocus' has a wrong offset!");

}

