#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LibrarianBoss

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_LibrarianBoss.BP_LibrarianBoss_C.ExecuteUbergraph_BP_LibrarianBoss
// 0x0058 (0x0058 - 0x0000)
struct BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDamageType_Poison;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDamageType_IsValid;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDamageType_Poison_1;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDamageType_IsValid_1;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDamageType_Poison_2;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDamageType_IsValid_2;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDamageType_Poison_3;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDamageType_IsValid_3;                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_VfxEventType;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_LibrarianKnowledgeIsPower_C*        K2Node_DynamicCast_AsBP_Librarian_Knowledge_Is_Power; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDamageType_Poison_4;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDamageType_IsValid_4;                  // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDamageType_Poison_5;                   // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDamageType_IsValid_5;                  // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDamageType_Poison_6;                   // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDamageType_IsValid_6;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss) == 0x000008, "Wrong alignment on BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss");
static_assert(sizeof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss) == 0x000058, "Wrong size on BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, EntryPoint) == 0x000000, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, CallFunc_GetDamageType_Poison) == 0x000004, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::CallFunc_GetDamageType_Poison' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, CallFunc_GetDamageType_IsValid) == 0x000005, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::CallFunc_GetDamageType_IsValid' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, CallFunc_GetDamageType_Poison_1) == 0x000007, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::CallFunc_GetDamageType_Poison_1' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, CallFunc_GetDamageType_IsValid_1) == 0x000008, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::CallFunc_GetDamageType_IsValid_1' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, CallFunc_BooleanAND_ReturnValue_1) == 0x000009, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, CallFunc_GetDamageType_Poison_2) == 0x00000A, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::CallFunc_GetDamageType_Poison_2' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, CallFunc_GetDamageType_IsValid_2) == 0x00000B, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::CallFunc_GetDamageType_IsValid_2' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, CallFunc_BooleanAND_ReturnValue_2) == 0x00000C, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, CallFunc_GetDamageType_Poison_3) == 0x00000D, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::CallFunc_GetDamageType_Poison_3' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, CallFunc_GetDamageType_IsValid_3) == 0x00000E, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::CallFunc_GetDamageType_IsValid_3' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, CallFunc_BooleanAND_ReturnValue_3) == 0x00000F, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, CallFunc_GetAbilityController_ReturnValue) == 0x000010, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000018, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, K2Node_Event_VfxEventType) == 0x000020, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::K2Node_Event_VfxEventType' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, K2Node_DynamicCast_AsBP_Librarian_Knowledge_Is_Power) == 0x000028, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::K2Node_DynamicCast_AsBP_Librarian_Knowledge_Is_Power' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, K2Node_SwitchName_CmpSuccess) == 0x000031, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, CallFunc_GetDamageType_Poison_4) == 0x000032, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::CallFunc_GetDamageType_Poison_4' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, CallFunc_GetDamageType_IsValid_4) == 0x000033, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::CallFunc_GetDamageType_IsValid_4' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, CallFunc_BooleanAND_ReturnValue_4) == 0x000034, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, CallFunc_GetDamageType_Poison_5) == 0x000035, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::CallFunc_GetDamageType_Poison_5' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, CallFunc_GetDamageType_IsValid_5) == 0x000036, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::CallFunc_GetDamageType_IsValid_5' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, CallFunc_BooleanAND_ReturnValue_5) == 0x000037, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, CallFunc_SelectColor_ReturnValue) == 0x000038, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000048, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, CallFunc_GetDamageType_Poison_6) == 0x000054, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::CallFunc_GetDamageType_Poison_6' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, CallFunc_GetDamageType_IsValid_6) == 0x000055, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::CallFunc_GetDamageType_IsValid_6' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss, CallFunc_BooleanAND_ReturnValue_6) == 0x000056, "Member 'BP_LibrarianBoss_C_ExecuteUbergraph_BP_LibrarianBoss::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");

// Function BP_LibrarianBoss.BP_LibrarianBoss_C.OnVfxEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_LibrarianBoss_C_OnVfxEvent final
{
public:
	class FName                                   VfxEventType;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LibrarianBoss_C_OnVfxEvent) == 0x000004, "Wrong alignment on BP_LibrarianBoss_C_OnVfxEvent");
static_assert(sizeof(BP_LibrarianBoss_C_OnVfxEvent) == 0x000008, "Wrong size on BP_LibrarianBoss_C_OnVfxEvent");
static_assert(offsetof(BP_LibrarianBoss_C_OnVfxEvent, VfxEventType) == 0x000000, "Member 'BP_LibrarianBoss_C_OnVfxEvent::VfxEventType' has a wrong offset!");

// Function BP_LibrarianBoss.BP_LibrarianBoss_C.GetDamageType
// 0x0003 (0x0003 - 0x0000)
struct BP_LibrarianBoss_C_GetDamageType final
{
public:
	bool                                          Poison;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsValid;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LibrarianBoss_C_GetDamageType) == 0x000001, "Wrong alignment on BP_LibrarianBoss_C_GetDamageType");
static_assert(sizeof(BP_LibrarianBoss_C_GetDamageType) == 0x000003, "Wrong size on BP_LibrarianBoss_C_GetDamageType");
static_assert(offsetof(BP_LibrarianBoss_C_GetDamageType, Poison) == 0x000000, "Member 'BP_LibrarianBoss_C_GetDamageType::Poison' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_GetDamageType, IsValid) == 0x000001, "Member 'BP_LibrarianBoss_C_GetDamageType::IsValid' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_C_GetDamageType, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'BP_LibrarianBoss_C_GetDamageType::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

