#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LootableHerb_Base

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_LootableHerb_Base.BP_LootableHerb_Base_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct BP_LootableHerb_Base_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LootableHerb_Base_C_UserConstructionScript) == 0x000001, "Wrong alignment on BP_LootableHerb_Base_C_UserConstructionScript");
static_assert(sizeof(BP_LootableHerb_Base_C_UserConstructionScript) == 0x000001, "Wrong size on BP_LootableHerb_Base_C_UserConstructionScript");
static_assert(offsetof(BP_LootableHerb_Base_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_LootableHerb_Base_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_LootableHerb_Base.BP_LootableHerb_Base_C.ExecuteUbergraph_BP_LootableHerb_Base
// 0x0044 (0x0044 - 0x0000)
struct BP_LootableHerb_Base_C_ExecuteUbergraph_BP_LootableHerb_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0024(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Harvestable_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LootableHerb_Base_C_ExecuteUbergraph_BP_LootableHerb_Base) == 0x000004, "Wrong alignment on BP_LootableHerb_Base_C_ExecuteUbergraph_BP_LootableHerb_Base");
static_assert(sizeof(BP_LootableHerb_Base_C_ExecuteUbergraph_BP_LootableHerb_Base) == 0x000044, "Wrong size on BP_LootableHerb_Base_C_ExecuteUbergraph_BP_LootableHerb_Base");
static_assert(offsetof(BP_LootableHerb_Base_C_ExecuteUbergraph_BP_LootableHerb_Base, EntryPoint) == 0x000000, "Member 'BP_LootableHerb_Base_C_ExecuteUbergraph_BP_LootableHerb_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LootableHerb_Base_C_ExecuteUbergraph_BP_LootableHerb_Base, Temp_delegate_Variable) == 0x000004, "Member 'BP_LootableHerb_Base_C_ExecuteUbergraph_BP_LootableHerb_Base::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootableHerb_Base_C_ExecuteUbergraph_BP_LootableHerb_Base, Temp_delegate_Variable_1) == 0x000014, "Member 'BP_LootableHerb_Base_C_ExecuteUbergraph_BP_LootableHerb_Base::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LootableHerb_Base_C_ExecuteUbergraph_BP_LootableHerb_Base, Temp_delegate_Variable_2) == 0x000024, "Member 'BP_LootableHerb_Base_C_ExecuteUbergraph_BP_LootableHerb_Base::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_LootableHerb_Base_C_ExecuteUbergraph_BP_LootableHerb_Base, CallFunc_PostAkEvent_ReturnValue) == 0x000034, "Member 'BP_LootableHerb_Base_C_ExecuteUbergraph_BP_LootableHerb_Base::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootableHerb_Base_C_ExecuteUbergraph_BP_LootableHerb_Base, CallFunc_PostAkEvent_ReturnValue_1) == 0x000038, "Member 'BP_LootableHerb_Base_C_ExecuteUbergraph_BP_LootableHerb_Base::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LootableHerb_Base_C_ExecuteUbergraph_BP_LootableHerb_Base, CallFunc_PostAkEvent_ReturnValue_2) == 0x00003C, "Member 'BP_LootableHerb_Base_C_ExecuteUbergraph_BP_LootableHerb_Base::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LootableHerb_Base_C_ExecuteUbergraph_BP_LootableHerb_Base, CallFunc_Harvestable_ReturnValue) == 0x000040, "Member 'BP_LootableHerb_Base_C_ExecuteUbergraph_BP_LootableHerb_Base::CallFunc_Harvestable_ReturnValue' has a wrong offset!");

}

