#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ladder

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Ladder.BP_Ladder_C
// 0x0098 (0x0880 - 0x07E8)
class ABP_Ladder_C final : public ALadderActorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_InteractPrompWidgetComponent_C*     BP_InteractPrompWidgetComponent;                   // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LadderBottomPose;                                  // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LadderTopPose;                                     // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh11;                                      // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh10;                                      // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh9;                                       // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh8;                                       // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh7;                                       // 0x0828(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh6;                                       // 0x0830(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh5;                                       // 0x0838(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh4;                                       // 0x0840(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x0848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x0850(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0858(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoundingBoxComponent*                  BoundingBox;                                       // 0x0860(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         InteractPromptTopOffsetZ;                          // 0x0878(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InteractPromptBottomOffsetZ;                       // 0x087C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Ladder(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Ladder_C">();
	}
	static class ABP_Ladder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Ladder_C>();
	}
};
static_assert(alignof(ABP_Ladder_C) == 0x000008, "Wrong alignment on ABP_Ladder_C");
static_assert(sizeof(ABP_Ladder_C) == 0x000880, "Wrong size on ABP_Ladder_C");
static_assert(offsetof(ABP_Ladder_C, UberGraphFrame) == 0x0007E8, "Member 'ABP_Ladder_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Ladder_C, BP_InteractPrompWidgetComponent) == 0x0007F0, "Member 'ABP_Ladder_C::BP_InteractPrompWidgetComponent' has a wrong offset!");
static_assert(offsetof(ABP_Ladder_C, LadderBottomPose) == 0x0007F8, "Member 'ABP_Ladder_C::LadderBottomPose' has a wrong offset!");
static_assert(offsetof(ABP_Ladder_C, LadderTopPose) == 0x000800, "Member 'ABP_Ladder_C::LadderTopPose' has a wrong offset!");
static_assert(offsetof(ABP_Ladder_C, StaticMesh11) == 0x000808, "Member 'ABP_Ladder_C::StaticMesh11' has a wrong offset!");
static_assert(offsetof(ABP_Ladder_C, StaticMesh10) == 0x000810, "Member 'ABP_Ladder_C::StaticMesh10' has a wrong offset!");
static_assert(offsetof(ABP_Ladder_C, StaticMesh9) == 0x000818, "Member 'ABP_Ladder_C::StaticMesh9' has a wrong offset!");
static_assert(offsetof(ABP_Ladder_C, StaticMesh8) == 0x000820, "Member 'ABP_Ladder_C::StaticMesh8' has a wrong offset!");
static_assert(offsetof(ABP_Ladder_C, StaticMesh7) == 0x000828, "Member 'ABP_Ladder_C::StaticMesh7' has a wrong offset!");
static_assert(offsetof(ABP_Ladder_C, StaticMesh6) == 0x000830, "Member 'ABP_Ladder_C::StaticMesh6' has a wrong offset!");
static_assert(offsetof(ABP_Ladder_C, StaticMesh5) == 0x000838, "Member 'ABP_Ladder_C::StaticMesh5' has a wrong offset!");
static_assert(offsetof(ABP_Ladder_C, StaticMesh4) == 0x000840, "Member 'ABP_Ladder_C::StaticMesh4' has a wrong offset!");
static_assert(offsetof(ABP_Ladder_C, StaticMesh3) == 0x000848, "Member 'ABP_Ladder_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(ABP_Ladder_C, StaticMesh2) == 0x000850, "Member 'ABP_Ladder_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(ABP_Ladder_C, StaticMesh1) == 0x000858, "Member 'ABP_Ladder_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_Ladder_C, BoundingBox) == 0x000860, "Member 'ABP_Ladder_C::BoundingBox' has a wrong offset!");
static_assert(offsetof(ABP_Ladder_C, StaticMesh) == 0x000868, "Member 'ABP_Ladder_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Ladder_C, DefaultSceneRoot) == 0x000870, "Member 'ABP_Ladder_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Ladder_C, InteractPromptTopOffsetZ) == 0x000878, "Member 'ABP_Ladder_C::InteractPromptTopOffsetZ' has a wrong offset!");
static_assert(offsetof(ABP_Ladder_C, InteractPromptBottomOffsetZ) == 0x00087C, "Member 'ABP_Ladder_C::InteractPromptBottomOffsetZ' has a wrong offset!");

}

