#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LibrarianBoss_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_LibrarianBoss_Anim.BP_LibrarianBoss_Anim_C.ExecuteUbergraph_BP_LibrarianBoss_Anim
// 0x006C (0x006C - 0x0000)
struct BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_2;       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_3;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bForced;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_4;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_1;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_5; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_5;       // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFacing_ReturnValue;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimToggled_ReturnValue;                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimToggled_ReturnValue_1;              // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimToggled_ReturnValue_2;              // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimToggled_ReturnValue_3;              // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Interpolate_ReturnValue;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim) == 0x000004, "Wrong alignment on BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim");
static_assert(sizeof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim) == 0x00006C, "Wrong size on BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, EntryPoint) == 0x000000, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_GetCurveValue_ReturnValue) == 0x000004, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x00000C, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_SelectFloat_ReturnValue) == 0x000014, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1) == 0x000018, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2) == 0x00001C, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000020, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_2) == 0x000021, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3) == 0x000024, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_3) == 0x000028, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000029, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_Abs_ReturnValue) == 0x00002C, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000030, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, K2Node_Event_DeltaTimeX) == 0x000034, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, K2Node_Event_bForced) == 0x000038, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::K2Node_Event_bForced' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4) == 0x00003C, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_4) == 0x000040, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_GetCurveValue_ReturnValue_1) == 0x000044, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_GetCurveValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000048, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00004C, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_5) == 0x000050, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_5) == 0x000054, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_GetFacing_ReturnValue) == 0x000058, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_GetFacing_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_IsAnimToggled_ReturnValue) == 0x00005C, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_IsAnimToggled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_IsAnimToggled_ReturnValue_1) == 0x00005D, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_IsAnimToggled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_IsAnimToggled_ReturnValue_2) == 0x00005E, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_IsAnimToggled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_IsAnimToggled_ReturnValue_3) == 0x00005F, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_IsAnimToggled_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_Not_PreBool_ReturnValue) == 0x000060, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000064, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim, CallFunc_Interpolate_ReturnValue) == 0x000068, "Member 'BP_LibrarianBoss_Anim_C_ExecuteUbergraph_BP_LibrarianBoss_Anim::CallFunc_Interpolate_ReturnValue' has a wrong offset!");

// Function BP_LibrarianBoss_Anim.BP_LibrarianBoss_Anim_C.OnFacingChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_LibrarianBoss_Anim_C_OnFacingChanged final
{
public:
	bool                                          bForced;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LibrarianBoss_Anim_C_OnFacingChanged) == 0x000001, "Wrong alignment on BP_LibrarianBoss_Anim_C_OnFacingChanged");
static_assert(sizeof(BP_LibrarianBoss_Anim_C_OnFacingChanged) == 0x000001, "Wrong size on BP_LibrarianBoss_Anim_C_OnFacingChanged");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_OnFacingChanged, bForced) == 0x000000, "Member 'BP_LibrarianBoss_Anim_C_OnFacingChanged::bForced' has a wrong offset!");

// Function BP_LibrarianBoss_Anim.BP_LibrarianBoss_Anim_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct BP_LibrarianBoss_Anim_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LibrarianBoss_Anim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on BP_LibrarianBoss_Anim_C_BlueprintUpdateAnimation");
static_assert(sizeof(BP_LibrarianBoss_Anim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on BP_LibrarianBoss_Anim_C_BlueprintUpdateAnimation");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'BP_LibrarianBoss_Anim_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function BP_LibrarianBoss_Anim.BP_LibrarianBoss_Anim_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct BP_LibrarianBoss_Anim_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BP_LibrarianBoss_Anim_C_AnimGraph) == 0x000008, "Wrong alignment on BP_LibrarianBoss_Anim_C_AnimGraph");
static_assert(sizeof(BP_LibrarianBoss_Anim_C_AnimGraph) == 0x000010, "Wrong size on BP_LibrarianBoss_Anim_C_AnimGraph");
static_assert(offsetof(BP_LibrarianBoss_Anim_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'BP_LibrarianBoss_Anim_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

