#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LibrarianBookOfEnlightenmentExplosionActor

#include "Basic.hpp"

#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LibrarianBookOfEnlightenmentExplosionActor.BP_LibrarianBookOfEnlightenmentExplosionActor_C
// 0x0048 (0x0820 - 0x07D8)
class ABP_LibrarianBookOfEnlightenmentExplosionActor_C final : public AActorBase
{
public:
	class UHitBox*                                CircularHitBox1;                                   // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                CircularHitBox6;                                   // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                CircularHitBox5;                                   // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                CircularHitBox4;                                   // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                CircularHitBox3;                                   // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                CircularHitBox2;                                   // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CircularHitBoxRoot;                                // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        RootScene;                                         // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LibrarianBookOfEnlightenmentExplosionActor_C">();
	}
	static class ABP_LibrarianBookOfEnlightenmentExplosionActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LibrarianBookOfEnlightenmentExplosionActor_C>();
	}
};
static_assert(alignof(ABP_LibrarianBookOfEnlightenmentExplosionActor_C) == 0x000008, "Wrong alignment on ABP_LibrarianBookOfEnlightenmentExplosionActor_C");
static_assert(sizeof(ABP_LibrarianBookOfEnlightenmentExplosionActor_C) == 0x000820, "Wrong size on ABP_LibrarianBookOfEnlightenmentExplosionActor_C");
static_assert(offsetof(ABP_LibrarianBookOfEnlightenmentExplosionActor_C, CircularHitBox1) == 0x0007D8, "Member 'ABP_LibrarianBookOfEnlightenmentExplosionActor_C::CircularHitBox1' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBookOfEnlightenmentExplosionActor_C, CircularHitBox6) == 0x0007E0, "Member 'ABP_LibrarianBookOfEnlightenmentExplosionActor_C::CircularHitBox6' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBookOfEnlightenmentExplosionActor_C, CircularHitBox5) == 0x0007E8, "Member 'ABP_LibrarianBookOfEnlightenmentExplosionActor_C::CircularHitBox5' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBookOfEnlightenmentExplosionActor_C, CircularHitBox4) == 0x0007F0, "Member 'ABP_LibrarianBookOfEnlightenmentExplosionActor_C::CircularHitBox4' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBookOfEnlightenmentExplosionActor_C, CircularHitBox3) == 0x0007F8, "Member 'ABP_LibrarianBookOfEnlightenmentExplosionActor_C::CircularHitBox3' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBookOfEnlightenmentExplosionActor_C, CircularHitBox2) == 0x000800, "Member 'ABP_LibrarianBookOfEnlightenmentExplosionActor_C::CircularHitBox2' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBookOfEnlightenmentExplosionActor_C, CircularHitBoxRoot) == 0x000808, "Member 'ABP_LibrarianBookOfEnlightenmentExplosionActor_C::CircularHitBoxRoot' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBookOfEnlightenmentExplosionActor_C, RootScene) == 0x000810, "Member 'ABP_LibrarianBookOfEnlightenmentExplosionActor_C::RootScene' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBookOfEnlightenmentExplosionActor_C, DefaultSceneRoot) == 0x000818, "Member 'ABP_LibrarianBookOfEnlightenmentExplosionActor_C::DefaultSceneRoot' has a wrong offset!");

}

