#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LibrarianTeleportAOEActor

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_LibrarianTeleportAOEActor.BP_LibrarianTeleportAOEActor_C.ExecuteUbergraph_BP_LibrarianTeleportAOEActor
// 0x0018 (0x0018 - 0x0000)
struct BP_LibrarianTeleportAOEActor_C_ExecuteUbergraph_BP_LibrarianTeleportAOEActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LibrarianTeleportAOEActor_C_ExecuteUbergraph_BP_LibrarianTeleportAOEActor) == 0x000008, "Wrong alignment on BP_LibrarianTeleportAOEActor_C_ExecuteUbergraph_BP_LibrarianTeleportAOEActor");
static_assert(sizeof(BP_LibrarianTeleportAOEActor_C_ExecuteUbergraph_BP_LibrarianTeleportAOEActor) == 0x000018, "Wrong size on BP_LibrarianTeleportAOEActor_C_ExecuteUbergraph_BP_LibrarianTeleportAOEActor");
static_assert(offsetof(BP_LibrarianTeleportAOEActor_C_ExecuteUbergraph_BP_LibrarianTeleportAOEActor, EntryPoint) == 0x000000, "Member 'BP_LibrarianTeleportAOEActor_C_ExecuteUbergraph_BP_LibrarianTeleportAOEActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LibrarianTeleportAOEActor_C_ExecuteUbergraph_BP_LibrarianTeleportAOEActor, CallFunc_GetManGameMode_ReturnValue) == 0x000008, "Member 'BP_LibrarianTeleportAOEActor_C_ExecuteUbergraph_BP_LibrarianTeleportAOEActor::CallFunc_GetManGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianTeleportAOEActor_C_ExecuteUbergraph_BP_LibrarianTeleportAOEActor, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000010, "Member 'BP_LibrarianTeleportAOEActor_C_ExecuteUbergraph_BP_LibrarianTeleportAOEActor::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");

}

