#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LightningStorm_ChargeUP_VisualEntity

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_LightningStorm_ChargeUP_VisualEntity.BP_LightningStorm_ChargeUP_VisualEntity_C.ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity
// 0x0070 (0x0070 - 0x0000)
struct BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_LightningStorm_ActiveAbility_C*     K2Node_DynamicCast_AsBP_Lightning_Storm_Active_Ability; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity) == 0x000008, "Wrong alignment on BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity");
static_assert(sizeof(BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity) == 0x000070, "Wrong size on BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity");
static_assert(offsetof(BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity, Temp_delegate_Variable) == 0x000004, "Member 'BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity, Temp_delegate_Variable_1) == 0x000014, "Member 'BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity, CallFunc_PostAkEvent_ReturnValue) == 0x000028, "Member 'BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity, CallFunc_Add_FloatFloat_ReturnValue) == 0x00002C, "Member 'BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000030, "Member 'BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity, CallFunc_FClamp_ReturnValue) == 0x000034, "Member 'BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity, K2Node_DynamicCast_AsCharacter_Base) == 0x000040, "Member 'BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity, CallFunc_PostAkEvent_ReturnValue_1) == 0x00004C, "Member 'BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity, CallFunc_GetAbilityController_ReturnValue) == 0x000050, "Member 'BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000058, "Member 'BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity, K2Node_DynamicCast_AsBP_Lightning_Storm_Active_Ability) == 0x000060, "Member 'BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity::K2Node_DynamicCast_AsBP_Lightning_Storm_Active_Ability' has a wrong offset!");
static_assert(offsetof(BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_LightningStorm_ChargeUP_VisualEntity_C_ExecuteUbergraph_BP_LightningStorm_ChargeUP_VisualEntity::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_LightningStorm_ChargeUP_VisualEntity.BP_LightningStorm_ChargeUP_VisualEntity_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_LightningStorm_ChargeUP_VisualEntity_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LightningStorm_ChargeUP_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_LightningStorm_ChargeUP_VisualEntity_C_ReceiveTick");
static_assert(sizeof(BP_LightningStorm_ChargeUP_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong size on BP_LightningStorm_ChargeUP_VisualEntity_C_ReceiveTick");
static_assert(offsetof(BP_LightningStorm_ChargeUP_VisualEntity_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_LightningStorm_ChargeUP_VisualEntity_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

