#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LootableMineral_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_LootableMineral_Base.BP_LootableMineral_Base_C.ExecuteUbergraph_BP_LootableMineral_Base
// 0x0248 (0x0248 - 0x0000)
struct BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x001C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x002C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x003C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x004C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0068(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x00FC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x0184(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDestructibleMesh*                      CallFunc_GetDestructibleMesh_ReturnValue;          // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Harvestable_ReturnValue;                  // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base) == 0x000008, "Wrong alignment on BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base");
static_assert(sizeof(BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base) == 0x000248, "Wrong size on BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base");
static_assert(offsetof(BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base, EntryPoint) == 0x000000, "Member 'BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000004, "Member 'BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base, CallFunc_MakeVector_ReturnValue) == 0x000010, "Member 'BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base, Temp_delegate_Variable) == 0x00001C, "Member 'BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base, Temp_delegate_Variable_1) == 0x00002C, "Member 'BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base, Temp_delegate_Variable_2) == 0x00003C, "Member 'BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base, Temp_delegate_Variable_3) == 0x00004C, "Member 'BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00005C, "Member 'BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000068, "Member 'BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base, CallFunc_VLerp_ReturnValue) == 0x0000F0, "Member 'BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x0000FC, "Member 'BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base, CallFunc_K2_SetRelativeLocation_SweepHitResult_2) == 0x000184, "Member 'BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base::CallFunc_K2_SetRelativeLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base, CallFunc_GetDestructibleMesh_ReturnValue) == 0x000210, "Member 'BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base::CallFunc_GetDestructibleMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base, CallFunc_PostAkEvent_ReturnValue) == 0x000218, "Member 'BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base, CallFunc_PostAkEvent_ReturnValue_1) == 0x00021C, "Member 'BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base, CallFunc_PostAkEvent_ReturnValue_2) == 0x000220, "Member 'BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base, CallFunc_PostAkEvent_ReturnValue_3) == 0x000224, "Member 'BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base::CallFunc_PostAkEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000228, "Member 'BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base, CallFunc_Add_VectorVector_ReturnValue) == 0x000234, "Member 'BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base, CallFunc_Harvestable_ReturnValue) == 0x000240, "Member 'BP_LootableMineral_Base_C_ExecuteUbergraph_BP_LootableMineral_Base::CallFunc_Harvestable_ReturnValue' has a wrong offset!");

// Function BP_LootableMineral_Base.BP_LootableMineral_Base_C.Shiny
// 0x0010 (0x0010 - 0x0000)
struct BP_LootableMineral_Base_C_Shiny final
{
public:
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootableMineral_Base_C_Shiny) == 0x000008, "Wrong alignment on BP_LootableMineral_Base_C_Shiny");
static_assert(sizeof(BP_LootableMineral_Base_C_Shiny) == 0x000010, "Wrong size on BP_LootableMineral_Base_C_Shiny");
static_assert(offsetof(BP_LootableMineral_Base_C_Shiny, CallFunc_K2_SetTimer_ReturnValue) == 0x000000, "Member 'BP_LootableMineral_Base_C_Shiny::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootableMineral_Base_C_Shiny, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000008, "Member 'BP_LootableMineral_Base_C_Shiny::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");

// Function BP_LootableMineral_Base.BP_LootableMineral_Base_C.RecalcShine
// 0x0018 (0x0018 - 0x0000)
struct BP_LootableMineral_Base_C_RecalcShine final
{
public:
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue_1;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootableMineral_Base_C_RecalcShine) == 0x000008, "Wrong alignment on BP_LootableMineral_Base_C_RecalcShine");
static_assert(sizeof(BP_LootableMineral_Base_C_RecalcShine) == 0x000018, "Wrong size on BP_LootableMineral_Base_C_RecalcShine");
static_assert(offsetof(BP_LootableMineral_Base_C_RecalcShine, CallFunc_RandomFloat_ReturnValue) == 0x000000, "Member 'BP_LootableMineral_Base_C_RecalcShine::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootableMineral_Base_C_RecalcShine, CallFunc_RandomFloat_ReturnValue_1) == 0x000004, "Member 'BP_LootableMineral_Base_C_RecalcShine::CallFunc_RandomFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LootableMineral_Base_C_RecalcShine, CallFunc_Add_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_LootableMineral_Base_C_RecalcShine::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootableMineral_Base_C_RecalcShine, CallFunc_K2_SetTimer_ReturnValue) == 0x000010, "Member 'BP_LootableMineral_Base_C_RecalcShine::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

}

