#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LibrarianBookOfEnlightenmentBook

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LibrarianBookOfEnlightenmentBook.BP_LibrarianBookOfEnlightenmentBook_C
// 0x0020 (0x1AE0 - 0x1AC0)
class ABP_LibrarianBookOfEnlightenmentBook_C final : public AEnemyCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1AC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   TempCube;                                          // 0x1AC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                VFXJank;                                           // 0x1AD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                BeamHitbox;                                        // 0x1AD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_LibrarianBookOfEnlightenmentBook(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LibrarianBookOfEnlightenmentBook_C">();
	}
	static class ABP_LibrarianBookOfEnlightenmentBook_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LibrarianBookOfEnlightenmentBook_C>();
	}
};
static_assert(alignof(ABP_LibrarianBookOfEnlightenmentBook_C) == 0x000010, "Wrong alignment on ABP_LibrarianBookOfEnlightenmentBook_C");
static_assert(sizeof(ABP_LibrarianBookOfEnlightenmentBook_C) == 0x001AE0, "Wrong size on ABP_LibrarianBookOfEnlightenmentBook_C");
static_assert(offsetof(ABP_LibrarianBookOfEnlightenmentBook_C, UberGraphFrame) == 0x001AC0, "Member 'ABP_LibrarianBookOfEnlightenmentBook_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBookOfEnlightenmentBook_C, TempCube) == 0x001AC8, "Member 'ABP_LibrarianBookOfEnlightenmentBook_C::TempCube' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBookOfEnlightenmentBook_C, VFXJank) == 0x001AD0, "Member 'ABP_LibrarianBookOfEnlightenmentBook_C::VFXJank' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBookOfEnlightenmentBook_C, BeamHitbox) == 0x001AD8, "Member 'ABP_LibrarianBookOfEnlightenmentBook_C::BeamHitbox' has a wrong offset!");

}

