#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LevelUpAltar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LevelUpAltar.BP_LevelUpAltar_C
// 0x00A8 (0x0880 - 0x07D8)
class ABP_LevelUpAltar_C final : public AActorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_AltarHighlight1;                                // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoundingBoxComponent*                  BoundingBox;                                       // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               AltarSmoke;                                        // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight2;                                       // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight1;                                       // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Candle03_Smoke;                                    // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Candle05_Smoke;                                    // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Candle04_Smoke;                                    // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Candle03_Fire;                                     // 0x0828(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Candle02_Fire;                                     // 0x0830(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Candle01_Fire;                                     // 0x0838(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0840(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_InteractPrompWidgetComponent_C*     BP_InteractPrompWidgetComponent;                   // 0x0848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTriggerBoxComponent*                   TriggerBox;                                        // 0x0850(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0858(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FadeInVisualsTimeline_MPCParams_2FAEBF3F43CA68D114B43BA0B1C62AC8; // 0x0860(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeInVisualsTimeline_LightIntensity_2FAEBF3F43CA68D114B43BA0B1C62AC8; // 0x0864(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeInVisualsTimeline__Direction_2FAEBF3F43CA68D114B43BA0B1C62AC8; // 0x0868(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_869[0x7];                                      // 0x0869(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadeInVisualsTimeline;                             // 0x0870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaterialTimer;                                     // 0x0878(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void InstantToggle(bool On);
	void FadeInVisualsTimeline__FinishedFunc();
	void FadeInVisualsTimeline__UpdateFunc();
	void FadeInVisuals();
	void BPPostBeginPlay();
	void ExecuteUbergraph_BP_LevelUpAltar(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LevelUpAltar_C">();
	}
	static class ABP_LevelUpAltar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LevelUpAltar_C>();
	}
};
static_assert(alignof(ABP_LevelUpAltar_C) == 0x000008, "Wrong alignment on ABP_LevelUpAltar_C");
static_assert(sizeof(ABP_LevelUpAltar_C) == 0x000880, "Wrong size on ABP_LevelUpAltar_C");
static_assert(offsetof(ABP_LevelUpAltar_C, UberGraphFrame) == 0x0007D8, "Member 'ABP_LevelUpAltar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LevelUpAltar_C, Ak) == 0x0007E0, "Member 'ABP_LevelUpAltar_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_LevelUpAltar_C, NS_AltarHighlight1) == 0x0007E8, "Member 'ABP_LevelUpAltar_C::NS_AltarHighlight1' has a wrong offset!");
static_assert(offsetof(ABP_LevelUpAltar_C, BoundingBox) == 0x0007F0, "Member 'ABP_LevelUpAltar_C::BoundingBox' has a wrong offset!");
static_assert(offsetof(ABP_LevelUpAltar_C, AltarSmoke) == 0x0007F8, "Member 'ABP_LevelUpAltar_C::AltarSmoke' has a wrong offset!");
static_assert(offsetof(ABP_LevelUpAltar_C, PointLight2) == 0x000800, "Member 'ABP_LevelUpAltar_C::PointLight2' has a wrong offset!");
static_assert(offsetof(ABP_LevelUpAltar_C, PointLight1) == 0x000808, "Member 'ABP_LevelUpAltar_C::PointLight1' has a wrong offset!");
static_assert(offsetof(ABP_LevelUpAltar_C, Candle03_Smoke) == 0x000810, "Member 'ABP_LevelUpAltar_C::Candle03_Smoke' has a wrong offset!");
static_assert(offsetof(ABP_LevelUpAltar_C, Candle05_Smoke) == 0x000818, "Member 'ABP_LevelUpAltar_C::Candle05_Smoke' has a wrong offset!");
static_assert(offsetof(ABP_LevelUpAltar_C, Candle04_Smoke) == 0x000820, "Member 'ABP_LevelUpAltar_C::Candle04_Smoke' has a wrong offset!");
static_assert(offsetof(ABP_LevelUpAltar_C, Candle03_Fire) == 0x000828, "Member 'ABP_LevelUpAltar_C::Candle03_Fire' has a wrong offset!");
static_assert(offsetof(ABP_LevelUpAltar_C, Candle02_Fire) == 0x000830, "Member 'ABP_LevelUpAltar_C::Candle02_Fire' has a wrong offset!");
static_assert(offsetof(ABP_LevelUpAltar_C, Candle01_Fire) == 0x000838, "Member 'ABP_LevelUpAltar_C::Candle01_Fire' has a wrong offset!");
static_assert(offsetof(ABP_LevelUpAltar_C, StaticMesh) == 0x000840, "Member 'ABP_LevelUpAltar_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_LevelUpAltar_C, BP_InteractPrompWidgetComponent) == 0x000848, "Member 'ABP_LevelUpAltar_C::BP_InteractPrompWidgetComponent' has a wrong offset!");
static_assert(offsetof(ABP_LevelUpAltar_C, TriggerBox) == 0x000850, "Member 'ABP_LevelUpAltar_C::TriggerBox' has a wrong offset!");
static_assert(offsetof(ABP_LevelUpAltar_C, DefaultSceneRoot) == 0x000858, "Member 'ABP_LevelUpAltar_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_LevelUpAltar_C, FadeInVisualsTimeline_MPCParams_2FAEBF3F43CA68D114B43BA0B1C62AC8) == 0x000860, "Member 'ABP_LevelUpAltar_C::FadeInVisualsTimeline_MPCParams_2FAEBF3F43CA68D114B43BA0B1C62AC8' has a wrong offset!");
static_assert(offsetof(ABP_LevelUpAltar_C, FadeInVisualsTimeline_LightIntensity_2FAEBF3F43CA68D114B43BA0B1C62AC8) == 0x000864, "Member 'ABP_LevelUpAltar_C::FadeInVisualsTimeline_LightIntensity_2FAEBF3F43CA68D114B43BA0B1C62AC8' has a wrong offset!");
static_assert(offsetof(ABP_LevelUpAltar_C, FadeInVisualsTimeline__Direction_2FAEBF3F43CA68D114B43BA0B1C62AC8) == 0x000868, "Member 'ABP_LevelUpAltar_C::FadeInVisualsTimeline__Direction_2FAEBF3F43CA68D114B43BA0B1C62AC8' has a wrong offset!");
static_assert(offsetof(ABP_LevelUpAltar_C, FadeInVisualsTimeline) == 0x000870, "Member 'ABP_LevelUpAltar_C::FadeInVisualsTimeline' has a wrong offset!");
static_assert(offsetof(ABP_LevelUpAltar_C, MaterialTimer) == 0x000878, "Member 'ABP_LevelUpAltar_C::MaterialTimer' has a wrong offset!");

}

