#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Librarian_StrikingRevelationBurn_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_Librarian_StrikingRevelationBurn_VisualEntity.BP_Librarian_StrikingRevelationBurn_VisualEntity_C.ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity
// 0x0330 (0x0330 - 0x0000)
struct BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0038(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetDamageType_Poison;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDamageType_IsValid;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x004C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0060(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_StrikingRevelationSummonedBook_C*   K2Node_DynamicCast_AsBP_Striking_Revelation_Summoned_Book; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0098(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ABP_LibrarianBoss_C*                    K2Node_DynamicCast_AsBP_Librarian_Boss;            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x015C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E7[0x1];                                      // 0x01E7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0xC];                                      // 0x0264(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0270(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x02A0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity) == 0x000010, "Wrong alignment on BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity");
static_assert(sizeof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity) == 0x000330, "Wrong size on BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_GetForwardVector_ReturnValue) == 0x000008, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000014, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000020, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_MakeRotFromX_ReturnValue) == 0x00002C, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, Temp_delegate_Variable) == 0x000038, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_GetDamageType_Poison) == 0x000048, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_GetDamageType_Poison' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_GetDamageType_IsValid) == 0x000049, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_GetDamageType_IsValid' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, Temp_delegate_Variable_1) == 0x00004C, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_BooleanAND_ReturnValue) == 0x00005C, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, Temp_object_Variable) == 0x000060, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000070, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, K2Node_Event_DeltaSeconds) == 0x000078, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, K2Node_DynamicCast_AsBP_Striking_Revelation_Summoned_Book) == 0x000080, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::K2Node_DynamicCast_AsBP_Striking_Revelation_Summoned_Book' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_GetAbilityController_ReturnValue) == 0x000090, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000098, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, K2Node_DynamicCast_AsBP_Librarian_Boss) == 0x000120, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::K2Node_DynamicCast_AsBP_Librarian_Boss' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, K2Node_DynamicCast_bSuccess_1) == 0x000128, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_PostAkEvent_ReturnValue) == 0x00012C, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, K2Node_Event_EndPlayReason) == 0x000130, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_PostAkEvent_ReturnValue_1) == 0x000134, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000138, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_Add_VectorVector_ReturnValue) == 0x000144, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000150, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_LineTraceSingle_OutHit) == 0x00015C, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_LineTraceSingle_ReturnValue) == 0x0001E4, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_BreakHitResult_bBlockingHit) == 0x0001E5, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001E6, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_BreakHitResult_Time) == 0x0001E8, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_BreakHitResult_Distance) == 0x0001EC, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_BreakHitResult_Location) == 0x0001F0, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_BreakHitResult_ImpactPoint) == 0x0001FC, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_BreakHitResult_Normal) == 0x000208, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_BreakHitResult_ImpactNormal) == 0x000214, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_BreakHitResult_PhysMat) == 0x000220, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_BreakHitResult_HitActor) == 0x000228, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_BreakHitResult_HitComponent) == 0x000230, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_BreakHitResult_HitBoneName) == 0x000238, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_BreakHitResult_HitItem) == 0x000240, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_BreakHitResult_ElementIndex) == 0x000244, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_BreakHitResult_FaceIndex) == 0x000248, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_BreakHitResult_TraceStart) == 0x00024C, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_BreakHitResult_TraceEnd) == 0x000258, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_MakeTransform_ReturnValue) == 0x000270, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x0002A0, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");

// Function BP_Librarian_StrikingRevelationBurn_VisualEntity.BP_Librarian_StrikingRevelationBurn_VisualEntity_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ReceiveEndPlay");
static_assert(sizeof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ReceiveEndPlay");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_Librarian_StrikingRevelationBurn_VisualEntity.BP_Librarian_StrikingRevelationBurn_VisualEntity_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ReceiveTick");
static_assert(sizeof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong size on BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ReceiveTick");
static_assert(offsetof(BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Librarian_StrikingRevelationBurn_VisualEntity_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

