#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LibrarianFastLearnerAbility

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_LibrarianFastLearnerAbility.BP_LibrarianFastLearnerAbility_C.ExecuteUbergraph_BP_LibrarianFastLearnerAbility
// 0x0018 (0x0018 - 0x0000)
struct BP_LibrarianFastLearnerAbility_C_ExecuteUbergraph_BP_LibrarianFastLearnerAbility final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LibrarianFastLearnerAbility_C_ExecuteUbergraph_BP_LibrarianFastLearnerAbility) == 0x000004, "Wrong alignment on BP_LibrarianFastLearnerAbility_C_ExecuteUbergraph_BP_LibrarianFastLearnerAbility");
static_assert(sizeof(BP_LibrarianFastLearnerAbility_C_ExecuteUbergraph_BP_LibrarianFastLearnerAbility) == 0x000018, "Wrong size on BP_LibrarianFastLearnerAbility_C_ExecuteUbergraph_BP_LibrarianFastLearnerAbility");
static_assert(offsetof(BP_LibrarianFastLearnerAbility_C_ExecuteUbergraph_BP_LibrarianFastLearnerAbility, EntryPoint) == 0x000000, "Member 'BP_LibrarianFastLearnerAbility_C_ExecuteUbergraph_BP_LibrarianFastLearnerAbility::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LibrarianFastLearnerAbility_C_ExecuteUbergraph_BP_LibrarianFastLearnerAbility, Temp_delegate_Variable) == 0x000004, "Member 'BP_LibrarianFastLearnerAbility_C_ExecuteUbergraph_BP_LibrarianFastLearnerAbility::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_LibrarianFastLearnerAbility_C_ExecuteUbergraph_BP_LibrarianFastLearnerAbility, CallFunc_PostEvent_ReturnValue) == 0x000014, "Member 'BP_LibrarianFastLearnerAbility_C_ExecuteUbergraph_BP_LibrarianFastLearnerAbility::CallFunc_PostEvent_ReturnValue' has a wrong offset!");

}

