#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Librarian_StrikingRevelationBurn_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Librarian_StrikingRevelationBurn_VisualEntity.BP_Librarian_StrikingRevelationBurn_VisualEntity_C
// 0x0030 (0x0380 - 0x0350)
class ABP_Librarian_StrikingRevelationBurn_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Impact;                                            // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                Beam_Hit_Box_0;                                    // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LibrarianBoss_C*                    Lib;                                               // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Librarian_StrikingRevelationBurn_VisualEntity(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void OnKill();
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Librarian_StrikingRevelationBurn_VisualEntity_C">();
	}
	static class ABP_Librarian_StrikingRevelationBurn_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Librarian_StrikingRevelationBurn_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_Librarian_StrikingRevelationBurn_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_Librarian_StrikingRevelationBurn_VisualEntity_C");
static_assert(sizeof(ABP_Librarian_StrikingRevelationBurn_VisualEntity_C) == 0x000380, "Wrong size on ABP_Librarian_StrikingRevelationBurn_VisualEntity_C");
static_assert(offsetof(ABP_Librarian_StrikingRevelationBurn_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_Librarian_StrikingRevelationBurn_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Librarian_StrikingRevelationBurn_VisualEntity_C, Impact) == 0x000358, "Member 'ABP_Librarian_StrikingRevelationBurn_VisualEntity_C::Impact' has a wrong offset!");
static_assert(offsetof(ABP_Librarian_StrikingRevelationBurn_VisualEntity_C, Ak) == 0x000360, "Member 'ABP_Librarian_StrikingRevelationBurn_VisualEntity_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_Librarian_StrikingRevelationBurn_VisualEntity_C, Niagara) == 0x000368, "Member 'ABP_Librarian_StrikingRevelationBurn_VisualEntity_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_Librarian_StrikingRevelationBurn_VisualEntity_C, Beam_Hit_Box_0) == 0x000370, "Member 'ABP_Librarian_StrikingRevelationBurn_VisualEntity_C::Beam_Hit_Box_0' has a wrong offset!");
static_assert(offsetof(ABP_Librarian_StrikingRevelationBurn_VisualEntity_C, Lib) == 0x000378, "Member 'ABP_Librarian_StrikingRevelationBurn_VisualEntity_C::Lib' has a wrong offset!");

}

