#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LibrarianBookPageProjectile

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_LibrarianBookPageProjectile.BP_LibrarianBookPageProjectile_C.ExecuteUbergraph_BP_LibrarianBookPageProjectile
// 0x0050 (0x0050 - 0x0000)
struct BP_LibrarianBookPageProjectile_C_ExecuteUbergraph_BP_LibrarianBookPageProjectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue_1;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LibrarianBoss_C*                    K2Node_DynamicCast_AsBP_Librarian_Boss;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue_1;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LibrarianBookPageProjectile_C_ExecuteUbergraph_BP_LibrarianBookPageProjectile) == 0x000008, "Wrong alignment on BP_LibrarianBookPageProjectile_C_ExecuteUbergraph_BP_LibrarianBookPageProjectile");
static_assert(sizeof(BP_LibrarianBookPageProjectile_C_ExecuteUbergraph_BP_LibrarianBookPageProjectile) == 0x000050, "Wrong size on BP_LibrarianBookPageProjectile_C_ExecuteUbergraph_BP_LibrarianBookPageProjectile");
static_assert(offsetof(BP_LibrarianBookPageProjectile_C_ExecuteUbergraph_BP_LibrarianBookPageProjectile, EntryPoint) == 0x000000, "Member 'BP_LibrarianBookPageProjectile_C_ExecuteUbergraph_BP_LibrarianBookPageProjectile::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBookPageProjectile_C_ExecuteUbergraph_BP_LibrarianBookPageProjectile, CallFunc_GetManGameMode_ReturnValue) == 0x000008, "Member 'BP_LibrarianBookPageProjectile_C_ExecuteUbergraph_BP_LibrarianBookPageProjectile::CallFunc_GetManGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBookPageProjectile_C_ExecuteUbergraph_BP_LibrarianBookPageProjectile, CallFunc_GetAbilityController_ReturnValue) == 0x000010, "Member 'BP_LibrarianBookPageProjectile_C_ExecuteUbergraph_BP_LibrarianBookPageProjectile::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBookPageProjectile_C_ExecuteUbergraph_BP_LibrarianBookPageProjectile, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000018, "Member 'BP_LibrarianBookPageProjectile_C_ExecuteUbergraph_BP_LibrarianBookPageProjectile::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBookPageProjectile_C_ExecuteUbergraph_BP_LibrarianBookPageProjectile, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'BP_LibrarianBookPageProjectile_C_ExecuteUbergraph_BP_LibrarianBookPageProjectile::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBookPageProjectile_C_ExecuteUbergraph_BP_LibrarianBookPageProjectile, CallFunc_GetOwner_ReturnValue_1) == 0x000028, "Member 'BP_LibrarianBookPageProjectile_C_ExecuteUbergraph_BP_LibrarianBookPageProjectile::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBookPageProjectile_C_ExecuteUbergraph_BP_LibrarianBookPageProjectile, CallFunc_GetManGameMode_ReturnValue_1) == 0x000030, "Member 'BP_LibrarianBookPageProjectile_C_ExecuteUbergraph_BP_LibrarianBookPageProjectile::CallFunc_GetManGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBookPageProjectile_C_ExecuteUbergraph_BP_LibrarianBookPageProjectile, K2Node_DynamicCast_AsBP_Librarian_Boss) == 0x000038, "Member 'BP_LibrarianBookPageProjectile_C_ExecuteUbergraph_BP_LibrarianBookPageProjectile::K2Node_DynamicCast_AsBP_Librarian_Boss' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBookPageProjectile_C_ExecuteUbergraph_BP_LibrarianBookPageProjectile, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_LibrarianBookPageProjectile_C_ExecuteUbergraph_BP_LibrarianBookPageProjectile::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LibrarianBookPageProjectile_C_ExecuteUbergraph_BP_LibrarianBookPageProjectile, CallFunc_SpawnVisualEntity_ReturnValue_1) == 0x000048, "Member 'BP_LibrarianBookPageProjectile_C_ExecuteUbergraph_BP_LibrarianBookPageProjectile::CallFunc_SpawnVisualEntity_ReturnValue_1' has a wrong offset!");

}

