#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LibrarianArcaneBlastProjectilePoison

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LibrarianArcaneBlastProjectilePoison.BP_LibrarianArcaneBlastProjectilePoison_C
// 0x0058 (0x0B48 - 0x0AF0)
class ABP_LibrarianArcaneBlastProjectilePoison_C final : public AManProjectile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHitBox*                                AreaHitBox2;                                       // 0x0AF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                AreaHitBox1;                                       // 0x0B00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                AreaHitBox6;                                       // 0x0B08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                AreaHitBox5;                                       // 0x0B10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                AreaHitBox4;                                       // 0x0B18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                AreaHitBox3;                                       // 0x0B20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        AreaHitBoxRoot;                                    // 0x0B28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UManBoxComponent*                       ManProjectileEnviormentalCollider;                 // 0x0B30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0B38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_VoidBlast_Projectile_VisualEntity_C* VE;                                                // 0x0B40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_LibrarianArcaneBlastProjectilePoison(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LibrarianArcaneBlastProjectilePoison_C">();
	}
	static class ABP_LibrarianArcaneBlastProjectilePoison_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LibrarianArcaneBlastProjectilePoison_C>();
	}
};
static_assert(alignof(ABP_LibrarianArcaneBlastProjectilePoison_C) == 0x000008, "Wrong alignment on ABP_LibrarianArcaneBlastProjectilePoison_C");
static_assert(sizeof(ABP_LibrarianArcaneBlastProjectilePoison_C) == 0x000B48, "Wrong size on ABP_LibrarianArcaneBlastProjectilePoison_C");
static_assert(offsetof(ABP_LibrarianArcaneBlastProjectilePoison_C, UberGraphFrame) == 0x000AF0, "Member 'ABP_LibrarianArcaneBlastProjectilePoison_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianArcaneBlastProjectilePoison_C, AreaHitBox2) == 0x000AF8, "Member 'ABP_LibrarianArcaneBlastProjectilePoison_C::AreaHitBox2' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianArcaneBlastProjectilePoison_C, AreaHitBox1) == 0x000B00, "Member 'ABP_LibrarianArcaneBlastProjectilePoison_C::AreaHitBox1' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianArcaneBlastProjectilePoison_C, AreaHitBox6) == 0x000B08, "Member 'ABP_LibrarianArcaneBlastProjectilePoison_C::AreaHitBox6' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianArcaneBlastProjectilePoison_C, AreaHitBox5) == 0x000B10, "Member 'ABP_LibrarianArcaneBlastProjectilePoison_C::AreaHitBox5' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianArcaneBlastProjectilePoison_C, AreaHitBox4) == 0x000B18, "Member 'ABP_LibrarianArcaneBlastProjectilePoison_C::AreaHitBox4' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianArcaneBlastProjectilePoison_C, AreaHitBox3) == 0x000B20, "Member 'ABP_LibrarianArcaneBlastProjectilePoison_C::AreaHitBox3' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianArcaneBlastProjectilePoison_C, AreaHitBoxRoot) == 0x000B28, "Member 'ABP_LibrarianArcaneBlastProjectilePoison_C::AreaHitBoxRoot' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianArcaneBlastProjectilePoison_C, ManProjectileEnviormentalCollider) == 0x000B30, "Member 'ABP_LibrarianArcaneBlastProjectilePoison_C::ManProjectileEnviormentalCollider' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianArcaneBlastProjectilePoison_C, Ak) == 0x000B38, "Member 'ABP_LibrarianArcaneBlastProjectilePoison_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianArcaneBlastProjectilePoison_C, VE) == 0x000B40, "Member 'ABP_LibrarianArcaneBlastProjectilePoison_C::VE' has a wrong offset!");

}

