#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LootableWoodChest_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_LootableWoodChest_Anim.BP_LootableWoodChest_Anim_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct BP_LootableWoodChest_Anim_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BP_LootableWoodChest_Anim_C_AnimGraph) == 0x000008, "Wrong alignment on BP_LootableWoodChest_Anim_C_AnimGraph");
static_assert(sizeof(BP_LootableWoodChest_Anim_C_AnimGraph) == 0x000010, "Wrong size on BP_LootableWoodChest_Anim_C_AnimGraph");
static_assert(offsetof(BP_LootableWoodChest_Anim_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'BP_LootableWoodChest_Anim_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function BP_LootableWoodChest_Anim.BP_LootableWoodChest_Anim_C.OnAnimStartRequest
// 0x0008 (0x0008 - 0x0000)
struct BP_LootableWoodChest_Anim_C_OnAnimStartRequest final
{
public:
	class UAnimID*                                AnimID;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootableWoodChest_Anim_C_OnAnimStartRequest) == 0x000008, "Wrong alignment on BP_LootableWoodChest_Anim_C_OnAnimStartRequest");
static_assert(sizeof(BP_LootableWoodChest_Anim_C_OnAnimStartRequest) == 0x000008, "Wrong size on BP_LootableWoodChest_Anim_C_OnAnimStartRequest");
static_assert(offsetof(BP_LootableWoodChest_Anim_C_OnAnimStartRequest, AnimID) == 0x000000, "Member 'BP_LootableWoodChest_Anim_C_OnAnimStartRequest::AnimID' has a wrong offset!");

// Function BP_LootableWoodChest_Anim.BP_LootableWoodChest_Anim_C.ExecuteUbergraph_BP_LootableWoodChest_Anim
// 0x0018 (0x0018 - 0x0000)
struct BP_LootableWoodChest_Anim_C_ExecuteUbergraph_BP_LootableWoodChest_Anim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimID*                                K2Node_Event_AnimID;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LootableWoodChest_Anim_C_ExecuteUbergraph_BP_LootableWoodChest_Anim) == 0x000008, "Wrong alignment on BP_LootableWoodChest_Anim_C_ExecuteUbergraph_BP_LootableWoodChest_Anim");
static_assert(sizeof(BP_LootableWoodChest_Anim_C_ExecuteUbergraph_BP_LootableWoodChest_Anim) == 0x000018, "Wrong size on BP_LootableWoodChest_Anim_C_ExecuteUbergraph_BP_LootableWoodChest_Anim");
static_assert(offsetof(BP_LootableWoodChest_Anim_C_ExecuteUbergraph_BP_LootableWoodChest_Anim, EntryPoint) == 0x000000, "Member 'BP_LootableWoodChest_Anim_C_ExecuteUbergraph_BP_LootableWoodChest_Anim::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LootableWoodChest_Anim_C_ExecuteUbergraph_BP_LootableWoodChest_Anim, K2Node_Event_AnimID) == 0x000008, "Member 'BP_LootableWoodChest_Anim_C_ExecuteUbergraph_BP_LootableWoodChest_Anim::K2Node_Event_AnimID' has a wrong offset!");
static_assert(offsetof(BP_LootableWoodChest_Anim_C_ExecuteUbergraph_BP_LootableWoodChest_Anim, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'BP_LootableWoodChest_Anim_C_ExecuteUbergraph_BP_LootableWoodChest_Anim::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootableWoodChest_Anim_C_ExecuteUbergraph_BP_LootableWoodChest_Anim, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000011, "Member 'BP_LootableWoodChest_Anim_C_ExecuteUbergraph_BP_LootableWoodChest_Anim::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LootableWoodChest_Anim_C_ExecuteUbergraph_BP_LootableWoodChest_Anim, CallFunc_BooleanOR_ReturnValue) == 0x000012, "Member 'BP_LootableWoodChest_Anim_C_ExecuteUbergraph_BP_LootableWoodChest_Anim::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

