#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LibrarianBoss

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LibrarianBoss.BP_LibrarianBoss_C
// 0x0140 (0x1C00 - 0x1AC0)
class ABP_LibrarianBoss_C final : public AEnemyCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1AC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHurtCapsule*                           HurtCapsule_Static;                                // 0x1AC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_LibrarianBoss_LivingPoison;                     // 0x1AD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_LibrarianBoss_LivingFire;                       // 0x1AD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_LibrarianBoss_TeleportStart_Poison;             // 0x1AE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_LibrarianBoss_TeleportStart_Fire;               // 0x1AE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SEHaloVFXPos;                                      // 0x1AF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BookOfEnlightenmentSocket;                         // 0x1AF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                BeamHitbox;                                        // 0x1B00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_KipCastBook;                                    // 0x1B08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_KipCast;                                        // 0x1B10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMiniMapActorComponent*                 MiniMapActor;                                      // 0x1B18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x1B20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                KnowledgeHitBox6;                                  // 0x1B28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                KnowledgeHitBox5;                                  // 0x1B30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                KnowledgeHitBox4;                                  // 0x1B38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                KnowledgeHitBox3;                                  // 0x1B40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                KnowledgeHitBox2;                                  // 0x1B48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                KnowledgeHitBox1;                                  // 0x1B50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        KnowledgeIsPowerHitBoxRoot;                        // 0x1B58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                KnowledgeHitBox;                                   // 0x1B60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Arm_Right_Hand;                                    // 0x1B68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Arm_Left_Hand;                                     // 0x1B70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        GameplayShotPos;                                   // 0x1B78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TR_CurrentAction;                                  // 0x1B80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Arm_Right_Lower;                                   // 0x1B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Arm_Left_Lower;                                    // 0x1B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Arm_Right_Upper;                                   // 0x1B98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Arm_Left_Upper;                                    // 0x1BA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Head;                                              // 0x1BA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Leg_Left_Lower;                                    // 0x1BB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Leg_Right_Lower;                                   // 0x1BB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Leg_Left;                                          // 0x1BC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Leg_Right;                                         // 0x1BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Torso;                                             // 0x1BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_LibrarianKnowledgeIsPower_C*        KnowledgeIsPower;                                  // 0x1BD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TeleportColor;                                     // 0x1BE0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LastElementWasPoison;                              // 0x1BF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_LibrarianBoss(int32 EntryPoint);
	void OnVfxEvent(class FName VfxEventType);
	void BPPostBeginPlay();
	void GetDamageType(bool* Poison, bool* IsValid);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LibrarianBoss_C">();
	}
	static class ABP_LibrarianBoss_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LibrarianBoss_C>();
	}
};
static_assert(alignof(ABP_LibrarianBoss_C) == 0x000010, "Wrong alignment on ABP_LibrarianBoss_C");
static_assert(sizeof(ABP_LibrarianBoss_C) == 0x001C00, "Wrong size on ABP_LibrarianBoss_C");
static_assert(offsetof(ABP_LibrarianBoss_C, UberGraphFrame) == 0x001AC0, "Member 'ABP_LibrarianBoss_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, HurtCapsule_Static) == 0x001AC8, "Member 'ABP_LibrarianBoss_C::HurtCapsule_Static' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, NS_LibrarianBoss_LivingPoison) == 0x001AD0, "Member 'ABP_LibrarianBoss_C::NS_LibrarianBoss_LivingPoison' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, NS_LibrarianBoss_LivingFire) == 0x001AD8, "Member 'ABP_LibrarianBoss_C::NS_LibrarianBoss_LivingFire' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, NS_LibrarianBoss_TeleportStart_Poison) == 0x001AE0, "Member 'ABP_LibrarianBoss_C::NS_LibrarianBoss_TeleportStart_Poison' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, NS_LibrarianBoss_TeleportStart_Fire) == 0x001AE8, "Member 'ABP_LibrarianBoss_C::NS_LibrarianBoss_TeleportStart_Fire' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, SEHaloVFXPos) == 0x001AF0, "Member 'ABP_LibrarianBoss_C::SEHaloVFXPos' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, BookOfEnlightenmentSocket) == 0x001AF8, "Member 'ABP_LibrarianBoss_C::BookOfEnlightenmentSocket' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, BeamHitbox) == 0x001B00, "Member 'ABP_LibrarianBoss_C::BeamHitbox' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, NS_KipCastBook) == 0x001B08, "Member 'ABP_LibrarianBoss_C::NS_KipCastBook' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, NS_KipCast) == 0x001B10, "Member 'ABP_LibrarianBoss_C::NS_KipCast' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, MiniMapActor) == 0x001B18, "Member 'ABP_LibrarianBoss_C::MiniMapActor' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, TextRender) == 0x001B20, "Member 'ABP_LibrarianBoss_C::TextRender' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, KnowledgeHitBox6) == 0x001B28, "Member 'ABP_LibrarianBoss_C::KnowledgeHitBox6' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, KnowledgeHitBox5) == 0x001B30, "Member 'ABP_LibrarianBoss_C::KnowledgeHitBox5' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, KnowledgeHitBox4) == 0x001B38, "Member 'ABP_LibrarianBoss_C::KnowledgeHitBox4' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, KnowledgeHitBox3) == 0x001B40, "Member 'ABP_LibrarianBoss_C::KnowledgeHitBox3' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, KnowledgeHitBox2) == 0x001B48, "Member 'ABP_LibrarianBoss_C::KnowledgeHitBox2' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, KnowledgeHitBox1) == 0x001B50, "Member 'ABP_LibrarianBoss_C::KnowledgeHitBox1' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, KnowledgeIsPowerHitBoxRoot) == 0x001B58, "Member 'ABP_LibrarianBoss_C::KnowledgeIsPowerHitBoxRoot' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, KnowledgeHitBox) == 0x001B60, "Member 'ABP_LibrarianBoss_C::KnowledgeHitBox' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, Arm_Right_Hand) == 0x001B68, "Member 'ABP_LibrarianBoss_C::Arm_Right_Hand' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, Arm_Left_Hand) == 0x001B70, "Member 'ABP_LibrarianBoss_C::Arm_Left_Hand' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, GameplayShotPos) == 0x001B78, "Member 'ABP_LibrarianBoss_C::GameplayShotPos' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, TR_CurrentAction) == 0x001B80, "Member 'ABP_LibrarianBoss_C::TR_CurrentAction' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, Arm_Right_Lower) == 0x001B88, "Member 'ABP_LibrarianBoss_C::Arm_Right_Lower' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, Arm_Left_Lower) == 0x001B90, "Member 'ABP_LibrarianBoss_C::Arm_Left_Lower' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, Arm_Right_Upper) == 0x001B98, "Member 'ABP_LibrarianBoss_C::Arm_Right_Upper' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, Arm_Left_Upper) == 0x001BA0, "Member 'ABP_LibrarianBoss_C::Arm_Left_Upper' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, Head) == 0x001BA8, "Member 'ABP_LibrarianBoss_C::Head' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, Leg_Left_Lower) == 0x001BB0, "Member 'ABP_LibrarianBoss_C::Leg_Left_Lower' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, Leg_Right_Lower) == 0x001BB8, "Member 'ABP_LibrarianBoss_C::Leg_Right_Lower' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, Leg_Left) == 0x001BC0, "Member 'ABP_LibrarianBoss_C::Leg_Left' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, Leg_Right) == 0x001BC8, "Member 'ABP_LibrarianBoss_C::Leg_Right' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, Torso) == 0x001BD0, "Member 'ABP_LibrarianBoss_C::Torso' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, KnowledgeIsPower) == 0x001BD8, "Member 'ABP_LibrarianBoss_C::KnowledgeIsPower' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, TeleportColor) == 0x001BE0, "Member 'ABP_LibrarianBoss_C::TeleportColor' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianBoss_C, LastElementWasPoison) == 0x001BF0, "Member 'ABP_LibrarianBoss_C::LastElementWasPoison' has a wrong offset!");

}

