#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LittleGirl

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LittleGirl.BP_LittleGirl_C
// 0x0038 (0x0810 - 0x07D8)
class ABP_LittleGirl_C final : public AActorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           AkComponent;                                       // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SpeechBubbleComponent_C*            BP_SpeechBubbleComponent;                          // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_LittleGirl;                                     // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTriggerBoxComponent*                   TriggerBox;                                        // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ActiveAudio;                                       // 0x0808(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_LittleGirl(int32 EntryPoint);
	void OnIdleBridgeAnimStart();
	void OnIdleAnimStart();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LittleGirl_C">();
	}
	static class ABP_LittleGirl_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LittleGirl_C>();
	}
};
static_assert(alignof(ABP_LittleGirl_C) == 0x000008, "Wrong alignment on ABP_LittleGirl_C");
static_assert(sizeof(ABP_LittleGirl_C) == 0x000810, "Wrong size on ABP_LittleGirl_C");
static_assert(offsetof(ABP_LittleGirl_C, UberGraphFrame) == 0x0007D8, "Member 'ABP_LittleGirl_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LittleGirl_C, AkComponent) == 0x0007E0, "Member 'ABP_LittleGirl_C::AkComponent' has a wrong offset!");
static_assert(offsetof(ABP_LittleGirl_C, BP_SpeechBubbleComponent) == 0x0007E8, "Member 'ABP_LittleGirl_C::BP_SpeechBubbleComponent' has a wrong offset!");
static_assert(offsetof(ABP_LittleGirl_C, SK_LittleGirl) == 0x0007F0, "Member 'ABP_LittleGirl_C::SK_LittleGirl' has a wrong offset!");
static_assert(offsetof(ABP_LittleGirl_C, TriggerBox) == 0x0007F8, "Member 'ABP_LittleGirl_C::TriggerBox' has a wrong offset!");
static_assert(offsetof(ABP_LittleGirl_C, DefaultSceneRoot) == 0x000800, "Member 'ABP_LittleGirl_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_LittleGirl_C, ActiveAudio) == 0x000808, "Member 'ABP_LittleGirl_C::ActiveAudio' has a wrong offset!");

}

