#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LibrarianTeleportAOEActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LibrarianTeleportAOEActor.BP_LibrarianTeleportAOEActor_C
// 0x0018 (0x07F0 - 0x07D8)
class ABP_LibrarianTeleportAOEActor_C final : public AActorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHitBox*                                HitBox;                                            // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_LibrarianTeleportAOEActor(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LibrarianTeleportAOEActor_C">();
	}
	static class ABP_LibrarianTeleportAOEActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LibrarianTeleportAOEActor_C>();
	}
};
static_assert(alignof(ABP_LibrarianTeleportAOEActor_C) == 0x000008, "Wrong alignment on ABP_LibrarianTeleportAOEActor_C");
static_assert(sizeof(ABP_LibrarianTeleportAOEActor_C) == 0x0007F0, "Wrong size on ABP_LibrarianTeleportAOEActor_C");
static_assert(offsetof(ABP_LibrarianTeleportAOEActor_C, UberGraphFrame) == 0x0007D8, "Member 'ABP_LibrarianTeleportAOEActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianTeleportAOEActor_C, HitBox) == 0x0007E0, "Member 'ABP_LibrarianTeleportAOEActor_C::HitBox' has a wrong offset!");
static_assert(offsetof(ABP_LibrarianTeleportAOEActor_C, DefaultSceneRoot) == 0x0007E8, "Member 'ABP_LibrarianTeleportAOEActor_C::DefaultSceneRoot' has a wrong offset!");

}

