#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LongPressIndicator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_LongPressIndicator.BP_LongPressIndicator_C
// 0x0018 (0x0280 - 0x0268)
class UBP_LongPressIndicator_C final : public ULongPressIndicatorUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Indicator;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Ratio;                                             // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_LongPressIndicator(int32 EntryPoint);
	void OnSetIndicatorRatio(float InIndicatorRatio);
	void PreConstruct(bool IsDesignTime);
	void SetupIndicator(float StartPoint, float CompleteRange);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LongPressIndicator_C">();
	}
	static class UBP_LongPressIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_LongPressIndicator_C>();
	}
};
static_assert(alignof(UBP_LongPressIndicator_C) == 0x000008, "Wrong alignment on UBP_LongPressIndicator_C");
static_assert(sizeof(UBP_LongPressIndicator_C) == 0x000280, "Wrong size on UBP_LongPressIndicator_C");
static_assert(offsetof(UBP_LongPressIndicator_C, UberGraphFrame) == 0x000268, "Member 'UBP_LongPressIndicator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_LongPressIndicator_C, Indicator) == 0x000270, "Member 'UBP_LongPressIndicator_C::Indicator' has a wrong offset!");
static_assert(offsetof(UBP_LongPressIndicator_C, Ratio) == 0x000278, "Member 'UBP_LongPressIndicator_C::Ratio' has a wrong offset!");

}

