#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LootActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LootActor.BP_LootActor_C
// 0x0048 (0x08E0 - 0x0898)
class ABP_LootActor_C : public AManLootActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0898(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           AkComponent;                                       // 0x08A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_InteractPrompWidgetComponent_C*     BP_InteractPrompWidgetComponent;                   // 0x08A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   EditorSphere;                                      // 0x08B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              LandedDelegate;                                    // 0x08B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          AlreadyLanded_;                                    // 0x08C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C9[0x7];                                      // 0x08C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class ABP_LootActor_C* LootActor)> PickedUpDelegate;                                  // 0x08D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_LootActor(int32 EntryPoint);
	void OnLevelLoad();
	void Landed();
	void PostLootPickup();
	void InitializeLootActorVFX();
	void ChooseLootActorVFX();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LootActor_C">();
	}
	static class ABP_LootActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LootActor_C>();
	}
};
static_assert(alignof(ABP_LootActor_C) == 0x000008, "Wrong alignment on ABP_LootActor_C");
static_assert(sizeof(ABP_LootActor_C) == 0x0008E0, "Wrong size on ABP_LootActor_C");
static_assert(offsetof(ABP_LootActor_C, UberGraphFrame) == 0x000898, "Member 'ABP_LootActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LootActor_C, AkComponent) == 0x0008A0, "Member 'ABP_LootActor_C::AkComponent' has a wrong offset!");
static_assert(offsetof(ABP_LootActor_C, BP_InteractPrompWidgetComponent) == 0x0008A8, "Member 'ABP_LootActor_C::BP_InteractPrompWidgetComponent' has a wrong offset!");
static_assert(offsetof(ABP_LootActor_C, EditorSphere) == 0x0008B0, "Member 'ABP_LootActor_C::EditorSphere' has a wrong offset!");
static_assert(offsetof(ABP_LootActor_C, LandedDelegate) == 0x0008B8, "Member 'ABP_LootActor_C::LandedDelegate' has a wrong offset!");
static_assert(offsetof(ABP_LootActor_C, AlreadyLanded_) == 0x0008C8, "Member 'ABP_LootActor_C::AlreadyLanded_' has a wrong offset!");
static_assert(offsetof(ABP_LootActor_C, PickedUpDelegate) == 0x0008D0, "Member 'ABP_LootActor_C::PickedUpDelegate' has a wrong offset!");

}

