#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LibrarianFastLearnerBook_Anim

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_LibrarianFastLearnerBook_Anim.BP_LibrarianFastLearnerBook_Anim_C
// 0x05F0 (0x0C90 - 0x06A0)
class UBP_LibrarianFastLearnerBook_Anim_C final : public UAnimInstanceBase
{
public:
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0030)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x06D8(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0780(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0800(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0828(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x08A8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x08D8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0958(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0988(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0A38(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0AB8(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0B38(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0C40(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0C60(0x0020)()
	float                                         Rotation_Z__Yaw__0;                                // 0x0C80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_LibrarianFastLearnerBook_Anim(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_LibrarianFastLearnerBook_Anim_AnimGraphNode_ModifyBone_3AE9FAF3418BD0F330AC2C850703D0D1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_LibrarianFastLearnerBook_Anim_AnimGraphNode_TransitionResult_516FFEE3479B3045C266D1AA8F76D90C();
	void OnFacingChanged(bool bForced);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LibrarianFastLearnerBook_Anim_C">();
	}
	static class UBP_LibrarianFastLearnerBook_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_LibrarianFastLearnerBook_Anim_C>();
	}
};
static_assert(alignof(UBP_LibrarianFastLearnerBook_Anim_C) == 0x000010, "Wrong alignment on UBP_LibrarianFastLearnerBook_Anim_C");
static_assert(sizeof(UBP_LibrarianFastLearnerBook_Anim_C) == 0x000C90, "Wrong size on UBP_LibrarianFastLearnerBook_Anim_C");
static_assert(offsetof(UBP_LibrarianFastLearnerBook_Anim_C, UberGraphFrame) == 0x0006A0, "Member 'UBP_LibrarianFastLearnerBook_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_LibrarianFastLearnerBook_Anim_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UBP_LibrarianFastLearnerBook_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_LibrarianFastLearnerBook_Anim_C, AnimGraphNode_BlendListByInt) == 0x0006D8, "Member 'UBP_LibrarianFastLearnerBook_Anim_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UBP_LibrarianFastLearnerBook_Anim_C, AnimGraphNode_SequencePlayer_4) == 0x000780, "Member 'UBP_LibrarianFastLearnerBook_Anim_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UBP_LibrarianFastLearnerBook_Anim_C, AnimGraphNode_TransitionResult) == 0x000800, "Member 'UBP_LibrarianFastLearnerBook_Anim_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UBP_LibrarianFastLearnerBook_Anim_C, AnimGraphNode_SequencePlayer_3) == 0x000828, "Member 'UBP_LibrarianFastLearnerBook_Anim_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UBP_LibrarianFastLearnerBook_Anim_C, AnimGraphNode_StateResult_1) == 0x0008A8, "Member 'UBP_LibrarianFastLearnerBook_Anim_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UBP_LibrarianFastLearnerBook_Anim_C, AnimGraphNode_SequencePlayer_2) == 0x0008D8, "Member 'UBP_LibrarianFastLearnerBook_Anim_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_LibrarianFastLearnerBook_Anim_C, AnimGraphNode_StateResult) == 0x000958, "Member 'UBP_LibrarianFastLearnerBook_Anim_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UBP_LibrarianFastLearnerBook_Anim_C, AnimGraphNode_StateMachine) == 0x000988, "Member 'UBP_LibrarianFastLearnerBook_Anim_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UBP_LibrarianFastLearnerBook_Anim_C, AnimGraphNode_SequencePlayer_1) == 0x000A38, "Member 'UBP_LibrarianFastLearnerBook_Anim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_LibrarianFastLearnerBook_Anim_C, AnimGraphNode_SequencePlayer) == 0x000AB8, "Member 'UBP_LibrarianFastLearnerBook_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBP_LibrarianFastLearnerBook_Anim_C, AnimGraphNode_ModifyBone) == 0x000B38, "Member 'UBP_LibrarianFastLearnerBook_Anim_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UBP_LibrarianFastLearnerBook_Anim_C, AnimGraphNode_LocalToComponentSpace) == 0x000C40, "Member 'UBP_LibrarianFastLearnerBook_Anim_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UBP_LibrarianFastLearnerBook_Anim_C, AnimGraphNode_ComponentToLocalSpace) == 0x000C60, "Member 'UBP_LibrarianFastLearnerBook_Anim_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UBP_LibrarianFastLearnerBook_Anim_C, Rotation_Z__Yaw__0) == 0x000C80, "Member 'UBP_LibrarianFastLearnerBook_Anim_C::Rotation_Z__Yaw__0' has a wrong offset!");

}

