#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LibrarianArcaneBlastLingeringAOEActor

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_LibrarianArcaneBlastLingeringAOEActor.BP_LibrarianArcaneBlastLingeringAOEActor_C.ExecuteUbergraph_BP_LibrarianArcaneBlastLingeringAOEActor
// 0x0040 (0x0040 - 0x0000)
struct BP_LibrarianArcaneBlastLingeringAOEActor_C_ExecuteUbergraph_BP_LibrarianArcaneBlastLingeringAOEActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LibrarianArcaneBlastProjectilePoison_C* K2Node_DynamicCast_AsBP_Librarian_Arcane_Blast_Projectile_Poison; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue_1;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue_1;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LibrarianArcaneBlastLingeringAOEActor_C_ExecuteUbergraph_BP_LibrarianArcaneBlastLingeringAOEActor) == 0x000008, "Wrong alignment on BP_LibrarianArcaneBlastLingeringAOEActor_C_ExecuteUbergraph_BP_LibrarianArcaneBlastLingeringAOEActor");
static_assert(sizeof(BP_LibrarianArcaneBlastLingeringAOEActor_C_ExecuteUbergraph_BP_LibrarianArcaneBlastLingeringAOEActor) == 0x000040, "Wrong size on BP_LibrarianArcaneBlastLingeringAOEActor_C_ExecuteUbergraph_BP_LibrarianArcaneBlastLingeringAOEActor");
static_assert(offsetof(BP_LibrarianArcaneBlastLingeringAOEActor_C_ExecuteUbergraph_BP_LibrarianArcaneBlastLingeringAOEActor, EntryPoint) == 0x000000, "Member 'BP_LibrarianArcaneBlastLingeringAOEActor_C_ExecuteUbergraph_BP_LibrarianArcaneBlastLingeringAOEActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LibrarianArcaneBlastLingeringAOEActor_C_ExecuteUbergraph_BP_LibrarianArcaneBlastLingeringAOEActor, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_LibrarianArcaneBlastLingeringAOEActor_C_ExecuteUbergraph_BP_LibrarianArcaneBlastLingeringAOEActor::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianArcaneBlastLingeringAOEActor_C_ExecuteUbergraph_BP_LibrarianArcaneBlastLingeringAOEActor, CallFunc_GetManGameMode_ReturnValue) == 0x000010, "Member 'BP_LibrarianArcaneBlastLingeringAOEActor_C_ExecuteUbergraph_BP_LibrarianArcaneBlastLingeringAOEActor::CallFunc_GetManGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianArcaneBlastLingeringAOEActor_C_ExecuteUbergraph_BP_LibrarianArcaneBlastLingeringAOEActor, K2Node_DynamicCast_AsBP_Librarian_Arcane_Blast_Projectile_Poison) == 0x000018, "Member 'BP_LibrarianArcaneBlastLingeringAOEActor_C_ExecuteUbergraph_BP_LibrarianArcaneBlastLingeringAOEActor::K2Node_DynamicCast_AsBP_Librarian_Arcane_Blast_Projectile_Poison' has a wrong offset!");
static_assert(offsetof(BP_LibrarianArcaneBlastLingeringAOEActor_C_ExecuteUbergraph_BP_LibrarianArcaneBlastLingeringAOEActor, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_LibrarianArcaneBlastLingeringAOEActor_C_ExecuteUbergraph_BP_LibrarianArcaneBlastLingeringAOEActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LibrarianArcaneBlastLingeringAOEActor_C_ExecuteUbergraph_BP_LibrarianArcaneBlastLingeringAOEActor, CallFunc_GetManGameMode_ReturnValue_1) == 0x000028, "Member 'BP_LibrarianArcaneBlastLingeringAOEActor_C_ExecuteUbergraph_BP_LibrarianArcaneBlastLingeringAOEActor::CallFunc_GetManGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LibrarianArcaneBlastLingeringAOEActor_C_ExecuteUbergraph_BP_LibrarianArcaneBlastLingeringAOEActor, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000030, "Member 'BP_LibrarianArcaneBlastLingeringAOEActor_C_ExecuteUbergraph_BP_LibrarianArcaneBlastLingeringAOEActor::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LibrarianArcaneBlastLingeringAOEActor_C_ExecuteUbergraph_BP_LibrarianArcaneBlastLingeringAOEActor, CallFunc_SpawnVisualEntity_ReturnValue_1) == 0x000038, "Member 'BP_LibrarianArcaneBlastLingeringAOEActor_C_ExecuteUbergraph_BP_LibrarianArcaneBlastLingeringAOEActor::CallFunc_SpawnVisualEntity_ReturnValue_1' has a wrong offset!");

}

