#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MaleTownsfolkBarrel_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_MaleTownsfolkBarrel_Anim.BP_MaleTownsfolkBarrel_Anim_C
// 0x0400 (0x0AF0 - 0x06F0)
class UBP_MaleTownsfolkBarrel_Anim_C final : public UNpcAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06F8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0728(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0750(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x07D0(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0800(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x08E8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0918(0x00B0)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x09C8(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0A70(0x0080)()

public:
	void ExecuteUbergraph_BP_MaleTownsfolkBarrel_Anim(int32 EntryPoint);
	void AnimNotify_OnIdleBarrelAngryEnd();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_MaleTownsfolkBarrel_Anim_AnimGraphNode_TransitionResult_7049D6404330C1E07206FFAF4B98B02E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_MaleTownsfolkBarrel_Anim_AnimGraphNode_BlendSpacePlayer_B74AC429403B0DFDF99B018CC83C8629();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MaleTownsfolkBarrel_Anim_C">();
	}
	static class UBP_MaleTownsfolkBarrel_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MaleTownsfolkBarrel_Anim_C>();
	}
};
static_assert(alignof(UBP_MaleTownsfolkBarrel_Anim_C) == 0x000010, "Wrong alignment on UBP_MaleTownsfolkBarrel_Anim_C");
static_assert(sizeof(UBP_MaleTownsfolkBarrel_Anim_C) == 0x000AF0, "Wrong size on UBP_MaleTownsfolkBarrel_Anim_C");
static_assert(offsetof(UBP_MaleTownsfolkBarrel_Anim_C, UberGraphFrame) == 0x0006F0, "Member 'UBP_MaleTownsfolkBarrel_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_MaleTownsfolkBarrel_Anim_C, AnimGraphNode_Root) == 0x0006F8, "Member 'UBP_MaleTownsfolkBarrel_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_MaleTownsfolkBarrel_Anim_C, AnimGraphNode_TransitionResult) == 0x000728, "Member 'UBP_MaleTownsfolkBarrel_Anim_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UBP_MaleTownsfolkBarrel_Anim_C, AnimGraphNode_SequencePlayer_1) == 0x000750, "Member 'UBP_MaleTownsfolkBarrel_Anim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_MaleTownsfolkBarrel_Anim_C, AnimGraphNode_StateResult_1) == 0x0007D0, "Member 'UBP_MaleTownsfolkBarrel_Anim_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UBP_MaleTownsfolkBarrel_Anim_C, AnimGraphNode_BlendSpacePlayer) == 0x000800, "Member 'UBP_MaleTownsfolkBarrel_Anim_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UBP_MaleTownsfolkBarrel_Anim_C, AnimGraphNode_StateResult) == 0x0008E8, "Member 'UBP_MaleTownsfolkBarrel_Anim_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UBP_MaleTownsfolkBarrel_Anim_C, AnimGraphNode_StateMachine) == 0x000918, "Member 'UBP_MaleTownsfolkBarrel_Anim_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UBP_MaleTownsfolkBarrel_Anim_C, AnimGraphNode_BlendListByInt) == 0x0009C8, "Member 'UBP_MaleTownsfolkBarrel_Anim_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UBP_MaleTownsfolkBarrel_Anim_C, AnimGraphNode_SequencePlayer) == 0x000A70, "Member 'UBP_MaleTownsfolkBarrel_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");

}

