#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MainMenu_Background_SmallScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_MainMenu_Background-SmallScreen.BP_MainMenu_Background-SmallScreen_C.OnShow
// 0x0004 (0x0004 - 0x0000)
struct BP_MainMenu_Background_SmallScreen_C_OnShow final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainMenu_Background_SmallScreen_C_OnShow) == 0x000004, "Wrong alignment on BP_MainMenu_Background_SmallScreen_C_OnShow");
static_assert(sizeof(BP_MainMenu_Background_SmallScreen_C_OnShow) == 0x000004, "Wrong size on BP_MainMenu_Background_SmallScreen_C_OnShow");
static_assert(offsetof(BP_MainMenu_Background_SmallScreen_C_OnShow, AnimDuration) == 0x000000, "Member 'BP_MainMenu_Background_SmallScreen_C_OnShow::AnimDuration' has a wrong offset!");

// Function BP_MainMenu_Background-SmallScreen.BP_MainMenu_Background-SmallScreen_C.ExecuteUbergraph_BP_MainMenu_Background-SmallScreen
// 0x0058 (0x0058 - 0x0000)
struct BP_MainMenu_Background_SmallScreen_C_ExecuteUbergraph_BP_MainMenu_Background_SmallScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetVersion_ReturnValue;                   // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
	float                                         K2Node_Event_AnimDuration_1;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue_1;       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainMenu_Background_SmallScreen_C_ExecuteUbergraph_BP_MainMenu_Background_SmallScreen) == 0x000008, "Wrong alignment on BP_MainMenu_Background_SmallScreen_C_ExecuteUbergraph_BP_MainMenu_Background_SmallScreen");
static_assert(sizeof(BP_MainMenu_Background_SmallScreen_C_ExecuteUbergraph_BP_MainMenu_Background_SmallScreen) == 0x000058, "Wrong size on BP_MainMenu_Background_SmallScreen_C_ExecuteUbergraph_BP_MainMenu_Background_SmallScreen");
static_assert(offsetof(BP_MainMenu_Background_SmallScreen_C_ExecuteUbergraph_BP_MainMenu_Background_SmallScreen, EntryPoint) == 0x000000, "Member 'BP_MainMenu_Background_SmallScreen_C_ExecuteUbergraph_BP_MainMenu_Background_SmallScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Background_SmallScreen_C_ExecuteUbergraph_BP_MainMenu_Background_SmallScreen, CallFunc_GetVersion_ReturnValue) == 0x000008, "Member 'BP_MainMenu_Background_SmallScreen_C_ExecuteUbergraph_BP_MainMenu_Background_SmallScreen::CallFunc_GetVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Background_SmallScreen_C_ExecuteUbergraph_BP_MainMenu_Background_SmallScreen, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'BP_MainMenu_Background_SmallScreen_C_ExecuteUbergraph_BP_MainMenu_Background_SmallScreen::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Background_SmallScreen_C_ExecuteUbergraph_BP_MainMenu_Background_SmallScreen, K2Node_Event_AnimDuration_1) == 0x000030, "Member 'BP_MainMenu_Background_SmallScreen_C_ExecuteUbergraph_BP_MainMenu_Background_SmallScreen::K2Node_Event_AnimDuration_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Background_SmallScreen_C_ExecuteUbergraph_BP_MainMenu_Background_SmallScreen, CallFunc_GetAnimPlaybackSpeed_ReturnValue) == 0x000034, "Member 'BP_MainMenu_Background_SmallScreen_C_ExecuteUbergraph_BP_MainMenu_Background_SmallScreen::CallFunc_GetAnimPlaybackSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Background_SmallScreen_C_ExecuteUbergraph_BP_MainMenu_Background_SmallScreen, K2Node_Event_AnimDuration) == 0x000038, "Member 'BP_MainMenu_Background_SmallScreen_C_ExecuteUbergraph_BP_MainMenu_Background_SmallScreen::K2Node_Event_AnimDuration' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Background_SmallScreen_C_ExecuteUbergraph_BP_MainMenu_Background_SmallScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'BP_MainMenu_Background_SmallScreen_C_ExecuteUbergraph_BP_MainMenu_Background_SmallScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Background_SmallScreen_C_ExecuteUbergraph_BP_MainMenu_Background_SmallScreen, CallFunc_GetAnimPlaybackSpeed_ReturnValue_1) == 0x000048, "Member 'BP_MainMenu_Background_SmallScreen_C_ExecuteUbergraph_BP_MainMenu_Background_SmallScreen::CallFunc_GetAnimPlaybackSpeed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Background_SmallScreen_C_ExecuteUbergraph_BP_MainMenu_Background_SmallScreen, CallFunc_PlayAnimation_ReturnValue_1) == 0x000050, "Member 'BP_MainMenu_Background_SmallScreen_C_ExecuteUbergraph_BP_MainMenu_Background_SmallScreen::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function BP_MainMenu_Background-SmallScreen.BP_MainMenu_Background-SmallScreen_C.OnHide
// 0x0004 (0x0004 - 0x0000)
struct BP_MainMenu_Background_SmallScreen_C_OnHide final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainMenu_Background_SmallScreen_C_OnHide) == 0x000004, "Wrong alignment on BP_MainMenu_Background_SmallScreen_C_OnHide");
static_assert(sizeof(BP_MainMenu_Background_SmallScreen_C_OnHide) == 0x000004, "Wrong size on BP_MainMenu_Background_SmallScreen_C_OnHide");
static_assert(offsetof(BP_MainMenu_Background_SmallScreen_C_OnHide, AnimDuration) == 0x000000, "Member 'BP_MainMenu_Background_SmallScreen_C_OnHide::AnimDuration' has a wrong offset!");

}

