#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapWindow_Marker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_MapWindow_Marker.BP_MapWindow_Marker_C
// 0x0028 (0x02A0 - 0x0278)
class UBP_MapWindow_Marker_C final : public UMapWindowMarkerUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                ButtonFrame;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectionFrame;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BP_MapWindow_Marker(int32 EntryPoint);
	void OnSetBtnVisiblity(ESlateVisibility SlateVisibility);
	void BndEvt__BP_MapWindow_Marker_ButtonFrame_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void OnSetSelected(bool bInSelected);
	void PreConstruct(bool IsDesignTime);
	void SetSelected(bool InIsFocused);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MapWindow_Marker_C">();
	}
	static class UBP_MapWindow_Marker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MapWindow_Marker_C>();
	}
};
static_assert(alignof(UBP_MapWindow_Marker_C) == 0x000008, "Wrong alignment on UBP_MapWindow_Marker_C");
static_assert(sizeof(UBP_MapWindow_Marker_C) == 0x0002A0, "Wrong size on UBP_MapWindow_Marker_C");
static_assert(offsetof(UBP_MapWindow_Marker_C, UberGraphFrame) == 0x000278, "Member 'UBP_MapWindow_Marker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_MapWindow_Marker_C, ButtonFrame) == 0x000280, "Member 'UBP_MapWindow_Marker_C::ButtonFrame' has a wrong offset!");
static_assert(offsetof(UBP_MapWindow_Marker_C, Icon) == 0x000288, "Member 'UBP_MapWindow_Marker_C::Icon' has a wrong offset!");
static_assert(offsetof(UBP_MapWindow_Marker_C, SelectionFrame) == 0x000290, "Member 'UBP_MapWindow_Marker_C::SelectionFrame' has a wrong offset!");
static_assert(offsetof(UBP_MapWindow_Marker_C, IsSelected) == 0x000298, "Member 'UBP_MapWindow_Marker_C::IsSelected' has a wrong offset!");

}

