#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MeshSampling_VisualEntity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_MeshSampling_VisualEntity.BP_MeshSampling_VisualEntity_C.ExecuteUbergraph_BP_MeshSampling_VisualEntity
// 0x0180 (0x0180 - 0x0000)
struct BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base_1;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_AddComponentByClass_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         CallFunc_GetSlotMeshComponents_ReturnValue;        // 0x0098(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_GetSlotMeshComponents_ReturnValue_1;      // 0x00B8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0xB];                                       // 0x00D5(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x00E0(0x0030)(IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_AddComponentByClass_ReturnValue_1;        // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item_1;                         // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0138(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item_2;                         // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumSlotMeshComponents_ReturnValue;     // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSlotMeshComponent_ReturnValue;         // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity) == 0x000010, "Wrong alignment on BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity");
static_assert(sizeof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity) == 0x000180, "Wrong size on BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_GetAttachParentActor_ReturnValue) == 0x000008, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, K2Node_DynamicCast_AsCharacter_Base) == 0x000018, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, K2Node_DynamicCast_AsCharacter_Base_1) == 0x000028, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::K2Node_DynamicCast_AsCharacter_Base_1' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_GetPlayerPawn_ReturnValue) == 0x000040, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000080, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_AddComponentByClass_ReturnValue) == 0x000088, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_Array_Add_ReturnValue) == 0x000090, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_Array_Length_ReturnValue) == 0x000094, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_GetSlotMeshComponents_ReturnValue) == 0x000098, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_GetSlotMeshComponents_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_Array_Length_ReturnValue_1) == 0x0000A8, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_Array_Length_ReturnValue_2) == 0x0000AC, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000B0, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_GetSlotMeshComponents_ReturnValue_1) == 0x0000B8, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_GetSlotMeshComponents_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_Array_Length_ReturnValue_3) == 0x0000C8, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000CC, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_Array_Length_ReturnValue_4) == 0x0000D0, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_Less_IntInt_ReturnValue) == 0x0000D4, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_MakeTransform_ReturnValue_1) == 0x0000E0, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_AddComponentByClass_ReturnValue_1) == 0x000110, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_AddComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_Array_Add_ReturnValue_1) == 0x000118, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_Array_Length_ReturnValue_5) == 0x00011C, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, Temp_int_Array_Index_Variable_1) == 0x000120, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_Array_Get_Item) == 0x000128, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_Array_Get_Item_1) == 0x000130, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_K2_SetTimer_ReturnValue) == 0x000138, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_Array_Get_Item_2) == 0x000140, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_Array_Length_ReturnValue_6) == 0x000148, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_Less_IntInt_ReturnValue_1) == 0x00014C, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, Temp_int_Variable) == 0x000150, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000154, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_Add_IntInt_ReturnValue_1) == 0x000158, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_GetNumSlotMeshComponents_ReturnValue) == 0x00015C, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_GetNumSlotMeshComponents_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_Less_IntInt_ReturnValue_2) == 0x000160, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_GetSlotMeshComponent_ReturnValue) == 0x000168, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_GetSlotMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, Temp_int_Loop_Counter_Variable_1) == 0x000170, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_Less_IntInt_ReturnValue_3) == 0x000174, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity, CallFunc_Add_IntInt_ReturnValue_2) == 0x000178, "Member 'BP_MeshSampling_VisualEntity_C_ExecuteUbergraph_BP_MeshSampling_VisualEntity::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function BP_MeshSampling_VisualEntity.BP_MeshSampling_VisualEntity_C.KillFinished
// 0x0020 (0x0020 - 0x0000)
struct BP_MeshSampling_VisualEntity_C_KillFinished final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MeshSampling_VisualEntity_C_KillFinished) == 0x000008, "Wrong alignment on BP_MeshSampling_VisualEntity_C_KillFinished");
static_assert(sizeof(BP_MeshSampling_VisualEntity_C_KillFinished) == 0x000020, "Wrong size on BP_MeshSampling_VisualEntity_C_KillFinished");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_KillFinished, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_MeshSampling_VisualEntity_C_KillFinished::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_KillFinished, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_MeshSampling_VisualEntity_C_KillFinished::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_KillFinished, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_MeshSampling_VisualEntity_C_KillFinished::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_KillFinished, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BP_MeshSampling_VisualEntity_C_KillFinished::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_KillFinished, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_MeshSampling_VisualEntity_C_KillFinished::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_KillFinished, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'BP_MeshSampling_VisualEntity_C_KillFinished::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_MeshSampling_VisualEntity.BP_MeshSampling_VisualEntity_C.GetOwnerAsCharacterBase
// 0x0008 (0x0008 - 0x0000)
struct BP_MeshSampling_VisualEntity_C_GetOwnerAsCharacterBase final
{
public:
	class ACharacterBase*                         MeshSamplingTarget_0;                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeshSampling_VisualEntity_C_GetOwnerAsCharacterBase) == 0x000008, "Wrong alignment on BP_MeshSampling_VisualEntity_C_GetOwnerAsCharacterBase");
static_assert(sizeof(BP_MeshSampling_VisualEntity_C_GetOwnerAsCharacterBase) == 0x000008, "Wrong size on BP_MeshSampling_VisualEntity_C_GetOwnerAsCharacterBase");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_GetOwnerAsCharacterBase, MeshSamplingTarget_0) == 0x000000, "Member 'BP_MeshSampling_VisualEntity_C_GetOwnerAsCharacterBase::MeshSamplingTarget_0' has a wrong offset!");

// Function BP_MeshSampling_VisualEntity.BP_MeshSampling_VisualEntity_C.ActivateComponents
// 0x0020 (0x0020 - 0x0000)
struct BP_MeshSampling_VisualEntity_C_ActivateComponents final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MeshSampling_VisualEntity_C_ActivateComponents) == 0x000008, "Wrong alignment on BP_MeshSampling_VisualEntity_C_ActivateComponents");
static_assert(sizeof(BP_MeshSampling_VisualEntity_C_ActivateComponents) == 0x000020, "Wrong size on BP_MeshSampling_VisualEntity_C_ActivateComponents");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ActivateComponents, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_MeshSampling_VisualEntity_C_ActivateComponents::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ActivateComponents, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_MeshSampling_VisualEntity_C_ActivateComponents::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ActivateComponents, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_MeshSampling_VisualEntity_C_ActivateComponents::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ActivateComponents, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BP_MeshSampling_VisualEntity_C_ActivateComponents::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ActivateComponents, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_MeshSampling_VisualEntity_C_ActivateComponents::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_ActivateComponents, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'BP_MeshSampling_VisualEntity_C_ActivateComponents::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_MeshSampling_VisualEntity.BP_MeshSampling_VisualEntity_C.GetMeshSamplingNiagaraComponents
// 0x0010 (0x0010 - 0x0000)
struct BP_MeshSampling_VisualEntity_C_GetMeshSamplingNiagaraComponents final
{
public:
	TArray<class UNiagaraComponent*>              NiagaraComponents_0;                               // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
};
static_assert(alignof(BP_MeshSampling_VisualEntity_C_GetMeshSamplingNiagaraComponents) == 0x000008, "Wrong alignment on BP_MeshSampling_VisualEntity_C_GetMeshSamplingNiagaraComponents");
static_assert(sizeof(BP_MeshSampling_VisualEntity_C_GetMeshSamplingNiagaraComponents) == 0x000010, "Wrong size on BP_MeshSampling_VisualEntity_C_GetMeshSamplingNiagaraComponents");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_GetMeshSamplingNiagaraComponents, NiagaraComponents_0) == 0x000000, "Member 'BP_MeshSampling_VisualEntity_C_GetMeshSamplingNiagaraComponents::NiagaraComponents_0' has a wrong offset!");

// Function BP_MeshSampling_VisualEntity.BP_MeshSampling_VisualEntity_C.SetNiagaraParams
// 0x0010 (0x0010 - 0x0000)
struct BP_MeshSampling_VisualEntity_C_SetNiagaraParams final
{
public:
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeshSampling_VisualEntity_C_SetNiagaraParams) == 0x000008, "Wrong alignment on BP_MeshSampling_VisualEntity_C_SetNiagaraParams");
static_assert(sizeof(BP_MeshSampling_VisualEntity_C_SetNiagaraParams) == 0x000010, "Wrong size on BP_MeshSampling_VisualEntity_C_SetNiagaraParams");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_SetNiagaraParams, NiagaraComponent) == 0x000000, "Member 'BP_MeshSampling_VisualEntity_C_SetNiagaraParams::NiagaraComponent' has a wrong offset!");
static_assert(offsetof(BP_MeshSampling_VisualEntity_C_SetNiagaraParams, SkeletalMeshComponent) == 0x000008, "Member 'BP_MeshSampling_VisualEntity_C_SetNiagaraParams::SkeletalMeshComponent' has a wrong offset!");

}

