#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Maddick_Anim

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_Maddick_Anim.BP_Maddick_Anim_C
// 0x2020 (0x26C0 - 0x06A0)
class UBP_Maddick_Anim_C final : public UAnimInstanceBase
{
public:
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_2;                    // 0x06A8(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_26;                   // 0x0750(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_25;                   // 0x07D0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x0850(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x0878(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x08A0(0x0028)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_1;                    // 0x08C8(0x00A8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0970(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_24;                   // 0x0998(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0A18(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_23;                   // 0x0A48(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0AC8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x0AF8(0x00B0)()
	struct FAnimNode_MirrorBones                  AnimGraphNode_MirrorBones;                         // 0x0BA8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_22;                   // 0x0BF0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_21;                   // 0x0C70(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_20;                   // 0x0CF0(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0D70(0x0158)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0EC8(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0EE8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_19;                   // 0x0F08(0x0080)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x0F88(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_18;                   // 0x1030(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_17;                   // 0x10B0(0x0080)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1130(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1160(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x11A8(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x1290(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16;                   // 0x1338(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x13B8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x13E8(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0x1498(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x1518(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x1598(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x1618(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1640(0x0028)()
	struct FAnimNode_HitReaction                  AnimGraphNode_HitReaction_3;                       // 0x1668(0x00E8)()
	struct FAnimNode_HitReaction                  AnimGraphNode_HitReaction_2;                       // 0x1750(0x00E8)()
	struct FAnimNode_HitReaction                  AnimGraphNode_HitReaction_1;                       // 0x1838(0x00E8)()
	struct FAnimNode_HitReaction                  AnimGraphNode_HitReaction;                         // 0x1920(0x00E8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1A08(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1B60(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1B88(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x1BB0(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x1C78(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x1CF8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x1D78(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x1DF8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x1E78(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x1EF8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x1F78(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x1FF8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x2078(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x20F8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x2178(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x21F8(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x2220(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x2308(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x23B0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x2430(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x2460(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x2548(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x2578(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x2628(0x0080)()
	int32                                         AdditiveHitAnimIx;                                 // 0x26A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Looking;                                           // 0x26AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26AD[0x3];                                     // 0x26AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LookAngle;                                         // 0x26B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IdlePreCombatStopped;                              // 0x26B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26B5[0x3];                                     // 0x26B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Alpha;                                             // 0x26B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void OnFacingChanged(bool bForced);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Maddick_Anim_AnimGraphNode_TransitionResult_0581BC0B49B9650137AB43B9E3AF8324();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Maddick_Anim_AnimGraphNode_BlendListByInt_3F65A2FC493B7D066D58A39AC4FB682D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Maddick_Anim_AnimGraphNode_BlendSpacePlayer_3EC8FADF44A3231B87ABF698D12437A3();
	void ExecuteUbergraph_BP_Maddick_Anim(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Maddick_Anim_C">();
	}
	static class UBP_Maddick_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Maddick_Anim_C>();
	}
};
static_assert(alignof(UBP_Maddick_Anim_C) == 0x000010, "Wrong alignment on UBP_Maddick_Anim_C");
static_assert(sizeof(UBP_Maddick_Anim_C) == 0x0026C0, "Wrong size on UBP_Maddick_Anim_C");
static_assert(offsetof(UBP_Maddick_Anim_C, UberGraphFrame) == 0x0006A0, "Member 'UBP_Maddick_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_BlendListByInt_2) == 0x0006A8, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_BlendListByInt_2' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer_26) == 0x000750, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer_26' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer_25) == 0x0007D0, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer_25' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_UseCachedPose_6) == 0x000850, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_UseCachedPose_5) == 0x000878, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_UseCachedPose_4) == 0x0008A0, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_BlendListByInt_1) == 0x0008C8, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_BlendListByInt_1' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_TransitionResult_1) == 0x000970, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer_24) == 0x000998, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer_24' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_StateResult_4) == 0x000A18, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer_23) == 0x000A48, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer_23' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_StateResult_3) == 0x000AC8, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_StateMachine_2) == 0x000AF8, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_StateMachine_2' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_MirrorBones) == 0x000BA8, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_MirrorBones' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer_22) == 0x000BF0, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer_22' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer_21) == 0x000C70, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer_21' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer_20) == 0x000CF0, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer_20' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SaveCachedPose_1) == 0x000D70, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_ComponentToLocalSpace) == 0x000EC8, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_LocalToComponentSpace) == 0x000EE8, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer_19) == 0x000F08, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer_19' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_BlendListByInt) == 0x000F88, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer_18) == 0x001030, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer_18' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer_17) == 0x0010B0, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer_17' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_Root) == 0x001130, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_Slot) == 0x001160, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_BlendSpacePlayer_2) == 0x0011A8, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_BlendSpacePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_BlendListByBool_1) == 0x001290, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer_16) == 0x001338, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer_16' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_StateResult_2) == 0x0013B8, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_StateMachine_1) == 0x0013E8, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer_15) == 0x001498, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer_15' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer_14) == 0x001518, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer_14' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer_13) == 0x001598, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer_13' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_UseCachedPose_3) == 0x001618, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_UseCachedPose_2) == 0x001640, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_HitReaction_3) == 0x001668, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_HitReaction_3' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_HitReaction_2) == 0x001750, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_HitReaction_2' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_HitReaction_1) == 0x001838, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_HitReaction_1' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_HitReaction) == 0x001920, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_HitReaction' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SaveCachedPose) == 0x001A08, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_UseCachedPose_1) == 0x001B60, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_UseCachedPose) == 0x001B88, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_TwoWayBlend) == 0x001BB0, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer_12) == 0x001C78, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer_12' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer_11) == 0x001CF8, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer_11' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer_10) == 0x001D78, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer_9) == 0x001DF8, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer_8) == 0x001E78, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer_7) == 0x001EF8, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer_6) == 0x001F78, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer_5) == 0x001FF8, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer_4) == 0x002078, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer_3) == 0x0020F8, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer_2) == 0x002178, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_TransitionResult) == 0x0021F8, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_BlendSpacePlayer_1) == 0x002220, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_BlendListByBool) == 0x002308, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer_1) == 0x0023B0, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_StateResult_1) == 0x002430, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_BlendSpacePlayer) == 0x002460, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_StateResult) == 0x002548, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_StateMachine) == 0x002578, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AnimGraphNode_SequencePlayer) == 0x002628, "Member 'UBP_Maddick_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, AdditiveHitAnimIx) == 0x0026A8, "Member 'UBP_Maddick_Anim_C::AdditiveHitAnimIx' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, Looking) == 0x0026AC, "Member 'UBP_Maddick_Anim_C::Looking' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, LookAngle) == 0x0026B0, "Member 'UBP_Maddick_Anim_C::LookAngle' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, IdlePreCombatStopped) == 0x0026B4, "Member 'UBP_Maddick_Anim_C::IdlePreCombatStopped' has a wrong offset!");
static_assert(offsetof(UBP_Maddick_Anim_C, Alpha) == 0x0026B8, "Member 'UBP_Maddick_Anim_C::Alpha' has a wrong offset!");

}

