#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MeleeImpDie1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_VfxComponentBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MeleeImpDie1.BP_MeleeImpDie1_C
// 0x0010 (0x0720 - 0x0710)
class UBP_MeleeImpDie1_C final : public UBP_VfxComponentBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_MeleeImpDie1_C;                  // 0x0708(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Time;                                              // 0x0710(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Random1;                                           // 0x0714(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Random2;                                           // 0x0718(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Random3;                                           // 0x071C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPForceKill();
	void BPStart();
	void BPTick(float DeltaTime);
	void ExecuteUbergraph_BP_MeleeImpDie1(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MeleeImpDie1_C">();
	}
	static class UBP_MeleeImpDie1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MeleeImpDie1_C>();
	}
};
static_assert(alignof(UBP_MeleeImpDie1_C) == 0x000010, "Wrong alignment on UBP_MeleeImpDie1_C");
static_assert(sizeof(UBP_MeleeImpDie1_C) == 0x000720, "Wrong size on UBP_MeleeImpDie1_C");
static_assert(offsetof(UBP_MeleeImpDie1_C, UberGraphFrame_BP_MeleeImpDie1_C) == 0x000708, "Member 'UBP_MeleeImpDie1_C::UberGraphFrame_BP_MeleeImpDie1_C' has a wrong offset!");
static_assert(offsetof(UBP_MeleeImpDie1_C, Time) == 0x000710, "Member 'UBP_MeleeImpDie1_C::Time' has a wrong offset!");
static_assert(offsetof(UBP_MeleeImpDie1_C, Random1) == 0x000714, "Member 'UBP_MeleeImpDie1_C::Random1' has a wrong offset!");
static_assert(offsetof(UBP_MeleeImpDie1_C, Random2) == 0x000718, "Member 'UBP_MeleeImpDie1_C::Random2' has a wrong offset!");
static_assert(offsetof(UBP_MeleeImpDie1_C, Random3) == 0x00071C, "Member 'UBP_MeleeImpDie1_C::Random3' has a wrong offset!");

}

