#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ModelActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ModelActor.BP_ModelActor_C
// 0x0020 (0x0290 - 0x0270)
class ABP_ModelActor_C : public AWeaponModelActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHitBox*                                SwordHitbox;                                       // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Longsword;                                      // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ModelActor(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ModelActor_C">();
	}
	static class ABP_ModelActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ModelActor_C>();
	}
};
static_assert(alignof(ABP_ModelActor_C) == 0x000010, "Wrong alignment on ABP_ModelActor_C");
static_assert(sizeof(ABP_ModelActor_C) == 0x000290, "Wrong size on ABP_ModelActor_C");
static_assert(offsetof(ABP_ModelActor_C, UberGraphFrame) == 0x000270, "Member 'ABP_ModelActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ModelActor_C, SwordHitbox) == 0x000278, "Member 'ABP_ModelActor_C::SwordHitbox' has a wrong offset!");
static_assert(offsetof(ABP_ModelActor_C, SK_Longsword) == 0x000280, "Member 'ABP_ModelActor_C::SK_Longsword' has a wrong offset!");
static_assert(offsetof(ABP_ModelActor_C, DefaultSceneRoot) == 0x000288, "Member 'ABP_ModelActor_C::DefaultSceneRoot' has a wrong offset!");

}

