#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ManEngineEventHandler

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ManEngineEventHandler.BP_ManEngineEventHandler_C
// 0x0010 (0x0048 - 0x0038)
class UBP_ManEngineEventHandler_C final : public UManEngineEventHandler
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0038(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         LoadCounter;                                       // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAudioPauseEnabled;                               // 0x0044(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_ManEngineEventHandler(int32 EntryPoint);
	void OnPauseEnd();
	void OnPauseStart();
	void OnLevelLoadFadeOutBegin(bool bQuick);
	void OnLevelLoadFadeInBegin();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ManEngineEventHandler_C">();
	}
	static class UBP_ManEngineEventHandler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ManEngineEventHandler_C>();
	}
};
static_assert(alignof(UBP_ManEngineEventHandler_C) == 0x000008, "Wrong alignment on UBP_ManEngineEventHandler_C");
static_assert(sizeof(UBP_ManEngineEventHandler_C) == 0x000048, "Wrong size on UBP_ManEngineEventHandler_C");
static_assert(offsetof(UBP_ManEngineEventHandler_C, UberGraphFrame) == 0x000038, "Member 'UBP_ManEngineEventHandler_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ManEngineEventHandler_C, LoadCounter) == 0x000040, "Member 'UBP_ManEngineEventHandler_C::LoadCounter' has a wrong offset!");
static_assert(offsetof(UBP_ManEngineEventHandler_C, IsAudioPauseEnabled) == 0x000044, "Member 'UBP_ManEngineEventHandler_C::IsAudioPauseEnabled' has a wrong offset!");

}

