#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mount_CS_A007_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Mount_CS_A007_Anim.BP_Mount_CS_A007_Anim_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct BP_Mount_CS_A007_Anim_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BP_Mount_CS_A007_Anim_C_AnimGraph) == 0x000008, "Wrong alignment on BP_Mount_CS_A007_Anim_C_AnimGraph");
static_assert(sizeof(BP_Mount_CS_A007_Anim_C_AnimGraph) == 0x000010, "Wrong size on BP_Mount_CS_A007_Anim_C_AnimGraph");
static_assert(offsetof(BP_Mount_CS_A007_Anim_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'BP_Mount_CS_A007_Anim_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function BP_Mount_CS_A007_Anim.BP_Mount_CS_A007_Anim_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct BP_Mount_CS_A007_Anim_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mount_CS_A007_Anim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on BP_Mount_CS_A007_Anim_C_BlueprintUpdateAnimation");
static_assert(sizeof(BP_Mount_CS_A007_Anim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on BP_Mount_CS_A007_Anim_C_BlueprintUpdateAnimation");
static_assert(offsetof(BP_Mount_CS_A007_Anim_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'BP_Mount_CS_A007_Anim_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function BP_Mount_CS_A007_Anim.BP_Mount_CS_A007_Anim_C.ExecuteUbergraph_BP_Mount_CS_A007_Anim
// 0x0008 (0x0008 - 0x0000)
struct BP_Mount_CS_A007_Anim_C_ExecuteUbergraph_BP_Mount_CS_A007_Anim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mount_CS_A007_Anim_C_ExecuteUbergraph_BP_Mount_CS_A007_Anim) == 0x000004, "Wrong alignment on BP_Mount_CS_A007_Anim_C_ExecuteUbergraph_BP_Mount_CS_A007_Anim");
static_assert(sizeof(BP_Mount_CS_A007_Anim_C_ExecuteUbergraph_BP_Mount_CS_A007_Anim) == 0x000008, "Wrong size on BP_Mount_CS_A007_Anim_C_ExecuteUbergraph_BP_Mount_CS_A007_Anim");
static_assert(offsetof(BP_Mount_CS_A007_Anim_C_ExecuteUbergraph_BP_Mount_CS_A007_Anim, EntryPoint) == 0x000000, "Member 'BP_Mount_CS_A007_Anim_C_ExecuteUbergraph_BP_Mount_CS_A007_Anim::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Mount_CS_A007_Anim_C_ExecuteUbergraph_BP_Mount_CS_A007_Anim, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'BP_Mount_CS_A007_Anim_C_ExecuteUbergraph_BP_Mount_CS_A007_Anim::K2Node_Event_DeltaTimeX' has a wrong offset!");

}

