#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MotesOfChaos_ProjectileImpact_VE

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_MotesOfChaos_ProjectileImpact_VE.BP_MotesOfChaos_ProjectileImpact_VE_C.ExecuteUbergraph_BP_MotesOfChaos_ProjectileImpact_VE
// 0x0020 (0x0020 - 0x0000)
struct BP_MotesOfChaos_ProjectileImpact_VE_C_ExecuteUbergraph_BP_MotesOfChaos_ProjectileImpact_VE final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MotesOfChaos_ProjectileImpact_VE_C_ExecuteUbergraph_BP_MotesOfChaos_ProjectileImpact_VE) == 0x000008, "Wrong alignment on BP_MotesOfChaos_ProjectileImpact_VE_C_ExecuteUbergraph_BP_MotesOfChaos_ProjectileImpact_VE");
static_assert(sizeof(BP_MotesOfChaos_ProjectileImpact_VE_C_ExecuteUbergraph_BP_MotesOfChaos_ProjectileImpact_VE) == 0x000020, "Wrong size on BP_MotesOfChaos_ProjectileImpact_VE_C_ExecuteUbergraph_BP_MotesOfChaos_ProjectileImpact_VE");
static_assert(offsetof(BP_MotesOfChaos_ProjectileImpact_VE_C_ExecuteUbergraph_BP_MotesOfChaos_ProjectileImpact_VE, EntryPoint) == 0x000000, "Member 'BP_MotesOfChaos_ProjectileImpact_VE_C_ExecuteUbergraph_BP_MotesOfChaos_ProjectileImpact_VE::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MotesOfChaos_ProjectileImpact_VE_C_ExecuteUbergraph_BP_MotesOfChaos_ProjectileImpact_VE, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'BP_MotesOfChaos_ProjectileImpact_VE_C_ExecuteUbergraph_BP_MotesOfChaos_ProjectileImpact_VE::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MotesOfChaos_ProjectileImpact_VE_C_ExecuteUbergraph_BP_MotesOfChaos_ProjectileImpact_VE, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000010, "Member 'BP_MotesOfChaos_ProjectileImpact_VE_C_ExecuteUbergraph_BP_MotesOfChaos_ProjectileImpact_VE::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MotesOfChaos_ProjectileImpact_VE_C_ExecuteUbergraph_BP_MotesOfChaos_ProjectileImpact_VE, CallFunc_PostEventAtLocation_ReturnValue) == 0x00001C, "Member 'BP_MotesOfChaos_ProjectileImpact_VE_C_ExecuteUbergraph_BP_MotesOfChaos_ProjectileImpact_VE::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");

}

