#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MainMenu_Button2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_MainMenu_Button2.BP_MainMenu_Button2_C
// 0x0128 (0x03B0 - 0x0288)
class UBP_MainMenu_Button2_C final : public UManBtnUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HighlightAnim;                                     // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BgDecor;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonFrame;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Caption;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Caption_Highlight;                                 // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DecorLeft;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DecorRight;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Highlight;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               IconContainer;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   CaptionText;                                       // 0x02E8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnHovered;                                         // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUnhovered;                                       // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnPressed;                                         // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnReleased;                                        // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnFocus;                                           // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsActive;                                          // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           TextColor_Up;                                      // 0x0364(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           TextColor_Sel;                                     // 0x0374(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IconVisible;                                       // 0x0384(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_385[0x3];                                      // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             IconTexture_Up;                                    // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             IconTexture_Sel;                                   // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             DecorTexture_Left;                                 // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             DecorTexture_Right;                                // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             DecorTexture_Bg;                                   // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Init();
	void ToggleActive(bool InIsActive);
	struct FEventReply OnPreviewKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnClickedButton();
	void OnFocused(bool bAnimate);
	void OnUnfocused(bool bAnimate);
	void OnSetText(const class FText& Text);
	void OnSetBtnEnabled(bool bInBtnEnabled);
	void ExecuteUbergraph_BP_MainMenu_Button2(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MainMenu_Button2_C">();
	}
	static class UBP_MainMenu_Button2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MainMenu_Button2_C>();
	}
};
static_assert(alignof(UBP_MainMenu_Button2_C) == 0x000008, "Wrong alignment on UBP_MainMenu_Button2_C");
static_assert(sizeof(UBP_MainMenu_Button2_C) == 0x0003B0, "Wrong size on UBP_MainMenu_Button2_C");
static_assert(offsetof(UBP_MainMenu_Button2_C, UberGraphFrame) == 0x000288, "Member 'UBP_MainMenu_Button2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, HighlightAnim) == 0x000290, "Member 'UBP_MainMenu_Button2_C::HighlightAnim' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, BgDecor) == 0x000298, "Member 'UBP_MainMenu_Button2_C::BgDecor' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, ButtonFrame) == 0x0002A0, "Member 'UBP_MainMenu_Button2_C::ButtonFrame' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, Caption) == 0x0002A8, "Member 'UBP_MainMenu_Button2_C::Caption' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, Caption_Highlight) == 0x0002B0, "Member 'UBP_MainMenu_Button2_C::Caption_Highlight' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, DecorLeft) == 0x0002B8, "Member 'UBP_MainMenu_Button2_C::DecorLeft' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, DecorRight) == 0x0002C0, "Member 'UBP_MainMenu_Button2_C::DecorRight' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, Icon) == 0x0002C8, "Member 'UBP_MainMenu_Button2_C::Icon' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, Icon_Highlight) == 0x0002D0, "Member 'UBP_MainMenu_Button2_C::Icon_Highlight' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, IconContainer) == 0x0002D8, "Member 'UBP_MainMenu_Button2_C::IconContainer' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, Overlay_0) == 0x0002E0, "Member 'UBP_MainMenu_Button2_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, CaptionText) == 0x0002E8, "Member 'UBP_MainMenu_Button2_C::CaptionText' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, OnClicked) == 0x000300, "Member 'UBP_MainMenu_Button2_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, OnHovered) == 0x000310, "Member 'UBP_MainMenu_Button2_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, OnUnhovered) == 0x000320, "Member 'UBP_MainMenu_Button2_C::OnUnhovered' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, OnPressed) == 0x000330, "Member 'UBP_MainMenu_Button2_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, OnReleased) == 0x000340, "Member 'UBP_MainMenu_Button2_C::OnReleased' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, OnFocus) == 0x000350, "Member 'UBP_MainMenu_Button2_C::OnFocus' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, IsActive) == 0x000360, "Member 'UBP_MainMenu_Button2_C::IsActive' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, TextColor_Up) == 0x000364, "Member 'UBP_MainMenu_Button2_C::TextColor_Up' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, TextColor_Sel) == 0x000374, "Member 'UBP_MainMenu_Button2_C::TextColor_Sel' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, IconVisible) == 0x000384, "Member 'UBP_MainMenu_Button2_C::IconVisible' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, IconTexture_Up) == 0x000388, "Member 'UBP_MainMenu_Button2_C::IconTexture_Up' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, IconTexture_Sel) == 0x000390, "Member 'UBP_MainMenu_Button2_C::IconTexture_Sel' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, DecorTexture_Left) == 0x000398, "Member 'UBP_MainMenu_Button2_C::DecorTexture_Left' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, DecorTexture_Right) == 0x0003A0, "Member 'UBP_MainMenu_Button2_C::DecorTexture_Right' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Button2_C, DecorTexture_Bg) == 0x0003A8, "Member 'UBP_MainMenu_Button2_C::DecorTexture_Bg' has a wrong offset!");

}

