#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mount_Blacksmith_02

#include "Basic.hpp"

#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mount_Blacksmith_02.BP_Mount_Blacksmith_02_C
// 0x0038 (0x0810 - 0x07D8)
class ABP_Mount_Blacksmith_02_C final : public AActorBase
{
public:
	class UAkComponent*                           Ak;                                                // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGroomComponent*                        Groom1;                                            // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGroomComponent*                        Groom;                                             // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Crow_Anim_C*                        Crow_Anim;                                         // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Idle_Bridge_Chance;                                // 0x0800(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Idle_Bridge_Start_Timer;                           // 0x0804(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Direction;                                         // 0x0808(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mount_Blacksmith_02_C">();
	}
	static class ABP_Mount_Blacksmith_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mount_Blacksmith_02_C>();
	}
};
static_assert(alignof(ABP_Mount_Blacksmith_02_C) == 0x000008, "Wrong alignment on ABP_Mount_Blacksmith_02_C");
static_assert(sizeof(ABP_Mount_Blacksmith_02_C) == 0x000810, "Wrong size on ABP_Mount_Blacksmith_02_C");
static_assert(offsetof(ABP_Mount_Blacksmith_02_C, Ak) == 0x0007D8, "Member 'ABP_Mount_Blacksmith_02_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_Mount_Blacksmith_02_C, Groom1) == 0x0007E0, "Member 'ABP_Mount_Blacksmith_02_C::Groom1' has a wrong offset!");
static_assert(offsetof(ABP_Mount_Blacksmith_02_C, Groom) == 0x0007E8, "Member 'ABP_Mount_Blacksmith_02_C::Groom' has a wrong offset!");
static_assert(offsetof(ABP_Mount_Blacksmith_02_C, SkeletalMesh) == 0x0007F0, "Member 'ABP_Mount_Blacksmith_02_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_Mount_Blacksmith_02_C, Crow_Anim) == 0x0007F8, "Member 'ABP_Mount_Blacksmith_02_C::Crow_Anim' has a wrong offset!");
static_assert(offsetof(ABP_Mount_Blacksmith_02_C, Idle_Bridge_Chance) == 0x000800, "Member 'ABP_Mount_Blacksmith_02_C::Idle_Bridge_Chance' has a wrong offset!");
static_assert(offsetof(ABP_Mount_Blacksmith_02_C, Idle_Bridge_Start_Timer) == 0x000804, "Member 'ABP_Mount_Blacksmith_02_C::Idle_Bridge_Start_Timer' has a wrong offset!");
static_assert(offsetof(ABP_Mount_Blacksmith_02_C, Direction) == 0x000808, "Member 'ABP_Mount_Blacksmith_02_C::Direction' has a wrong offset!");

}

