#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MainMenu_Button2

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function BP_MainMenu_Button2.BP_MainMenu_Button2_C.Init
// 0x0070 (0x0070 - 0x0000)
struct BP_MainMenu_Button2_C_Init final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0020(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0048(0x0028)()
};
static_assert(alignof(BP_MainMenu_Button2_C_Init) == 0x000008, "Wrong alignment on BP_MainMenu_Button2_C_Init");
static_assert(sizeof(BP_MainMenu_Button2_C_Init) == 0x000070, "Wrong size on BP_MainMenu_Button2_C_Init");
static_assert(offsetof(BP_MainMenu_Button2_C_Init, Temp_bool_Variable) == 0x000000, "Member 'BP_MainMenu_Button2_C_Init::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_Init, Temp_byte_Variable) == 0x000001, "Member 'BP_MainMenu_Button2_C_Init::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_Init, Temp_byte_Variable_1) == 0x000002, "Member 'BP_MainMenu_Button2_C_Init::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_Init, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'BP_MainMenu_Button2_C_Init::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_Init, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000010, "Member 'BP_MainMenu_Button2_C_Init::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_Init, K2Node_Select_Default) == 0x000018, "Member 'BP_MainMenu_Button2_C_Init::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_Init, K2Node_MakeStruct_SlateColor) == 0x000020, "Member 'BP_MainMenu_Button2_C_Init::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_Init, K2Node_MakeStruct_SlateColor_1) == 0x000048, "Member 'BP_MainMenu_Button2_C_Init::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function BP_MainMenu_Button2.BP_MainMenu_Button2_C.ToggleActive
// 0x0060 (0x0060 - 0x0000)
struct BP_MainMenu_Button2_C_ToggleActive final
{
public:
	bool                                          InIsActive;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0038(0x0028)()
};
static_assert(alignof(BP_MainMenu_Button2_C_ToggleActive) == 0x000008, "Wrong alignment on BP_MainMenu_Button2_C_ToggleActive");
static_assert(sizeof(BP_MainMenu_Button2_C_ToggleActive) == 0x000060, "Wrong size on BP_MainMenu_Button2_C_ToggleActive");
static_assert(offsetof(BP_MainMenu_Button2_C_ToggleActive, InIsActive) == 0x000000, "Member 'BP_MainMenu_Button2_C_ToggleActive::InIsActive' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_ToggleActive, Temp_bool_Variable) == 0x000001, "Member 'BP_MainMenu_Button2_C_ToggleActive::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_ToggleActive, Temp_struct_Variable) == 0x000004, "Member 'BP_MainMenu_Button2_C_ToggleActive::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_ToggleActive, Temp_struct_Variable_1) == 0x000014, "Member 'BP_MainMenu_Button2_C_ToggleActive::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_ToggleActive, K2Node_Select_Default) == 0x000024, "Member 'BP_MainMenu_Button2_C_ToggleActive::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_ToggleActive, K2Node_MakeStruct_SlateColor) == 0x000038, "Member 'BP_MainMenu_Button2_C_ToggleActive::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function BP_MainMenu_Button2.BP_MainMenu_Button2_C.OnPreviewKeyDown
// 0x02B8 (0x02B8 - 0x0000)
struct BP_MainMenu_Button2_C_OnPreviewKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0128(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0140(0x00B8)()
	bool                                          CallFunc_IsHotkeyKey_ReturnValue;                  // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0200(0x00B8)()
};
static_assert(alignof(BP_MainMenu_Button2_C_OnPreviewKeyDown) == 0x000008, "Wrong alignment on BP_MainMenu_Button2_C_OnPreviewKeyDown");
static_assert(sizeof(BP_MainMenu_Button2_C_OnPreviewKeyDown) == 0x0002B8, "Wrong size on BP_MainMenu_Button2_C_OnPreviewKeyDown");
static_assert(offsetof(BP_MainMenu_Button2_C_OnPreviewKeyDown, MyGeometry) == 0x000000, "Member 'BP_MainMenu_Button2_C_OnPreviewKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_OnPreviewKeyDown, InKeyEvent) == 0x000038, "Member 'BP_MainMenu_Button2_C_OnPreviewKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_OnPreviewKeyDown, ReturnValue) == 0x000070, "Member 'BP_MainMenu_Button2_C_OnPreviewKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_OnPreviewKeyDown, CallFunc_GetKey_ReturnValue) == 0x000128, "Member 'BP_MainMenu_Button2_C_OnPreviewKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_OnPreviewKeyDown, CallFunc_Handled_ReturnValue) == 0x000140, "Member 'BP_MainMenu_Button2_C_OnPreviewKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_OnPreviewKeyDown, CallFunc_IsHotkeyKey_ReturnValue) == 0x0001F8, "Member 'BP_MainMenu_Button2_C_OnPreviewKeyDown::CallFunc_IsHotkeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_OnPreviewKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000200, "Member 'BP_MainMenu_Button2_C_OnPreviewKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function BP_MainMenu_Button2.BP_MainMenu_Button2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_MainMenu_Button2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MainMenu_Button2_C_PreConstruct) == 0x000001, "Wrong alignment on BP_MainMenu_Button2_C_PreConstruct");
static_assert(sizeof(BP_MainMenu_Button2_C_PreConstruct) == 0x000001, "Wrong size on BP_MainMenu_Button2_C_PreConstruct");
static_assert(offsetof(BP_MainMenu_Button2_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_MainMenu_Button2_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_MainMenu_Button2.BP_MainMenu_Button2_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_MainMenu_Button2_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainMenu_Button2_C_Tick) == 0x000004, "Wrong alignment on BP_MainMenu_Button2_C_Tick");
static_assert(sizeof(BP_MainMenu_Button2_C_Tick) == 0x00003C, "Wrong size on BP_MainMenu_Button2_C_Tick");
static_assert(offsetof(BP_MainMenu_Button2_C_Tick, MyGeometry) == 0x000000, "Member 'BP_MainMenu_Button2_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_MainMenu_Button2_C_Tick::InDeltaTime' has a wrong offset!");

// Function BP_MainMenu_Button2.BP_MainMenu_Button2_C.OnFocused
// 0x0001 (0x0001 - 0x0000)
struct BP_MainMenu_Button2_C_OnFocused final
{
public:
	bool                                          bAnimate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MainMenu_Button2_C_OnFocused) == 0x000001, "Wrong alignment on BP_MainMenu_Button2_C_OnFocused");
static_assert(sizeof(BP_MainMenu_Button2_C_OnFocused) == 0x000001, "Wrong size on BP_MainMenu_Button2_C_OnFocused");
static_assert(offsetof(BP_MainMenu_Button2_C_OnFocused, bAnimate) == 0x000000, "Member 'BP_MainMenu_Button2_C_OnFocused::bAnimate' has a wrong offset!");

// Function BP_MainMenu_Button2.BP_MainMenu_Button2_C.OnUnfocused
// 0x0001 (0x0001 - 0x0000)
struct BP_MainMenu_Button2_C_OnUnfocused final
{
public:
	bool                                          bAnimate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MainMenu_Button2_C_OnUnfocused) == 0x000001, "Wrong alignment on BP_MainMenu_Button2_C_OnUnfocused");
static_assert(sizeof(BP_MainMenu_Button2_C_OnUnfocused) == 0x000001, "Wrong size on BP_MainMenu_Button2_C_OnUnfocused");
static_assert(offsetof(BP_MainMenu_Button2_C_OnUnfocused, bAnimate) == 0x000000, "Member 'BP_MainMenu_Button2_C_OnUnfocused::bAnimate' has a wrong offset!");

// Function BP_MainMenu_Button2.BP_MainMenu_Button2_C.OnSetText
// 0x0018 (0x0018 - 0x0000)
struct BP_MainMenu_Button2_C_OnSetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_MainMenu_Button2_C_OnSetText) == 0x000008, "Wrong alignment on BP_MainMenu_Button2_C_OnSetText");
static_assert(sizeof(BP_MainMenu_Button2_C_OnSetText) == 0x000018, "Wrong size on BP_MainMenu_Button2_C_OnSetText");
static_assert(offsetof(BP_MainMenu_Button2_C_OnSetText, Text) == 0x000000, "Member 'BP_MainMenu_Button2_C_OnSetText::Text' has a wrong offset!");

// Function BP_MainMenu_Button2.BP_MainMenu_Button2_C.OnSetBtnEnabled
// 0x0001 (0x0001 - 0x0000)
struct BP_MainMenu_Button2_C_OnSetBtnEnabled final
{
public:
	bool                                          bInBtnEnabled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MainMenu_Button2_C_OnSetBtnEnabled) == 0x000001, "Wrong alignment on BP_MainMenu_Button2_C_OnSetBtnEnabled");
static_assert(sizeof(BP_MainMenu_Button2_C_OnSetBtnEnabled) == 0x000001, "Wrong size on BP_MainMenu_Button2_C_OnSetBtnEnabled");
static_assert(offsetof(BP_MainMenu_Button2_C_OnSetBtnEnabled, bInBtnEnabled) == 0x000000, "Member 'BP_MainMenu_Button2_C_OnSetBtnEnabled::bInBtnEnabled' has a wrong offset!");

// Function BP_MainMenu_Button2.BP_MainMenu_Button2_C.ExecuteUbergraph_BP_MainMenu_Button2
// 0x00A8 (0x00A8 - 0x0000)
struct BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInBtnEnabled;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x002C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAnimate_1;                           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bAnimate;                             // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Text;                                 // 0x0088(0x0018)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2) == 0x000008, "Wrong alignment on BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2");
static_assert(sizeof(BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2) == 0x0000A8, "Wrong size on BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2");
static_assert(offsetof(BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2, EntryPoint) == 0x000000, "Member 'BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2, K2Node_Event_bInBtnEnabled) == 0x000004, "Member 'BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2::K2Node_Event_bInBtnEnabled' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2, Temp_bool_Variable) == 0x000018, "Member 'BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2, Temp_float_Variable) == 0x00001C, "Member 'BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2, Temp_bool_Variable_1) == 0x000020, "Member 'BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2, Temp_float_Variable_1) == 0x000024, "Member 'BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2, K2Node_Event_IsDesignTime) == 0x000028, "Member 'BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2, K2Node_Event_MyGeometry) == 0x00002C, "Member 'BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2, K2Node_Event_InDeltaTime) == 0x000064, "Member 'BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2, CallFunc_GetEndTime_ReturnValue) == 0x000068, "Member 'BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2, CallFunc_GetEndTime_ReturnValue_1) == 0x00006C, "Member 'BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2, K2Node_Event_bAnimate_1) == 0x000070, "Member 'BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2::K2Node_Event_bAnimate_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2, K2Node_Event_bAnimate) == 0x000071, "Member 'BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2::K2Node_Event_bAnimate' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2, K2Node_Select_Default) == 0x000074, "Member 'BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2, CallFunc_PlayAnimation_ReturnValue) == 0x000078, "Member 'BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2, K2Node_Select_Default_1) == 0x000080, "Member 'BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2, K2Node_Event_Text) == 0x000088, "Member 'BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2::K2Node_Event_Text' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000A0, "Member 'BP_MainMenu_Button2_C_ExecuteUbergraph_BP_MainMenu_Button2::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

