#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapCharacter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_MapCharacter.BP_MapCharacter_C
// 0x0018 (0x0280 - 0x0268)
class UBP_MapCharacter_C final : public UMapCharacterUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LoopAnimation;                                     // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MapCharacter(int32 EntryPoint);
	void OnSetFacing(bool bLeft);
	void Construct();
	void SetFacing(bool IsLeftFacing);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MapCharacter_C">();
	}
	static class UBP_MapCharacter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MapCharacter_C>();
	}
};
static_assert(alignof(UBP_MapCharacter_C) == 0x000008, "Wrong alignment on UBP_MapCharacter_C");
static_assert(sizeof(UBP_MapCharacter_C) == 0x000280, "Wrong size on UBP_MapCharacter_C");
static_assert(offsetof(UBP_MapCharacter_C, UberGraphFrame) == 0x000268, "Member 'UBP_MapCharacter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_MapCharacter_C, LoopAnimation) == 0x000270, "Member 'UBP_MapCharacter_C::LoopAnimation' has a wrong offset!");
static_assert(offsetof(UBP_MapCharacter_C, Icon) == 0x000278, "Member 'UBP_MapCharacter_C::Icon' has a wrong offset!");

}

