#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MainMenu

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_MainMenu.BP_MainMenu_C.OnShowWindowFinished_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BP_MainMenu_C_OnShowWindowFinished_Event_0 final
{
public:
	class UManUserWidgetBase*                     ManUserWidgetBase;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainMenu_C_OnShowWindowFinished_Event_0) == 0x000008, "Wrong alignment on BP_MainMenu_C_OnShowWindowFinished_Event_0");
static_assert(sizeof(BP_MainMenu_C_OnShowWindowFinished_Event_0) == 0x000008, "Wrong size on BP_MainMenu_C_OnShowWindowFinished_Event_0");
static_assert(offsetof(BP_MainMenu_C_OnShowWindowFinished_Event_0, ManUserWidgetBase) == 0x000000, "Member 'BP_MainMenu_C_OnShowWindowFinished_Event_0::ManUserWidgetBase' has a wrong offset!");

// Function BP_MainMenu.BP_MainMenu_C.FadeMainMenuBackground
// 0x0070 (0x0070 - 0x0000)
struct BP_MainMenu_C_FadeMainMenuBackground final
{
public:
	bool                                          FadeIn;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSmallScreenMode_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UManUserWidgetBase*                     CallFunc_GetManUserWidgetBase_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_MainMenu_Background_SmallScreen_C*  K2Node_DynamicCast_AsBP_Main_Menu_Background__Small_Screen; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MainMenu_Background_C*              K2Node_DynamicCast_AsBP_Main_Menu_Background;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_2;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_3;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainMenu_C_FadeMainMenuBackground) == 0x000008, "Wrong alignment on BP_MainMenu_C_FadeMainMenuBackground");
static_assert(sizeof(BP_MainMenu_C_FadeMainMenuBackground) == 0x000070, "Wrong size on BP_MainMenu_C_FadeMainMenuBackground");
static_assert(offsetof(BP_MainMenu_C_FadeMainMenuBackground, FadeIn) == 0x000000, "Member 'BP_MainMenu_C_FadeMainMenuBackground::FadeIn' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_FadeMainMenuBackground, Temp_bool_Variable) == 0x000001, "Member 'BP_MainMenu_C_FadeMainMenuBackground::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_FadeMainMenuBackground, Temp_bool_Variable_1) == 0x000002, "Member 'BP_MainMenu_C_FadeMainMenuBackground::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_FadeMainMenuBackground, Temp_float_Variable) == 0x000004, "Member 'BP_MainMenu_C_FadeMainMenuBackground::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_FadeMainMenuBackground, Temp_bool_Variable_2) == 0x000008, "Member 'BP_MainMenu_C_FadeMainMenuBackground::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_FadeMainMenuBackground, Temp_float_Variable_1) == 0x00000C, "Member 'BP_MainMenu_C_FadeMainMenuBackground::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_FadeMainMenuBackground, Temp_bool_Variable_3) == 0x000010, "Member 'BP_MainMenu_C_FadeMainMenuBackground::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_FadeMainMenuBackground, CallFunc_IsSmallScreenMode_ReturnValue) == 0x000011, "Member 'BP_MainMenu_C_FadeMainMenuBackground::CallFunc_IsSmallScreenMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_FadeMainMenuBackground, CallFunc_GetManUserWidgetBase_ReturnValue) == 0x000018, "Member 'BP_MainMenu_C_FadeMainMenuBackground::CallFunc_GetManUserWidgetBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_FadeMainMenuBackground, K2Node_DynamicCast_AsBP_Main_Menu_Background__Small_Screen) == 0x000020, "Member 'BP_MainMenu_C_FadeMainMenuBackground::K2Node_DynamicCast_AsBP_Main_Menu_Background__Small_Screen' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_FadeMainMenuBackground, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_MainMenu_C_FadeMainMenuBackground::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_FadeMainMenuBackground, K2Node_DynamicCast_AsBP_Main_Menu_Background) == 0x000030, "Member 'BP_MainMenu_C_FadeMainMenuBackground::K2Node_DynamicCast_AsBP_Main_Menu_Background' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_FadeMainMenuBackground, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_MainMenu_C_FadeMainMenuBackground::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_FadeMainMenuBackground, CallFunc_GetEndTime_ReturnValue) == 0x00003C, "Member 'BP_MainMenu_C_FadeMainMenuBackground::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_FadeMainMenuBackground, CallFunc_GetEndTime_ReturnValue_1) == 0x000040, "Member 'BP_MainMenu_C_FadeMainMenuBackground::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_FadeMainMenuBackground, K2Node_Select_Default) == 0x000044, "Member 'BP_MainMenu_C_FadeMainMenuBackground::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_FadeMainMenuBackground, K2Node_Select_Default_1) == 0x000048, "Member 'BP_MainMenu_C_FadeMainMenuBackground::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_FadeMainMenuBackground, K2Node_Select_Default_2) == 0x000050, "Member 'BP_MainMenu_C_FadeMainMenuBackground::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_FadeMainMenuBackground, K2Node_Select_Default_3) == 0x000058, "Member 'BP_MainMenu_C_FadeMainMenuBackground::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_FadeMainMenuBackground, CallFunc_PlayAnimation_ReturnValue) == 0x000060, "Member 'BP_MainMenu_C_FadeMainMenuBackground::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_FadeMainMenuBackground, CallFunc_PlayAnimation_ReturnValue_1) == 0x000068, "Member 'BP_MainMenu_C_FadeMainMenuBackground::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function BP_MainMenu.BP_MainMenu_C.HideExtrasMenu
// 0x0005 (0x0005 - 0x0000)
struct BP_MainMenu_C_HideExtrasMenu final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainMenu_C_HideExtrasMenu) == 0x000001, "Wrong alignment on BP_MainMenu_C_HideExtrasMenu");
static_assert(sizeof(BP_MainMenu_C_HideExtrasMenu) == 0x000005, "Wrong size on BP_MainMenu_C_HideExtrasMenu");
static_assert(offsetof(BP_MainMenu_C_HideExtrasMenu, Temp_bool_Variable) == 0x000000, "Member 'BP_MainMenu_C_HideExtrasMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_HideExtrasMenu, Temp_byte_Variable) == 0x000001, "Member 'BP_MainMenu_C_HideExtrasMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_HideExtrasMenu, Temp_byte_Variable_1) == 0x000002, "Member 'BP_MainMenu_C_HideExtrasMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_HideExtrasMenu, CallFunc_IsConsole_ReturnValue) == 0x000003, "Member 'BP_MainMenu_C_HideExtrasMenu::CallFunc_IsConsole_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_HideExtrasMenu, K2Node_Select_Default) == 0x000004, "Member 'BP_MainMenu_C_HideExtrasMenu::K2Node_Select_Default' has a wrong offset!");

// Function BP_MainMenu.BP_MainMenu_C.ShowExtrasMenu
// 0x0008 (0x0008 - 0x0000)
struct BP_MainMenu_C_ShowExtrasMenu final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainMenu_C_ShowExtrasMenu) == 0x000001, "Wrong alignment on BP_MainMenu_C_ShowExtrasMenu");
static_assert(sizeof(BP_MainMenu_C_ShowExtrasMenu) == 0x000008, "Wrong size on BP_MainMenu_C_ShowExtrasMenu");
static_assert(offsetof(BP_MainMenu_C_ShowExtrasMenu, Temp_bool_Variable) == 0x000000, "Member 'BP_MainMenu_C_ShowExtrasMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_ShowExtrasMenu, Temp_byte_Variable) == 0x000001, "Member 'BP_MainMenu_C_ShowExtrasMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_ShowExtrasMenu, Temp_byte_Variable_1) == 0x000002, "Member 'BP_MainMenu_C_ShowExtrasMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_ShowExtrasMenu, Temp_bool_Variable_1) == 0x000003, "Member 'BP_MainMenu_C_ShowExtrasMenu::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_ShowExtrasMenu, Temp_byte_Variable_2) == 0x000004, "Member 'BP_MainMenu_C_ShowExtrasMenu::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_ShowExtrasMenu, Temp_byte_Variable_3) == 0x000005, "Member 'BP_MainMenu_C_ShowExtrasMenu::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_ShowExtrasMenu, K2Node_Select_Default) == 0x000006, "Member 'BP_MainMenu_C_ShowExtrasMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_ShowExtrasMenu, K2Node_Select_Default_1) == 0x000007, "Member 'BP_MainMenu_C_ShowExtrasMenu::K2Node_Select_Default_1' has a wrong offset!");

// Function BP_MainMenu.BP_MainMenu_C.SetContinueBtnState
// 0x0005 (0x0005 - 0x0000)
struct BP_MainMenu_C_SetContinueBtnState final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasValidSaveGameSlot_ReturnValue;         // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainMenu_C_SetContinueBtnState) == 0x000001, "Wrong alignment on BP_MainMenu_C_SetContinueBtnState");
static_assert(sizeof(BP_MainMenu_C_SetContinueBtnState) == 0x000005, "Wrong size on BP_MainMenu_C_SetContinueBtnState");
static_assert(offsetof(BP_MainMenu_C_SetContinueBtnState, Temp_bool_Variable) == 0x000000, "Member 'BP_MainMenu_C_SetContinueBtnState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_SetContinueBtnState, Temp_byte_Variable) == 0x000001, "Member 'BP_MainMenu_C_SetContinueBtnState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_SetContinueBtnState, Temp_byte_Variable_1) == 0x000002, "Member 'BP_MainMenu_C_SetContinueBtnState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_SetContinueBtnState, CallFunc_HasValidSaveGameSlot_ReturnValue) == 0x000003, "Member 'BP_MainMenu_C_SetContinueBtnState::CallFunc_HasValidSaveGameSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_SetContinueBtnState, K2Node_Select_Default) == 0x000004, "Member 'BP_MainMenu_C_SetContinueBtnState::K2Node_Select_Default' has a wrong offset!");

// Function BP_MainMenu.BP_MainMenu_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_MainMenu_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainMenu_C_Tick) == 0x000004, "Wrong alignment on BP_MainMenu_C_Tick");
static_assert(sizeof(BP_MainMenu_C_Tick) == 0x00003C, "Wrong size on BP_MainMenu_C_Tick");
static_assert(offsetof(BP_MainMenu_C_Tick, MyGeometry) == 0x000000, "Member 'BP_MainMenu_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_MainMenu_C_Tick::InDeltaTime' has a wrong offset!");

// Function BP_MainMenu.BP_MainMenu_C.OnShow
// 0x0004 (0x0004 - 0x0000)
struct BP_MainMenu_C_OnShow final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainMenu_C_OnShow) == 0x000004, "Wrong alignment on BP_MainMenu_C_OnShow");
static_assert(sizeof(BP_MainMenu_C_OnShow) == 0x000004, "Wrong size on BP_MainMenu_C_OnShow");
static_assert(offsetof(BP_MainMenu_C_OnShow, AnimDuration) == 0x000000, "Member 'BP_MainMenu_C_OnShow::AnimDuration' has a wrong offset!");

// Function BP_MainMenu.BP_MainMenu_C.OnHide
// 0x0004 (0x0004 - 0x0000)
struct BP_MainMenu_C_OnHide final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainMenu_C_OnHide) == 0x000004, "Wrong alignment on BP_MainMenu_C_OnHide");
static_assert(sizeof(BP_MainMenu_C_OnHide) == 0x000004, "Wrong size on BP_MainMenu_C_OnHide");
static_assert(offsetof(BP_MainMenu_C_OnHide, AnimDuration) == 0x000000, "Member 'BP_MainMenu_C_OnHide::AnimDuration' has a wrong offset!");

// Function BP_MainMenu.BP_MainMenu_C.ExecuteUbergraph_BP_MainMenu
// 0x0120 (0x0120 - 0x0000)
struct BP_MainMenu_C_ExecuteUbergraph_BP_MainMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(class UManUserWidgetBase* ManUserWidgetBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0028(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x003C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration_1;                       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue;         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration;                         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue_1;       // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsConsole_ReturnValue;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsXbox_ReturnValue;                       // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManGameInstance*                       K2Node_DynamicCast_AsMan_Game_Instance;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManUserWidgetBase*                     CallFunc_ShowManUserWidgetByZorder_ReturnValue;    // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManUserWidgetBase*                     K2Node_CustomEvent_ManUserWidgetBase;              // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCreditsUserWidget*                     CallFunc_GetCreditsUserWidget_ReturnValue;         // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCreditsUserWidget*                     CallFunc_GetCreditsUserWidget_ReturnValue_1;       // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_103[0x5];                                      // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UManUserWidgetBase*                     CallFunc_ShowManUserWidgetByZorder_ReturnValue_1;  // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManUserWidgetBase*                     CallFunc_ShowManUserWidgetByZorder_ReturnValue_2;  // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MainMenu_C_ExecuteUbergraph_BP_MainMenu) == 0x000008, "Wrong alignment on BP_MainMenu_C_ExecuteUbergraph_BP_MainMenu");
static_assert(sizeof(BP_MainMenu_C_ExecuteUbergraph_BP_MainMenu) == 0x000120, "Wrong size on BP_MainMenu_C_ExecuteUbergraph_BP_MainMenu");
static_assert(offsetof(BP_MainMenu_C_ExecuteUbergraph_BP_MainMenu, EntryPoint) == 0x000000, "Member 'BP_MainMenu_C_ExecuteUbergraph_BP_MainMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_ExecuteUbergraph_BP_MainMenu, Temp_delegate_Variable) == 0x000004, "Member 'BP_MainMenu_C_ExecuteUbergraph_BP_MainMenu::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_MainMenu_C_ExecuteUbergraph_BP_MainMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_MainMenu_C_ExecuteUbergraph_BP_MainMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
