#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapLegendObject

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_MapLegendObject.BP_MapLegendObject_C
// 0x0018 (0x02C8 - 0x02B0)
class UBP_MapLegendObject_C final : public UMapLegendObjectUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Icon;                                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MapLegendObject(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MapLegendObject_C">();
	}
	static class UBP_MapLegendObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MapLegendObject_C>();
	}
};
static_assert(alignof(UBP_MapLegendObject_C) == 0x000008, "Wrong alignment on UBP_MapLegendObject_C");
static_assert(sizeof(UBP_MapLegendObject_C) == 0x0002C8, "Wrong size on UBP_MapLegendObject_C");
static_assert(offsetof(UBP_MapLegendObject_C, UberGraphFrame) == 0x0002B0, "Member 'UBP_MapLegendObject_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_MapLegendObject_C, Icon) == 0x0002B8, "Member 'UBP_MapLegendObject_C::Icon' has a wrong offset!");
static_assert(offsetof(UBP_MapLegendObject_C, Name_0) == 0x0002C0, "Member 'UBP_MapLegendObject_C::Name_0' has a wrong offset!");

}

