#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MainMenu_Background

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_MainMenu_Background.BP_MainMenu_Background_C
// 0x0048 (0x04F8 - 0x04B0)
class UBP_MainMenu_Background_C final : public UManScaledUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutTextsAnim;                                  // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInTextsAnim;                                   // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Background_A;                                      // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Background_B;                                      // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Background_C;                                      // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             VersionText;                                       // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MainMenu_Background(int32 EntryPoint);
	void OnShow(float AnimDuration);
	void OnHide(float AnimDuration);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MainMenu_Background_C">();
	}
	static class UBP_MainMenu_Background_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MainMenu_Background_C>();
	}
};
static_assert(alignof(UBP_MainMenu_Background_C) == 0x000008, "Wrong alignment on UBP_MainMenu_Background_C");
static_assert(sizeof(UBP_MainMenu_Background_C) == 0x0004F8, "Wrong size on UBP_MainMenu_Background_C");
static_assert(offsetof(UBP_MainMenu_Background_C, UberGraphFrame) == 0x0004B0, "Member 'UBP_MainMenu_Background_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Background_C, FadeOutTextsAnim) == 0x0004B8, "Member 'UBP_MainMenu_Background_C::FadeOutTextsAnim' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Background_C, FadeInTextsAnim) == 0x0004C0, "Member 'UBP_MainMenu_Background_C::FadeInTextsAnim' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Background_C, FadeOutAnim) == 0x0004C8, "Member 'UBP_MainMenu_Background_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Background_C, FadeInAnim) == 0x0004D0, "Member 'UBP_MainMenu_Background_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Background_C, Background_A) == 0x0004D8, "Member 'UBP_MainMenu_Background_C::Background_A' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Background_C, Background_B) == 0x0004E0, "Member 'UBP_MainMenu_Background_C::Background_B' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Background_C, Background_C) == 0x0004E8, "Member 'UBP_MainMenu_Background_C::Background_C' has a wrong offset!");
static_assert(offsetof(UBP_MainMenu_Background_C, VersionText) == 0x0004F0, "Member 'UBP_MainMenu_Background_C::VersionText' has a wrong offset!");

}

