#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NewAreaWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_NewAreaWindow.BP_NewAreaWindow_C
// 0x0068 (0x0578 - 0x0510)
class UBP_NewAreaWindow_C final : public UHUDPopupUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 DecorLeft;                                         // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DecorRight;                                        // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DecorUnder;                                        // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconImage;                                         // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NameText;                                          // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleText;                                         // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             Icon;                                              // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             IconHighlight;                                     // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              AreaNameSound;                                     // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_NewAreaWindow(int32 EntryPoint);
	void OnSetData(const struct FHUDPopupQueue& InHUDPopupQueue);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void OnShow(float AnimDuration);
	void OnHide(float AnimDuration);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NewAreaWindow_C">();
	}
	static class UBP_NewAreaWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_NewAreaWindow_C>();
	}
};
static_assert(alignof(UBP_NewAreaWindow_C) == 0x000008, "Wrong alignment on UBP_NewAreaWindow_C");
static_assert(sizeof(UBP_NewAreaWindow_C) == 0x000578, "Wrong size on UBP_NewAreaWindow_C");
static_assert(offsetof(UBP_NewAreaWindow_C, UberGraphFrame) == 0x000510, "Member 'UBP_NewAreaWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_NewAreaWindow_C, FadeOutAnim) == 0x000518, "Member 'UBP_NewAreaWindow_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_NewAreaWindow_C, FadeInAnim) == 0x000520, "Member 'UBP_NewAreaWindow_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_NewAreaWindow_C, DecorLeft) == 0x000528, "Member 'UBP_NewAreaWindow_C::DecorLeft' has a wrong offset!");
static_assert(offsetof(UBP_NewAreaWindow_C, DecorRight) == 0x000530, "Member 'UBP_NewAreaWindow_C::DecorRight' has a wrong offset!");
static_assert(offsetof(UBP_NewAreaWindow_C, DecorUnder) == 0x000538, "Member 'UBP_NewAreaWindow_C::DecorUnder' has a wrong offset!");
static_assert(offsetof(UBP_NewAreaWindow_C, Frame) == 0x000540, "Member 'UBP_NewAreaWindow_C::Frame' has a wrong offset!");
static_assert(offsetof(UBP_NewAreaWindow_C, IconImage) == 0x000548, "Member 'UBP_NewAreaWindow_C::IconImage' has a wrong offset!");
static_assert(offsetof(UBP_NewAreaWindow_C, NameText) == 0x000550, "Member 'UBP_NewAreaWindow_C::NameText' has a wrong offset!");
static_assert(offsetof(UBP_NewAreaWindow_C, TitleText) == 0x000558, "Member 'UBP_NewAreaWindow_C::TitleText' has a wrong offset!");
static_assert(offsetof(UBP_NewAreaWindow_C, Icon) == 0x000560, "Member 'UBP_NewAreaWindow_C::Icon' has a wrong offset!");
static_assert(offsetof(UBP_NewAreaWindow_C, IconHighlight) == 0x000568, "Member 'UBP_NewAreaWindow_C::IconHighlight' has a wrong offset!");
static_assert(offsetof(UBP_NewAreaWindow_C, AreaNameSound) == 0x000570, "Member 'UBP_NewAreaWindow_C::AreaNameSound' has a wrong offset!");

}

