#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_Bestiary_FilterSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_NPC_Bestiary_FilterSlot.BP_NPC_Bestiary_FilterSlot_C
// 0x00D0 (0x0338 - 0x0268)
class UBP_NPC_Bestiary_FilterSlot_C final : public UNPCBestiaryFilterSlotUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SelectedAnim;                                      // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                ButtonFrame;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Disabled1;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Normal;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Over1;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Sel1;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NewRegistryIcon;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_19;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWidget* WidgetReference)> OnHovered;                                         // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWidget* WidgetReference)> OnUnhovered;                                       // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UNPCBestiaryFilterSlotUserWidget* WidgetReference, EBestiaryCategory BestiaryCategoryFilter)> OnClicked;                                         // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWidget* WidgetReference)> OnFocus;                                           // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWidget* WidgetReference)> OnPressed;                                         // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWidget* WidgetReference)> OnReleased;                                        // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UTexture2D*                             Frame_up;                                          // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             Frame_sel;                                         // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             Frame_over;                                        // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             Frame_Disabled;                                    // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_NPC_Bestiary_FilterSlot(int32 EntryPoint);
	void OnToggleNewRegistry(bool bInVisible);
	void OnSetSelected(bool bInSelected, bool bAnimate);
	void OnSetEnabled(bool bInEnabled);
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void Init();
	void SetSelected(bool InSelected);
	void SetEnabled(bool InIsEnabled);
	void ToggleNewRegistry(bool InVisible, bool InAnimate);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NPC_Bestiary_FilterSlot_C">();
	}
	static class UBP_NPC_Bestiary_FilterSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_NPC_Bestiary_FilterSlot_C>();
	}
};
static_assert(alignof(UBP_NPC_Bestiary_FilterSlot_C) == 0x000008, "Wrong alignment on UBP_NPC_Bestiary_FilterSlot_C");
static_assert(sizeof(UBP_NPC_Bestiary_FilterSlot_C) == 0x000338, "Wrong size on UBP_NPC_Bestiary_FilterSlot_C");
static_assert(offsetof(UBP_NPC_Bestiary_FilterSlot_C, UberGraphFrame) == 0x000268, "Member 'UBP_NPC_Bestiary_FilterSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_NPC_Bestiary_FilterSlot_C, HoverAnim) == 0x000270, "Member 'UBP_NPC_Bestiary_FilterSlot_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UBP_NPC_Bestiary_FilterSlot_C, SelectedAnim) == 0x000278, "Member 'UBP_NPC_Bestiary_FilterSlot_C::SelectedAnim' has a wrong offset!");
static_assert(offsetof(UBP_NPC_Bestiary_FilterSlot_C, ButtonFrame) == 0x000280, "Member 'UBP_NPC_Bestiary_FilterSlot_C::ButtonFrame' has a wrong offset!");
static_assert(offsetof(UBP_NPC_Bestiary_FilterSlot_C, Frame_Disabled1) == 0x000288, "Member 'UBP_NPC_Bestiary_FilterSlot_C::Frame_Disabled1' has a wrong offset!");
static_assert(offsetof(UBP_NPC_Bestiary_FilterSlot_C, Frame_Normal) == 0x000290, "Member 'UBP_NPC_Bestiary_FilterSlot_C::Frame_Normal' has a wrong offset!");
static_assert(offsetof(UBP_NPC_Bestiary_FilterSlot_C, Frame_Over1) == 0x000298, "Member 'UBP_NPC_Bestiary_FilterSlot_C::Frame_Over1' has a wrong offset!");
static_assert(offsetof(UBP_NPC_Bestiary_FilterSlot_C, Frame_Sel1) == 0x0002A0, "Member 'UBP_NPC_Bestiary_FilterSlot_C::Frame_Sel1' has a wrong offset!");
static_assert(offsetof(UBP_NPC_Bestiary_FilterSlot_C, NewRegistryIcon) == 0x0002A8, "Member 'UBP_NPC_Bestiary_FilterSlot_C::NewRegistryIcon' has a wrong offset!");
static_assert(offsetof(UBP_NPC_Bestiary_FilterSlot_C, Overlay_19) == 0x0002B0, "Member 'UBP_NPC_Bestiary_FilterSlot_C::Overlay_19' has a wrong offset!");
static_assert(offsetof(UBP_NPC_Bestiary_FilterSlot_C, OnHovered) == 0x0002B8, "Member 'UBP_NPC_Bestiary_FilterSlot_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UBP_NPC_Bestiary_FilterSlot_C, OnUnhovered) == 0x0002C8, "Member 'UBP_NPC_Bestiary_FilterSlot_C::OnUnhovered' has a wrong offset!");
static_assert(offsetof(UBP_NPC_Bestiary_FilterSlot_C, OnClicked) == 0x0002D8, "Member 'UBP_NPC_Bestiary_FilterSlot_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UBP_NPC_Bestiary_FilterSlot_C, OnFocus) == 0x0002E8, "Member 'UBP_NPC_Bestiary_FilterSlot_C::OnFocus' has a wrong offset!");
static_assert(offsetof(UBP_NPC_Bestiary_FilterSlot_C, OnPressed) == 0x0002F8, "Member 'UBP_NPC_Bestiary_FilterSlot_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UBP_NPC_Bestiary_FilterSlot_C, OnReleased) == 0x000308, "Member 'UBP_NPC_Bestiary_FilterSlot_C::OnReleased' has a wrong offset!");
static_assert(offsetof(UBP_NPC_Bestiary_FilterSlot_C, Frame_up) == 0x000318, "Member 'UBP_NPC_Bestiary_FilterSlot_C::Frame_up' has a wrong offset!");
static_assert(offsetof(UBP_NPC_Bestiary_FilterSlot_C, Frame_sel) == 0x000320, "Member 'UBP_NPC_Bestiary_FilterSlot_C::Frame_sel' has a wrong offset!");
static_assert(offsetof(UBP_NPC_Bestiary_FilterSlot_C, Frame_over) == 0x000328, "Member 'UBP_NPC_Bestiary_FilterSlot_C::Frame_over' has a wrong offset!");
static_assert(offsetof(UBP_NPC_Bestiary_FilterSlot_C, Frame_Disabled) == 0x000330, "Member 'UBP_NPC_Bestiary_FilterSlot_C::Frame_Disabled' has a wrong offset!");

}

