#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPCHorseTailor_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_NPCHorseTailor_Anim.BP_NPCHorseTailor_Anim_C.ExecuteUbergraph_BP_NPCHorseTailor_Anim
// 0x0048 (0x0048 - 0x0000)
struct BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_1;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_2;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim) == 0x000004, "Wrong alignment on BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim");
static_assert(sizeof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim) == 0x000048, "Wrong size on BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, EntryPoint) == 0x000000, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_GetCurveValue_ReturnValue) == 0x000004, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_GetCurveValue_ReturnValue_1) == 0x000008, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_GetCurveValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_Less_FloatFloat_ReturnValue) == 0x00000D, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_BooleanAND_ReturnValue) == 0x00000E, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_IsValid_ReturnValue) == 0x00000F, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_BooleanAND_ReturnValue_1) == 0x000011, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_BooleanAND_ReturnValue_2) == 0x000012, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000014, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1) == 0x00001C, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000020, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2) == 0x000024, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_2) == 0x000028, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_BooleanAND_ReturnValue_3) == 0x000029, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3) == 0x00002C, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_Not_PreBool_ReturnValue_1) == 0x000030, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000031, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_BooleanAND_ReturnValue_4) == 0x000032, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000033, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_BooleanAND_ReturnValue_5) == 0x000034, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000035, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_BooleanAND_ReturnValue_6) == 0x000036, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000037, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_Not_PreBool_ReturnValue_2) == 0x000038, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_BooleanAND_ReturnValue_7) == 0x000039, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_BooleanAND_ReturnValue_8) == 0x00003A, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_BooleanAND_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4) == 0x00003C, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, K2Node_Event_DeltaTimeX) == 0x000040, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim, CallFunc_Less_FloatFloat_ReturnValue_2) == 0x000044, "Member 'BP_NPCHorseTailor_Anim_C_ExecuteUbergraph_BP_NPCHorseTailor_Anim::CallFunc_Less_FloatFloat_ReturnValue_2' has a wrong offset!");

// Function BP_NPCHorseTailor_Anim.BP_NPCHorseTailor_Anim_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct BP_NPCHorseTailor_Anim_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPCHorseTailor_Anim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on BP_NPCHorseTailor_Anim_C_BlueprintUpdateAnimation");
static_assert(sizeof(BP_NPCHorseTailor_Anim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on BP_NPCHorseTailor_Anim_C_BlueprintUpdateAnimation");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'BP_NPCHorseTailor_Anim_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function BP_NPCHorseTailor_Anim.BP_NPCHorseTailor_Anim_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct BP_NPCHorseTailor_Anim_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BP_NPCHorseTailor_Anim_C_AnimGraph) == 0x000008, "Wrong alignment on BP_NPCHorseTailor_Anim_C_AnimGraph");
static_assert(sizeof(BP_NPCHorseTailor_Anim_C_AnimGraph) == 0x000010, "Wrong size on BP_NPCHorseTailor_Anim_C_AnimGraph");
static_assert(offsetof(BP_NPCHorseTailor_Anim_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'BP_NPCHorseTailor_Anim_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

