#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NewGame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_NewGame.BP_NewGame_C
// 0x0090 (0x0550 - 0x04C0)
class UBP_NewGame_C final : public UNewGameUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur;                                    // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_UserLoginNotification_C*            BP_UserLoginNotification;                          // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CloseButton_C*                      BtnClose;                                          // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyA;                                        // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyB;                                        // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Buttons;                                           // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas;                                            // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_NewGame_Slot_C*                     NewGameSlot0;                                      // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_NewGame_Slot_C*                     NewGameSlot1;                                      // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_NewGame_Slot_C*                     NewGameSlot2;                                      // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_NewGame_Slot_C*                     NewGameSlot3;                                      // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManWrapBox*                            NewGameSlotsList;                                  // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScreenBg2;                                         // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManRichTextBlock*                      Title;                                             // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Window;                                            // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetBtnCloseVisibility();
	void BtnHotkeyAClicked();
	void BtnHotkeyBClicked();
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnShow(float AnimDuration);
	void OnHide(float AnimDuration);
	void BndEvt__BtnHotkeyB_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void OnGamepadBEvent();
	void BndEvt__BtnHotkeyA_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();
	void OnGamepadAEvent();
	void BndEvt__BP_NewGame_BtnClose_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void OnSetInputDisplay(EInputDisplay InInputDisplay, EInputDisplay InControlDisplay);
	void ExecuteUbergraph_BP_NewGame(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NewGame_C">();
	}
	static class UBP_NewGame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_NewGame_C>();
	}
};
static_assert(alignof(UBP_NewGame_C) == 0x000008, "Wrong alignment on UBP_NewGame_C");
static_assert(sizeof(UBP_NewGame_C) == 0x000550, "Wrong size on UBP_NewGame_C");
static_assert(offsetof(UBP_NewGame_C, UberGraphFrame) == 0x0004C0, "Member 'UBP_NewGame_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_NewGame_C, FadeOutAnim) == 0x0004C8, "Member 'UBP_NewGame_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_NewGame_C, FadeInAnim) == 0x0004D0, "Member 'UBP_NewGame_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_NewGame_C, BackgroundBlur) == 0x0004D8, "Member 'UBP_NewGame_C::BackgroundBlur' has a wrong offset!");
static_assert(offsetof(UBP_NewGame_C, BP_UserLoginNotification) == 0x0004E0, "Member 'UBP_NewGame_C::BP_UserLoginNotification' has a wrong offset!");
static_assert(offsetof(UBP_NewGame_C, BtnClose) == 0x0004E8, "Member 'UBP_NewGame_C::BtnClose' has a wrong offset!");
static_assert(offsetof(UBP_NewGame_C, BtnHotkeyA) == 0x0004F0, "Member 'UBP_NewGame_C::BtnHotkeyA' has a wrong offset!");
static_assert(offsetof(UBP_NewGame_C, BtnHotkeyB) == 0x0004F8, "Member 'UBP_NewGame_C::BtnHotkeyB' has a wrong offset!");
static_assert(offsetof(UBP_NewGame_C, Buttons) == 0x000500, "Member 'UBP_NewGame_C::Buttons' has a wrong offset!");
static_assert(offsetof(UBP_NewGame_C, Canvas) == 0x000508, "Member 'UBP_NewGame_C::Canvas' has a wrong offset!");
static_assert(offsetof(UBP_NewGame_C, NewGameSlot0) == 0x000510, "Member 'UBP_NewGame_C::NewGameSlot0' has a wrong offset!");
static_assert(offsetof(UBP_NewGame_C, NewGameSlot1) == 0x000518, "Member 'UBP_NewGame_C::NewGameSlot1' has a wrong offset!");
static_assert(offsetof(UBP_NewGame_C, NewGameSlot2) == 0x000520, "Member 'UBP_NewGame_C::NewGameSlot2' has a wrong offset!");
static_assert(offsetof(UBP_NewGame_C, NewGameSlot3) == 0x000528, "Member 'UBP_NewGame_C::NewGameSlot3' has a wrong offset!");
static_assert(offsetof(UBP_NewGame_C, NewGameSlotsList) == 0x000530, "Member 'UBP_NewGame_C::NewGameSlotsList' has a wrong offset!");
static_assert(offsetof(UBP_NewGame_C, ScreenBg2) == 0x000538, "Member 'UBP_NewGame_C::ScreenBg2' has a wrong offset!");
static_assert(offsetof(UBP_NewGame_C, Title) == 0x000540, "Member 'UBP_NewGame_C::Title' has a wrong offset!");
static_assert(offsetof(UBP_NewGame_C, Window) == 0x000548, "Member 'UBP_NewGame_C::Window' has a wrong offset!");

}

