#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPCAdventurer_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_NPCAdventurer_Anim.BP_NPCAdventurer_Anim_C
// 0x1F50 (0x2640 - 0x06F0)
class UBP_NPCAdventurer_Anim_C final : public UNpcAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06F8(0x0030)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x0728(0x00A8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x07D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x07F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x0820(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x0848(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x0870(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x0898(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x08C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x08E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x0910(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x0938(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x0960(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x0988(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x09B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x09D8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x0A00(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0x0A80(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x0AB0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x0B30(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x0B60(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x0BE0(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_7;                  // 0x0C10(0x00E8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_6;                     // 0x0CF8(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x0DC0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x0E40(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_6;                  // 0x0E70(0x00E8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_5;                     // 0x0F58(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x1020(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x10A0(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_5;                  // 0x10D0(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x11B8(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x1260(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x12E0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x1310(0x00B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x13C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x13E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x1410(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x1438(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x1460(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x1488(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x14B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x14D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x1500(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x1528(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x1550(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0x1578(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_4;                  // 0x1640(0x00E8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x1728(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x17A8(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x17D8(0x00E8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0x18C0(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x1988(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x1A08(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x1A38(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x1AB8(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x1AE8(0x00E8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x1BD0(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x1C98(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x1D18(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x1D48(0x00E8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x1E30(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x1EF8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x1F78(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1FA8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x2028(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x2058(0x00B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x2108(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x2130(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x2158(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x2180(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x21A8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x21D0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x2250(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x2280(0x00E8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x2368(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x2430(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x24B0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x24E0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x2560(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x2590(0x00B0)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_NPCAdventurer_Anim_AnimGraphNode_TransitionResult_684DAF624A4605BA9DB0DEA65C9EE29C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_NPCAdventurer_Anim_AnimGraphNode_TransitionResult_9D9EB7C944B4147D04DDCCAE6DD8863C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_NPCAdventurer_Anim_AnimGraphNode_TransitionResult_52C672C946D5311F9F469DB651E0D217();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_NPCAdventurer_Anim_AnimGraphNode_TransitionResult_97002C694719041E727ACAB03D21D849();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_NPCAdventurer_Anim_AnimGraphNode_TransitionResult_F5394300473CE16CD0AF4B873857F4D8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_NPCAdventurer_Anim_AnimGraphNode_TransitionResult_8FB4284B40254EC2886864AD9F60E813();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_NPCAdventurer_Anim_AnimGraphNode_TransitionResult_21F23702472D09CD412F5FA2BB2E8F59();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_NPCAdventurer_Anim_AnimGraphNode_TransitionResult_1D718DAF446F5DCBFB54648F7ED64C0F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_NPCAdventurer_Anim_AnimGraphNode_TransitionResult_F5A7C9D7493DCCA46D77AFBC7E3C7FCD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_NPCAdventurer_Anim_AnimGraphNode_TransitionResult_294DBFA7451FFC539B133A800E41439F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_NPCAdventurer_Anim_AnimGraphNode_TransitionResult_39A391314130BE7215DE88943A2D8B5B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_NPCAdventurer_Anim_AnimGraphNode_TransitionResult_BA9F6CAD40695EF547EBFCAC46A0A978();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_NPCAdventurer_Anim_AnimGraphNode_TransitionResult_E3EE041E402C2C94040B8AB33D0B13DE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_NPCAdventurer_Anim_AnimGraphNode_TransitionResult_7E5B70124694E05E98EDB0B6A69E639D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_NPCAdventurer_Anim_AnimGraphNode_TransitionResult_BC2B368247C74E32E519F18295C72501();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_NPCAdventurer_Anim_AnimGraphNode_TransitionResult_017FF59245B2F8820A503F99BBDF361F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_NPCAdventurer_Anim_AnimGraphNode_TransitionResult_F68C04774FFCB718C62648A8182296AE();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_NPCAdventurer_Anim_AnimGraphNode_TransitionResult_6054C5E542DABF028C5661A218349E18();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_NPCAdventurer_Anim_AnimGraphNode_TransitionResult_389A0678440C4F76A3BBF9B0F6A5A4A6();
	void ExecuteUbergraph_BP_NPCAdventurer_Anim(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NPCAdventurer_Anim_C">();
	}
	static class UBP_NPCAdventurer_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_NPCAdventurer_Anim_C>();
	}
};
static_assert(alignof(UBP_NPCAdventurer_Anim_C) == 0x000010, "Wrong alignment on UBP_NPCAdventurer_Anim_C");
static_assert(sizeof(UBP_NPCAdventurer_Anim_C) == 0x002640, "Wrong size on UBP_NPCAdventurer_Anim_C");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, UberGraphFrame) == 0x0006F0, "Member 'UBP_NPCAdventurer_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_Root) == 0x0006F8, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_BlendListByInt) == 0x000728, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_29) == 0x0007D0, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_29' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_28) == 0x0007F8, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_28' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_27) == 0x000820, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_27' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_26) == 0x000848, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_26' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_25) == 0x000870, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_25' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_24) == 0x000898, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_24' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_23) == 0x0008C0, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_23' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_22) == 0x0008E8, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_22' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_21) == 0x000910, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_21' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_20) == 0x000938, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_20' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_19) == 0x000960, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_19' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_18) == 0x000988, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_18' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_17) == 0x0009B0, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_17' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_16) == 0x0009D8, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_16' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_SequencePlayer_14) == 0x000A00, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_SequencePlayer_14' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_StateResult_14) == 0x000A80, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_StateResult_14' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_SequencePlayer_13) == 0x000AB0, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_SequencePlayer_13' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_StateResult_13) == 0x000B30, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_StateResult_13' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_SequencePlayer_12) == 0x000B60, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_SequencePlayer_12' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_StateResult_12) == 0x000BE0, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_StateResult_12' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_BlendSpacePlayer_7) == 0x000C10, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_BlendSpacePlayer_7' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_ApplyAdditive_6) == 0x000CF8, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_ApplyAdditive_6' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_SequencePlayer_11) == 0x000DC0, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_SequencePlayer_11' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_StateResult_11) == 0x000E40, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_StateResult_11' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_BlendSpacePlayer_6) == 0x000E70, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_BlendSpacePlayer_6' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_ApplyAdditive_5) == 0x000F58, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_ApplyAdditive_5' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_SequencePlayer_10) == 0x001020, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_StateResult_10) == 0x0010A0, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_StateResult_10' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_BlendSpacePlayer_5) == 0x0010D0, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_BlendSpacePlayer_5' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_BlendListByBool) == 0x0011B8, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_SequencePlayer_9) == 0x001260, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_StateResult_9) == 0x0012E0, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_StateResult_9' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_StateMachine_2) == 0x001310, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_StateMachine_2' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_15) == 0x0013C0, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_15' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_14) == 0x0013E8, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_14' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_13) == 0x001410, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_13' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_12) == 0x001438, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_12' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_11) == 0x001460, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_11' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_10) == 0x001488, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_9) == 0x0014B0, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_8) == 0x0014D8, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_7) == 0x001500, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_6) == 0x001528, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_5) == 0x001550, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_ApplyAdditive_4) == 0x001578, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_ApplyAdditive_4' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_BlendSpacePlayer_4) == 0x001640, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_BlendSpacePlayer_4' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_SequencePlayer_8) == 0x001728, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_StateResult_8) == 0x0017A8, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_StateResult_8' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_BlendSpacePlayer_3) == 0x0017D8, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_BlendSpacePlayer_3' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_ApplyAdditive_3) == 0x0018C0, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_ApplyAdditive_3' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_SequencePlayer_7) == 0x001988, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_StateResult_7) == 0x001A08, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_StateResult_7' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_SequencePlayer_6) == 0x001A38, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_StateResult_6) == 0x001AB8, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_BlendSpacePlayer_2) == 0x001AE8, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_BlendSpacePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_ApplyAdditive_2) == 0x001BD0, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_ApplyAdditive_2' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_SequencePlayer_5) == 0x001C98, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_StateResult_5) == 0x001D18, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_BlendSpacePlayer_1) == 0x001D48, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_ApplyAdditive_1) == 0x001E30, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_SequencePlayer_4) == 0x001EF8, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_StateResult_4) == 0x001F78, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_SequencePlayer_3) == 0x001FA8, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_StateResult_3) == 0x002028, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_StateMachine_1) == 0x002058, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_4) == 0x002108, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_3) == 0x002130, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_2) == 0x002158, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult_1) == 0x002180, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_TransitionResult) == 0x0021A8, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_SequencePlayer_2) == 0x0021D0, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_StateResult_2) == 0x002250, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_BlendSpacePlayer) == 0x002280, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_ApplyAdditive) == 0x002368, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_SequencePlayer_1) == 0x002430, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_StateResult_1) == 0x0024B0, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_SequencePlayer) == 0x0024E0, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_StateResult) == 0x002560, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UBP_NPCAdventurer_Anim_C, AnimGraphNode_StateMachine) == 0x002590, "Member 'UBP_NPCAdventurer_Anim_C::AnimGraphNode_StateMachine' has a wrong offset!");

}

