#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPCLittleGirl_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_NPCLittleGirl_Anim.BP_NPCLittleGirl_Anim_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct BP_NPCLittleGirl_Anim_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BP_NPCLittleGirl_Anim_C_AnimGraph) == 0x000008, "Wrong alignment on BP_NPCLittleGirl_Anim_C_AnimGraph");
static_assert(sizeof(BP_NPCLittleGirl_Anim_C_AnimGraph) == 0x000010, "Wrong size on BP_NPCLittleGirl_Anim_C_AnimGraph");
static_assert(offsetof(BP_NPCLittleGirl_Anim_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'BP_NPCLittleGirl_Anim_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function BP_NPCLittleGirl_Anim.BP_NPCLittleGirl_Anim_C.ExecuteUbergraph_BP_NPCLittleGirl_Anim
// 0x0030 (0x0030 - 0x0000)
struct BP_NPCLittleGirl_Anim_C_ExecuteUbergraph_BP_NPCLittleGirl_Anim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LittleGirl_C*                       K2Node_DynamicCast_AsBP_Little_Girl;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_LittleGirl_C*                       K2Node_DynamicCast_AsBP_Little_Girl_1;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPCLittleGirl_Anim_C_ExecuteUbergraph_BP_NPCLittleGirl_Anim) == 0x000008, "Wrong alignment on BP_NPCLittleGirl_Anim_C_ExecuteUbergraph_BP_NPCLittleGirl_Anim");
static_assert(sizeof(BP_NPCLittleGirl_Anim_C_ExecuteUbergraph_BP_NPCLittleGirl_Anim) == 0x000030, "Wrong size on BP_NPCLittleGirl_Anim_C_ExecuteUbergraph_BP_NPCLittleGirl_Anim");
static_assert(offsetof(BP_NPCLittleGirl_Anim_C_ExecuteUbergraph_BP_NPCLittleGirl_Anim, EntryPoint) == 0x000000, "Member 'BP_NPCLittleGirl_Anim_C_ExecuteUbergraph_BP_NPCLittleGirl_Anim::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NPCLittleGirl_Anim_C_ExecuteUbergraph_BP_NPCLittleGirl_Anim, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'BP_NPCLittleGirl_Anim_C_ExecuteUbergraph_BP_NPCLittleGirl_Anim::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCLittleGirl_Anim_C_ExecuteUbergraph_BP_NPCLittleGirl_Anim, K2Node_DynamicCast_AsBP_Little_Girl) == 0x000010, "Member 'BP_NPCLittleGirl_Anim_C_ExecuteUbergraph_BP_NPCLittleGirl_Anim::K2Node_DynamicCast_AsBP_Little_Girl' has a wrong offset!");
static_assert(offsetof(BP_NPCLittleGirl_Anim_C_ExecuteUbergraph_BP_NPCLittleGirl_Anim, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_NPCLittleGirl_Anim_C_ExecuteUbergraph_BP_NPCLittleGirl_Anim::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NPCLittleGirl_Anim_C_ExecuteUbergraph_BP_NPCLittleGirl_Anim, K2Node_DynamicCast_AsBP_Little_Girl_1) == 0x000020, "Member 'BP_NPCLittleGirl_Anim_C_ExecuteUbergraph_BP_NPCLittleGirl_Anim::K2Node_DynamicCast_AsBP_Little_Girl_1' has a wrong offset!");
static_assert(offsetof(BP_NPCLittleGirl_Anim_C_ExecuteUbergraph_BP_NPCLittleGirl_Anim, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'BP_NPCLittleGirl_Anim_C_ExecuteUbergraph_BP_NPCLittleGirl_Anim::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

