#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NewItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_NewItem.BP_NewItem_C.ExecuteUbergraph_BP_NewItem
// 0x00F0 (0x00F0 - 0x0000)
struct BP_NewItem_C_ExecuteUbergraph_BP_NewItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x002C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PickupNotification_C*               K2Node_DynamicCast_AsBP_Pickup_Notification;       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x005C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration_1;                       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration;                         // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue;         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue_1;       // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x00C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PickupNotification_C*               K2Node_DynamicCast_AsBP_Pickup_Notification_1;     // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem) == 0x000008, "Wrong alignment on BP_NewItem_C_ExecuteUbergraph_BP_NewItem");
static_assert(sizeof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem) == 0x0000F0, "Wrong size on BP_NewItem_C_ExecuteUbergraph_BP_NewItem");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, EntryPoint) == 0x000000, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, CallFunc_GetAllChildren_ReturnValue) == 0x000008, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, Temp_int_Array_Index_Variable_1) == 0x000028, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, Temp_delegate_Variable) == 0x00002C, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, CallFunc_PostEvent_ReturnValue) == 0x000048, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, K2Node_DynamicCast_AsBP_Pickup_Notification) == 0x000050, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::K2Node_DynamicCast_AsBP_Pickup_Notification' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, K2Node_Event_MyGeometry) == 0x00005C, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, K2Node_Event_InDeltaTime) == 0x000094, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, K2Node_Event_AnimDuration_1) == 0x000098, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::K2Node_Event_AnimDuration_1' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, K2Node_Event_AnimDuration) == 0x00009C, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::K2Node_Event_AnimDuration' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, CallFunc_GetAnimPlaybackSpeed_ReturnValue) == 0x0000A0, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::CallFunc_GetAnimPlaybackSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, CallFunc_GetAnimPlaybackSpeed_ReturnValue_1) == 0x0000A4, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::CallFunc_GetAnimPlaybackSpeed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, CallFunc_PlayAnimation_ReturnValue) == 0x0000A8, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000B0, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, Temp_int_Loop_Counter_Variable_1) == 0x0000B8, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, CallFunc_GetAllChildren_ReturnValue_1) == 0x0000C0, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, CallFunc_Array_Get_Item_1) == 0x0000D0, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, CallFunc_Array_Length_ReturnValue_1) == 0x0000D8, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, K2Node_DynamicCast_AsBP_Pickup_Notification_1) == 0x0000E0, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::K2Node_DynamicCast_AsBP_Pickup_Notification_1' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, K2Node_DynamicCast_bSuccess_1) == 0x0000E8, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000E9, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_ExecuteUbergraph_BP_NewItem, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000EC, "Member 'BP_NewItem_C_ExecuteUbergraph_BP_NewItem::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_NewItem.BP_NewItem_C.OnHide
// 0x0004 (0x0004 - 0x0000)
struct BP_NewItem_C_OnHide final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NewItem_C_OnHide) == 0x000004, "Wrong alignment on BP_NewItem_C_OnHide");
static_assert(sizeof(BP_NewItem_C_OnHide) == 0x000004, "Wrong size on BP_NewItem_C_OnHide");
static_assert(offsetof(BP_NewItem_C_OnHide, AnimDuration) == 0x000000, "Member 'BP_NewItem_C_OnHide::AnimDuration' has a wrong offset!");

// Function BP_NewItem.BP_NewItem_C.OnShow
// 0x0004 (0x0004 - 0x0000)
struct BP_NewItem_C_OnShow final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NewItem_C_OnShow) == 0x000004, "Wrong alignment on BP_NewItem_C_OnShow");
static_assert(sizeof(BP_NewItem_C_OnShow) == 0x000004, "Wrong size on BP_NewItem_C_OnShow");
static_assert(offsetof(BP_NewItem_C_OnShow, AnimDuration) == 0x000000, "Member 'BP_NewItem_C_OnShow::AnimDuration' has a wrong offset!");

// Function BP_NewItem.BP_NewItem_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_NewItem_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NewItem_C_Tick) == 0x000004, "Wrong alignment on BP_NewItem_C_Tick");
static_assert(sizeof(BP_NewItem_C_Tick) == 0x00003C, "Wrong size on BP_NewItem_C_Tick");
static_assert(offsetof(BP_NewItem_C_Tick, MyGeometry) == 0x000000, "Member 'BP_NewItem_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_NewItem_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_NewItem_C_Tick::InDeltaTime' has a wrong offset!");

}

