#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NetherBladesProjectile

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_NetherBladesProjectile.BP_NetherBladesProjectile_C.ExecuteUbergraph_BP_NetherBladesProjectile
// 0x00A0 (0x00A0 - 0x0000)
struct BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEnemyCharacter*                        CallFunc_GetTargetEnemy_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue_1;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue_1;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetTargetRotation_ReturnValue;            // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetTargetRotation_ReturnValue_1;          // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_1;        // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_2;        // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile) == 0x000008, "Wrong alignment on BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile");
static_assert(sizeof(BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile) == 0x0000A0, "Wrong size on BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile");
static_assert(offsetof(BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile, EntryPoint) == 0x000000, "Member 'BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile, Temp_delegate_Variable) == 0x000004, "Member 'BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile, Temp_delegate_Variable_1) == 0x000014, "Member 'BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile, CallFunc_PostAkEvent_ReturnValue) == 0x000028, "Member 'BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile, CallFunc_GetTargetEnemy_ReturnValue) == 0x000030, "Member 'BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile::CallFunc_GetTargetEnemy_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000044, "Member 'BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile, CallFunc_GetManGameMode_ReturnValue) == 0x000050, "Member 'BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile::CallFunc_GetManGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile, CallFunc_FindLookAtRotation_ReturnValue) == 0x000058, "Member 'BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000064, "Member 'BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000068, "Member 'BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile, CallFunc_GetManGameMode_ReturnValue_1) == 0x000070, "Member 'BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile::CallFunc_GetManGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile, CallFunc_SpawnVisualEntity_ReturnValue_1) == 0x000078, "Member 'BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile::CallFunc_SpawnVisualEntity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile, CallFunc_GetTargetRotation_ReturnValue) == 0x000080, "Member 'BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile::CallFunc_GetTargetRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile, CallFunc_GetTargetRotation_ReturnValue_1) == 0x00008C, "Member 'BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile::CallFunc_GetTargetRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile, CallFunc_K2_SetActorRotation_ReturnValue_1) == 0x000098, "Member 'BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile::CallFunc_K2_SetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile, CallFunc_K2_SetActorRotation_ReturnValue_2) == 0x000099, "Member 'BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile::CallFunc_K2_SetActorRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile, CallFunc_PostAkEvent_ReturnValue_1) == 0x00009C, "Member 'BP_NetherBladesProjectile_C_ExecuteUbergraph_BP_NetherBladesProjectile::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");

// Function BP_NetherBladesProjectile.BP_NetherBladesProjectile_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_NetherBladesProjectile_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NetherBladesProjectile_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_NetherBladesProjectile_C_ReceiveTick");
static_assert(sizeof(BP_NetherBladesProjectile_C_ReceiveTick) == 0x000004, "Wrong size on BP_NetherBladesProjectile_C_ReceiveTick");
static_assert(offsetof(BP_NetherBladesProjectile_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_NetherBladesProjectile_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

