#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Netherwalk_Begin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Netherwalk_Begin.BP_Netherwalk_Begin_C
// 0x0018 (0x0368 - 0x0350)
class ABP_Netherwalk_Begin_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Netherwalk_Begin(int32 EntryPoint);
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Netherwalk_Begin_C">();
	}
	static class ABP_Netherwalk_Begin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Netherwalk_Begin_C>();
	}
};
static_assert(alignof(ABP_Netherwalk_Begin_C) == 0x000008, "Wrong alignment on ABP_Netherwalk_Begin_C");
static_assert(sizeof(ABP_Netherwalk_Begin_C) == 0x000368, "Wrong size on ABP_Netherwalk_Begin_C");
static_assert(offsetof(ABP_Netherwalk_Begin_C, UberGraphFrame) == 0x000350, "Member 'ABP_Netherwalk_Begin_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Netherwalk_Begin_C, Ak) == 0x000358, "Member 'ABP_Netherwalk_Begin_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_Netherwalk_Begin_C, Niagara) == 0x000360, "Member 'ABP_Netherwalk_Begin_C::Niagara' has a wrong offset!");

}

