#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_Bestiary_Button

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function BP_NPC_Bestiary_Button.BP_NPC_Bestiary_Button_C.ExecuteUbergraph_BP_NPC_Bestiary_Button
// 0x0098 (0x0098 - 0x0000)
struct BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x000C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAnimate_1;                           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bAnimate;                             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue_1;    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_InName;                               // 0x0078(0x0018)(ConstParm)
	bool                                          K2Node_Event_bInNewRegistry;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button) == 0x000008, "Wrong alignment on BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button");
static_assert(sizeof(BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button) == 0x000098, "Wrong size on BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button, EntryPoint) == 0x000000, "Member 'BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button, Temp_bool_Variable) == 0x000004, "Member 'BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button, Temp_bool_Variable_1) == 0x000005, "Member 'BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button, Temp_bool_Variable_2) == 0x000006, "Member 'BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button, Temp_byte_Variable) == 0x000007, "Member 'BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button, Temp_byte_Variable_1) == 0x000008, "Member 'BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button, K2Node_Event_IsDesignTime) == 0x000009, "Member 'BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button, K2Node_Event_MyGeometry) == 0x00000C, "Member 'BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button, K2Node_Event_InDeltaTime) == 0x000044, "Member 'BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button, K2Node_Event_bAnimate_1) == 0x000048, "Member 'BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button::K2Node_Event_bAnimate_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button, K2Node_Event_bAnimate) == 0x000049, "Member 'BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button::K2Node_Event_bAnimate' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x00004C, "Member 'BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button, CallFunc_GetAnimationCurrentTime_ReturnValue_1) == 0x000050, "Member 'BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button::CallFunc_GetAnimationCurrentTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button, CallFunc_GetEndTime_ReturnValue) == 0x000054, "Member 'BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button, CallFunc_GetEndTime_ReturnValue_1) == 0x000058, "Member 'BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button, K2Node_Select_Default) == 0x00005C, "Member 'BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button, K2Node_Select_Default_1) == 0x000060, "Member 'BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button, CallFunc_PlayAnimation_ReturnValue) == 0x000068, "Member 'BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button, CallFunc_PlayAnimation_ReturnValue_1) == 0x000070, "Member 'BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button, K2Node_Event_InName) == 0x000078, "Member 'BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button::K2Node_Event_InName' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button, K2Node_Event_bInNewRegistry) == 0x000090, "Member 'BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button::K2Node_Event_bInNewRegistry' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button, K2Node_Select_Default_2) == 0x000091, "Member 'BP_NPC_Bestiary_Button_C_ExecuteUbergraph_BP_NPC_Bestiary_Button::K2Node_Select_Default_2' has a wrong offset!");

// Function BP_NPC_Bestiary_Button.BP_NPC_Bestiary_Button_C.OnSetSlot
// 0x0020 (0x0020 - 0x0000)
struct BP_NPC_Bestiary_Button_C_OnSetSlot final
{
public:
	class FText                                   InName;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bInNewRegistry;                                    // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPC_Bestiary_Button_C_OnSetSlot) == 0x000008, "Wrong alignment on BP_NPC_Bestiary_Button_C_OnSetSlot");
static_assert(sizeof(BP_NPC_Bestiary_Button_C_OnSetSlot) == 0x000020, "Wrong size on BP_NPC_Bestiary_Button_C_OnSetSlot");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_OnSetSlot, InName) == 0x000000, "Member 'BP_NPC_Bestiary_Button_C_OnSetSlot::InName' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_OnSetSlot, bInNewRegistry) == 0x000018, "Member 'BP_NPC_Bestiary_Button_C_OnSetSlot::bInNewRegistry' has a wrong offset!");

// Function BP_NPC_Bestiary_Button.BP_NPC_Bestiary_Button_C.OnUnfocused
// 0x0001 (0x0001 - 0x0000)
struct BP_NPC_Bestiary_Button_C_OnUnfocused final
{
public:
	bool                                          bAnimate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPC_Bestiary_Button_C_OnUnfocused) == 0x000001, "Wrong alignment on BP_NPC_Bestiary_Button_C_OnUnfocused");
static_assert(sizeof(BP_NPC_Bestiary_Button_C_OnUnfocused) == 0x000001, "Wrong size on BP_NPC_Bestiary_Button_C_OnUnfocused");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_OnUnfocused, bAnimate) == 0x000000, "Member 'BP_NPC_Bestiary_Button_C_OnUnfocused::bAnimate' has a wrong offset!");

// Function BP_NPC_Bestiary_Button.BP_NPC_Bestiary_Button_C.OnFocused
// 0x0001 (0x0001 - 0x0000)
struct BP_NPC_Bestiary_Button_C_OnFocused final
{
public:
	bool                                          bAnimate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPC_Bestiary_Button_C_OnFocused) == 0x000001, "Wrong alignment on BP_NPC_Bestiary_Button_C_OnFocused");
static_assert(sizeof(BP_NPC_Bestiary_Button_C_OnFocused) == 0x000001, "Wrong size on BP_NPC_Bestiary_Button_C_OnFocused");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_OnFocused, bAnimate) == 0x000000, "Member 'BP_NPC_Bestiary_Button_C_OnFocused::bAnimate' has a wrong offset!");

// Function BP_NPC_Bestiary_Button.BP_NPC_Bestiary_Button_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_NPC_Bestiary_Button_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Bestiary_Button_C_Tick) == 0x000004, "Wrong alignment on BP_NPC_Bestiary_Button_C_Tick");
static_assert(sizeof(BP_NPC_Bestiary_Button_C_Tick) == 0x00003C, "Wrong size on BP_NPC_Bestiary_Button_C_Tick");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_Tick, MyGeometry) == 0x000000, "Member 'BP_NPC_Bestiary_Button_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_NPC_Bestiary_Button_C_Tick::InDeltaTime' has a wrong offset!");

// Function BP_NPC_Bestiary_Button.BP_NPC_Bestiary_Button_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_NPC_Bestiary_Button_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPC_Bestiary_Button_C_PreConstruct) == 0x000001, "Wrong alignment on BP_NPC_Bestiary_Button_C_PreConstruct");
static_assert(sizeof(BP_NPC_Bestiary_Button_C_PreConstruct) == 0x000001, "Wrong size on BP_NPC_Bestiary_Button_C_PreConstruct");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_NPC_Bestiary_Button_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_NPC_Bestiary_Button.BP_NPC_Bestiary_Button_C.OnPreviewKeyDown
// 0x02B8 (0x02B8 - 0x0000)
struct BP_NPC_Bestiary_Button_C_OnPreviewKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0128(0x00B8)()
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x01E0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsHotkeyKey_ReturnValue;                  // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0200(0x00B8)()
};
static_assert(alignof(BP_NPC_Bestiary_Button_C_OnPreviewKeyDown) == 0x000008, "Wrong alignment on BP_NPC_Bestiary_Button_C_OnPreviewKeyDown");
static_assert(sizeof(BP_NPC_Bestiary_Button_C_OnPreviewKeyDown) == 0x0002B8, "Wrong size on BP_NPC_Bestiary_Button_C_OnPreviewKeyDown");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_OnPreviewKeyDown, MyGeometry) == 0x000000, "Member 'BP_NPC_Bestiary_Button_C_OnPreviewKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_OnPreviewKeyDown, InKeyEvent) == 0x000038, "Member 'BP_NPC_Bestiary_Button_C_OnPreviewKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_OnPreviewKeyDown, ReturnValue) == 0x000070, "Member 'BP_NPC_Bestiary_Button_C_OnPreviewKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_OnPreviewKeyDown, CallFunc_Handled_ReturnValue) == 0x000128, "Member 'BP_NPC_Bestiary_Button_C_OnPreviewKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_OnPreviewKeyDown, CallFunc_GetKey_ReturnValue) == 0x0001E0, "Member 'BP_NPC_Bestiary_Button_C_OnPreviewKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_OnPreviewKeyDown, CallFunc_IsHotkeyKey_ReturnValue) == 0x0001F8, "Member 'BP_NPC_Bestiary_Button_C_OnPreviewKeyDown::CallFunc_IsHotkeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_OnPreviewKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000200, "Member 'BP_NPC_Bestiary_Button_C_OnPreviewKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function BP_NPC_Bestiary_Button.BP_NPC_Bestiary_Button_C.GetSeedFromCaption
// 0x0070 (0x0070 - 0x0000)
struct BP_NPC_Bestiary_Button_C_GetSeedFromCaption final
{
public:
	float                                         OutSeed1;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutSeed2;                                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Seed2;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Seed1;                                             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeToRange_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeToRange_ReturnValue_1;           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0020(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterAsNumber_ReturnValue;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterAsNumber_ReturnValue_1;       // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_2;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_3;             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Bestiary_Button_C_GetSeedFromCaption) == 0x000008, "Wrong alignment on BP_NPC_Bestiary_Button_C_GetSeedFromCaption");
static_assert(sizeof(BP_NPC_Bestiary_Button_C_GetSeedFromCaption) == 0x000070, "Wrong size on BP_NPC_Bestiary_Button_C_GetSeedFromCaption");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_GetSeedFromCaption, OutSeed1) == 0x000000, "Member 'BP_NPC_Bestiary_Button_C_GetSeedFromCaption::OutSeed1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_GetSeedFromCaption, OutSeed2) == 0x000004, "Member 'BP_NPC_Bestiary_Button_C_GetSeedFromCaption::OutSeed2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_GetSeedFromCaption, Seed2) == 0x000008, "Member 'BP_NPC_Bestiary_Button_C_GetSeedFromCaption::Seed2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_GetSeedFromCaption, Seed1) == 0x00000C, "Member 'BP_NPC_Bestiary_Button_C_GetSeedFromCaption::Seed1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_GetSeedFromCaption, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000010, "Member 'BP_NPC_Bestiary_Button_C_GetSeedFromCaption::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_GetSeedFromCaption, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000014, "Member 'BP_NPC_Bestiary_Button_C_GetSeedFromCaption::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_GetSeedFromCaption, CallFunc_NormalizeToRange_ReturnValue) == 0x000018, "Member 'BP_NPC_Bestiary_Button_C_GetSeedFromCaption::CallFunc_NormalizeToRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_GetSeedFromCaption, CallFunc_NormalizeToRange_ReturnValue_1) == 0x00001C, "Member 'BP_NPC_Bestiary_Button_C_GetSeedFromCaption::CallFunc_NormalizeToRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_GetSeedFromCaption, CallFunc_GetText_ReturnValue) == 0x000020, "Member 'BP_NPC_Bestiary_Button_C_GetSeedFromCaption::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_GetSeedFromCaption, CallFunc_Conv_TextToString_ReturnValue) == 0x000038, "Member 'BP_NPC_Bestiary_Button_C_GetSeedFromCaption::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_GetSeedFromCaption, CallFunc_GetCharacterAsNumber_ReturnValue) == 0x000048, "Member 'BP_NPC_Bestiary_Button_C_GetSeedFromCaption::CallFunc_GetCharacterAsNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_GetSeedFromCaption, CallFunc_Len_ReturnValue) == 0x00004C, "Member 'BP_NPC_Bestiary_Button_C_GetSeedFromCaption::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_GetSeedFromCaption, CallFunc_Percent_IntInt_ReturnValue) == 0x000050, "Member 'BP_NPC_Bestiary_Button_C_GetSeedFromCaption::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_GetSeedFromCaption, CallFunc_Subtract_IntInt_ReturnValue) == 0x000054, "Member 'BP_NPC_Bestiary_Button_C_GetSeedFromCaption::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_GetSeedFromCaption, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000058, "Member 'BP_NPC_Bestiary_Button_C_GetSeedFromCaption::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_GetSeedFromCaption, CallFunc_GetCharacterAsNumber_ReturnValue_1) == 0x00005C, "Member 'BP_NPC_Bestiary_Button_C_GetSeedFromCaption::CallFunc_GetCharacterAsNumber_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_GetSeedFromCaption, CallFunc_Percent_IntInt_ReturnValue_2) == 0x000060, "Member 'BP_NPC_Bestiary_Button_C_GetSeedFromCaption::CallFunc_Percent_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_GetSeedFromCaption, CallFunc_Percent_IntInt_ReturnValue_3) == 0x000064, "Member 'BP_NPC_Bestiary_Button_C_GetSeedFromCaption::CallFunc_Percent_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_GetSeedFromCaption, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'BP_NPC_Bestiary_Button_C_GetSeedFromCaption::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Bestiary_Button_C_GetSeedFromCaption, CallFunc_Add_IntInt_ReturnValue_1) == 0x00006C, "Member 'BP_NPC_Bestiary_Button_C_GetSeedFromCaption::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

}

