#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Options_Slider

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Options_Slider.BP_Options_Slider_C
// 0x00D0 (0x0430 - 0x0360)
class UBP_Options_Slider_C final : public UOptionsSliderUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HighlightAnim;                                     // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                ButtonFrame;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DisplayValueText;                                  // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Active;                                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Highlight;                                   // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Normal;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_142;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBarWidget;                                 // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManRichTextBlock*                      RichCaptionActive;                                 // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManRichTextBlock*                      RichCaptionInactive;                               // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManSlider*                             SliderWidget;                                      // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnHovered;                                         // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUnhovered;                                       // 0x03E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnReleased;                                        // 0x03F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnPressed;                                         // 0x0400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnFocus;                                           // 0x0410(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(float Value)>   OnValueChanged;                                    // 0x0420(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_Options_Slider(int32 EntryPoint);
	void OnSetActive(bool bInIsActive);
	void OnSetDisplayName(const class FText& InDisplayName);
	void BndEvt__BP_Options_Slider_SliderWidget_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature(float Value_0);
	void OnUnfocused(bool bAnimate);
	void OnFocused(bool bAnimate);
	void OnSetValue(float InValue);
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_2_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void BPSetValue(float InValue);
	void SetAttributeName(const class FText& Caption);
	void ToggleActive(bool InIsActive);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Options_Slider_C">();
	}
	static class UBP_Options_Slider_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Options_Slider_C>();
	}
};
static_assert(alignof(UBP_Options_Slider_C) == 0x000008, "Wrong alignment on UBP_Options_Slider_C");
static_assert(sizeof(UBP_Options_Slider_C) == 0x000430, "Wrong size on UBP_Options_Slider_C");
static_assert(offsetof(UBP_Options_Slider_C, UberGraphFrame) == 0x000360, "Member 'UBP_Options_Slider_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Options_Slider_C, HighlightAnim) == 0x000368, "Member 'UBP_Options_Slider_C::HighlightAnim' has a wrong offset!");
static_assert(offsetof(UBP_Options_Slider_C, ButtonFrame) == 0x000370, "Member 'UBP_Options_Slider_C::ButtonFrame' has a wrong offset!");
static_assert(offsetof(UBP_Options_Slider_C, DisplayValueText) == 0x000378, "Member 'UBP_Options_Slider_C::DisplayValueText' has a wrong offset!");
static_assert(offsetof(UBP_Options_Slider_C, Frame_Active) == 0x000380, "Member 'UBP_Options_Slider_C::Frame_Active' has a wrong offset!");
static_assert(offsetof(UBP_Options_Slider_C, Frame_Highlight) == 0x000388, "Member 'UBP_Options_Slider_C::Frame_Highlight' has a wrong offset!");
static_assert(offsetof(UBP_Options_Slider_C, Frame_Normal) == 0x000390, "Member 'UBP_Options_Slider_C::Frame_Normal' has a wrong offset!");
static_assert(offsetof(UBP_Options_Slider_C, Image_142) == 0x000398, "Member 'UBP_Options_Slider_C::Image_142' has a wrong offset!");
static_assert(offsetof(UBP_Options_Slider_C, ProgressBarWidget) == 0x0003A0, "Member 'UBP_Options_Slider_C::ProgressBarWidget' has a wrong offset!");
static_assert(offsetof(UBP_Options_Slider_C, RichCaptionActive) == 0x0003A8, "Member 'UBP_Options_Slider_C::RichCaptionActive' has a wrong offset!");
static_assert(offsetof(UBP_Options_Slider_C, RichCaptionInactive) == 0x0003B0, "Member 'UBP_Options_Slider_C::RichCaptionInactive' has a wrong offset!");
static_assert(offsetof(UBP_Options_Slider_C, SliderWidget) == 0x0003B8, "Member 'UBP_Options_Slider_C::SliderWidget' has a wrong offset!");
static_assert(offsetof(UBP_Options_Slider_C, OnClicked) == 0x0003C0, "Member 'UBP_Options_Slider_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UBP_Options_Slider_C, OnHovered) == 0x0003D0, "Member 'UBP_Options_Slider_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UBP_Options_Slider_C, OnUnhovered) == 0x0003E0, "Member 'UBP_Options_Slider_C::OnUnhovered' has a wrong offset!");
static_assert(offsetof(UBP_Options_Slider_C, OnReleased) == 0x0003F0, "Member 'UBP_Options_Slider_C::OnReleased' has a wrong offset!");
static_assert(offsetof(UBP_Options_Slider_C, OnPressed) == 0x000400, "Member 'UBP_Options_Slider_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UBP_Options_Slider_C, OnFocus) == 0x000410, "Member 'UBP_Options_Slider_C::OnFocus' has a wrong offset!");
static_assert(offsetof(UBP_Options_Slider_C, OnValueChanged) == 0x000420, "Member 'UBP_Options_Slider_C::OnValueChanged' has a wrong offset!");

}

