#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OrbOfDoomCollisionExplosionVisualEntity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_OrbOfDoomCollisionExplosionVisualEntity.BP_OrbOfDoomCollisionExplosionVisualEntity_C.ExecuteUbergraph_BP_OrbOfDoomCollisionExplosionVisualEntity
// 0x00D0 (0x00D0 - 0x0000)
struct BP_OrbOfDoomCollisionExplosionVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomCollisionExplosionVisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_OrbOfDoomProjectile_C*              K2Node_DynamicCast_AsBP_Orb_Of_Doom_Projectile;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetImpactSurfaceNormal_ReturnValue;       // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0028(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue;         // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_OrbOfDoomCollisionExplosionVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomCollisionExplosionVisualEntity) == 0x000008, "Wrong alignment on BP_OrbOfDoomCollisionExplosionVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomCollisionExplosionVisualEntity");
static_assert(sizeof(BP_OrbOfDoomCollisionExplosionVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomCollisionExplosionVisualEntity) == 0x0000D0, "Wrong size on BP_OrbOfDoomCollisionExplosionVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomCollisionExplosionVisualEntity");
static_assert(offsetof(BP_OrbOfDoomCollisionExplosionVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomCollisionExplosionVisualEntity, EntryPoint) == 0x000000, "Member 'BP_OrbOfDoomCollisionExplosionVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomCollisionExplosionVisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_OrbOfDoomCollisionExplosionVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomCollisionExplosionVisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_OrbOfDoomCollisionExplosionVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomCollisionExplosionVisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrbOfDoomCollisionExplosionVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomCollisionExplosionVisualEntity, K2Node_DynamicCast_AsBP_Orb_Of_Doom_Projectile) == 0x000010, "Member 'BP_OrbOfDoomCollisionExplosionVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomCollisionExplosionVisualEntity::K2Node_DynamicCast_AsBP_Orb_Of_Doom_Projectile' has a wrong offset!");
static_assert(offsetof(BP_OrbOfDoomCollisionExplosionVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomCollisionExplosionVisualEntity, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_OrbOfDoomCollisionExplosionVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomCollisionExplosionVisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_OrbOfDoomCollisionExplosionVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomCollisionExplosionVisualEntity, CallFunc_GetImpactSurfaceNormal_ReturnValue) == 0x00001C, "Member 'BP_OrbOfDoomCollisionExplosionVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomCollisionExplosionVisualEntity::CallFunc_GetImpactSurfaceNormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrbOfDoomCollisionExplosionVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomCollisionExplosionVisualEntity, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000028, "Member 'BP_OrbOfDoomCollisionExplosionVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomCollisionExplosionVisualEntity::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_OrbOfDoomCollisionExplosionVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomCollisionExplosionVisualEntity, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0000B0, "Member 'BP_OrbOfDoomCollisionExplosionVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomCollisionExplosionVisualEntity::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrbOfDoomCollisionExplosionVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomCollisionExplosionVisualEntity, CallFunc_RotateAngleAxis_ReturnValue) == 0x0000B4, "Member 'BP_OrbOfDoomCollisionExplosionVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomCollisionExplosionVisualEntity::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrbOfDoomCollisionExplosionVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomCollisionExplosionVisualEntity, CallFunc_MakeRotationFromAxes_ReturnValue) == 0x0000C0, "Member 'BP_OrbOfDoomCollisionExplosionVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomCollisionExplosionVisualEntity::CallFunc_MakeRotationFromAxes_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrbOfDoomCollisionExplosionVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomCollisionExplosionVisualEntity, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0000CC, "Member 'BP_OrbOfDoomCollisionExplosionVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomCollisionExplosionVisualEntity::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");

}

