#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Options_Heading

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_Options_Heading.BP_Options_Heading_C.ExecuteUbergraph_BP_Options_Heading
// 0x0044 (0x0044 - 0x0000)
struct BP_Options_Heading_C_ExecuteUbergraph_BP_Options_Heading final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Options_Heading_C_ExecuteUbergraph_BP_Options_Heading) == 0x000004, "Wrong alignment on BP_Options_Heading_C_ExecuteUbergraph_BP_Options_Heading");
static_assert(sizeof(BP_Options_Heading_C_ExecuteUbergraph_BP_Options_Heading) == 0x000044, "Wrong size on BP_Options_Heading_C_ExecuteUbergraph_BP_Options_Heading");
static_assert(offsetof(BP_Options_Heading_C_ExecuteUbergraph_BP_Options_Heading, EntryPoint) == 0x000000, "Member 'BP_Options_Heading_C_ExecuteUbergraph_BP_Options_Heading::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Options_Heading_C_ExecuteUbergraph_BP_Options_Heading, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BP_Options_Heading_C_ExecuteUbergraph_BP_Options_Heading::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_Options_Heading_C_ExecuteUbergraph_BP_Options_Heading, K2Node_Event_MyGeometry) == 0x000008, "Member 'BP_Options_Heading_C_ExecuteUbergraph_BP_Options_Heading::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_Options_Heading_C_ExecuteUbergraph_BP_Options_Heading, K2Node_Event_InDeltaTime) == 0x000040, "Member 'BP_Options_Heading_C_ExecuteUbergraph_BP_Options_Heading::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function BP_Options_Heading.BP_Options_Heading_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_Options_Heading_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Options_Heading_C_Tick) == 0x000004, "Wrong alignment on BP_Options_Heading_C_Tick");
static_assert(sizeof(BP_Options_Heading_C_Tick) == 0x00003C, "Wrong size on BP_Options_Heading_C_Tick");
static_assert(offsetof(BP_Options_Heading_C_Tick, MyGeometry) == 0x000000, "Member 'BP_Options_Heading_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_Options_Heading_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_Options_Heading_C_Tick::InDeltaTime' has a wrong offset!");

// Function BP_Options_Heading.BP_Options_Heading_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_Options_Heading_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Options_Heading_C_PreConstruct) == 0x000001, "Wrong alignment on BP_Options_Heading_C_PreConstruct");
static_assert(sizeof(BP_Options_Heading_C_PreConstruct) == 0x000001, "Wrong size on BP_Options_Heading_C_PreConstruct");
static_assert(offsetof(BP_Options_Heading_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_Options_Heading_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_Options_Heading.BP_Options_Heading_C.SetAttributeName
// 0x0018 (0x0018 - 0x0000)
struct BP_Options_Heading_C_SetAttributeName final
{
public:
	class FText                                   Caption;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_Options_Heading_C_SetAttributeName) == 0x000008, "Wrong alignment on BP_Options_Heading_C_SetAttributeName");
static_assert(sizeof(BP_Options_Heading_C_SetAttributeName) == 0x000018, "Wrong size on BP_Options_Heading_C_SetAttributeName");
static_assert(offsetof(BP_Options_Heading_C_SetAttributeName, Caption) == 0x000000, "Member 'BP_Options_Heading_C_SetAttributeName::Caption' has a wrong offset!");

}

