#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Options_Controls

#include "Basic.hpp"

#include "man_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_Options_Controls.BP_Options_Controls_C.ExecuteUbergraph_BP_Options_Controls
// 0x00B8 (0x00B8 - 0x0000)
struct BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration_1;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue;         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue_1;       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETabButtonType                                CallFunc_GetPreviousTab_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETabButtonType                                CallFunc_GetNextTab_ReturnValue;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UManUserWidgetBase*                     CallFunc_ShowManUserWidgetByZorder_ReturnValue;    // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOptionsKeyBindingsUserWidget*          K2Node_DynamicCast_AsOptions_Key_Bindings_User_Widget; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InDescription;                        // 0x0088(0x0018)(ConstParm)
	class UBP_Options_Button_C*                   K2Node_ComponentBoundEvent_OptionsButton;          // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index_2;                // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index_1;                // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBtnEnabled_ReturnValue;                 // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInputDisplay                                 K2Node_Event_InInputDisplay;                       // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDisplay                                 K2Node_Event_InControlDisplay;                     // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls) == 0x000008, "Wrong alignment on BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls");
static_assert(sizeof(BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls) == 0x0000B8, "Wrong size on BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls");
static_assert(offsetof(BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls, EntryPoint) == 0x000000, "Member 'BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls, K2Node_Event_MyGeometry) == 0x000004, "Member 'BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls, K2Node_Event_AnimDuration_1) == 0x000040, "Member 'BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls::K2Node_Event_AnimDuration_1' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls, CallFunc_GetAnimPlaybackSpeed_ReturnValue) == 0x000044, "Member 'BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls::CallFunc_GetAnimPlaybackSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls, K2Node_Event_AnimDuration) == 0x000048, "Member 'BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls::K2Node_Event_AnimDuration' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls, CallFunc_GetAnimPlaybackSpeed_ReturnValue_1) == 0x000058, "Member 'BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls::CallFunc_GetAnimPlaybackSpeed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls, CallFunc_PlayAnimation_ReturnValue_1) == 0x000060, "Member 'BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls, CallFunc_GetPreviousTab_ReturnValue) == 0x000068, "Member 'BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls::CallFunc_GetPreviousTab_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls, CallFunc_GetNextTab_ReturnValue) == 0x000069, "Member 'BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls::CallFunc_GetNextTab_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls, CallFunc_ShowManUserWidgetByZorder_ReturnValue) == 0x000070, "Member 'BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls::CallFunc_ShowManUserWidgetByZorder_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls, K2Node_DynamicCast_AsOptions_Key_Bindings_User_Widget) == 0x000078, "Member 'BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls::K2Node_DynamicCast_AsOptions_Key_Bindings_User_Widget' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls, K2Node_Event_InDescription) == 0x000088, "Member 'BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls::K2Node_Event_InDescription' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls, K2Node_ComponentBoundEvent_OptionsButton) == 0x0000A0, "Member 'BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls::K2Node_ComponentBoundEvent_OptionsButton' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls, K2Node_ComponentBoundEvent_Index_2) == 0x0000A8, "Member 'BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls::K2Node_ComponentBoundEvent_Index_2' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls, K2Node_ComponentBoundEvent_Index_1) == 0x0000AC, "Member 'BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls::K2Node_ComponentBoundEvent_Index_1' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls, K2Node_ComponentBoundEvent_Index) == 0x0000B0, "Member 'BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls::K2Node_ComponentBoundEvent_Index' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls, CallFunc_IsBtnEnabled_ReturnValue) == 0x0000B4, "Member 'BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls::CallFunc_IsBtnEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls, K2Node_Event_InInputDisplay) == 0x0000B5, "Member 'BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls::K2Node_Event_InInputDisplay' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls, K2Node_Event_InControlDisplay) == 0x0000B6, "Member 'BP_Options_Controls_C_ExecuteUbergraph_BP_Options_Controls::K2Node_Event_InControlDisplay' has a wrong offset!");

// Function BP_Options_Controls.BP_Options_Controls_C.OnSetInputDisplay
// 0x0002 (0x0002 - 0x0000)
struct BP_Options_Controls_C_OnSetInputDisplay final
{
public:
	EInputDisplay                                 InInputDisplay;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDisplay                                 InControlDisplay;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Options_Controls_C_OnSetInputDisplay) == 0x000001, "Wrong alignment on BP_Options_Controls_C_OnSetInputDisplay");
static_assert(sizeof(BP_Options_Controls_C_OnSetInputDisplay) == 0x000002, "Wrong size on BP_Options_Controls_C_OnSetInputDisplay");
static_assert(offsetof(BP_Options_Controls_C_OnSetInputDisplay, InInputDisplay) == 0x000000, "Member 'BP_Options_Controls_C_OnSetInputDisplay::InInputDisplay' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_OnSetInputDisplay, InControlDisplay) == 0x000001, "Member 'BP_Options_Controls_C_OnSetInputDisplay::InControlDisplay' has a wrong offset!");

// Function BP_Options_Controls.BP_Options_Controls_C.BndEvt__BP_Options_Controls_Option_SwapLeftAndRightSticks_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_Options_Controls_C_BndEvt__BP_Options_Controls_Option_SwapLeftAndRightSticks_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Options_Controls_C_BndEvt__BP_Options_Controls_Option_SwapLeftAndRightSticks_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature) == 0x000004, "Wrong alignment on BP_Options_Controls_C_BndEvt__BP_Options_Controls_Option_SwapLeftAndRightSticks_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature");
static_assert(sizeof(BP_Options_Controls_C_BndEvt__BP_Options_Controls_Option_SwapLeftAndRightSticks_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature) == 0x000004, "Wrong size on BP_Options_Controls_C_BndEvt__BP_Options_Controls_Option_SwapLeftAndRightSticks_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature");
static_assert(offsetof(BP_Options_Controls_C_BndEvt__BP_Options_Controls_Option_SwapLeftAndRightSticks_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature, Index_0) == 0x000000, "Member 'BP_Options_Controls_C_BndEvt__BP_Options_Controls_Option_SwapLeftAndRightSticks_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature::Index_0' has a wrong offset!");

// Function BP_Options_Controls.BP_Options_Controls_C.BndEvt__BP_Options_Controls_Option_YAxis_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_Options_Controls_C_BndEvt__BP_Options_Controls_Option_YAxis_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Options_Controls_C_BndEvt__BP_Options_Controls_Option_YAxis_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature) == 0x000004, "Wrong alignment on BP_Options_Controls_C_BndEvt__BP_Options_Controls_Option_YAxis_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature");
static_assert(sizeof(BP_Options_Controls_C_BndEvt__BP_Options_Controls_Option_YAxis_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature) == 0x000004, "Wrong size on BP_Options_Controls_C_BndEvt__BP_Options_Controls_Option_YAxis_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature");
static_assert(offsetof(BP_Options_Controls_C_BndEvt__BP_Options_Controls_Option_YAxis_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature, Index_0) == 0x000000, "Member 'BP_Options_Controls_C_BndEvt__BP_Options_Controls_Option_YAxis_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature::Index_0' has a wrong offset!");

// Function BP_Options_Controls.BP_Options_Controls_C.BndEvt__BP_Options_Controls_Option_XAxis_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_Options_Controls_C_BndEvt__BP_Options_Controls_Option_XAxis_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Options_Controls_C_BndEvt__BP_Options_Controls_Option_XAxis_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature) == 0x000004, "Wrong alignment on BP_Options_Controls_C_BndEvt__BP_Options_Controls_Option_XAxis_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature");
static_assert(sizeof(BP_Options_Controls_C_BndEvt__BP_Options_Controls_Option_XAxis_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature) == 0x000004, "Wrong size on BP_Options_Controls_C_BndEvt__BP_Options_Controls_Option_XAxis_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature");
static_assert(offsetof(BP_Options_Controls_C_BndEvt__BP_Options_Controls_Option_XAxis_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature, Index_0) == 0x000000, "Member 'BP_Options_Controls_C_BndEvt__BP_Options_Controls_Option_XAxis_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature::Index_0' has a wrong offset!");

// Function BP_Options_Controls.BP_Options_Controls_C.BndEvt__BP_Options_Controls_Btn_KeyboardMapping_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Options_Controls_C_BndEvt__BP_Options_Controls_Btn_KeyboardMapping_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature final
{
public:
	class UBP_Options_Button_C*                   OptionsButton;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Options_Controls_C_BndEvt__BP_Options_Controls_Btn_KeyboardMapping_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Options_Controls_C_BndEvt__BP_Options_Controls_Btn_KeyboardMapping_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Options_Controls_C_BndEvt__BP_Options_Controls_Btn_KeyboardMapping_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Options_Controls_C_BndEvt__BP_Options_Controls_Btn_KeyboardMapping_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature");
static_assert(offsetof(BP_Options_Controls_C_BndEvt__BP_Options_Controls_Btn_KeyboardMapping_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature, OptionsButton) == 0x000000, "Member 'BP_Options_Controls_C_BndEvt__BP_Options_Controls_Btn_KeyboardMapping_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature::OptionsButton' has a wrong offset!");

// Function BP_Options_Controls.BP_Options_Controls_C.OnSetDescription
// 0x0018 (0x0018 - 0x0000)
struct BP_Options_Controls_C_OnSetDescription final
{
public:
	class FText                                   InDescription;                                     // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Options_Controls_C_OnSetDescription) == 0x000008, "Wrong alignment on BP_Options_Controls_C_OnSetDescription");
static_assert(sizeof(BP_Options_Controls_C_OnSetDescription) == 0x000018, "Wrong size on BP_Options_Controls_C_OnSetDescription");
static_assert(offsetof(BP_Options_Controls_C_OnSetDescription, InDescription) == 0x000000, "Member 'BP_Options_Controls_C_OnSetDescription::InDescription' has a wrong offset!");

// Function BP_Options_Controls.BP_Options_Controls_C.OnHide
// 0x0004 (0x0004 - 0x0000)
struct BP_Options_Controls_C_OnHide final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Options_Controls_C_OnHide) == 0x000004, "Wrong alignment on BP_Options_Controls_C_OnHide");
static_assert(sizeof(BP_Options_Controls_C_OnHide) == 0x000004, "Wrong size on BP_Options_Controls_C_OnHide");
static_assert(offsetof(BP_Options_Controls_C_OnHide, AnimDuration) == 0x000000, "Member 'BP_Options_Controls_C_OnHide::AnimDuration' has a wrong offset!");

// Function BP_Options_Controls.BP_Options_Controls_C.OnShow
// 0x0004 (0x0004 - 0x0000)
struct BP_Options_Controls_C_OnShow final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Options_Controls_C_OnShow) == 0x000004, "Wrong alignment on BP_Options_Controls_C_OnShow");
static_assert(sizeof(BP_Options_Controls_C_OnShow) == 0x000004, "Wrong size on BP_Options_Controls_C_OnShow");
static_assert(offsetof(BP_Options_Controls_C_OnShow, AnimDuration) == 0x000000, "Member 'BP_Options_Controls_C_OnShow::AnimDuration' has a wrong offset!");

// Function BP_Options_Controls.BP_Options_Controls_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_Options_Controls_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Options_Controls_C_Tick) == 0x000004, "Wrong alignment on BP_Options_Controls_C_Tick");
static_assert(sizeof(BP_Options_Controls_C_Tick) == 0x00003C, "Wrong size on BP_Options_Controls_C_Tick");
static_assert(offsetof(BP_Options_Controls_C_Tick, MyGeometry) == 0x000000, "Member 'BP_Options_Controls_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_Options_Controls_C_Tick::InDeltaTime' has a wrong offset!");

// Function BP_Options_Controls.BP_Options_Controls_C.BtnHotkeyBClicked
// 0x0001 (0x0001 - 0x0000)
struct BP_Options_Controls_C_BtnHotkeyBClicked final
{
public:
	bool                                          CallFunc_DoClose_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Options_Controls_C_BtnHotkeyBClicked) == 0x000001, "Wrong alignment on BP_Options_Controls_C_BtnHotkeyBClicked");
static_assert(sizeof(BP_Options_Controls_C_BtnHotkeyBClicked) == 0x000001, "Wrong size on BP_Options_Controls_C_BtnHotkeyBClicked");
static_assert(offsetof(BP_Options_Controls_C_BtnHotkeyBClicked, CallFunc_DoClose_ReturnValue) == 0x000000, "Member 'BP_Options_Controls_C_BtnHotkeyBClicked::CallFunc_DoClose_ReturnValue' has a wrong offset!");

// Function BP_Options_Controls.BP_Options_Controls_C.BtnHotkeyXClicked
// 0x0001 (0x0001 - 0x0000)
struct BP_Options_Controls_C_BtnHotkeyXClicked final
{
public:
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Options_Controls_C_BtnHotkeyXClicked) == 0x000001, "Wrong alignment on BP_Options_Controls_C_BtnHotkeyXClicked");
static_assert(sizeof(BP_Options_Controls_C_BtnHotkeyXClicked) == 0x000001, "Wrong size on BP_Options_Controls_C_BtnHotkeyXClicked");
static_assert(offsetof(BP_Options_Controls_C_BtnHotkeyXClicked, CallFunc_IsActive_ReturnValue) == 0x000000, "Member 'BP_Options_Controls_C_BtnHotkeyXClicked::CallFunc_IsActive_ReturnValue' has a wrong offset!");

// Function BP_Options_Controls.BP_Options_Controls_C.SetBtnCloseVisibility
// 0x000B (0x000B - 0x0000)
struct BP_Options_Controls_C_SetBtnCloseVisibility final
{
public:
	EInputDisplay                                 Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDisplay                                 CallFunc_GetInputDisplay_ReturnValue;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Options_Controls_C_SetBtnCloseVisibility) == 0x000001, "Wrong alignment on BP_Options_Controls_C_SetBtnCloseVisibility");
static_assert(sizeof(BP_Options_Controls_C_SetBtnCloseVisibility) == 0x00000B, "Wrong size on BP_Options_Controls_C_SetBtnCloseVisibility");
static_assert(offsetof(BP_Options_Controls_C_SetBtnCloseVisibility, Temp_byte_Variable) == 0x000000, "Member 'BP_Options_Controls_C_SetBtnCloseVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_SetBtnCloseVisibility, Temp_byte_Variable_1) == 0x000001, "Member 'BP_Options_Controls_C_SetBtnCloseVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_SetBtnCloseVisibility, Temp_byte_Variable_2) == 0x000002, "Member 'BP_Options_Controls_C_SetBtnCloseVisibility::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_SetBtnCloseVisibility, Temp_byte_Variable_3) == 0x000003, "Member 'BP_Options_Controls_C_SetBtnCloseVisibility::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_SetBtnCloseVisibility, Temp_byte_Variable_4) == 0x000004, "Member 'BP_Options_Controls_C_SetBtnCloseVisibility::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_SetBtnCloseVisibility, Temp_byte_Variable_5) == 0x000005, "Member 'BP_Options_Controls_C_SetBtnCloseVisibility::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_SetBtnCloseVisibility, Temp_byte_Variable_6) == 0x000006, "Member 'BP_Options_Controls_C_SetBtnCloseVisibility::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_SetBtnCloseVisibility, Temp_byte_Variable_7) == 0x000007, "Member 'BP_Options_Controls_C_SetBtnCloseVisibility::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_SetBtnCloseVisibility, Temp_byte_Variable_8) == 0x000008, "Member 'BP_Options_Controls_C_SetBtnCloseVisibility::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_SetBtnCloseVisibility, CallFunc_GetInputDisplay_ReturnValue) == 0x000009, "Member 'BP_Options_Controls_C_SetBtnCloseVisibility::CallFunc_GetInputDisplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Options_Controls_C_SetBtnCloseVisibility, K2Node_Select_Default) == 0x00000A, "Member 'BP_Options_Controls_C_SetBtnCloseVisibility::K2Node_Select_Default' has a wrong offset!");

}

