#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Options_Controls_KeyBindings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Options_Controls_KeyBindings.BP_Options_Controls_KeyBindings_C
// 0x0170 (0x0738 - 0x05C8)
class UBP_Options_Controls_KeyBindings_C final : public UOptionsKeyBindingsUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x05D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur;                                    // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BottomScreenFrame;                                 // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_HotkeyUserWidget2_C*        BP_Options_HotkeyUserWidget2;                      // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_HotkeyUserWidget2_C*        BP_Options_HotkeyUserWidget2_1;                    // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_HotkeyUserWidget2_C*        BP_Options_HotkeyUserWidget2_2;                    // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_HotkeyUserWidget2_C*        BP_Options_HotkeyUserWidget2_3;                    // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_HotkeyUserWidget2_C*        BP_Options_HotkeyUserWidget2_4;                    // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_HotkeyUserWidget2_C*        BP_Options_HotkeyUserWidget2_5;                    // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_HotkeyUserWidget2_C*        BP_Options_HotkeyUserWidget2_6;                    // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_HotkeyUserWidget2_C*        BP_Options_HotkeyUserWidget2_7;                    // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_HotkeyUserWidget2_C*        BP_Options_HotkeyUserWidget2_8;                    // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_HotkeyUserWidget2_C*        BP_Options_HotkeyUserWidget2_9;                    // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_HotkeyUserWidget2_C*        BP_Options_HotkeyUserWidget2_10;                   // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_HotkeyUserWidget2_C*        BP_Options_HotkeyUserWidget2_11;                   // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_HotkeyUserWidget2_C*        BP_Options_HotkeyUserWidget2_12;                   // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_HotkeyUserWidget2_C*        BP_Options_HotkeyUserWidget2_13;                   // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_HotkeyUserWidget2_C*        BP_Options_HotkeyUserWidget2_14;                   // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_HotkeyUserWidget2_C*        BP_Options_HotkeyUserWidget2_15;                   // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_HotkeyUserWidget2_C*        BP_Options_HotkeyUserWidget2_16;                   // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CloseButton_C*                      BtnClose;                                          // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyB;                                        // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyCancel;                                   // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyHoldY;                                    // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnNextTab;                                        // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnPreviousTab;                                    // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Label_KBM;                                         // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NormalFrame;                                       // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScreenBg2;                                         // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollPaneTopMask;                                 // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Accessibility;                                 // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Audio;                                         // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_ControllerLayout;                              // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Controls;                                      // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_General;                                       // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Video;                                         // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Video_Advanced;                                // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Visual;                                        // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Tabs;                                              // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TopScreenFrame;                                    // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             UnboundText;                                       // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              ClickedOutside;                                    // 0x0728(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_Options_Controls_KeyBindings(int32 EntryPoint);
	void BndEvt__BP_Options_Controls_KeyBindings_Tab_Controls_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature();
	void OnFocusedHotkeySelected();
	void BndEvt__BP_Options_Controls_KeyBindings_Tab_Accessibility_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();
	void BndEvt__BP_Options_Controls_KeyBindings_Tab_Video_Advanced_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();
	void BndEvt__BP_Options_Controls_KeyBindings_Tab_Visual_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void OnSetInputDisplay(EInputDisplay InInputDisplay, EInputDisplay InControlDisplay);
	void BndEvt__BP_Options_Controls_KeyBindings_BtnClose_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void BndEvt__BP_Options_Controls_Tab_ControllerLayout_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature();
	void OnGamepadAEvent();
	void OnSetUnboundText(const class FText& InUnboundText);
	void Construct();
	void BndEvt__BP_Options_Controls_Tab_Audio_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature();
	void BndEvt__BP_Options_Controls_Tab_Video_K2Node_ComponentBoundEvent_11_OnClicked__DelegateSignature();
	void BndEvt__BP_Options_Controls_Tab_General_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature();
	void BndEvt__BP_Options_Video_BtnPreviousTab_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature();
	void BndEvt__BP_Options_Video_BtnNextTab_K2Node_ComponentBoundEvent_24_OnClicked__DelegateSignature();
	void OnGamepadRBEvent();
	void OnGamepadLBEvent();
	void BndEvt__BP_Options_Video_BtnHotkeyB_K2Node_ComponentBoundEvent_23_OnClicked__DelegateSignature();
	void OnHide(float AnimDuration);
	void OnShow(float AnimDuration);
	void OnGamepadBEvent();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BtnHotkeyBClicked();
	void SetBtnCloseVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Options_Controls_KeyBindings_C">();
	}
	static class UBP_Options_Controls_KeyBindings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Options_Controls_KeyBindings_C>();
	}
};
static_assert(alignof(UBP_Options_Controls_KeyBindings_C) == 0x000008, "Wrong alignment on UBP_Options_Controls_KeyBindings_C");
static_assert(sizeof(UBP_Options_Controls_KeyBindings_C) == 0x000738, "Wrong size on UBP_Options_Controls_KeyBindings_C");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, UberGraphFrame) == 0x0005C8, "Member 'UBP_Options_Controls_KeyBindings_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, FadeOutAnim) == 0x0005D0, "Member 'UBP_Options_Controls_KeyBindings_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, FadeInAnim) == 0x0005D8, "Member 'UBP_Options_Controls_KeyBindings_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, BackgroundBlur) == 0x0005E0, "Member 'UBP_Options_Controls_KeyBindings_C::BackgroundBlur' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, BottomScreenFrame) == 0x0005E8, "Member 'UBP_Options_Controls_KeyBindings_C::BottomScreenFrame' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, BP_Options_HotkeyUserWidget2) == 0x0005F0, "Member 'UBP_Options_Controls_KeyBindings_C::BP_Options_HotkeyUserWidget2' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, BP_Options_HotkeyUserWidget2_1) == 0x0005F8, "Member 'UBP_Options_Controls_KeyBindings_C::BP_Options_HotkeyUserWidget2_1' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, BP_Options_HotkeyUserWidget2_2) == 0x000600, "Member 'UBP_Options_Controls_KeyBindings_C::BP_Options_HotkeyUserWidget2_2' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, BP_Options_HotkeyUserWidget2_3) == 0x000608, "Member 'UBP_Options_Controls_KeyBindings_C::BP_Options_HotkeyUserWidget2_3' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, BP_Options_HotkeyUserWidget2_4) == 0x000610, "Member 'UBP_Options_Controls_KeyBindings_C::BP_Options_HotkeyUserWidget2_4' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, BP_Options_HotkeyUserWidget2_5) == 0x000618, "Member 'UBP_Options_Controls_KeyBindings_C::BP_Options_HotkeyUserWidget2_5' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, BP_Options_HotkeyUserWidget2_6) == 0x000620, "Member 'UBP_Options_Controls_KeyBindings_C::BP_Options_HotkeyUserWidget2_6' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, BP_Options_HotkeyUserWidget2_7) == 0x000628, "Member 'UBP_Options_Controls_KeyBindings_C::BP_Options_HotkeyUserWidget2_7' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, BP_Options_HotkeyUserWidget2_8) == 0x000630, "Member 'UBP_Options_Controls_KeyBindings_C::BP_Options_HotkeyUserWidget2_8' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, BP_Options_HotkeyUserWidget2_9) == 0x000638, "Member 'UBP_Options_Controls_KeyBindings_C::BP_Options_HotkeyUserWidget2_9' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, BP_Options_HotkeyUserWidget2_10) == 0x000640, "Member 'UBP_Options_Controls_KeyBindings_C::BP_Options_HotkeyUserWidget2_10' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, BP_Options_HotkeyUserWidget2_11) == 0x000648, "Member 'UBP_Options_Controls_KeyBindings_C::BP_Options_HotkeyUserWidget2_11' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, BP_Options_HotkeyUserWidget2_12) == 0x000650, "Member 'UBP_Options_Controls_KeyBindings_C::BP_Options_HotkeyUserWidget2_12' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, BP_Options_HotkeyUserWidget2_13) == 0x000658, "Member 'UBP_Options_Controls_KeyBindings_C::BP_Options_HotkeyUserWidget2_13' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, BP_Options_HotkeyUserWidget2_14) == 0x000660, "Member 'UBP_Options_Controls_KeyBindings_C::BP_Options_HotkeyUserWidget2_14' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, BP_Options_HotkeyUserWidget2_15) == 0x000668, "Member 'UBP_Options_Controls_KeyBindings_C::BP_Options_HotkeyUserWidget2_15' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, BP_Options_HotkeyUserWidget2_16) == 0x000670, "Member 'UBP_Options_Controls_KeyBindings_C::BP_Options_HotkeyUserWidget2_16' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, BtnClose) == 0x000678, "Member 'UBP_Options_Controls_KeyBindings_C::BtnClose' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, BtnHotkeyB) == 0x000680, "Member 'UBP_Options_Controls_KeyBindings_C::BtnHotkeyB' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, BtnHotkeyCancel) == 0x000688, "Member 'UBP_Options_Controls_KeyBindings_C::BtnHotkeyCancel' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, BtnHotkeyHoldY) == 0x000690, "Member 'UBP_Options_Controls_KeyBindings_C::BtnHotkeyHoldY' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, BtnNextTab) == 0x000698, "Member 'UBP_Options_Controls_KeyBindings_C::BtnNextTab' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, BtnPreviousTab) == 0x0006A0, "Member 'UBP_Options_Controls_KeyBindings_C::BtnPreviousTab' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, HorizontalBox_0) == 0x0006A8, "Member 'UBP_Options_Controls_KeyBindings_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, Label_KBM) == 0x0006B0, "Member 'UBP_Options_Controls_KeyBindings_C::Label_KBM' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, NormalFrame) == 0x0006B8, "Member 'UBP_Options_Controls_KeyBindings_C::NormalFrame' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, ScreenBg2) == 0x0006C0, "Member 'UBP_Options_Controls_KeyBindings_C::ScreenBg2' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, ScrollPaneTopMask) == 0x0006C8, "Member 'UBP_Options_Controls_KeyBindings_C::ScrollPaneTopMask' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, Tab_Accessibility) == 0x0006D0, "Member 'UBP_Options_Controls_KeyBindings_C::Tab_Accessibility' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, Tab_Audio) == 0x0006D8, "Member 'UBP_Options_Controls_KeyBindings_C::Tab_Audio' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, Tab_ControllerLayout) == 0x0006E0, "Member 'UBP_Options_Controls_KeyBindings_C::Tab_ControllerLayout' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, Tab_Controls) == 0x0006E8, "Member 'UBP_Options_Controls_KeyBindings_C::Tab_Controls' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, Tab_General) == 0x0006F0, "Member 'UBP_Options_Controls_KeyBindings_C::Tab_General' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, Tab_Video) == 0x0006F8, "Member 'UBP_Options_Controls_KeyBindings_C::Tab_Video' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, Tab_Video_Advanced) == 0x000700, "Member 'UBP_Options_Controls_KeyBindings_C::Tab_Video_Advanced' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, Tab_Visual) == 0x000708, "Member 'UBP_Options_Controls_KeyBindings_C::Tab_Visual' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, Tabs) == 0x000710, "Member 'UBP_Options_Controls_KeyBindings_C::Tabs' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, TopScreenFrame) == 0x000718, "Member 'UBP_Options_Controls_KeyBindings_C::TopScreenFrame' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, UnboundText) == 0x000720, "Member 'UBP_Options_Controls_KeyBindings_C::UnboundText' has a wrong offset!");
static_assert(offsetof(UBP_Options_Controls_KeyBindings_C, ClickedOutside) == 0x000728, "Member 'UBP_Options_Controls_KeyBindings_C::ClickedOutside' has a wrong offset!");

}

