#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OfferingShrine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OfferingShrine.BP_OfferingShrine_C
// 0x0098 (0x0890 - 0x07F8)
class ABP_OfferingShrine_C final : public AOfferingShrine
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           AkComponent;                                       // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMiniMapActorComponent*                 MiniMapActor;                                      // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_OfferingShrine_InteractHold;                    // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FireRightMid;                                      // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SmokeRightFront;                                   // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FireLeftBack;                                      // 0x0828(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SmokeRightBack;                                    // 0x0830(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SmokeLeftFront;                                    // 0x0838(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FireLeftMid;                                       // 0x0840(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      VFXInteract;                                       // 0x0848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_InteractPrompWidgetComponent_C*     BP_InteractPrompWidgetComponent;                   // 0x0850(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoundingBoxComponent*                  BoundingBox;                                       // 0x0858(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Offering_Shrine;                                // 0x0860(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         epic_Alpha_DDC3DC3144AEE920F6FF48BCC8B5F529;       // 0x0878(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            epic__Direction_DDC3DC3144AEE920F6FF48BCC8B5F529;  // 0x087C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87D[0x3];                                      // 0x087D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Epic;                                              // 0x0880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewVar_0;                                          // 0x0888(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_OfferingShrine(int32 EntryPoint);
	void InteractChargeStop();
	void InteractChargeStart();
	void Interact();
	void epic__UpdateFunc();
	void epic__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_OfferingShrine_C">();
	}
	static class ABP_OfferingShrine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OfferingShrine_C>();
	}
};
static_assert(alignof(ABP_OfferingShrine_C) == 0x000008, "Wrong alignment on ABP_OfferingShrine_C");
static_assert(sizeof(ABP_OfferingShrine_C) == 0x000890, "Wrong size on ABP_OfferingShrine_C");
static_assert(offsetof(ABP_OfferingShrine_C, UberGraphFrame) == 0x0007F8, "Member 'ABP_OfferingShrine_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_OfferingShrine_C, AkComponent) == 0x000800, "Member 'ABP_OfferingShrine_C::AkComponent' has a wrong offset!");
static_assert(offsetof(ABP_OfferingShrine_C, MiniMapActor) == 0x000808, "Member 'ABP_OfferingShrine_C::MiniMapActor' has a wrong offset!");
static_assert(offsetof(ABP_OfferingShrine_C, NS_OfferingShrine_InteractHold) == 0x000810, "Member 'ABP_OfferingShrine_C::NS_OfferingShrine_InteractHold' has a wrong offset!");
static_assert(offsetof(ABP_OfferingShrine_C, FireRightMid) == 0x000818, "Member 'ABP_OfferingShrine_C::FireRightMid' has a wrong offset!");
static_assert(offsetof(ABP_OfferingShrine_C, SmokeRightFront) == 0x000820, "Member 'ABP_OfferingShrine_C::SmokeRightFront' has a wrong offset!");
static_assert(offsetof(ABP_OfferingShrine_C, FireLeftBack) == 0x000828, "Member 'ABP_OfferingShrine_C::FireLeftBack' has a wrong offset!");
static_assert(offsetof(ABP_OfferingShrine_C, SmokeRightBack) == 0x000830, "Member 'ABP_OfferingShrine_C::SmokeRightBack' has a wrong offset!");
static_assert(offsetof(ABP_OfferingShrine_C, SmokeLeftFront) == 0x000838, "Member 'ABP_OfferingShrine_C::SmokeLeftFront' has a wrong offset!");
static_assert(offsetof(ABP_OfferingShrine_C, FireLeftMid) == 0x000840, "Member 'ABP_OfferingShrine_C::FireLeftMid' has a wrong offset!");
static_assert(offsetof(ABP_OfferingShrine_C, VFXInteract) == 0x000848, "Member 'ABP_OfferingShrine_C::VFXInteract' has a wrong offset!");
static_assert(offsetof(ABP_OfferingShrine_C, BP_InteractPrompWidgetComponent) == 0x000850, "Member 'ABP_OfferingShrine_C::BP_InteractPrompWidgetComponent' has a wrong offset!");
static_assert(offsetof(ABP_OfferingShrine_C, BoundingBox) == 0x000858, "Member 'ABP_OfferingShrine_C::BoundingBox' has a wrong offset!");
static_assert(offsetof(ABP_OfferingShrine_C, SM_Offering_Shrine) == 0x000860, "Member 'ABP_OfferingShrine_C::SM_Offering_Shrine' has a wrong offset!");
static_assert(offsetof(ABP_OfferingShrine_C, Cube) == 0x000868, "Member 'ABP_OfferingShrine_C::Cube' has a wrong offset!");
static_assert(offsetof(ABP_OfferingShrine_C, DefaultSceneRoot) == 0x000870, "Member 'ABP_OfferingShrine_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_OfferingShrine_C, epic_Alpha_DDC3DC3144AEE920F6FF48BCC8B5F529) == 0x000878, "Member 'ABP_OfferingShrine_C::epic_Alpha_DDC3DC3144AEE920F6FF48BCC8B5F529' has a wrong offset!");
static_assert(offsetof(ABP_OfferingShrine_C, epic__Direction_DDC3DC3144AEE920F6FF48BCC8B5F529) == 0x00087C, "Member 'ABP_OfferingShrine_C::epic__Direction_DDC3DC3144AEE920F6FF48BCC8B5F529' has a wrong offset!");
static_assert(offsetof(ABP_OfferingShrine_C, Epic) == 0x000880, "Member 'ABP_OfferingShrine_C::Epic' has a wrong offset!");
static_assert(offsetof(ABP_OfferingShrine_C, NewVar_0) == 0x000888, "Member 'ABP_OfferingShrine_C::NewVar_0' has a wrong offset!");

}

