#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OpportunistWeakPoint_VisualEntity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_OpportunistWeakPoint_VisualEntity.BP_OpportunistWeakPoint_VisualEntity_C.ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity
// 0x0198 (0x0198 - 0x0000)
struct BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOpportunistWeakPointPassive*           K2Node_DynamicCast_AsOpportunist_Weak_Point_Passive; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0074(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x010C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity) == 0x000008, "Wrong alignment on BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity");
static_assert(sizeof(BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity) == 0x000198, "Wrong size on BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity");
static_assert(offsetof(BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000010, "Member 'BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity, CallFunc_PostEventAtLocation_ReturnValue) == 0x00001C, "Member 'BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity, K2Node_DynamicCast_AsCharacter_Base) == 0x000030, "Member 'BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity, CallFunc_GetAbilityController_ReturnValue) == 0x000040, "Member 'BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000048, "Member 'BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000050, "Member 'BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity, K2Node_DynamicCast_AsOpportunist_Weak_Point_Passive) == 0x000068, "Member 'BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity::K2Node_DynamicCast_AsOpportunist_Weak_Point_Passive' has a wrong offset!");
static_assert(offsetof(BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000074, "Member 'BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity, CallFunc_SelectFloat_ReturnValue) == 0x0000FC, "Member 'BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity, CallFunc_MakeRotator_ReturnValue) == 0x000100, "Member 'BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x00010C, "Member 'BP_OpportunistWeakPoint_VisualEntity_C_ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");

// Function BP_OpportunistWeakPoint_VisualEntity.BP_OpportunistWeakPoint_VisualEntity_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_OpportunistWeakPoint_VisualEntity_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OpportunistWeakPoint_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_OpportunistWeakPoint_VisualEntity_C_ReceiveTick");
static_assert(sizeof(BP_OpportunistWeakPoint_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong size on BP_OpportunistWeakPoint_VisualEntity_C_ReceiveTick");
static_assert(offsetof(BP_OpportunistWeakPoint_VisualEntity_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_OpportunistWeakPoint_VisualEntity_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

