#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OpportunistWeakPoint_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OpportunistWeakPoint_VisualEntity.BP_OpportunistWeakPoint_VisualEntity_C
// 0x0028 (0x0378 - 0x0350)
class ABP_OpportunistWeakPoint_VisualEntity_C : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          isRight;                                           // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBase*                         OwnerAsCharacter;                                  // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_OpportunistWeakPoint_VisualEntity(int32 EntryPoint);
	void VisualEntityConstructionFinished();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_OpportunistWeakPoint_VisualEntity_C">();
	}
	static class ABP_OpportunistWeakPoint_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OpportunistWeakPoint_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_OpportunistWeakPoint_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_OpportunistWeakPoint_VisualEntity_C");
static_assert(sizeof(ABP_OpportunistWeakPoint_VisualEntity_C) == 0x000378, "Wrong size on ABP_OpportunistWeakPoint_VisualEntity_C");
static_assert(offsetof(ABP_OpportunistWeakPoint_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_OpportunistWeakPoint_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_OpportunistWeakPoint_VisualEntity_C, Niagara) == 0x000358, "Member 'ABP_OpportunistWeakPoint_VisualEntity_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_OpportunistWeakPoint_VisualEntity_C, Arrow) == 0x000360, "Member 'ABP_OpportunistWeakPoint_VisualEntity_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_OpportunistWeakPoint_VisualEntity_C, isRight) == 0x000368, "Member 'ABP_OpportunistWeakPoint_VisualEntity_C::isRight' has a wrong offset!");
static_assert(offsetof(ABP_OpportunistWeakPoint_VisualEntity_C, OwnerAsCharacter) == 0x000370, "Member 'ABP_OpportunistWeakPoint_VisualEntity_C::OwnerAsCharacter' has a wrong offset!");

}

