#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OpenEntropyRiftPortal_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OpenEntropyRiftPortal_VisualEntity.BP_OpenEntropyRiftPortal_VisualEntity_C
// 0x0030 (0x0380 - 0x0350)
class ABP_OpenEntropyRiftPortal_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_WitchLantern_Living;                            // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_KingPriestVoidMandragora_LifelinkProjectiles;   // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Pos;                                               // 0x0370(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_OpenEntropyRiftPortal_VisualEntity(int32 EntryPoint);
	void OnKill();
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_OpenEntropyRiftPortal_VisualEntity_C">();
	}
	static class ABP_OpenEntropyRiftPortal_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OpenEntropyRiftPortal_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_OpenEntropyRiftPortal_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_OpenEntropyRiftPortal_VisualEntity_C");
static_assert(sizeof(ABP_OpenEntropyRiftPortal_VisualEntity_C) == 0x000380, "Wrong size on ABP_OpenEntropyRiftPortal_VisualEntity_C");
static_assert(offsetof(ABP_OpenEntropyRiftPortal_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_OpenEntropyRiftPortal_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_OpenEntropyRiftPortal_VisualEntity_C, Ak) == 0x000358, "Member 'ABP_OpenEntropyRiftPortal_VisualEntity_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_OpenEntropyRiftPortal_VisualEntity_C, NS_WitchLantern_Living) == 0x000360, "Member 'ABP_OpenEntropyRiftPortal_VisualEntity_C::NS_WitchLantern_Living' has a wrong offset!");
static_assert(offsetof(ABP_OpenEntropyRiftPortal_VisualEntity_C, NS_KingPriestVoidMandragora_LifelinkProjectiles) == 0x000368, "Member 'ABP_OpenEntropyRiftPortal_VisualEntity_C::NS_KingPriestVoidMandragora_LifelinkProjectiles' has a wrong offset!");
static_assert(offsetof(ABP_OpenEntropyRiftPortal_VisualEntity_C, Pos) == 0x000370, "Member 'ABP_OpenEntropyRiftPortal_VisualEntity_C::Pos' has a wrong offset!");

}

