#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Options_HotkeyUserWidget2

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_Options_HotkeyUserWidget2.BP_Options_HotkeyUserWidget2_C.ExecuteUbergraph_BP_Options_HotkeyUserWidget2
// 0x0048 (0x0048 - 0x0000)
struct BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsKeyboardEnabled_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManUserWidgetBase*                     CallFunc_GetManUserWidgetBase_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOptionsKeyBindingsUserWidget*          K2Node_DynamicCast_AsOptions_Key_Bindings_User_Widget; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsKeyboardEnabled_ReturnValue_1;          // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2) == 0x000008, "Wrong alignment on BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2");
static_assert(sizeof(BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2) == 0x000048, "Wrong size on BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2");
static_assert(offsetof(BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2, EntryPoint) == 0x000000, "Member 'BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2, CallFunc_IsKeyboardEnabled_ReturnValue) == 0x000004, "Member 'BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2::CallFunc_IsKeyboardEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2, Temp_float_Variable) == 0x000008, "Member 'BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2, Temp_float_Variable_1) == 0x00000C, "Member 'BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2, CallFunc_GetManUserWidgetBase_ReturnValue) == 0x000010, "Member 'BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2::CallFunc_GetManUserWidgetBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2, K2Node_DynamicCast_AsOptions_Key_Bindings_User_Widget) == 0x000018, "Member 'BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2::K2Node_DynamicCast_AsOptions_Key_Bindings_User_Widget' has a wrong offset!");
static_assert(offsetof(BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000028, "Member 'BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2, Temp_bool_Variable) == 0x000030, "Member 'BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2, K2Node_Event_IsDesignTime) == 0x000031, "Member 'BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2, CallFunc_IsKeyboardEnabled_ReturnValue_1) == 0x000032, "Member 'BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2::CallFunc_IsKeyboardEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2, K2Node_Select_Default) == 0x000034, "Member 'BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2, K2Node_MakeStruct_Margin) == 0x000038, "Member 'BP_Options_HotkeyUserWidget2_C_ExecuteUbergraph_BP_Options_HotkeyUserWidget2::K2Node_MakeStruct_Margin' has a wrong offset!");

// Function BP_Options_HotkeyUserWidget2.BP_Options_HotkeyUserWidget2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_Options_HotkeyUserWidget2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Options_HotkeyUserWidget2_C_PreConstruct) == 0x000001, "Wrong alignment on BP_Options_HotkeyUserWidget2_C_PreConstruct");
static_assert(sizeof(BP_Options_HotkeyUserWidget2_C_PreConstruct) == 0x000001, "Wrong size on BP_Options_HotkeyUserWidget2_C_PreConstruct");
static_assert(offsetof(BP_Options_HotkeyUserWidget2_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_Options_HotkeyUserWidget2_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

