#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Options_HotkeyUserWidget2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Options_HotkeyUserWidget2.BP_Options_HotkeyUserWidget2_C
// 0x0040 (0x0318 - 0x02D8)
class UBP_Options_HotkeyUserWidget2_C final : public UOptionsHotkeyUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_Options_HotkeyBtnUserWidget2_C*     ControllerHotkeyBtnUserWidget;                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HotkeyNameText;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Hotkeys_KBM;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_HotkeyBtnUserWidget2_C*     PrimaryKBMHotkeyBtnUserWidget;                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_HotkeyBtnUserWidget2_C*     SecondaryKBMHotkeyBtnUserWidget;                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_0;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Options_HotkeyUserWidget2(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__BP_Options_HotkeyUserWidget2_BP_Options_HotkeyBtnUserWidget2_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void BndEvt__BP_Options_HotkeyUserWidget_SecondaryHotkeyBtnUserWidget2_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();
	void BndEvt__BP_Options_HotkeyUserWidget_PrimaryHotkeyBtnUserWidget2_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Options_HotkeyUserWidget2_C">();
	}
	static class UBP_Options_HotkeyUserWidget2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Options_HotkeyUserWidget2_C>();
	}
};
static_assert(alignof(UBP_Options_HotkeyUserWidget2_C) == 0x000008, "Wrong alignment on UBP_Options_HotkeyUserWidget2_C");
static_assert(sizeof(UBP_Options_HotkeyUserWidget2_C) == 0x000318, "Wrong size on UBP_Options_HotkeyUserWidget2_C");
static_assert(offsetof(UBP_Options_HotkeyUserWidget2_C, UberGraphFrame) == 0x0002D8, "Member 'UBP_Options_HotkeyUserWidget2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Options_HotkeyUserWidget2_C, ControllerHotkeyBtnUserWidget) == 0x0002E0, "Member 'UBP_Options_HotkeyUserWidget2_C::ControllerHotkeyBtnUserWidget' has a wrong offset!");
static_assert(offsetof(UBP_Options_HotkeyUserWidget2_C, HorizontalBox_0) == 0x0002E8, "Member 'UBP_Options_HotkeyUserWidget2_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(UBP_Options_HotkeyUserWidget2_C, HotkeyNameText) == 0x0002F0, "Member 'UBP_Options_HotkeyUserWidget2_C::HotkeyNameText' has a wrong offset!");
static_assert(offsetof(UBP_Options_HotkeyUserWidget2_C, Hotkeys_KBM) == 0x0002F8, "Member 'UBP_Options_HotkeyUserWidget2_C::Hotkeys_KBM' has a wrong offset!");
static_assert(offsetof(UBP_Options_HotkeyUserWidget2_C, PrimaryKBMHotkeyBtnUserWidget) == 0x000300, "Member 'UBP_Options_HotkeyUserWidget2_C::PrimaryKBMHotkeyBtnUserWidget' has a wrong offset!");
static_assert(offsetof(UBP_Options_HotkeyUserWidget2_C, SecondaryKBMHotkeyBtnUserWidget) == 0x000308, "Member 'UBP_Options_HotkeyUserWidget2_C::SecondaryKBMHotkeyBtnUserWidget' has a wrong offset!");
static_assert(offsetof(UBP_Options_HotkeyUserWidget2_C, VerticalBox_0) == 0x000310, "Member 'UBP_Options_HotkeyUserWidget2_C::VerticalBox_0' has a wrong offset!");

}

