#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Options_Subtitle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Options_Subtitle.BP_Options_Subtitle_C
// 0x0030 (0x0570 - 0x0540)
class UBP_Options_Subtitle_C final : public USubtitleUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0540(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DebugLineID;                                       // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SubtitleBox;                                       // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManRichTextBlock*                      SubtitleText;                                      // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Counter;                                           // 0x0568(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Options_Subtitle(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnShow(float AnimDuration);
	void OnHide(float AnimDuration);
	void OnShowSubtitleText(const class FText& InText, const class FText& InLineIDText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Options_Subtitle_C">();
	}
	static class UBP_Options_Subtitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Options_Subtitle_C>();
	}
};
static_assert(alignof(UBP_Options_Subtitle_C) == 0x000008, "Wrong alignment on UBP_Options_Subtitle_C");
static_assert(sizeof(UBP_Options_Subtitle_C) == 0x000570, "Wrong size on UBP_Options_Subtitle_C");
static_assert(offsetof(UBP_Options_Subtitle_C, UberGraphFrame) == 0x000540, "Member 'UBP_Options_Subtitle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Options_Subtitle_C, CanvasPanel_0) == 0x000548, "Member 'UBP_Options_Subtitle_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UBP_Options_Subtitle_C, DebugLineID) == 0x000550, "Member 'UBP_Options_Subtitle_C::DebugLineID' has a wrong offset!");
static_assert(offsetof(UBP_Options_Subtitle_C, SubtitleBox) == 0x000558, "Member 'UBP_Options_Subtitle_C::SubtitleBox' has a wrong offset!");
static_assert(offsetof(UBP_Options_Subtitle_C, SubtitleText) == 0x000560, "Member 'UBP_Options_Subtitle_C::SubtitleText' has a wrong offset!");
static_assert(offsetof(UBP_Options_Subtitle_C, Counter) == 0x000568, "Member 'UBP_Options_Subtitle_C::Counter' has a wrong offset!");

}

