#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OrbOfDoomVisualEntity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_OrbOfDoomVisualEntity.BP_OrbOfDoomVisualEntity_C.ExecuteUbergraph_BP_OrbOfDoomVisualEntity
// 0x0078 (0x0078 - 0x0000)
struct BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_OrbOfDoomProjectile_C*              K2Node_DynamicCast_AsBP_Orb_Of_Doom_Projectile;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaledBoxExtent_ReturnValue;           // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABrawlerHero*                           K2Node_DynamicCast_AsBrawler_Hero;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrbOfDoomAbility*                      K2Node_DynamicCast_AsOrb_Of_Doom_Ability;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity) == 0x000008, "Wrong alignment on BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity");
static_assert(sizeof(BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity) == 0x000078, "Wrong size on BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity");
static_assert(offsetof(BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity, EntryPoint) == 0x000000, "Member 'BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity, K2Node_DynamicCast_AsBP_Orb_Of_Doom_Projectile) == 0x000010, "Member 'BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity::K2Node_DynamicCast_AsBP_Orb_Of_Doom_Projectile' has a wrong offset!");
static_assert(offsetof(BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity, CallFunc_GetOwner_ReturnValue_1) == 0x000020, "Member 'BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity, CallFunc_GetScaledBoxExtent_ReturnValue) == 0x000028, "Member 'BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity::CallFunc_GetScaledBoxExtent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity, K2Node_DynamicCast_AsBrawler_Hero) == 0x000038, "Member 'BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity::K2Node_DynamicCast_AsBrawler_Hero' has a wrong offset!");
static_assert(offsetof(BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity, CallFunc_BreakVector_X) == 0x000044, "Member 'BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity, CallFunc_BreakVector_Y) == 0x000048, "Member 'BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity, CallFunc_BreakVector_Z) == 0x00004C, "Member 'BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity, CallFunc_GetAbilityController_ReturnValue) == 0x000050, "Member 'BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000058, "Member 'BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000060, "Member 'BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity, K2Node_DynamicCast_AsOrb_Of_Doom_Ability) == 0x000068, "Member 'BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity::K2Node_DynamicCast_AsOrb_Of_Doom_Ability' has a wrong offset!");
static_assert(offsetof(BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'BP_OrbOfDoomVisualEntity_C_ExecuteUbergraph_BP_OrbOfDoomVisualEntity::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

}

