#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Options_Audio

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Options_Audio.BP_Options_Audio_C
// 0x0100 (0x0680 - 0x0580)
class UBP_Options_Audio_C final : public UOptionsAudioUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0580(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x0588(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x0590(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur;                                    // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BottomScreenFrame;                                 // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CloseButton_C*                      BtnClose;                                          // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyB;                                        // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyHoldY;                                    // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnNextTab;                                        // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnPreviousTab;                                    // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DescriptionText;                                   // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NormalFrame;                                       // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_Selector_C*                 Option_AudioPlayInBackground;                      // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_Slider_C*                   Option_CinematicVolume;                            // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_Slider_C*                   Option_DialogueVolume;                             // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_Slider_C*                   Option_MasterVolume;                               // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_Slider_C*                   Option_MusicVolume;                                // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_Slider_C*                   Option_SoundEffectsVolume;                         // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Options_Slider_C*                   Option_UIVolume;                                   // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScreenBg2;                                         // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Accessibility;                                 // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Audio;                                         // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_ControllerLayout;                              // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Controls;                                      // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_General;                                       // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Video;                                         // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Video_Advanced;                                // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Visual;                                        // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Tabs;                                              // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TopScreenFrame;                                    // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              ClickedOutside;                                    // 0x0670(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_Options_Audio(int32 EntryPoint);
	void BndEvt__BP_Options_Audio_Tab_Video_Advanced_K2Node_ComponentBoundEvent_13_OnClicked__DelegateSignature();
	void BndEvt__BP_Options_Audio_Tab_Visual_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature();
	void BndEvt__BP_Options_Audio_Tab_Accessibility_K2Node_ComponentBoundEvent_11_OnClicked__DelegateSignature();
	void OnSetInputDisplay(EInputDisplay InInputDisplay, EInputDisplay InControlDisplay);
	void BndEvt__BP_Options_Audio_BtnClose_K2Node_ComponentBoundEvent_9_OnClicked__DelegateSignature();
	void BndEvt__BP_Options_Controls_Tab_ControllerLayout_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature();
	void BndEvt__BP_Options_Audio_Tab_Controls_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature();
	void BndEvt__BP_Options_Audio_Tab_Video_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature();
	void BndEvt__BP_Options_Audio_Tab_General_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature();
	void OnSetDescription(const class FText& InDescription);
	void BndEvt__BP_Options_Video_BtnPreviousTab_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature();
	void BndEvt__BP_Options_Video_BtnNextTab_K2Node_ComponentBoundEvent_24_OnClicked__DelegateSignature();
	void OnGamepadRBEvent();
	void OnGamepadLBEvent();
	void BndEvt__BP_Options_Video_BtnHotkeyB_K2Node_ComponentBoundEvent_23_OnClicked__DelegateSignature();
	void OnHide(float AnimDuration);
	void OnShow(float AnimDuration);
	void OnGamepadBEvent();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BtnHotkeyBClicked();
	void SetBtnCloseVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Options_Audio_C">();
	}
	static class UBP_Options_Audio_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Options_Audio_C>();
	}
};
static_assert(alignof(UBP_Options_Audio_C) == 0x000008, "Wrong alignment on UBP_Options_Audio_C");
static_assert(sizeof(UBP_Options_Audio_C) == 0x000680, "Wrong size on UBP_Options_Audio_C");
static_assert(offsetof(UBP_Options_Audio_C, UberGraphFrame) == 0x000580, "Member 'UBP_Options_Audio_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, FadeOutAnim) == 0x000588, "Member 'UBP_Options_Audio_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, FadeInAnim) == 0x000590, "Member 'UBP_Options_Audio_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, BackgroundBlur) == 0x000598, "Member 'UBP_Options_Audio_C::BackgroundBlur' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, BottomScreenFrame) == 0x0005A0, "Member 'UBP_Options_Audio_C::BottomScreenFrame' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, BtnClose) == 0x0005A8, "Member 'UBP_Options_Audio_C::BtnClose' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, BtnHotkeyB) == 0x0005B0, "Member 'UBP_Options_Audio_C::BtnHotkeyB' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, BtnHotkeyHoldY) == 0x0005B8, "Member 'UBP_Options_Audio_C::BtnHotkeyHoldY' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, BtnNextTab) == 0x0005C0, "Member 'UBP_Options_Audio_C::BtnNextTab' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, BtnPreviousTab) == 0x0005C8, "Member 'UBP_Options_Audio_C::BtnPreviousTab' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, DescriptionText) == 0x0005D0, "Member 'UBP_Options_Audio_C::DescriptionText' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, NormalFrame) == 0x0005D8, "Member 'UBP_Options_Audio_C::NormalFrame' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, Option_AudioPlayInBackground) == 0x0005E0, "Member 'UBP_Options_Audio_C::Option_AudioPlayInBackground' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, Option_CinematicVolume) == 0x0005E8, "Member 'UBP_Options_Audio_C::Option_CinematicVolume' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, Option_DialogueVolume) == 0x0005F0, "Member 'UBP_Options_Audio_C::Option_DialogueVolume' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, Option_MasterVolume) == 0x0005F8, "Member 'UBP_Options_Audio_C::Option_MasterVolume' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, Option_MusicVolume) == 0x000600, "Member 'UBP_Options_Audio_C::Option_MusicVolume' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, Option_SoundEffectsVolume) == 0x000608, "Member 'UBP_Options_Audio_C::Option_SoundEffectsVolume' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, Option_UIVolume) == 0x000610, "Member 'UBP_Options_Audio_C::Option_UIVolume' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, ScreenBg2) == 0x000618, "Member 'UBP_Options_Audio_C::ScreenBg2' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, Tab_Accessibility) == 0x000620, "Member 'UBP_Options_Audio_C::Tab_Accessibility' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, Tab_Audio) == 0x000628, "Member 'UBP_Options_Audio_C::Tab_Audio' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, Tab_ControllerLayout) == 0x000630, "Member 'UBP_Options_Audio_C::Tab_ControllerLayout' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, Tab_Controls) == 0x000638, "Member 'UBP_Options_Audio_C::Tab_Controls' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, Tab_General) == 0x000640, "Member 'UBP_Options_Audio_C::Tab_General' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, Tab_Video) == 0x000648, "Member 'UBP_Options_Audio_C::Tab_Video' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, Tab_Video_Advanced) == 0x000650, "Member 'UBP_Options_Audio_C::Tab_Video_Advanced' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, Tab_Visual) == 0x000658, "Member 'UBP_Options_Audio_C::Tab_Visual' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, Tabs) == 0x000660, "Member 'UBP_Options_Audio_C::Tabs' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, TopScreenFrame) == 0x000668, "Member 'UBP_Options_Audio_C::TopScreenFrame' has a wrong offset!");
static_assert(offsetof(UBP_Options_Audio_C, ClickedOutside) == 0x000670, "Member 'UBP_Options_Audio_C::ClickedOutside' has a wrong offset!");

}

