#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Options_Selector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Options_Selector.BP_Options_Selector_C
// 0x0100 (0x0408 - 0x0308)
class UBP_Options_Selector_C final : public UOptionsSelectorUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ClickIncreaseAnim;                                 // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ClickDecreaseAnim;                                 // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HighlightAnim;                                     // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                BtnDecrease;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnDecreaseHighlight;                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                BtnIncrease;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnIncreaseHighlight;                              // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonFrame;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               DecreaseBox;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Active;                                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Highlight;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Normal;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HasChangedIcon;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               IncreaseBox;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NewValueText;                                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManRichTextBlock*                      RichCaptionActive;                                 // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManRichTextBlock*                      RichCaptionInactive;                               // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnHovered;                                         // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUnhovered;                                       // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnReleased;                                        // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnPressed;                                         // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnFocus;                                           // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(int32 Index)>   OnValueChanged;                                    // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_Options_Selector(int32 EntryPoint);
	void OnJumpToNextOption();
	void OnJumpToPrevOption();
	void OnSetHasChanged(bool bInHasChanged);
	void OnSetSelectedIndex(int32 InSelectedIndex);
	void OnSetDisplayName(const class FText& InDisplayName);
	void OnSetActive(bool bInIsActive);
	void OnUnfocused(bool bAnimate);
	void OnFocused(bool bAnimate);
	void BndEvt__BtnIncrease_K2Node_ComponentBoundEvent_12_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BtnDecrease_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_2_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void SetValue(int32 Index_0);
	void SetAttributeName(const class FText& Caption);
	struct FEventReply OnPreviewKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void ToggleActive(bool InIsActive);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Options_Selector_C">();
	}
	static class UBP_Options_Selector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Options_Selector_C>();
	}
};
static_assert(alignof(UBP_Options_Selector_C) == 0x000008, "Wrong alignment on UBP_Options_Selector_C");
static_assert(sizeof(UBP_Options_Selector_C) == 0x000408, "Wrong size on UBP_Options_Selector_C");
static_assert(offsetof(UBP_Options_Selector_C, UberGraphFrame) == 0x000308, "Member 'UBP_Options_Selector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Options_Selector_C, ClickIncreaseAnim) == 0x000310, "Member 'UBP_Options_Selector_C::ClickIncreaseAnim' has a wrong offset!");
static_assert(offsetof(UBP_Options_Selector_C, ClickDecreaseAnim) == 0x000318, "Member 'UBP_Options_Selector_C::ClickDecreaseAnim' has a wrong offset!");
static_assert(offsetof(UBP_Options_Selector_C, HighlightAnim) == 0x000320, "Member 'UBP_Options_Selector_C::HighlightAnim' has a wrong offset!");
static_assert(offsetof(UBP_Options_Selector_C, BtnDecrease) == 0x000328, "Member 'UBP_Options_Selector_C::BtnDecrease' has a wrong offset!");
static_assert(offsetof(UBP_Options_Selector_C, BtnDecreaseHighlight) == 0x000330, "Member 'UBP_Options_Selector_C::BtnDecreaseHighlight' has a wrong offset!");
static_assert(offsetof(UBP_Options_Selector_C, BtnIncrease) == 0x000338, "Member 'UBP_Options_Selector_C::BtnIncrease' has a wrong offset!");
static_assert(offsetof(UBP_Options_Selector_C, BtnIncreaseHighlight) == 0x000340, "Member 'UBP_Options_Selector_C::BtnIncreaseHighlight' has a wrong offset!");
static_assert(offsetof(UBP_Options_Selector_C, ButtonFrame) == 0x000348, "Member 'UBP_Options_Selector_C::ButtonFrame' has a wrong offset!");
static_assert(offsetof(UBP_Options_Selector_C, DecreaseBox) == 0x000350, "Member 'UBP_Options_Selector_C::DecreaseBox' has a wrong offset!");
static_assert(offsetof(UBP_Options_Selector_C, Frame_Active) == 0x000358, "Member 'UBP_Options_Selector_C::Frame_Active' has a wrong offset!");
static_assert(offsetof(UBP_Options_Selector_C, Frame_Highlight) == 0x000360, "Member 'UBP_Options_Selector_C::Frame_Highlight' has a wrong offset!");
static_assert(offsetof(UBP_Options_Selector_C, Frame_Normal) == 0x000368, "Member 'UBP_Options_Selector_C::Frame_Normal' has a wrong offset!");
static_assert(offsetof(UBP_Options_Selector_C, HasChangedIcon) == 0x000370, "Member 'UBP_Options_Selector_C::HasChangedIcon' has a wrong offset!");
static_assert(offsetof(UBP_Options_Selector_C, IncreaseBox) == 0x000378, "Member 'UBP_Options_Selector_C::IncreaseBox' has a wrong offset!");
static_assert(offsetof(UBP_Options_Selector_C, NewValueText) == 0x000380, "Member 'UBP_Options_Selector_C::NewValueText' has a wrong offset!");
static_assert(offsetof(UBP_Options_Selector_C, RichCaptionActive) == 0x000388, "Member 'UBP_Options_Selector_C::RichCaptionActive' has a wrong offset!");
static_assert(offsetof(UBP_Options_Selector_C, RichCaptionInactive) == 0x000390, "Member 'UBP_Options_Selector_C::RichCaptionInactive' has a wrong offset!");
static_assert(offsetof(UBP_Options_Selector_C, OnClicked) == 0x000398, "Member 'UBP_Options_Selector_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UBP_Options_Selector_C, OnHovered) == 0x0003A8, "Member 'UBP_Options_Selector_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UBP_Options_Selector_C, OnUnhovered) == 0x0003B8, "Member 'UBP_Options_Selector_C::OnUnhovered' has a wrong offset!");
static_assert(offsetof(UBP_Options_Selector_C, OnReleased) == 0x0003C8, "Member 'UBP_Options_Selector_C::OnReleased' has a wrong offset!");
static_assert(offsetof(UBP_Options_Selector_C, OnPressed) == 0x0003D8, "Member 'UBP_Options_Selector_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UBP_Options_Selector_C, OnFocus) == 0x0003E8, "Member 'UBP_Options_Selector_C::OnFocus' has a wrong offset!");
static_assert(offsetof(UBP_Options_Selector_C, OnValueChanged) == 0x0003F8, "Member 'UBP_Options_Selector_C::OnValueChanged' has a wrong offset!");

}

