#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PickupNotification

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "man_structs.hpp"
#include "EPickupNotificationTypes_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PickupNotification.BP_PickupNotification_C.ExecuteUbergraph_BP_PickupNotification
// 0x0060 (0x0060 - 0x0000)
struct BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESmallScreenMode                              CallFunc_GetSmallScreenMode_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESmallScreenMode                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InName;                               // 0x0010(0x0018)(ConstParm)
	class FText                                   K2Node_Event_InDescription;                        // 0x0028(0x0018)(ConstParm)
	class UTexture2D*                             K2Node_Event_InIcon;                               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InNumber_1;                           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemAbility*                           K2Node_Event_InItemAbility;                        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InNumber;                             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification) == 0x000008, "Wrong alignment on BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification");
static_assert(sizeof(BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification) == 0x000060, "Wrong size on BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification");
static_assert(offsetof(BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification, EntryPoint) == 0x000000, "Member 'BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification, CallFunc_GetSmallScreenMode_ReturnValue) == 0x000004, "Member 'BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification::CallFunc_GetSmallScreenMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification, Temp_byte_Variable) == 0x000005, "Member 'BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification, Temp_bool_Variable) == 0x000006, "Member 'BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification, Temp_bool_Variable_1) == 0x000007, "Member 'BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification, Temp_bool_Variable_2) == 0x000008, "Member 'BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification, Temp_bool_Variable_3) == 0x000009, "Member 'BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification, K2Node_Event_IsDesignTime) == 0x00000A, "Member 'BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification, K2Node_Select_Default) == 0x00000B, "Member 'BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification, K2Node_Event_InName) == 0x000010, "Member 'BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification::K2Node_Event_InName' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification, K2Node_Event_InDescription) == 0x000028, "Member 'BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification::K2Node_Event_InDescription' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification, K2Node_Event_InIcon) == 0x000040, "Member 'BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification::K2Node_Event_InIcon' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification, K2Node_Event_InNumber_1) == 0x000048, "Member 'BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification::K2Node_Event_InNumber_1' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification, K2Node_Event_InItemAbility) == 0x000050, "Member 'BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification::K2Node_Event_InItemAbility' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification, K2Node_Event_InNumber) == 0x000058, "Member 'BP_PickupNotification_C_ExecuteUbergraph_BP_PickupNotification::K2Node_Event_InNumber' has a wrong offset!");

// Function BP_PickupNotification.BP_PickupNotification_C.OnSetNumber
// 0x0004 (0x0004 - 0x0000)
struct BP_PickupNotification_C_OnSetNumber final
{
public:
	int32                                         InNumber;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickupNotification_C_OnSetNumber) == 0x000004, "Wrong alignment on BP_PickupNotification_C_OnSetNumber");
static_assert(sizeof(BP_PickupNotification_C_OnSetNumber) == 0x000004, "Wrong size on BP_PickupNotification_C_OnSetNumber");
static_assert(offsetof(BP_PickupNotification_C_OnSetNumber, InNumber) == 0x000000, "Member 'BP_PickupNotification_C_OnSetNumber::InNumber' has a wrong offset!");

// Function BP_PickupNotification.BP_PickupNotification_C.OnSetData
// 0x0048 (0x0048 - 0x0000)
struct BP_PickupNotification_C_OnSetData final
{
public:
	class FText                                   InName;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   InDescription;                                     // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UTexture2D*                             InIcon;                                            // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InNumber;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemAbility*                           InItemAbility;                                     // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickupNotification_C_OnSetData) == 0x000008, "Wrong alignment on BP_PickupNotification_C_OnSetData");
static_assert(sizeof(BP_PickupNotification_C_OnSetData) == 0x000048, "Wrong size on BP_PickupNotification_C_OnSetData");
static_assert(offsetof(BP_PickupNotification_C_OnSetData, InName) == 0x000000, "Member 'BP_PickupNotification_C_OnSetData::InName' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_OnSetData, InDescription) == 0x000018, "Member 'BP_PickupNotification_C_OnSetData::InDescription' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_OnSetData, InIcon) == 0x000030, "Member 'BP_PickupNotification_C_OnSetData::InIcon' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_OnSetData, InNumber) == 0x000038, "Member 'BP_PickupNotification_C_OnSetData::InNumber' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_OnSetData, InItemAbility) == 0x000040, "Member 'BP_PickupNotification_C_OnSetData::InItemAbility' has a wrong offset!");

// Function BP_PickupNotification.BP_PickupNotification_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_PickupNotification_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PickupNotification_C_PreConstruct) == 0x000001, "Wrong alignment on BP_PickupNotification_C_PreConstruct");
static_assert(sizeof(BP_PickupNotification_C_PreConstruct) == 0x000001, "Wrong size on BP_PickupNotification_C_PreConstruct");
static_assert(offsetof(BP_PickupNotification_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_PickupNotification_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_PickupNotification.BP_PickupNotification_C.SetData
// 0x0368 (0x0368 - 0x0000)
struct BP_PickupNotification_C_SetData final
{
public:
	class FText                                   Param_Name_0;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Description;                                       // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTexture2D*                             Icon_0;                                            // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Number;                                            // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemAbility*                           ItemAbility_0;                                     // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             FrameSpecial;                                      // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             FrameNormal;                                       // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewLocalVar_0;                                     // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Temp_object_Variable;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Temp_object_Variable_1;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Temp_object_Variable_2;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPickupNotificationTypes                      Temp_byte_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_4;                             // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_5;                             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_6;                             // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_7;                             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPickupNotificationTypes                      Temp_byte_Variable_1;                              // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Temp_object_Variable_3;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Temp_object_Variable_4;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Temp_object_Variable_5;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Temp_object_Variable_6;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Temp_object_Variable_7;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Temp_object_Variable_8;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Temp_object_Variable_9;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Temp_object_Variable_10;                           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPickupNotificationTypes                      Temp_byte_Variable_2;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x00E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x00F4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0104(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0114(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0124(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x0134(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_6;                            // 0x0144(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_7;                            // 0x0154(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPickupNotificationTypes                      Temp_byte_Variable_3;                              // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_8;                            // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_9;                            // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_10;                           // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_11;                           // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_12;                           // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_13;                           // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_14;                           // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_15;                           // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMainItemType                                 Temp_byte_Variable_4;                              // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPickupNotificationTypes                      Temp_byte_Variable_5;                              // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPickupNotificationTypes                      Temp_byte_Variable_6;                              // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPickupNotificationTypes                      Temp_byte_Variable_7;                              // 0x01EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPickupNotificationTypes                      Temp_byte_Variable_8;                              // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPickupNotificationTypes                      Temp_byte_Variable_9;                              // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPickupNotificationTypes                      Temp_byte_Variable_10;                             // 0x01EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPickupNotificationTypes                      Temp_byte_Variable_11;                             // 0x01EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPickupNotificationTypes                      Temp_byte_Variable_12;                             // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPickupNotificationTypes                      Temp_byte_Variable_13;                             // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPickupNotificationTypes                      Temp_byte_Variable_14;                             // 0x01F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPickupNotificationTypes                      Temp_byte_Variable_15;                             // 0x01F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPickupNotificationTypes                      Temp_byte_Variable_16;                             // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_17;                             // 0x01F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_18;                             // 0x01F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_19;                             // 0x01F7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_20;                             // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_21;                             // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_22;                             // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_23;                             // 0x01FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_24;                             // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPickupNotificationTypes                      Temp_byte_Variable_25;                             // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FE[0x2];                                      // 0x01FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable_11;                           // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_12;                           // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_13;                           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_14;                           // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_15;                           // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_16;                           // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_17;                           // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_18;                           // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable_19;                           // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_20;                           // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_21;                           // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CrystalFlask_ItemAbility_C*         K2Node_DynamicCast_AsBP_Crystal_Flask_Item_Ability; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Naceaia_ItemAbility_C*              K2Node_DynamicCast_AsBP_Naceaia_Item_Ability;      // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x028A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x028B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MandrakeRoot_ItemAbility_C*         K2Node_DynamicCast_AsBP_Mandrake_Root_Item_Ability; // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPickupNotificationTypes                      K2Node_Select_Default;                             // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29A[0x6];                                      // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default_1;                           // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               K2Node_Select_Default_2;                           // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_3;                           // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               K2Node_Select_Default_4;                           // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_5;                           // 0x02D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x02E8(0x0028)()
	struct FLinearColor                           K2Node_Select_Default_6;                           // 0x0310(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0320(0x0028)()
	ESlateVisibility                              K2Node_Select_Default_7;                           // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default_8;                           // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickupNotification_C_SetData) == 0x000008, "Wrong alignment on BP_PickupNotification_C_SetData");
static_assert(sizeof(BP_PickupNotification_C_SetData) == 0x000368, "Wrong size on BP_PickupNotification_C_SetData");
static_assert(offsetof(BP_PickupNotification_C_SetData, Param_Name_0) == 0x000000, "Member 'BP_PickupNotification_C_SetData::Param_Name_0' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Description) == 0x000018, "Member 'BP_PickupNotification_C_SetData::Description' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Icon_0) == 0x000030, "Member 'BP_PickupNotification_C_SetData::Icon_0' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Number) == 0x000038, "Member 'BP_PickupNotification_C_SetData::Number' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, ItemAbility_0) == 0x000040, "Member 'BP_PickupNotification_C_SetData::ItemAbility_0' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, FrameSpecial) == 0x000048, "Member 'BP_PickupNotification_C_SetData::FrameSpecial' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, FrameNormal) == 0x000050, "Member 'BP_PickupNotification_C_SetData::FrameNormal' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, NewLocalVar_0) == 0x000058, "Member 'BP_PickupNotification_C_SetData::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_object_Variable) == 0x000060, "Member 'BP_PickupNotification_C_SetData::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_object_Variable_1) == 0x000068, "Member 'BP_PickupNotification_C_SetData::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_object_Variable_2) == 0x000070, "Member 'BP_PickupNotification_C_SetData::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_byte_Variable) == 0x000078, "Member 'BP_PickupNotification_C_SetData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_float_Variable) == 0x00007C, "Member 'BP_PickupNotification_C_SetData::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_float_Variable_1) == 0x000080, "Member 'BP_PickupNotification_C_SetData::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_float_Variable_2) == 0x000084, "Member 'BP_PickupNotification_C_SetData::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_float_Variable_3) == 0x000088, "Member 'BP_PickupNotification_C_SetData::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_float_Variable_4) == 0x00008C, "Member 'BP_PickupNotification_C_SetData::Temp_float_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_float_Variable_5) == 0x000090, "Member 'BP_PickupNotification_C_SetData::Temp_float_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_float_Variable_6) == 0x000094, "Member 'BP_PickupNotification_C_SetData::Temp_float_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_float_Variable_7) == 0x000098, "Member 'BP_PickupNotification_C_SetData::Temp_float_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_byte_Variable_1) == 0x00009C, "Member 'BP_PickupNotification_C_SetData::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_object_Variable_3) == 0x0000A0, "Member 'BP_PickupNotification_C_SetData::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_object_Variable_4) == 0x0000A8, "Member 'BP_PickupNotification_C_SetData::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_object_Variable_5) == 0x0000B0, "Member 'BP_PickupNotification_C_SetData::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_object_Variable_6) == 0x0000B8, "Member 'BP_PickupNotification_C_SetData::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_object_Variable_7) == 0x0000C0, "Member 'BP_PickupNotification_C_SetData::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_object_Variable_8) == 0x0000C8, "Member 'BP_PickupNotification_C_SetData::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_object_Variable_9) == 0x0000D0, "Member 'BP_PickupNotification_C_SetData::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_object_Variable_10) == 0x0000D8, "Member 'BP_PickupNotification_C_SetData::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_byte_Variable_2) == 0x0000E0, "Member 'BP_PickupNotification_C_SetData::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_struct_Variable) == 0x0000E4, "Member 'BP_PickupNotification_C_SetData::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_struct_Variable_1) == 0x0000F4, "Member 'BP_PickupNotification_C_SetData::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_struct_Variable_2) == 0x000104, "Member 'BP_PickupNotification_C_SetData::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_struct_Variable_3) == 0x000114, "Member 'BP_PickupNotification_C_SetData::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_struct_Variable_4) == 0x000124, "Member 'BP_PickupNotification_C_SetData::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_struct_Variable_5) == 0x000134, "Member 'BP_PickupNotification_C_SetData::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_struct_Variable_6) == 0x000144, "Member 'BP_PickupNotification_C_SetData::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_struct_Variable_7) == 0x000154, "Member 'BP_PickupNotification_C_SetData::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_byte_Variable_3) == 0x000164, "Member 'BP_PickupNotification_C_SetData::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_struct_Variable_8) == 0x000168, "Member 'BP_PickupNotification_C_SetData::Temp_struct_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_struct_Variable_9) == 0x000178, "Member 'BP_PickupNotification_C_SetData::Temp_struct_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_struct_Variable_10) == 0x000188, "Member 'BP_PickupNotification_C_SetData::Temp_struct_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_struct_Variable_11) == 0x000198, "Member 'BP_PickupNotification_C_SetData::Temp_struct_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_struct_Variable_12) == 0x0001A8, "Member 'BP_PickupNotification_C_SetData::Temp_struct_Variable_12' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_struct_Variable_13) == 0x0001B8, "Member 'BP_PickupNotification_C_SetData::Temp_struct_Variable_13' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_struct_Variable_14) == 0x0001C8, "Member 'BP_PickupNotification_C_SetData::Temp_struct_Variable_14' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_struct_Variable_15) == 0x0001D8, "Member 'BP_PickupNotification_C_SetData::Temp_struct_Variable_15' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_byte_Variable_4) == 0x0001E8, "Member 'BP_PickupNotification_C_SetData::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_byte_Variable_5) == 0x0001E9, "Member 'BP_PickupNotification_C_SetData::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_byte_Variable_6) == 0x0001EA, "Member 'BP_PickupNotification_C_SetData::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_byte_Variable_7) == 0x0001EB, "Member 'BP_PickupNotification_C_SetData::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_byte_Variable_8) == 0x0001EC, "Member 'BP_PickupNotification_C_SetData::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_byte_Variable_9) == 0x0001ED, "Member 'BP_PickupNotification_C_SetData::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_byte_Variable_10) == 0x0001EE, "Member 'BP_PickupNotification_C_SetData::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_byte_Variable_11) == 0x0001EF, "Member 'BP_PickupNotification_C_SetData::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_byte_Variable_12) == 0x0001F0, "Member 'BP_PickupNotification_C_SetData::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_byte_Variable_13) == 0x0001F1, "Member 'BP_PickupNotification_C_SetData::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_byte_Variable_14) == 0x0001F2, "Member 'BP_PickupNotification_C_SetData::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_byte_Variable_15) == 0x0001F3, "Member 'BP_PickupNotification_C_SetData::Temp_byte_Variable_15' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_byte_Variable_16) == 0x0001F4, "Member 'BP_PickupNotification_C_SetData::Temp_byte_Variable_16' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_byte_Variable_17) == 0x0001F5, "Member 'BP_PickupNotification_C_SetData::Temp_byte_Variable_17' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_byte_Variable_18) == 0x0001F6, "Member 'BP_PickupNotification_C_SetData::Temp_byte_Variable_18' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_byte_Variable_19) == 0x0001F7, "Member 'BP_PickupNotification_C_SetData::Temp_byte_Variable_19' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_byte_Variable_20) == 0x0001F8, "Member 'BP_PickupNotification_C_SetData::Temp_byte_Variable_20' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_byte_Variable_21) == 0x0001F9, "Member 'BP_PickupNotification_C_SetData::Temp_byte_Variable_21' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_byte_Variable_22) == 0x0001FA, "Member 'BP_PickupNotification_C_SetData::Temp_byte_Variable_22' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_byte_Variable_23) == 0x0001FB, "Member 'BP_PickupNotification_C_SetData::Temp_byte_Variable_23' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_byte_Variable_24) == 0x0001FC, "Member 'BP_PickupNotification_C_SetData::Temp_byte_Variable_24' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_byte_Variable_25) == 0x0001FD, "Member 'BP_PickupNotification_C_SetData::Temp_byte_Variable_25' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_object_Variable_11) == 0x000200, "Member 'BP_PickupNotification_C_SetData::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_object_Variable_12) == 0x000208, "Member 'BP_PickupNotification_C_SetData::Temp_object_Variable_12' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_object_Variable_13) == 0x000210, "Member 'BP_PickupNotification_C_SetData::Temp_object_Variable_13' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_object_Variable_14) == 0x000218, "Member 'BP_PickupNotification_C_SetData::Temp_object_Variable_14' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_object_Variable_15) == 0x000220, "Member 'BP_PickupNotification_C_SetData::Temp_object_Variable_15' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_object_Variable_16) == 0x000228, "Member 'BP_PickupNotification_C_SetData::Temp_object_Variable_16' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_object_Variable_17) == 0x000230, "Member 'BP_PickupNotification_C_SetData::Temp_object_Variable_17' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_object_Variable_18) == 0x000238, "Member 'BP_PickupNotification_C_SetData::Temp_object_Variable_18' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_int_Variable) == 0x000240, "Member 'BP_PickupNotification_C_SetData::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_object_Variable_19) == 0x000248, "Member 'BP_PickupNotification_C_SetData::Temp_object_Variable_19' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_object_Variable_20) == 0x000250, "Member 'BP_PickupNotification_C_SetData::Temp_object_Variable_20' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_object_Variable_21) == 0x000258, "Member 'BP_PickupNotification_C_SetData::Temp_object_Variable_21' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000260, "Member 'BP_PickupNotification_C_SetData::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, Temp_int_Variable_1) == 0x000268, "Member 'BP_PickupNotification_C_SetData::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00026C, "Member 'BP_PickupNotification_C_SetData::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, K2Node_DynamicCast_AsBP_Crystal_Flask_Item_Ability) == 0x000270, "Member 'BP_PickupNotification_C_SetData::K2Node_DynamicCast_AsBP_Crystal_Flask_Item_Ability' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, K2Node_DynamicCast_bSuccess) == 0x000278, "Member 'BP_PickupNotification_C_SetData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, K2Node_DynamicCast_AsBP_Naceaia_Item_Ability) == 0x000280, "Member 'BP_PickupNotification_C_SetData::K2Node_DynamicCast_AsBP_Naceaia_Item_Ability' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, K2Node_DynamicCast_bSuccess_1) == 0x000288, "Member 'BP_PickupNotification_C_SetData::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000289, "Member 'BP_PickupNotification_C_SetData::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00028A, "Member 'BP_PickupNotification_C_SetData::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, CallFunc_BooleanOR_ReturnValue) == 0x00028B, "Member 'BP_PickupNotification_C_SetData::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00028C, "Member 'BP_PickupNotification_C_SetData::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, K2Node_DynamicCast_AsBP_Mandrake_Root_Item_Ability) == 0x000290, "Member 'BP_PickupNotification_C_SetData::K2Node_DynamicCast_AsBP_Mandrake_Root_Item_Ability' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, K2Node_DynamicCast_bSuccess_2) == 0x000298, "Member 'BP_PickupNotification_C_SetData::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, K2Node_Select_Default) == 0x000299, "Member 'BP_PickupNotification_C_SetData::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, K2Node_Select_Default_1) == 0x0002A0, "Member 'BP_PickupNotification_C_SetData::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, CallFunc_IsValid_ReturnValue) == 0x0002A8, "Member 'BP_PickupNotification_C_SetData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, K2Node_Select_Default_2) == 0x0002B0, "Member 'BP_PickupNotification_C_SetData::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, K2Node_Select_Default_3) == 0x0002B8, "Member 'BP_PickupNotification_C_SetData::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, K2Node_Select_Default_4) == 0x0002C0, "Member 'BP_PickupNotification_C_SetData::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x0002C8, "Member 'BP_PickupNotification_C_SetData::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x0002D0, "Member 'BP_PickupNotification_C_SetData::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, K2Node_Select_Default_5) == 0x0002D8, "Member 'BP_PickupNotification_C_SetData::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, K2Node_MakeStruct_SlateColor) == 0x0002E8, "Member 'BP_PickupNotification_C_SetData::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, K2Node_Select_Default_6) == 0x000310, "Member 'BP_PickupNotification_C_SetData::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, K2Node_MakeStruct_SlateColor_1) == 0x000320, "Member 'BP_PickupNotification_C_SetData::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, K2Node_Select_Default_7) == 0x000348, "Member 'BP_PickupNotification_C_SetData::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, K2Node_Select_Default_8) == 0x000350, "Member 'BP_PickupNotification_C_SetData::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, CallFunc_RandomInteger_ReturnValue) == 0x000358, "Member 'BP_PickupNotification_C_SetData::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_SetData, CallFunc_GetDynamicMaterial_ReturnValue_3) == 0x000360, "Member 'BP_PickupNotification_C_SetData::CallFunc_GetDynamicMaterial_ReturnValue_3' has a wrong offset!");

// Function BP_PickupNotification.BP_PickupNotification_C.ShowNotification
// 0x0078 (0x0078 - 0x0000)
struct BP_PickupNotification_C_ShowNotification final
{
public:
	float                                         Timeout;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Temp_object_Variable_3;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Temp_object_Variable_4;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Temp_object_Variable_5;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPickupNotificationTypes                      Temp_byte_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickupNotification_C_ShowNotification) == 0x000008, "Wrong alignment on BP_PickupNotification_C_ShowNotification");
static_assert(sizeof(BP_PickupNotification_C_ShowNotification) == 0x000078, "Wrong size on BP_PickupNotification_C_ShowNotification");
static_assert(offsetof(BP_PickupNotification_C_ShowNotification, Timeout) == 0x000000, "Member 'BP_PickupNotification_C_ShowNotification::Timeout' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_ShowNotification, Temp_object_Variable) == 0x000008, "Member 'BP_PickupNotification_C_ShowNotification::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_ShowNotification, Temp_object_Variable_1) == 0x000010, "Member 'BP_PickupNotification_C_ShowNotification::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PickupNotification_C_ShowNotification, Temp_object_Variable_2) == 0x000018, "Member 'BP_PickupNotification_C_ShowNotification::Temp_object_Variable_2' has a wrong offset!");
