#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerMonologue

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_PlayerMonologue.BP_PlayerMonologue_C
// 0x0050 (0x0520 - 0x04D0)
class UBP_PlayerMonologue_C final : public UPlayerMonologueUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeAnim;                                          // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                BlackBorder;                                       // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BottomScreenFrame;                                 // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyHoldX;                                    // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DebugLineID;                                       // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManRichTextBlock*                      PlayerMonologueText;                               // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PlayerMonologueTextBox;                            // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayerMonologueTexture;                            // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayerMonologueVideo;                              // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PlayerMonologue(int32 EntryPoint);
	void OnShowText(const class FText& InText, const class FText& InLineIDText, bool bSubtitleEnable);
	void OnSetPicture(class UTexture2D* Picture);
	void OnPlayVideo(const class FString& VideoUrl);
	void OnShow(float AnimDuration);
	void OnHide(float AnimDuration);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayerMonologue_C">();
	}
	static class UBP_PlayerMonologue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PlayerMonologue_C>();
	}
};
static_assert(alignof(UBP_PlayerMonologue_C) == 0x000008, "Wrong alignment on UBP_PlayerMonologue_C");
static_assert(sizeof(UBP_PlayerMonologue_C) == 0x000520, "Wrong size on UBP_PlayerMonologue_C");
static_assert(offsetof(UBP_PlayerMonologue_C, UberGraphFrame) == 0x0004D0, "Member 'UBP_PlayerMonologue_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_PlayerMonologue_C, FadeAnim) == 0x0004D8, "Member 'UBP_PlayerMonologue_C::FadeAnim' has a wrong offset!");
static_assert(offsetof(UBP_PlayerMonologue_C, BlackBorder) == 0x0004E0, "Member 'UBP_PlayerMonologue_C::BlackBorder' has a wrong offset!");
static_assert(offsetof(UBP_PlayerMonologue_C, BottomScreenFrame) == 0x0004E8, "Member 'UBP_PlayerMonologue_C::BottomScreenFrame' has a wrong offset!");
static_assert(offsetof(UBP_PlayerMonologue_C, BtnHotkeyHoldX) == 0x0004F0, "Member 'UBP_PlayerMonologue_C::BtnHotkeyHoldX' has a wrong offset!");
static_assert(offsetof(UBP_PlayerMonologue_C, DebugLineID) == 0x0004F8, "Member 'UBP_PlayerMonologue_C::DebugLineID' has a wrong offset!");
static_assert(offsetof(UBP_PlayerMonologue_C, PlayerMonologueText) == 0x000500, "Member 'UBP_PlayerMonologue_C::PlayerMonologueText' has a wrong offset!");
static_assert(offsetof(UBP_PlayerMonologue_C, PlayerMonologueTextBox) == 0x000508, "Member 'UBP_PlayerMonologue_C::PlayerMonologueTextBox' has a wrong offset!");
static_assert(offsetof(UBP_PlayerMonologue_C, PlayerMonologueTexture) == 0x000510, "Member 'UBP_PlayerMonologue_C::PlayerMonologueTexture' has a wrong offset!");
static_assert(offsetof(UBP_PlayerMonologue_C, PlayerMonologueVideo) == 0x000518, "Member 'UBP_PlayerMonologue_C::PlayerMonologueVideo' has a wrong offset!");

}

