#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PauseMenu_Button

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function BP_PauseMenu_Button.BP_PauseMenu_Button_C.ExecuteUbergraph_BP_PauseMenu_Button
// 0x0080 (0x0080 - 0x0000)
struct BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInBtnEnabled;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0024(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAnimate_1;                           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bAnimate;                             // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBtnEnabled_ReturnValue;                 // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63[0x1];                                       // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFocused_ReturnValue;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button) == 0x000008, "Wrong alignment on BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button");
static_assert(sizeof(BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button) == 0x000080, "Wrong size on BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button");
static_assert(offsetof(BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button, EntryPoint) == 0x000000, "Member 'BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button, K2Node_Event_bInBtnEnabled) == 0x000004, "Member 'BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button::K2Node_Event_bInBtnEnabled' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button, Temp_bool_Variable) == 0x000018, "Member 'BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button, Temp_float_Variable) == 0x00001C, "Member 'BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button, K2Node_Event_IsDesignTime) == 0x000020, "Member 'BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button, K2Node_Event_MyGeometry) == 0x000024, "Member 'BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button, K2Node_Event_InDeltaTime) == 0x00005C, "Member 'BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button, K2Node_Event_bAnimate_1) == 0x000060, "Member 'BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button::K2Node_Event_bAnimate_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button, K2Node_Event_bAnimate) == 0x000061, "Member 'BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button::K2Node_Event_bAnimate' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button, CallFunc_IsBtnEnabled_ReturnValue) == 0x000062, "Member 'BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button::CallFunc_IsBtnEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button, CallFunc_GetEndTime_ReturnValue) == 0x000064, "Member 'BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button, K2Node_Select_Default) == 0x000068, "Member 'BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button, CallFunc_PlayAnimation_ReturnValue) == 0x000070, "Member 'BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button, CallFunc_IsFocused_ReturnValue) == 0x000078, "Member 'BP_PauseMenu_Button_C_ExecuteUbergraph_BP_PauseMenu_Button::CallFunc_IsFocused_ReturnValue' has a wrong offset!");

// Function BP_PauseMenu_Button.BP_PauseMenu_Button_C.OnSetBtnEnabled
// 0x0001 (0x0001 - 0x0000)
struct BP_PauseMenu_Button_C_OnSetBtnEnabled final
{
public:
	bool                                          bInBtnEnabled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PauseMenu_Button_C_OnSetBtnEnabled) == 0x000001, "Wrong alignment on BP_PauseMenu_Button_C_OnSetBtnEnabled");
static_assert(sizeof(BP_PauseMenu_Button_C_OnSetBtnEnabled) == 0x000001, "Wrong size on BP_PauseMenu_Button_C_OnSetBtnEnabled");
static_assert(offsetof(BP_PauseMenu_Button_C_OnSetBtnEnabled, bInBtnEnabled) == 0x000000, "Member 'BP_PauseMenu_Button_C_OnSetBtnEnabled::bInBtnEnabled' has a wrong offset!");

// Function BP_PauseMenu_Button.BP_PauseMenu_Button_C.OnUnfocused
// 0x0001 (0x0001 - 0x0000)
struct BP_PauseMenu_Button_C_OnUnfocused final
{
public:
	bool                                          bAnimate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PauseMenu_Button_C_OnUnfocused) == 0x000001, "Wrong alignment on BP_PauseMenu_Button_C_OnUnfocused");
static_assert(sizeof(BP_PauseMenu_Button_C_OnUnfocused) == 0x000001, "Wrong size on BP_PauseMenu_Button_C_OnUnfocused");
static_assert(offsetof(BP_PauseMenu_Button_C_OnUnfocused, bAnimate) == 0x000000, "Member 'BP_PauseMenu_Button_C_OnUnfocused::bAnimate' has a wrong offset!");

// Function BP_PauseMenu_Button.BP_PauseMenu_Button_C.OnFocused
// 0x0001 (0x0001 - 0x0000)
struct BP_PauseMenu_Button_C_OnFocused final
{
public:
	bool                                          bAnimate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PauseMenu_Button_C_OnFocused) == 0x000001, "Wrong alignment on BP_PauseMenu_Button_C_OnFocused");
static_assert(sizeof(BP_PauseMenu_Button_C_OnFocused) == 0x000001, "Wrong size on BP_PauseMenu_Button_C_OnFocused");
static_assert(offsetof(BP_PauseMenu_Button_C_OnFocused, bAnimate) == 0x000000, "Member 'BP_PauseMenu_Button_C_OnFocused::bAnimate' has a wrong offset!");

// Function BP_PauseMenu_Button.BP_PauseMenu_Button_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_PauseMenu_Button_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PauseMenu_Button_C_Tick) == 0x000004, "Wrong alignment on BP_PauseMenu_Button_C_Tick");
static_assert(sizeof(BP_PauseMenu_Button_C_Tick) == 0x00003C, "Wrong size on BP_PauseMenu_Button_C_Tick");
static_assert(offsetof(BP_PauseMenu_Button_C_Tick, MyGeometry) == 0x000000, "Member 'BP_PauseMenu_Button_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_PauseMenu_Button_C_Tick::InDeltaTime' has a wrong offset!");

// Function BP_PauseMenu_Button.BP_PauseMenu_Button_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_PauseMenu_Button_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PauseMenu_Button_C_PreConstruct) == 0x000001, "Wrong alignment on BP_PauseMenu_Button_C_PreConstruct");
static_assert(sizeof(BP_PauseMenu_Button_C_PreConstruct) == 0x000001, "Wrong size on BP_PauseMenu_Button_C_PreConstruct");
static_assert(offsetof(BP_PauseMenu_Button_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_PauseMenu_Button_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_PauseMenu_Button.BP_PauseMenu_Button_C.OnPreviewKeyDown
// 0x02D0 (0x02D0 - 0x0000)
struct BP_PauseMenu_Button_C_OnPreviewKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsFocused_ReturnValue;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0130(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsHotkeyKey_ReturnValue;                  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0218(0x00B8)()
};
static_assert(alignof(BP_PauseMenu_Button_C_OnPreviewKeyDown) == 0x000008, "Wrong alignment on BP_PauseMenu_Button_C_OnPreviewKeyDown");
static_assert(sizeof(BP_PauseMenu_Button_C_OnPreviewKeyDown) == 0x0002D0, "Wrong size on BP_PauseMenu_Button_C_OnPreviewKeyDown");
static_assert(offsetof(BP_PauseMenu_Button_C_OnPreviewKeyDown, MyGeometry) == 0x000000, "Member 'BP_PauseMenu_Button_C_OnPreviewKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_OnPreviewKeyDown, InKeyEvent) == 0x000038, "Member 'BP_PauseMenu_Button_C_OnPreviewKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_OnPreviewKeyDown, ReturnValue) == 0x000070, "Member 'BP_PauseMenu_Button_C_OnPreviewKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_OnPreviewKeyDown, CallFunc_IsFocused_ReturnValue) == 0x000128, "Member 'BP_PauseMenu_Button_C_OnPreviewKeyDown::CallFunc_IsFocused_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_OnPreviewKeyDown, CallFunc_GetKey_ReturnValue) == 0x000130, "Member 'BP_PauseMenu_Button_C_OnPreviewKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_OnPreviewKeyDown, CallFunc_IsHotkeyKey_ReturnValue) == 0x000148, "Member 'BP_PauseMenu_Button_C_OnPreviewKeyDown::CallFunc_IsHotkeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_OnPreviewKeyDown, CallFunc_PlayAnimation_ReturnValue) == 0x000150, "Member 'BP_PauseMenu_Button_C_OnPreviewKeyDown::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_OnPreviewKeyDown, CallFunc_BooleanAND_ReturnValue) == 0x000158, "Member 'BP_PauseMenu_Button_C_OnPreviewKeyDown::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_OnPreviewKeyDown, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'BP_PauseMenu_Button_C_OnPreviewKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_OnPreviewKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000218, "Member 'BP_PauseMenu_Button_C_OnPreviewKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function BP_PauseMenu_Button.BP_PauseMenu_Button_C.ToggleEnabled
// 0x00C0 (0x00C0 - 0x0000)
struct BP_PauseMenu_Button_C_ToggleEnabled final
{
public:
	bool                                          InIsBtnEnabled;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBtnEnabled_ReturnValue;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBtnEnabled_ReturnValue_1;               // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBtnEnabled_ReturnValue_2;               // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0060(0x0028)()
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0098(0x0028)()
};
static_assert(alignof(BP_PauseMenu_Button_C_ToggleEnabled) == 0x000008, "Wrong alignment on BP_PauseMenu_Button_C_ToggleEnabled");
static_assert(sizeof(BP_PauseMenu_Button_C_ToggleEnabled) == 0x0000C0, "Wrong size on BP_PauseMenu_Button_C_ToggleEnabled");
static_assert(offsetof(BP_PauseMenu_Button_C_ToggleEnabled, InIsBtnEnabled) == 0x000000, "Member 'BP_PauseMenu_Button_C_ToggleEnabled::InIsBtnEnabled' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ToggleEnabled, Temp_bool_Variable) == 0x000001, "Member 'BP_PauseMenu_Button_C_ToggleEnabled::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ToggleEnabled, Temp_struct_Variable) == 0x000004, "Member 'BP_PauseMenu_Button_C_ToggleEnabled::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ToggleEnabled, Temp_struct_Variable_1) == 0x000014, "Member 'BP_PauseMenu_Button_C_ToggleEnabled::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ToggleEnabled, Temp_bool_Variable_1) == 0x000024, "Member 'BP_PauseMenu_Button_C_ToggleEnabled::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ToggleEnabled, Temp_struct_Variable_2) == 0x000028, "Member 'BP_PauseMenu_Button_C_ToggleEnabled::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ToggleEnabled, Temp_struct_Variable_3) == 0x000038, "Member 'BP_PauseMenu_Button_C_ToggleEnabled::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ToggleEnabled, CallFunc_IsBtnEnabled_ReturnValue) == 0x000048, "Member 'BP_PauseMenu_Button_C_ToggleEnabled::CallFunc_IsBtnEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ToggleEnabled, CallFunc_IsBtnEnabled_ReturnValue_1) == 0x000049, "Member 'BP_PauseMenu_Button_C_ToggleEnabled::CallFunc_IsBtnEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ToggleEnabled, CallFunc_IsBtnEnabled_ReturnValue_2) == 0x00004A, "Member 'BP_PauseMenu_Button_C_ToggleEnabled::CallFunc_IsBtnEnabled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ToggleEnabled, K2Node_Select_Default) == 0x00004C, "Member 'BP_PauseMenu_Button_C_ToggleEnabled::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ToggleEnabled, K2Node_MakeStruct_SlateColor) == 0x000060, "Member 'BP_PauseMenu_Button_C_ToggleEnabled::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ToggleEnabled, K2Node_Select_Default_1) == 0x000088, "Member 'BP_PauseMenu_Button_C_ToggleEnabled::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ToggleEnabled, K2Node_MakeStruct_SlateColor_1) == 0x000098, "Member 'BP_PauseMenu_Button_C_ToggleEnabled::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function BP_PauseMenu_Button.BP_PauseMenu_Button_C.ToggleIcon
// 0x0005 (0x0005 - 0x0000)
struct BP_PauseMenu_Button_C_ToggleIcon final
{
public:
	bool                                          InIconVisible;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PauseMenu_Button_C_ToggleIcon) == 0x000001, "Wrong alignment on BP_PauseMenu_Button_C_ToggleIcon");
static_assert(sizeof(BP_PauseMenu_Button_C_ToggleIcon) == 0x000005, "Wrong size on BP_PauseMenu_Button_C_ToggleIcon");
static_assert(offsetof(BP_PauseMenu_Button_C_ToggleIcon, InIconVisible) == 0x000000, "Member 'BP_PauseMenu_Button_C_ToggleIcon::InIconVisible' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ToggleIcon, Temp_bool_Variable) == 0x000001, "Member 'BP_PauseMenu_Button_C_ToggleIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ToggleIcon, Temp_byte_Variable) == 0x000002, "Member 'BP_PauseMenu_Button_C_ToggleIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ToggleIcon, Temp_byte_Variable_1) == 0x000003, "Member 'BP_PauseMenu_Button_C_ToggleIcon::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_ToggleIcon, K2Node_Select_Default) == 0x000004, "Member 'BP_PauseMenu_Button_C_ToggleIcon::K2Node_Select_Default' has a wrong offset!");

// Function BP_PauseMenu_Button.BP_PauseMenu_Button_C.Init
// 0x0058 (0x0058 - 0x0000)
struct BP_PauseMenu_Button_C_Init final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0028(0x0028)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PauseMenu_Button_C_Init) == 0x000008, "Wrong alignment on BP_PauseMenu_Button_C_Init");
static_assert(sizeof(BP_PauseMenu_Button_C_Init) == 0x000058, "Wrong size on BP_PauseMenu_Button_C_Init");
static_assert(offsetof(BP_PauseMenu_Button_C_Init, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'BP_PauseMenu_Button_C_Init::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_Init, K2Node_MakeStruct_SlateColor_1) == 0x000028, "Member 'BP_PauseMenu_Button_C_Init::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(BP_PauseMenu_Button_C_Init, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000050, "Member 'BP_PauseMenu_Button_C_Init::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

