#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PrivacyPolicyWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_PrivacyPolicyWindow.BP_PrivacyPolicyWindow_C
// 0x0050 (0x0548 - 0x04F8)
class UBP_PrivacyPolicyWindow_C final : public ULegalWindowUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Bg;                                                // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BottomScreenFrame;                                 // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_UserLoginNotification_C*            BP_UserLoginNotification;                          // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyHoldB;                                    // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyHoldX;                                    // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyRS_Up_Down;                               // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManRichTextBlock*                      ManRichText;                                       // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NormalFrame;                                       // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManScrollBox*                          TextScrollBox;                                     // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnSetText(const class FText& InText);
	void ExecuteUbergraph_BP_PrivacyPolicyWindow(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PrivacyPolicyWindow_C">();
	}
	static class UBP_PrivacyPolicyWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PrivacyPolicyWindow_C>();
	}
};
static_assert(alignof(UBP_PrivacyPolicyWindow_C) == 0x000008, "Wrong alignment on UBP_PrivacyPolicyWindow_C");
static_assert(sizeof(UBP_PrivacyPolicyWindow_C) == 0x000548, "Wrong size on UBP_PrivacyPolicyWindow_C");
static_assert(offsetof(UBP_PrivacyPolicyWindow_C, UberGraphFrame) == 0x0004F8, "Member 'UBP_PrivacyPolicyWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_PrivacyPolicyWindow_C, Bg) == 0x000500, "Member 'UBP_PrivacyPolicyWindow_C::Bg' has a wrong offset!");
static_assert(offsetof(UBP_PrivacyPolicyWindow_C, BottomScreenFrame) == 0x000508, "Member 'UBP_PrivacyPolicyWindow_C::BottomScreenFrame' has a wrong offset!");
static_assert(offsetof(UBP_PrivacyPolicyWindow_C, BP_UserLoginNotification) == 0x000510, "Member 'UBP_PrivacyPolicyWindow_C::BP_UserLoginNotification' has a wrong offset!");
static_assert(offsetof(UBP_PrivacyPolicyWindow_C, BtnHotkeyHoldB) == 0x000518, "Member 'UBP_PrivacyPolicyWindow_C::BtnHotkeyHoldB' has a wrong offset!");
static_assert(offsetof(UBP_PrivacyPolicyWindow_C, BtnHotkeyHoldX) == 0x000520, "Member 'UBP_PrivacyPolicyWindow_C::BtnHotkeyHoldX' has a wrong offset!");
static_assert(offsetof(UBP_PrivacyPolicyWindow_C, BtnHotkeyRS_Up_Down) == 0x000528, "Member 'UBP_PrivacyPolicyWindow_C::BtnHotkeyRS_Up_Down' has a wrong offset!");
static_assert(offsetof(UBP_PrivacyPolicyWindow_C, ManRichText) == 0x000530, "Member 'UBP_PrivacyPolicyWindow_C::ManRichText' has a wrong offset!");
static_assert(offsetof(UBP_PrivacyPolicyWindow_C, NormalFrame) == 0x000538, "Member 'UBP_PrivacyPolicyWindow_C::NormalFrame' has a wrong offset!");
static_assert(offsetof(UBP_PrivacyPolicyWindow_C, TextScrollBox) == 0x000540, "Member 'UBP_PrivacyPolicyWindow_C::TextScrollBox' has a wrong offset!");

}

