#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Phantom

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Phantom.BP_Phantom_C.ExecuteUbergraph_BP_Phantom
// 0x0014 (0x0014 - 0x0000)
struct BP_Phantom_C_ExecuteUbergraph_BP_Phantom final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_VfxEventType;                         // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Phantom_C_ExecuteUbergraph_BP_Phantom) == 0x000004, "Wrong alignment on BP_Phantom_C_ExecuteUbergraph_BP_Phantom");
static_assert(sizeof(BP_Phantom_C_ExecuteUbergraph_BP_Phantom) == 0x000014, "Wrong size on BP_Phantom_C_ExecuteUbergraph_BP_Phantom");
static_assert(offsetof(BP_Phantom_C_ExecuteUbergraph_BP_Phantom, EntryPoint) == 0x000000, "Member 'BP_Phantom_C_ExecuteUbergraph_BP_Phantom::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Phantom_C_ExecuteUbergraph_BP_Phantom, K2Node_Event_VfxEventType) == 0x000004, "Member 'BP_Phantom_C_ExecuteUbergraph_BP_Phantom::K2Node_Event_VfxEventType' has a wrong offset!");
static_assert(offsetof(BP_Phantom_C_ExecuteUbergraph_BP_Phantom, K2Node_SwitchName_CmpSuccess) == 0x00000C, "Member 'BP_Phantom_C_ExecuteUbergraph_BP_Phantom::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Phantom_C_ExecuteUbergraph_BP_Phantom, CallFunc_FClamp_ReturnValue) == 0x000010, "Member 'BP_Phantom_C_ExecuteUbergraph_BP_Phantom::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function BP_Phantom.BP_Phantom_C.OnVfxEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_Phantom_C_OnVfxEvent final
{
public:
	class FName                                   VfxEventType;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Phantom_C_OnVfxEvent) == 0x000004, "Wrong alignment on BP_Phantom_C_OnVfxEvent");
static_assert(sizeof(BP_Phantom_C_OnVfxEvent) == 0x000008, "Wrong size on BP_Phantom_C_OnVfxEvent");
static_assert(offsetof(BP_Phantom_C_OnVfxEvent, VfxEventType) == 0x000000, "Member 'BP_Phantom_C_OnVfxEvent::VfxEventType' has a wrong offset!");

}

