#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Panning_Waypoint

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Panning_Waypoint.BP_Panning_Waypoint_C.ExecuteUbergraph_BP_Panning_Waypoint
// 0x00A8 (0x00A8 - 0x0000)
struct BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Panning_Waypoint_C*>         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0020(0x0010)(ReferenceParm)
	class ABP_Panning_Waypoint_C*                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint) == 0x000008, "Wrong alignment on BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint");
static_assert(sizeof(BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint) == 0x0000A8, "Wrong size on BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint");
static_assert(offsetof(BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint, EntryPoint) == 0x000000, "Member 'BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint, CallFunc_Concat_StrStr_ReturnValue) == 0x000008, "Member 'BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint, CallFunc_GetAllActorsOfClass_OutActors) == 0x000020, "Member 'BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint, CallFunc_GetDisplayName_ReturnValue) == 0x000040, "Member 'BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint, CallFunc_Conv_IntToString_ReturnValue) == 0x000058, "Member 'BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000068, "Member 'BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000070, "Member 'BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000080, "Member 'BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000090, "Member 'BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A0, "Member 'BP_Panning_Waypoint_C_ExecuteUbergraph_BP_Panning_Waypoint::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Panning_Waypoint.BP_Panning_Waypoint_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_Panning_Waypoint_C_UserConstructionScript final
{
public:
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0000(0x0018)()
};
static_assert(alignof(BP_Panning_Waypoint_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Panning_Waypoint_C_UserConstructionScript");
static_assert(sizeof(BP_Panning_Waypoint_C_UserConstructionScript) == 0x000018, "Wrong size on BP_Panning_Waypoint_C_UserConstructionScript");
static_assert(offsetof(BP_Panning_Waypoint_C_UserConstructionScript, CallFunc_Conv_IntToText_ReturnValue) == 0x000000, "Member 'BP_Panning_Waypoint_C_UserConstructionScript::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

}

