#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Purgetoxin_Debuff_Status_VisualEntity

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Purgetoxin_Debuff_Status_VisualEntity.BP_Purgetoxin_Debuff_Status_VisualEntity_C.ExecuteUbergraph_BP_Purgetoxin_Debuff_Status_VisualEntity
// 0x0020 (0x0020 - 0x0000)
struct BP_Purgetoxin_Debuff_Status_VisualEntity_C_ExecuteUbergraph_BP_Purgetoxin_Debuff_Status_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Purgetoxin_Debuff_Status_VisualEntity_C_ExecuteUbergraph_BP_Purgetoxin_Debuff_Status_VisualEntity) == 0x000008, "Wrong alignment on BP_Purgetoxin_Debuff_Status_VisualEntity_C_ExecuteUbergraph_BP_Purgetoxin_Debuff_Status_VisualEntity");
static_assert(sizeof(BP_Purgetoxin_Debuff_Status_VisualEntity_C_ExecuteUbergraph_BP_Purgetoxin_Debuff_Status_VisualEntity) == 0x000020, "Wrong size on BP_Purgetoxin_Debuff_Status_VisualEntity_C_ExecuteUbergraph_BP_Purgetoxin_Debuff_Status_VisualEntity");
static_assert(offsetof(BP_Purgetoxin_Debuff_Status_VisualEntity_C_ExecuteUbergraph_BP_Purgetoxin_Debuff_Status_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_Purgetoxin_Debuff_Status_VisualEntity_C_ExecuteUbergraph_BP_Purgetoxin_Debuff_Status_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Purgetoxin_Debuff_Status_VisualEntity_C_ExecuteUbergraph_BP_Purgetoxin_Debuff_Status_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_Purgetoxin_Debuff_Status_VisualEntity_C_ExecuteUbergraph_BP_Purgetoxin_Debuff_Status_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Purgetoxin_Debuff_Status_VisualEntity_C_ExecuteUbergraph_BP_Purgetoxin_Debuff_Status_VisualEntity, K2Node_DynamicCast_AsCharacter_Base) == 0x000010, "Member 'BP_Purgetoxin_Debuff_Status_VisualEntity_C_ExecuteUbergraph_BP_Purgetoxin_Debuff_Status_VisualEntity::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_Purgetoxin_Debuff_Status_VisualEntity_C_ExecuteUbergraph_BP_Purgetoxin_Debuff_Status_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Purgetoxin_Debuff_Status_VisualEntity_C_ExecuteUbergraph_BP_Purgetoxin_Debuff_Status_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Purgetoxin_Debuff_Status_VisualEntity_C_ExecuteUbergraph_BP_Purgetoxin_Debuff_Status_VisualEntity, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00001C, "Member 'BP_Purgetoxin_Debuff_Status_VisualEntity_C_ExecuteUbergraph_BP_Purgetoxin_Debuff_Status_VisualEntity::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

}

