#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Prism_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Prism_VisualEntity.BP_Prism_VisualEntity_C
// 0x0030 (0x0380 - 0x0350)
class ABP_Prism_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TargetScale;                                       // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentTime;                                       // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            PulseCurve;                                        // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PulseDuration;                                     // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrismAbility*                          Prism;                                             // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Prism_VisualEntity(int32 EntryPoint);
	void OnCustomEvent(class FName CustomName);
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Prism_VisualEntity_C">();
	}
	static class ABP_Prism_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Prism_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_Prism_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_Prism_VisualEntity_C");
static_assert(sizeof(ABP_Prism_VisualEntity_C) == 0x000380, "Wrong size on ABP_Prism_VisualEntity_C");
static_assert(offsetof(ABP_Prism_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_Prism_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Prism_VisualEntity_C, Niagara) == 0x000358, "Member 'ABP_Prism_VisualEntity_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_Prism_VisualEntity_C, TargetScale) == 0x000360, "Member 'ABP_Prism_VisualEntity_C::TargetScale' has a wrong offset!");
static_assert(offsetof(ABP_Prism_VisualEntity_C, CurrentTime) == 0x000364, "Member 'ABP_Prism_VisualEntity_C::CurrentTime' has a wrong offset!");
static_assert(offsetof(ABP_Prism_VisualEntity_C, PulseCurve) == 0x000368, "Member 'ABP_Prism_VisualEntity_C::PulseCurve' has a wrong offset!");
static_assert(offsetof(ABP_Prism_VisualEntity_C, PulseDuration) == 0x000370, "Member 'ABP_Prism_VisualEntity_C::PulseDuration' has a wrong offset!");
static_assert(offsetof(ABP_Prism_VisualEntity_C, Prism) == 0x000378, "Member 'ABP_Prism_VisualEntity_C::Prism' has a wrong offset!");

}

