#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PauseMenu_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_PauseMenu_Button.BP_PauseMenu_Button_C
// 0x0130 (0x03B8 - 0x0288)
class UBP_PauseMenu_Button_C final : public UPauseMenuButtonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       BtnPressAnim;                                      // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HighlightAnim;                                     // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Bg;                                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonFrame;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Caption;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Caption_Highlight;                                 // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                FrameSel;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                FrameUp;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Highlight;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   CaptionText;                                       // 0x02E8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnHovered;                                         // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUnhovered;                                       // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnPressed;                                         // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnReleased;                                        // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnFocus;                                           // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UTexture2D*                             FrameTexture_Up;                                   // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             FrameTexture_Sel;                                  // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           SelectionColorOverlay;                             // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IconVisible;                                       // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             IconTexture_Up;                                    // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             IconTexture_Sel;                                   // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           TexColor_Up;                                       // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           TexColor_Sel;                                      // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PauseMenu_Button(int32 EntryPoint);
	void OnSetBtnEnabled(bool bInBtnEnabled);
	void OnUnfocused(bool bAnimate);
	void OnFocused(bool bAnimate);
	void OnClickedButton();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	struct FEventReply OnPreviewKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void ToggleEnabled(bool InIsBtnEnabled);
	void ToggleIcon(bool InIconVisible);
	void Init();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PauseMenu_Button_C">();
	}
	static class UBP_PauseMenu_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PauseMenu_Button_C>();
	}
};
static_assert(alignof(UBP_PauseMenu_Button_C) == 0x000008, "Wrong alignment on UBP_PauseMenu_Button_C");
static_assert(sizeof(UBP_PauseMenu_Button_C) == 0x0003B8, "Wrong size on UBP_PauseMenu_Button_C");
static_assert(offsetof(UBP_PauseMenu_Button_C, UberGraphFrame) == 0x000288, "Member 'UBP_PauseMenu_Button_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenu_Button_C, BtnPressAnim) == 0x000290, "Member 'UBP_PauseMenu_Button_C::BtnPressAnim' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenu_Button_C, HighlightAnim) == 0x000298, "Member 'UBP_PauseMenu_Button_C::HighlightAnim' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenu_Button_C, Bg) == 0x0002A0, "Member 'UBP_PauseMenu_Button_C::Bg' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenu_Button_C, ButtonFrame) == 0x0002A8, "Member 'UBP_PauseMenu_Button_C::ButtonFrame' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenu_Button_C, Caption) == 0x0002B0, "Member 'UBP_PauseMenu_Button_C::Caption' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenu_Button_C, Caption_Highlight) == 0x0002B8, "Member 'UBP_PauseMenu_Button_C::Caption_Highlight' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenu_Button_C, FrameSel) == 0x0002C0, "Member 'UBP_PauseMenu_Button_C::FrameSel' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenu_Button_C, FrameUp) == 0x0002C8, "Member 'UBP_PauseMenu_Button_C::FrameUp' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenu_Button_C, Icon) == 0x0002D0, "Member 'UBP_PauseMenu_Button_C::Icon' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenu_Button_C, Icon_Highlight) == 0x0002D8, "Member 'UBP_PauseMenu_Button_C::Icon_Highlight' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenu_Button_C, Overlay_0) == 0x0002E0, "Member 'UBP_PauseMenu_Button_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenu_Button_C, CaptionText) == 0x0002E8, "Member 'UBP_PauseMenu_Button_C::CaptionText' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenu_Button_C, OnClicked) == 0x000300, "Member 'UBP_PauseMenu_Button_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenu_Button_C, OnHovered) == 0x000310, "Member 'UBP_PauseMenu_Button_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenu_Button_C, OnUnhovered) == 0x000320, "Member 'UBP_PauseMenu_Button_C::OnUnhovered' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenu_Button_C, OnPressed) == 0x000330, "Member 'UBP_PauseMenu_Button_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenu_Button_C, OnReleased) == 0x000340, "Member 'UBP_PauseMenu_Button_C::OnReleased' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenu_Button_C, OnFocus) == 0x000350, "Member 'UBP_PauseMenu_Button_C::OnFocus' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenu_Button_C, FrameTexture_Up) == 0x000360, "Member 'UBP_PauseMenu_Button_C::FrameTexture_Up' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenu_Button_C, FrameTexture_Sel) == 0x000368, "Member 'UBP_PauseMenu_Button_C::FrameTexture_Sel' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenu_Button_C, SelectionColorOverlay) == 0x000370, "Member 'UBP_PauseMenu_Button_C::SelectionColorOverlay' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenu_Button_C, IconVisible) == 0x000380, "Member 'UBP_PauseMenu_Button_C::IconVisible' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenu_Button_C, IconTexture_Up) == 0x000388, "Member 'UBP_PauseMenu_Button_C::IconTexture_Up' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenu_Button_C, IconTexture_Sel) == 0x000390, "Member 'UBP_PauseMenu_Button_C::IconTexture_Sel' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenu_Button_C, TexColor_Up) == 0x000398, "Member 'UBP_PauseMenu_Button_C::TexColor_Up' has a wrong offset!");
static_assert(offsetof(UBP_PauseMenu_Button_C, TexColor_Sel) == 0x0003A8, "Member 'UBP_PauseMenu_Button_C::TexColor_Sel' has a wrong offset!");

}

