#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_pickup_die_general1

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_pickup_die_general1.BP_Pickup_die_general1_C.ExecuteUbergraph_BP_Pickup_die_general1
// 0x0050 (0x0050 - 0x0000)
struct BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UActorComponent*>                CallFunc_GetComponentsByTag_ReturnValue;           // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        K2Node_DynamicCast_AsScene_Component;              // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1) == 0x000008, "Wrong alignment on BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1");
static_assert(sizeof(BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1) == 0x000050, "Wrong size on BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1");
static_assert(offsetof(BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1, EntryPoint) == 0x000000, "Member 'BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1, CallFunc_GetComponentsByTag_ReturnValue) == 0x000018, "Member 'BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1, K2Node_DynamicCast_AsScene_Component) == 0x000040, "Member 'BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1::K2Node_DynamicCast_AsScene_Component' has a wrong offset!");
static_assert(offsetof(BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_Pickup_die_general1_C_ExecuteUbergraph_BP_Pickup_die_general1::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

