#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PeriodicBulletTrap

#include "Basic.hpp"

#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PeriodicBulletTrap.BP_PeriodicBulletTrap_C
// 0x0018 (0x0860 - 0x0848)
class ABP_PeriodicBulletTrap_C final : public AProjectileTrap
{
public:
	class UMiniMapActorComponent*                 MiniMapActor;                                      // 0x0848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0850(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTriggerBoxComponent*                   TriggerBox;                                        // 0x0858(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PeriodicBulletTrap_C">();
	}
	static class ABP_PeriodicBulletTrap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PeriodicBulletTrap_C>();
	}
};
static_assert(alignof(ABP_PeriodicBulletTrap_C) == 0x000008, "Wrong alignment on ABP_PeriodicBulletTrap_C");
static_assert(sizeof(ABP_PeriodicBulletTrap_C) == 0x000860, "Wrong size on ABP_PeriodicBulletTrap_C");
static_assert(offsetof(ABP_PeriodicBulletTrap_C, MiniMapActor) == 0x000848, "Member 'ABP_PeriodicBulletTrap_C::MiniMapActor' has a wrong offset!");
static_assert(offsetof(ABP_PeriodicBulletTrap_C, SkeletalMesh) == 0x000850, "Member 'ABP_PeriodicBulletTrap_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_PeriodicBulletTrap_C, TriggerBox) == 0x000858, "Member 'ABP_PeriodicBulletTrap_C::TriggerBox' has a wrong offset!");

}

