#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PoisonStacks_VisualEntity

#include "Basic.hpp"

#include "man_structs.hpp"


namespace SDK::Params
{

// Function BP_PoisonStacks_VisualEntity.BP_PoisonStacks_VisualEntity_C.ExecuteUbergraph_BP_PoisonStacks_VisualEntity
// 0x00A8 (0x00A8 - 0x0000)
struct BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStatusEffectController*                CallFunc_GetStatusEffectController_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BPGetStatusEffectStackNum_ReturnValue;    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SignOfInteger_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStatusEffectType                             K2Node_CustomEvent_StatusType;                     // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Stack;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EStatusEffectType StatusType, int32 Stack)> K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHPAboveZero_HasHP;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_4;            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity) == 0x000008, "Wrong alignment on BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity");
static_assert(sizeof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity) == 0x0000A8, "Wrong size on BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, CallFunc_GetAbilityController_ReturnValue) == 0x000008, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, CallFunc_GetStatusEffectController_ReturnValue) == 0x000010, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::CallFunc_GetStatusEffectController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, CallFunc_BPGetStatusEffectStackNum_ReturnValue) == 0x000018, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::CallFunc_BPGetStatusEffectStackNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00001D, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, CallFunc_SignOfInteger_ReturnValue) == 0x000024, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::CallFunc_SignOfInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000028, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000030, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000038, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, K2Node_CustomEvent_StatusType) == 0x00003C, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::K2Node_CustomEvent_StatusType' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, K2Node_CustomEvent_Stack) == 0x000040, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::K2Node_CustomEvent_Stack' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, CallFunc_FTrunc_ReturnValue) == 0x000044, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000048, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, CallFunc_Greater_IntInt_ReturnValue) == 0x000049, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, CallFunc_GetAttachParentActor_ReturnValue) == 0x000050, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, K2Node_DynamicCast_AsCharacter_Base) == 0x000058, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000068, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000080, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000084, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, CallFunc_Add_FloatFloat_ReturnValue) == 0x000088, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, CallFunc_FClamp_ReturnValue) == 0x00008C, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, CallFunc_IsHPAboveZero_HasHP) == 0x000090, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::CallFunc_IsHPAboveZero_HasHP' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, CallFunc_Not_PreBool_ReturnValue) == 0x000091, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x000094, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, CallFunc_Conv_IntToFloat_ReturnValue_3) == 0x000098, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::CallFunc_Conv_IntToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x00009C, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity, CallFunc_Conv_IntToFloat_ReturnValue_4) == 0x0000A0, "Member 'BP_PoisonStacks_VisualEntity_C_ExecuteUbergraph_BP_PoisonStacks_VisualEntity::CallFunc_Conv_IntToFloat_ReturnValue_4' has a wrong offset!");

// Function BP_PoisonStacks_VisualEntity.BP_PoisonStacks_VisualEntity_C.OnStatusEffectStackChanged
// 0x0008 (0x0008 - 0x0000)
struct BP_PoisonStacks_VisualEntity_C_OnStatusEffectStackChanged final
{
public:
	EStatusEffectType                             StatusType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Stack;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PoisonStacks_VisualEntity_C_OnStatusEffectStackChanged) == 0x000004, "Wrong alignment on BP_PoisonStacks_VisualEntity_C_OnStatusEffectStackChanged");
static_assert(sizeof(BP_PoisonStacks_VisualEntity_C_OnStatusEffectStackChanged) == 0x000008, "Wrong size on BP_PoisonStacks_VisualEntity_C_OnStatusEffectStackChanged");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_OnStatusEffectStackChanged, StatusType) == 0x000000, "Member 'BP_PoisonStacks_VisualEntity_C_OnStatusEffectStackChanged::StatusType' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_OnStatusEffectStackChanged, Stack) == 0x000004, "Member 'BP_PoisonStacks_VisualEntity_C_OnStatusEffectStackChanged::Stack' has a wrong offset!");

// Function BP_PoisonStacks_VisualEntity.BP_PoisonStacks_VisualEntity_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PoisonStacks_VisualEntity_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PoisonStacks_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PoisonStacks_VisualEntity_C_ReceiveTick");
static_assert(sizeof(BP_PoisonStacks_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong size on BP_PoisonStacks_VisualEntity_C_ReceiveTick");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PoisonStacks_VisualEntity_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PoisonStacks_VisualEntity.BP_PoisonStacks_VisualEntity_C.IsHPAboveZero
// 0x0020 (0x0020 - 0x0000)
struct BP_PoisonStacks_VisualEntity_C_IsHPAboveZero final
{
public:
	class ACharacterBase*                         InCharacter;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasHP;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttributeContainer*                    CallFunc_GetAttributeContainer_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PoisonStacks_VisualEntity_C_IsHPAboveZero) == 0x000008, "Wrong alignment on BP_PoisonStacks_VisualEntity_C_IsHPAboveZero");
static_assert(sizeof(BP_PoisonStacks_VisualEntity_C_IsHPAboveZero) == 0x000020, "Wrong size on BP_PoisonStacks_VisualEntity_C_IsHPAboveZero");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_IsHPAboveZero, InCharacter) == 0x000000, "Member 'BP_PoisonStacks_VisualEntity_C_IsHPAboveZero::InCharacter' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_IsHPAboveZero, HasHP) == 0x000008, "Member 'BP_PoisonStacks_VisualEntity_C_IsHPAboveZero::HasHP' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_IsHPAboveZero, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'BP_PoisonStacks_VisualEntity_C_IsHPAboveZero::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_IsHPAboveZero, CallFunc_GetAttributeContainer_ReturnValue) == 0x000010, "Member 'BP_PoisonStacks_VisualEntity_C_IsHPAboveZero::CallFunc_GetAttributeContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_IsHPAboveZero, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'BP_PoisonStacks_VisualEntity_C_IsHPAboveZero::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PoisonStacks_VisualEntity_C_IsHPAboveZero, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000019, "Member 'BP_PoisonStacks_VisualEntity_C_IsHPAboveZero::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

}

