#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Phoenix_VisualEntity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_Phoenix_VisualEntity.BP_Phoenix_VisualEntity_C.ExecuteUbergraph_BP_Phoenix_VisualEntity
// 0x0108 (0x0108 - 0x0000)
struct BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0024(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrawlerHero_C*                      K2Node_DynamicCast_AsBP_Brawler_Hero;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_GetSlotMeshComponents_ReturnValue;        // 0x0080(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       CallFunc_CacheDynamicMaterials_DynamicMaterials;   // 0x00A0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_2;                         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_3;                         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetChaoticEnergiesDefaults_CE_Color;      // 0x00F4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetChaoticEnergiesDefaults_CE_NormalCheck; // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity) == 0x000008, "Wrong alignment on BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity");
static_assert(sizeof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity) == 0x000108, "Wrong size on BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, K2Node_MakeStruct_LinearColor) == 0x000004, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, K2Node_MakeStruct_LinearColor_1) == 0x000014, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, Temp_delegate_Variable) == 0x000024, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, CallFunc_PostAkEvent_ReturnValue) == 0x000034, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, Temp_int_Array_Index_Variable) == 0x000038, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, Temp_int_Loop_Counter_Variable_1) == 0x000040, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, CallFunc_Add_IntInt_ReturnValue_1) == 0x000048, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, Temp_int_Loop_Counter_Variable_2) == 0x00004C, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, CallFunc_Add_IntInt_ReturnValue_2) == 0x000050, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, Temp_int_Array_Index_Variable_1) == 0x000054, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, Temp_int_Array_Index_Variable_2) == 0x000058, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, Temp_int_Loop_Counter_Variable_3) == 0x00005C, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, CallFunc_Add_IntInt_ReturnValue_3) == 0x000060, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, Temp_int_Array_Index_Variable_3) == 0x000064, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000068, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, K2Node_DynamicCast_AsBP_Brawler_Hero) == 0x000070, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::K2Node_DynamicCast_AsBP_Brawler_Hero' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, CallFunc_GetSlotMeshComponents_ReturnValue) == 0x000080, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::CallFunc_GetSlotMeshComponents_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, CallFunc_Array_Get_Item) == 0x000090, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, CallFunc_CacheDynamicMaterials_DynamicMaterials) == 0x0000A0, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::CallFunc_CacheDynamicMaterials_DynamicMaterials' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, CallFunc_Less_IntInt_ReturnValue) == 0x0000B0, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, CallFunc_Array_Get_Item_1) == 0x0000B8, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, CallFunc_Array_Add_ReturnValue) == 0x0000C0, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, CallFunc_Array_Length_ReturnValue_1) == 0x0000C4, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C8, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000CC, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, CallFunc_Array_Get_Item_2) == 0x0000D8, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, CallFunc_Array_Get_Item_3) == 0x0000E0, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, CallFunc_Array_Length_ReturnValue_2) == 0x0000E8, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, CallFunc_Array_Length_ReturnValue_3) == 0x0000EC, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000F0, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, CallFunc_Less_IntInt_ReturnValue_3) == 0x0000F1, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, CallFunc_GetChaoticEnergiesDefaults_CE_Color) == 0x0000F4, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::CallFunc_GetChaoticEnergiesDefaults_CE_Color' has a wrong offset!");
static_assert(offsetof(BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity, CallFunc_GetChaoticEnergiesDefaults_CE_NormalCheck) == 0x000104, "Member 'BP_Phoenix_VisualEntity_C_ExecuteUbergraph_BP_Phoenix_VisualEntity::CallFunc_GetChaoticEnergiesDefaults_CE_NormalCheck' has a wrong offset!");

}

