#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PrivacyPolicyWindow

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PrivacyPolicyWindow.BP_PrivacyPolicyWindow_C.OnSetText
// 0x0018 (0x0018 - 0x0000)
struct BP_PrivacyPolicyWindow_C_OnSetText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_PrivacyPolicyWindow_C_OnSetText) == 0x000008, "Wrong alignment on BP_PrivacyPolicyWindow_C_OnSetText");
static_assert(sizeof(BP_PrivacyPolicyWindow_C_OnSetText) == 0x000018, "Wrong size on BP_PrivacyPolicyWindow_C_OnSetText");
static_assert(offsetof(BP_PrivacyPolicyWindow_C_OnSetText, InText) == 0x000000, "Member 'BP_PrivacyPolicyWindow_C_OnSetText::InText' has a wrong offset!");

// Function BP_PrivacyPolicyWindow.BP_PrivacyPolicyWindow_C.ExecuteUbergraph_BP_PrivacyPolicyWindow
// 0x0020 (0x0020 - 0x0000)
struct BP_PrivacyPolicyWindow_C_ExecuteUbergraph_BP_PrivacyPolicyWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InText;                               // 0x0008(0x0018)(ConstParm)
};
static_assert(alignof(BP_PrivacyPolicyWindow_C_ExecuteUbergraph_BP_PrivacyPolicyWindow) == 0x000008, "Wrong alignment on BP_PrivacyPolicyWindow_C_ExecuteUbergraph_BP_PrivacyPolicyWindow");
static_assert(sizeof(BP_PrivacyPolicyWindow_C_ExecuteUbergraph_BP_PrivacyPolicyWindow) == 0x000020, "Wrong size on BP_PrivacyPolicyWindow_C_ExecuteUbergraph_BP_PrivacyPolicyWindow");
static_assert(offsetof(BP_PrivacyPolicyWindow_C_ExecuteUbergraph_BP_PrivacyPolicyWindow, EntryPoint) == 0x000000, "Member 'BP_PrivacyPolicyWindow_C_ExecuteUbergraph_BP_PrivacyPolicyWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PrivacyPolicyWindow_C_ExecuteUbergraph_BP_PrivacyPolicyWindow, K2Node_Event_InText) == 0x000008, "Member 'BP_PrivacyPolicyWindow_C_ExecuteUbergraph_BP_PrivacyPolicyWindow::K2Node_Event_InText' has a wrong offset!");

}

