#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PersonalCart_Interact

#include "Basic.hpp"

#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PersonalCart_Interact.BP_PersonalCart_Interact_C
// 0x0028 (0x0800 - 0x07D8)
class ABP_PersonalCart_Interact_C final : public AActorBase
{
public:
	class UMiniMapActorComponent*                 MiniMapActor;                                      // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_InteractPrompWidgetComponent_C*     BP_InteractPrompWidgetComponent;                   // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTriggerBoxComponent*                   TriggerBox;                                        // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Checked;                                           // 0x07F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PersonalCart_Interact_C">();
	}
	static class ABP_PersonalCart_Interact_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PersonalCart_Interact_C>();
	}
};
static_assert(alignof(ABP_PersonalCart_Interact_C) == 0x000008, "Wrong alignment on ABP_PersonalCart_Interact_C");
static_assert(sizeof(ABP_PersonalCart_Interact_C) == 0x000800, "Wrong size on ABP_PersonalCart_Interact_C");
static_assert(offsetof(ABP_PersonalCart_Interact_C, MiniMapActor) == 0x0007D8, "Member 'ABP_PersonalCart_Interact_C::MiniMapActor' has a wrong offset!");
static_assert(offsetof(ABP_PersonalCart_Interact_C, BP_InteractPrompWidgetComponent) == 0x0007E0, "Member 'ABP_PersonalCart_Interact_C::BP_InteractPrompWidgetComponent' has a wrong offset!");
static_assert(offsetof(ABP_PersonalCart_Interact_C, TriggerBox) == 0x0007E8, "Member 'ABP_PersonalCart_Interact_C::TriggerBox' has a wrong offset!");
static_assert(offsetof(ABP_PersonalCart_Interact_C, DefaultSceneRoot) == 0x0007F0, "Member 'ABP_PersonalCart_Interact_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_PersonalCart_Interact_C, Checked) == 0x0007F8, "Member 'ABP_PersonalCart_Interact_C::Checked' has a wrong offset!");

}

