#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerStats_MainStat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_PlayerStats_MainStat.BP_PlayerStats_MainStat_C
// 0x0080 (0x02E0 - 0x0260)
class UBP_PlayerStats_MainStat_C final : public UPlayerStatsStatUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             CaptionText;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RankText;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ValueText;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Caption;                                           // 0x0288(0x0018)(Edit, BlueprintVisible)
	class FText                                   Value;                                             // 0x02A0(0x0018)(Edit, BlueprintVisible)
	class FText                                   Rank;                                              // 0x02B8(0x0018)(Edit, BlueprintVisible)
	bool                                          RankVisible;                                       // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             IconTexture;                                       // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PlayerStats_MainStat(int32 EntryPoint);
	void OnSetCaption(const class FText& InCaption);
	void OnSetValue(const class FText& InValue);
	void PreConstruct(bool IsDesignTime);
	void SetCaption(const class FText& InCaption);
	void SetValue(const class FText& InValue);
	void SetRank(const class FText& InRank);
	void ShowRank(bool InRankVisible);
	void SetIcon(class UTexture2D* InIconTexture);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayerStats_MainStat_C">();
	}
	static class UBP_PlayerStats_MainStat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PlayerStats_MainStat_C>();
	}
};
static_assert(alignof(UBP_PlayerStats_MainStat_C) == 0x000008, "Wrong alignment on UBP_PlayerStats_MainStat_C");
static_assert(sizeof(UBP_PlayerStats_MainStat_C) == 0x0002E0, "Wrong size on UBP_PlayerStats_MainStat_C");
static_assert(offsetof(UBP_PlayerStats_MainStat_C, UberGraphFrame) == 0x000260, "Member 'UBP_PlayerStats_MainStat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_PlayerStats_MainStat_C, CaptionText) == 0x000268, "Member 'UBP_PlayerStats_MainStat_C::CaptionText' has a wrong offset!");
static_assert(offsetof(UBP_PlayerStats_MainStat_C, Icon) == 0x000270, "Member 'UBP_PlayerStats_MainStat_C::Icon' has a wrong offset!");
static_assert(offsetof(UBP_PlayerStats_MainStat_C, RankText) == 0x000278, "Member 'UBP_PlayerStats_MainStat_C::RankText' has a wrong offset!");
static_assert(offsetof(UBP_PlayerStats_MainStat_C, ValueText) == 0x000280, "Member 'UBP_PlayerStats_MainStat_C::ValueText' has a wrong offset!");
static_assert(offsetof(UBP_PlayerStats_MainStat_C, Caption) == 0x000288, "Member 'UBP_PlayerStats_MainStat_C::Caption' has a wrong offset!");
static_assert(offsetof(UBP_PlayerStats_MainStat_C, Value) == 0x0002A0, "Member 'UBP_PlayerStats_MainStat_C::Value' has a wrong offset!");
static_assert(offsetof(UBP_PlayerStats_MainStat_C, Rank) == 0x0002B8, "Member 'UBP_PlayerStats_MainStat_C::Rank' has a wrong offset!");
static_assert(offsetof(UBP_PlayerStats_MainStat_C, RankVisible) == 0x0002D0, "Member 'UBP_PlayerStats_MainStat_C::RankVisible' has a wrong offset!");
static_assert(offsetof(UBP_PlayerStats_MainStat_C, IconTexture) == 0x0002D8, "Member 'UBP_PlayerStats_MainStat_C::IconTexture' has a wrong offset!");

}

