#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Petfollower_TeleportStart_VE

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Petfollower_TeleportStart_VE.BP_Petfollower_TeleportStart_VE_C.ExecuteUbergraph_BP_Petfollower_TeleportStart_VE
// 0x00A8 (0x00A8 - 0x0000)
struct BP_Petfollower_TeleportStart_VE_C_ExecuteUbergraph_BP_Petfollower_TeleportStart_VE final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x001C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Petfollower_TeleportStart_VE_C_ExecuteUbergraph_BP_Petfollower_TeleportStart_VE) == 0x000008, "Wrong alignment on BP_Petfollower_TeleportStart_VE_C_ExecuteUbergraph_BP_Petfollower_TeleportStart_VE");
static_assert(sizeof(BP_Petfollower_TeleportStart_VE_C_ExecuteUbergraph_BP_Petfollower_TeleportStart_VE) == 0x0000A8, "Wrong size on BP_Petfollower_TeleportStart_VE_C_ExecuteUbergraph_BP_Petfollower_TeleportStart_VE");
static_assert(offsetof(BP_Petfollower_TeleportStart_VE_C_ExecuteUbergraph_BP_Petfollower_TeleportStart_VE, EntryPoint) == 0x000000, "Member 'BP_Petfollower_TeleportStart_VE_C_ExecuteUbergraph_BP_Petfollower_TeleportStart_VE::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Petfollower_TeleportStart_VE_C_ExecuteUbergraph_BP_Petfollower_TeleportStart_VE, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_Petfollower_TeleportStart_VE_C_ExecuteUbergraph_BP_Petfollower_TeleportStart_VE::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Petfollower_TeleportStart_VE_C_ExecuteUbergraph_BP_Petfollower_TeleportStart_VE, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_Petfollower_TeleportStart_VE_C_ExecuteUbergraph_BP_Petfollower_TeleportStart_VE::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Petfollower_TeleportStart_VE_C_ExecuteUbergraph_BP_Petfollower_TeleportStart_VE, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x00001C, "Member 'BP_Petfollower_TeleportStart_VE_C_ExecuteUbergraph_BP_Petfollower_TeleportStart_VE::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Petfollower_TeleportStart_VE_C_ExecuteUbergraph_BP_Petfollower_TeleportStart_VE, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0000A4, "Member 'BP_Petfollower_TeleportStart_VE_C_ExecuteUbergraph_BP_Petfollower_TeleportStart_VE::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

}

