#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PrismPulse_VisualEntity

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_PrismPulse_VisualEntity.BP_PrismPulse_VisualEntity_C.ExecuteUbergraph_BP_PrismPulse_VisualEntity
// 0x0078 (0x0078 - 0x0000)
struct BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABrawlerHero*                           K2Node_DynamicCast_AsBrawler_Hero;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrismAbility*                          K2Node_DynamicCast_AsPrism_Ability;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxDamageCharge_ReturnValue;           // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentDamageCharge_ReturnValue;       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity) == 0x000008, "Wrong alignment on BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity");
static_assert(sizeof(BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity) == 0x000078, "Wrong size on BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity");
static_assert(offsetof(BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity, Temp_delegate_Variable) == 0x000004, "Member 'BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity, Temp_delegate_Variable_1) == 0x000014, "Member 'BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity, CallFunc_PostEvent_ReturnValue) == 0x000024, "Member 'BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity, CallFunc_PostEvent_ReturnValue_1) == 0x000028, "Member 'BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000030, "Member 'BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity, K2Node_DynamicCast_AsBrawler_Hero) == 0x000038, "Member 'BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity::K2Node_DynamicCast_AsBrawler_Hero' has a wrong offset!");
static_assert(offsetof(BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity, CallFunc_GetAbilityController_ReturnValue) == 0x000048, "Member 'BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000050, "Member 'BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity, K2Node_DynamicCast_AsPrism_Ability) == 0x000058, "Member 'BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity::K2Node_DynamicCast_AsPrism_Ability' has a wrong offset!");
static_assert(offsetof(BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity, CallFunc_GetMaxDamageCharge_ReturnValue) == 0x000064, "Member 'BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity::CallFunc_GetMaxDamageCharge_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000068, "Member 'BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity, CallFunc_GetCurrentDamageCharge_ReturnValue) == 0x00006C, "Member 'BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity::CallFunc_GetCurrentDamageCharge_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000070, "Member 'BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000074, "Member 'BP_PrismPulse_VisualEntity_C_ExecuteUbergraph_BP_PrismPulse_VisualEntity::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");

}

