#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PhoenixDeath_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PhoenixDeath_VisualEntity.BP_PhoenixDeath_VisualEntity_C
// 0x0028 (0x03B8 - 0x0390)
class ABP_PhoenixDeath_VisualEntity_C final : public AMeshSamplingVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           AkComponent;                                       // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_GDD_2A8E4FEA46579308DBB34CAAD1586205;   // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Radius_2A8E4FEA46579308DBB34CAAD1586205; // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_2A8E4FEA46579308DBB34CAAD1586205; // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PhoenixDeath_VisualEntity(int32 EntryPoint);
	void OnEntityKilledWithRebirth_Event_0(class AActor* KilledActor);
	void VisualEntityConstructionFinished();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PhoenixDeath_VisualEntity_C">();
	}
	static class ABP_PhoenixDeath_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PhoenixDeath_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_PhoenixDeath_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_PhoenixDeath_VisualEntity_C");
static_assert(sizeof(ABP_PhoenixDeath_VisualEntity_C) == 0x0003B8, "Wrong size on ABP_PhoenixDeath_VisualEntity_C");
static_assert(offsetof(ABP_PhoenixDeath_VisualEntity_C, UberGraphFrame) == 0x000390, "Member 'ABP_PhoenixDeath_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PhoenixDeath_VisualEntity_C, AkComponent) == 0x000398, "Member 'ABP_PhoenixDeath_VisualEntity_C::AkComponent' has a wrong offset!");
static_assert(offsetof(ABP_PhoenixDeath_VisualEntity_C, Timeline_0_GDD_2A8E4FEA46579308DBB34CAAD1586205) == 0x0003A0, "Member 'ABP_PhoenixDeath_VisualEntity_C::Timeline_0_GDD_2A8E4FEA46579308DBB34CAAD1586205' has a wrong offset!");
static_assert(offsetof(ABP_PhoenixDeath_VisualEntity_C, Timeline_0_Radius_2A8E4FEA46579308DBB34CAAD1586205) == 0x0003A4, "Member 'ABP_PhoenixDeath_VisualEntity_C::Timeline_0_Radius_2A8E4FEA46579308DBB34CAAD1586205' has a wrong offset!");
static_assert(offsetof(ABP_PhoenixDeath_VisualEntity_C, Timeline_0__Direction_2A8E4FEA46579308DBB34CAAD1586205) == 0x0003A8, "Member 'ABP_PhoenixDeath_VisualEntity_C::Timeline_0__Direction_2A8E4FEA46579308DBB34CAAD1586205' has a wrong offset!");
static_assert(offsetof(ABP_PhoenixDeath_VisualEntity_C, Timeline_0) == 0x0003B0, "Member 'ABP_PhoenixDeath_VisualEntity_C::Timeline_0' has a wrong offset!");

}

