#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Panning_Agent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Panning_Agent.BP_Panning_Agent_C
// 0x0030 (0x0278 - 0x0248)
class ABP_Panning_Agent_C final : public APanningAgentBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Panning_Waypoint_C*>         WaypointList;                                      // 0x0258(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         ArrayIndex;                                        // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastIndex;                                         // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentWaypoint;                                   // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HighestWaypoint;                                   // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Panning_Agent(int32 EntryPoint);
	void Done();
	void OnEntityTeleportPost_Event_0(const struct FVector& NewLocation);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void FindArrayIndexOfWaypoint(int32 WaypointNumber);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Panning_Agent_C">();
	}
	static class ABP_Panning_Agent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Panning_Agent_C>();
	}
};
static_assert(alignof(ABP_Panning_Agent_C) == 0x000008, "Wrong alignment on ABP_Panning_Agent_C");
static_assert(sizeof(ABP_Panning_Agent_C) == 0x000278, "Wrong size on ABP_Panning_Agent_C");
static_assert(offsetof(ABP_Panning_Agent_C, UberGraphFrame) == 0x000248, "Member 'ABP_Panning_Agent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Panning_Agent_C, DefaultSceneRoot) == 0x000250, "Member 'ABP_Panning_Agent_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Panning_Agent_C, WaypointList) == 0x000258, "Member 'ABP_Panning_Agent_C::WaypointList' has a wrong offset!");
static_assert(offsetof(ABP_Panning_Agent_C, ArrayIndex) == 0x000268, "Member 'ABP_Panning_Agent_C::ArrayIndex' has a wrong offset!");
static_assert(offsetof(ABP_Panning_Agent_C, LastIndex) == 0x00026C, "Member 'ABP_Panning_Agent_C::LastIndex' has a wrong offset!");
static_assert(offsetof(ABP_Panning_Agent_C, CurrentWaypoint) == 0x000270, "Member 'ABP_Panning_Agent_C::CurrentWaypoint' has a wrong offset!");
static_assert(offsetof(ABP_Panning_Agent_C, HighestWaypoint) == 0x000274, "Member 'ABP_Panning_Agent_C::HighestWaypoint' has a wrong offset!");

}

