#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PeriodicBTrapProjectile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PeriodicBTrapProjectile.BP_PeriodicBTrapProjectile_C.ExecuteUbergraph_BP_PeriodicBTrapProjectile
// 0x0068 (0x0068 - 0x0000)
struct BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile) == 0x000008, "Wrong alignment on BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile");
static_assert(sizeof(BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile) == 0x000068, "Wrong size on BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile");
static_assert(offsetof(BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile, EntryPoint) == 0x000000, "Member 'BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile, Temp_delegate_Variable) == 0x000004, "Member 'BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile, Temp_delegate_Variable_1) == 0x000014, "Member 'BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000024, "Member 'BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000030, "Member 'BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000040, "Member 'BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile, CallFunc_PostAkEvent_ReturnValue) == 0x000048, "Member 'BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile, K2Node_Event_EndPlayReason) == 0x00004C, "Member 'BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile, CallFunc_PostAkEvent_ReturnValue_1) == 0x000050, "Member 'BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000054, "Member 'BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile, CallFunc_PostEventAtLocation_ReturnValue) == 0x000060, "Member 'BP_PeriodicBTrapProjectile_C_ExecuteUbergraph_BP_PeriodicBTrapProjectile::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");

// Function BP_PeriodicBTrapProjectile.BP_PeriodicBTrapProjectile_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_PeriodicBTrapProjectile_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PeriodicBTrapProjectile_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_PeriodicBTrapProjectile_C_ReceiveEndPlay");
static_assert(sizeof(BP_PeriodicBTrapProjectile_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_PeriodicBTrapProjectile_C_ReceiveEndPlay");
static_assert(offsetof(BP_PeriodicBTrapProjectile_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_PeriodicBTrapProjectile_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

