#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PouchOfGoldMedium

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PouchOfGoldMedium.BP_PouchOfGoldMedium_C
// 0x0028 (0x0830 - 0x0808)
class ABP_PouchOfGoldMedium_C final : public AChestBaseActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0808(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_InteractPrompWidgetComponent_C*     BP_InteractPrompWidgetComponent;                   // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere;                                            // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoundingBoxComponent*                  BoundingBox;                                       // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0828(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PouchOfGoldMedium(int32 EntryPoint);
	void BPPostBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PouchOfGoldMedium_C">();
	}
	static class ABP_PouchOfGoldMedium_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PouchOfGoldMedium_C>();
	}
};
static_assert(alignof(ABP_PouchOfGoldMedium_C) == 0x000008, "Wrong alignment on ABP_PouchOfGoldMedium_C");
static_assert(sizeof(ABP_PouchOfGoldMedium_C) == 0x000830, "Wrong size on ABP_PouchOfGoldMedium_C");
static_assert(offsetof(ABP_PouchOfGoldMedium_C, UberGraphFrame) == 0x000808, "Member 'ABP_PouchOfGoldMedium_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PouchOfGoldMedium_C, BP_InteractPrompWidgetComponent) == 0x000810, "Member 'ABP_PouchOfGoldMedium_C::BP_InteractPrompWidgetComponent' has a wrong offset!");
static_assert(offsetof(ABP_PouchOfGoldMedium_C, Sphere) == 0x000818, "Member 'ABP_PouchOfGoldMedium_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_PouchOfGoldMedium_C, BoundingBox) == 0x000820, "Member 'ABP_PouchOfGoldMedium_C::BoundingBox' has a wrong offset!");
static_assert(offsetof(ABP_PouchOfGoldMedium_C, DefaultSceneRoot) == 0x000828, "Member 'ABP_PouchOfGoldMedium_C::DefaultSceneRoot' has a wrong offset!");

}

