#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PickupItem_Base_VisualEntity

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PickupItem_Base_VisualEntity.BP_PickupItem_Base_VisualEntity_C.ExecuteUbergraph_BP_PickupItem_Base_VisualEntity
// 0x0048 (0x0048 - 0x0000)
struct BP_PickupItem_Base_VisualEntity_C_ExecuteUbergraph_BP_PickupItem_Base_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LootActor_C*                        K2Node_DynamicCast_AsBP_Loot_Actor;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_PickupItem_Base_VisualEntity_C_ExecuteUbergraph_BP_PickupItem_Base_VisualEntity) == 0x000008, "Wrong alignment on BP_PickupItem_Base_VisualEntity_C_ExecuteUbergraph_BP_PickupItem_Base_VisualEntity");
static_assert(sizeof(BP_PickupItem_Base_VisualEntity_C_ExecuteUbergraph_BP_PickupItem_Base_VisualEntity) == 0x000048, "Wrong size on BP_PickupItem_Base_VisualEntity_C_ExecuteUbergraph_BP_PickupItem_Base_VisualEntity");
static_assert(offsetof(BP_PickupItem_Base_VisualEntity_C_ExecuteUbergraph_BP_PickupItem_Base_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_PickupItem_Base_VisualEntity_C_ExecuteUbergraph_BP_PickupItem_Base_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PickupItem_Base_VisualEntity_C_ExecuteUbergraph_BP_PickupItem_Base_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_PickupItem_Base_VisualEntity_C_ExecuteUbergraph_BP_PickupItem_Base_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupItem_Base_VisualEntity_C_ExecuteUbergraph_BP_PickupItem_Base_VisualEntity, CallFunc_GetOwner_ReturnValue_1) == 0x000010, "Member 'BP_PickupItem_Base_VisualEntity_C_ExecuteUbergraph_BP_PickupItem_Base_VisualEntity::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PickupItem_Base_VisualEntity_C_ExecuteUbergraph_BP_PickupItem_Base_VisualEntity, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_PickupItem_Base_VisualEntity_C_ExecuteUbergraph_BP_PickupItem_Base_VisualEntity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupItem_Base_VisualEntity_C_ExecuteUbergraph_BP_PickupItem_Base_VisualEntity, CallFunc_GetOwner_ReturnValue_2) == 0x000020, "Member 'BP_PickupItem_Base_VisualEntity_C_ExecuteUbergraph_BP_PickupItem_Base_VisualEntity::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PickupItem_Base_VisualEntity_C_ExecuteUbergraph_BP_PickupItem_Base_VisualEntity, K2Node_DynamicCast_AsBP_Loot_Actor) == 0x000028, "Member 'BP_PickupItem_Base_VisualEntity_C_ExecuteUbergraph_BP_PickupItem_Base_VisualEntity::K2Node_DynamicCast_AsBP_Loot_Actor' has a wrong offset!");
static_assert(offsetof(BP_PickupItem_Base_VisualEntity_C_ExecuteUbergraph_BP_PickupItem_Base_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_PickupItem_Base_VisualEntity_C_ExecuteUbergraph_BP_PickupItem_Base_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PickupItem_Base_VisualEntity_C_ExecuteUbergraph_BP_PickupItem_Base_VisualEntity, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'BP_PickupItem_Base_VisualEntity_C_ExecuteUbergraph_BP_PickupItem_Base_VisualEntity::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

}

