#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PouchOfGoldVisualEntity

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PouchOfGoldVisualEntity.BP_PouchOfGoldVisualEntity_C.ExecuteUbergraph_BP_PouchOfGoldVisualEntity
// 0x0020 (0x0020 - 0x0000)
struct BP_PouchOfGoldVisualEntity_C_ExecuteUbergraph_BP_PouchOfGoldVisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchOnClass_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PouchOfGoldVisualEntity_C_ExecuteUbergraph_BP_PouchOfGoldVisualEntity) == 0x000008, "Wrong alignment on BP_PouchOfGoldVisualEntity_C_ExecuteUbergraph_BP_PouchOfGoldVisualEntity");
static_assert(sizeof(BP_PouchOfGoldVisualEntity_C_ExecuteUbergraph_BP_PouchOfGoldVisualEntity) == 0x000020, "Wrong size on BP_PouchOfGoldVisualEntity_C_ExecuteUbergraph_BP_PouchOfGoldVisualEntity");
static_assert(offsetof(BP_PouchOfGoldVisualEntity_C_ExecuteUbergraph_BP_PouchOfGoldVisualEntity, EntryPoint) == 0x000000, "Member 'BP_PouchOfGoldVisualEntity_C_ExecuteUbergraph_BP_PouchOfGoldVisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PouchOfGoldVisualEntity_C_ExecuteUbergraph_BP_PouchOfGoldVisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_PouchOfGoldVisualEntity_C_ExecuteUbergraph_BP_PouchOfGoldVisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PouchOfGoldVisualEntity_C_ExecuteUbergraph_BP_PouchOfGoldVisualEntity, CallFunc_GetObjectClass_ReturnValue) == 0x000010, "Member 'BP_PouchOfGoldVisualEntity_C_ExecuteUbergraph_BP_PouchOfGoldVisualEntity::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PouchOfGoldVisualEntity_C_ExecuteUbergraph_BP_PouchOfGoldVisualEntity, K2Node_SwitchOnClass_CmpSuccess) == 0x000018, "Member 'BP_PouchOfGoldVisualEntity_C_ExecuteUbergraph_BP_PouchOfGoldVisualEntity::K2Node_SwitchOnClass_CmpSuccess' has a wrong offset!");

}

