#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PickupItem_Base_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PickupItem_Base_VisualEntity.BP_PickupItem_Base_VisualEntity_C
// 0x0048 (0x0398 - 0x0350)
class ABP_PickupItem_Base_VisualEntity_C : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NiagaraLoopEnd;                                    // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraLoop;                                       // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      LandedExplo;                                       // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               LoopEnd;                                           // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Trail;                                             // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Loop;                                              // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_LootActor_C*                        As_BP_Loot_Actor_0;                                // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Delay;                                             // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PickupItem_Base_VisualEntity(int32 EntryPoint);
	void LandedEvent();
	void OnKill();
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PickupItem_Base_VisualEntity_C">();
	}
	static class ABP_PickupItem_Base_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PickupItem_Base_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_PickupItem_Base_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_PickupItem_Base_VisualEntity_C");
static_assert(sizeof(ABP_PickupItem_Base_VisualEntity_C) == 0x000398, "Wrong size on ABP_PickupItem_Base_VisualEntity_C");
static_assert(offsetof(ABP_PickupItem_Base_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_PickupItem_Base_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PickupItem_Base_VisualEntity_C, NiagaraLoopEnd) == 0x000358, "Member 'ABP_PickupItem_Base_VisualEntity_C::NiagaraLoopEnd' has a wrong offset!");
static_assert(offsetof(ABP_PickupItem_Base_VisualEntity_C, NiagaraLoop) == 0x000360, "Member 'ABP_PickupItem_Base_VisualEntity_C::NiagaraLoop' has a wrong offset!");
static_assert(offsetof(ABP_PickupItem_Base_VisualEntity_C, LandedExplo) == 0x000368, "Member 'ABP_PickupItem_Base_VisualEntity_C::LandedExplo' has a wrong offset!");
static_assert(offsetof(ABP_PickupItem_Base_VisualEntity_C, LoopEnd) == 0x000370, "Member 'ABP_PickupItem_Base_VisualEntity_C::LoopEnd' has a wrong offset!");
static_assert(offsetof(ABP_PickupItem_Base_VisualEntity_C, Trail) == 0x000378, "Member 'ABP_PickupItem_Base_VisualEntity_C::Trail' has a wrong offset!");
static_assert(offsetof(ABP_PickupItem_Base_VisualEntity_C, Loop) == 0x000380, "Member 'ABP_PickupItem_Base_VisualEntity_C::Loop' has a wrong offset!");
static_assert(offsetof(ABP_PickupItem_Base_VisualEntity_C, As_BP_Loot_Actor_0) == 0x000388, "Member 'ABP_PickupItem_Base_VisualEntity_C::As_BP_Loot_Actor_0' has a wrong offset!");
static_assert(offsetof(ABP_PickupItem_Base_VisualEntity_C, Delay) == 0x000390, "Member 'ABP_PickupItem_Base_VisualEntity_C::Delay' has a wrong offset!");

}

