#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Panning_Agent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Panning_Agent.BP_Panning_Agent_C.ExecuteUbergraph_BP_Panning_Agent
// 0x00F0 (0x00F0 - 0x0000)
struct BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetHeroLocation_ReturnValue;              // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Panning_Waypoint_C*>         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0028(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_GetHeroLocation_ReturnValue_1;            // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHeroGroundSpeed_ReturnValue;           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Panning_Waypoint_C*                 CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Panning_Waypoint_C*                 CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VInterpTo_Constant_ReturnValue;           // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_NewLocation;                    // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrawlerHero_C*                      K2Node_DynamicCast_AsBP_Brawler_Hero;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FVector& NewLocation)> K2Node_CreateDelegate_OutputDelegate;              // 0x00C4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Panning_Waypoint_C*                 CallFunc_Array_Get_Item_2;                         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent) == 0x000008, "Wrong alignment on BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent");
static_assert(sizeof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent) == 0x0000F0, "Wrong size on BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, EntryPoint) == 0x000000, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, CallFunc_GetHeroLocation_ReturnValue) == 0x000014, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::CallFunc_GetHeroLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, K2Node_Event_EndPlayReason) == 0x000020, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, CallFunc_GetAllActorsOfClass_OutActors) == 0x000028, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, CallFunc_GetHeroLocation_ReturnValue_1) == 0x000038, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::CallFunc_GetHeroLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, CallFunc_GetHeroGroundSpeed_ReturnValue) == 0x000044, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::CallFunc_GetHeroGroundSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000048, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00006C, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x000078, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, CallFunc_VInterpTo_Constant_ReturnValue) == 0x00007C, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::CallFunc_VInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, CallFunc_Add_IntInt_ReturnValue_1) == 0x000088, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, Temp_int_Variable) == 0x00008C, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, CallFunc_GetPlayerPawn_ReturnValue) == 0x000090, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, K2Node_CustomEvent_NewLocation) == 0x000098, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::K2Node_CustomEvent_NewLocation' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, K2Node_DynamicCast_AsBP_Brawler_Hero) == 0x0000A8, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::K2Node_DynamicCast_AsBP_Brawler_Hero' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, CallFunc_GetAbilityController_ReturnValue) == 0x0000B8, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, Temp_bool_Has_Been_Initd_Variable) == 0x0000C0, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, Temp_bool_IsClosed_Variable) == 0x0000C1, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, K2Node_CreateDelegate_OutputDelegate) == 0x0000C4, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, CallFunc_Array_Get_Item_2) == 0x0000D8, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, CallFunc_Array_LastIndex_ReturnValue) == 0x0000E0, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, CallFunc_Array_Length_ReturnValue) == 0x0000E4, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, CallFunc_Less_IntInt_ReturnValue) == 0x0000E8, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000E9, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent, CallFunc_Greater_IntInt_ReturnValue) == 0x0000EA, "Member 'BP_Panning_Agent_C_ExecuteUbergraph_BP_Panning_Agent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Panning_Agent.BP_Panning_Agent_C.OnEntityTeleportPost_Event_0
// 0x000C (0x000C - 0x0000)
struct BP_Panning_Agent_C_OnEntityTeleportPost_Event_0 final
{
public:
	struct FVector                                NewLocation;                                       // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Panning_Agent_C_OnEntityTeleportPost_Event_0) == 0x000004, "Wrong alignment on BP_Panning_Agent_C_OnEntityTeleportPost_Event_0");
static_assert(sizeof(BP_Panning_Agent_C_OnEntityTeleportPost_Event_0) == 0x00000C, "Wrong size on BP_Panning_Agent_C_OnEntityTeleportPost_Event_0");
static_assert(offsetof(BP_Panning_Agent_C_OnEntityTeleportPost_Event_0, NewLocation) == 0x000000, "Member 'BP_Panning_Agent_C_OnEntityTeleportPost_Event_0::NewLocation' has a wrong offset!");

// Function BP_Panning_Agent.BP_Panning_Agent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Panning_Agent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Panning_Agent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_Panning_Agent_C_ReceiveEndPlay");
static_assert(sizeof(BP_Panning_Agent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_Panning_Agent_C_ReceiveEndPlay");
static_assert(offsetof(BP_Panning_Agent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_Panning_Agent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_Panning_Agent.BP_Panning_Agent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Panning_Agent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Panning_Agent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Panning_Agent_C_ReceiveTick");
static_assert(sizeof(BP_Panning_Agent_C_ReceiveTick) == 0x000004, "Wrong size on BP_Panning_Agent_C_ReceiveTick");
static_assert(offsetof(BP_Panning_Agent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Panning_Agent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Panning_Agent.BP_Panning_Agent_C.FindArrayIndexOfWaypoint
// 0x0050 (0x0050 - 0x0000)
struct BP_Panning_Agent_C_FindArrayIndexOfWaypoint final
{
public:
	int32                                         WaypointNumber;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_Panning_Waypoint_C*                 CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Panning_Agent_C_FindArrayIndexOfWaypoint) == 0x000008, "Wrong alignment on BP_Panning_Agent_C_FindArrayIndexOfWaypoint");
static_assert(sizeof(BP_Panning_Agent_C_FindArrayIndexOfWaypoint) == 0x000050, "Wrong size on BP_Panning_Agent_C_FindArrayIndexOfWaypoint");
static_assert(offsetof(BP_Panning_Agent_C_FindArrayIndexOfWaypoint, WaypointNumber) == 0x000000, "Member 'BP_Panning_Agent_C_FindArrayIndexOfWaypoint::WaypointNumber' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_FindArrayIndexOfWaypoint, Temp_bool_True_if_break_was_hit_Variable) == 0x000004, "Member 'BP_Panning_Agent_C_FindArrayIndexOfWaypoint::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_FindArrayIndexOfWaypoint, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_Panning_Agent_C_FindArrayIndexOfWaypoint::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_FindArrayIndexOfWaypoint, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'BP_Panning_Agent_C_FindArrayIndexOfWaypoint::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_FindArrayIndexOfWaypoint, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_Panning_Agent_C_FindArrayIndexOfWaypoint::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_FindArrayIndexOfWaypoint, CallFunc_Conv_IntToString_ReturnValue) == 0x000018, "Member 'BP_Panning_Agent_C_FindArrayIndexOfWaypoint::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_FindArrayIndexOfWaypoint, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_Panning_Agent_C_FindArrayIndexOfWaypoint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_FindArrayIndexOfWaypoint, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'BP_Panning_Agent_C_FindArrayIndexOfWaypoint::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_FindArrayIndexOfWaypoint, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_Panning_Agent_C_FindArrayIndexOfWaypoint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_FindArrayIndexOfWaypoint, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_Panning_Agent_C_FindArrayIndexOfWaypoint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_FindArrayIndexOfWaypoint, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'BP_Panning_Agent_C_FindArrayIndexOfWaypoint::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_FindArrayIndexOfWaypoint, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00004D, "Member 'BP_Panning_Agent_C_FindArrayIndexOfWaypoint::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panning_Agent_C_FindArrayIndexOfWaypoint, CallFunc_BooleanAND_ReturnValue) == 0x00004E, "Member 'BP_Panning_Agent_C_FindArrayIndexOfWaypoint::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

