#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Parchment

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Parchment.BP_Parchment_C
// 0x0048 (0x0508 - 0x04C0)
class UBP_Parchment_C final : public UInfoScreenUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur;                                    // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BottomScreenFrame;                                 // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyB;                                        // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ParchmentText;                                     // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ParchmentTexture;                                  // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TopScreenFrame;                                    // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Parchment(int32 EntryPoint);
	void OnSetData(class UInfoScreentDataAsset* InInfoScreenData);
	void BndEvt__BtnHotkeyA2_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void OnInit();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnHide(float AnimDuration);
	void OnShow(float AnimDuration);
	void OnGamepadBEvent();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void Init(class UTexture2D* InParchmentTexture, const class FText& InParchmentText);
	void BtnHotkeyBClicked();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Parchment_C">();
	}
	static class UBP_Parchment_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Parchment_C>();
	}
};
static_assert(alignof(UBP_Parchment_C) == 0x000008, "Wrong alignment on UBP_Parchment_C");
static_assert(sizeof(UBP_Parchment_C) == 0x000508, "Wrong size on UBP_Parchment_C");
static_assert(offsetof(UBP_Parchment_C, UberGraphFrame) == 0x0004C0, "Member 'UBP_Parchment_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Parchment_C, FadeOutAnim) == 0x0004C8, "Member 'UBP_Parchment_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_Parchment_C, FadeInAnim) == 0x0004D0, "Member 'UBP_Parchment_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_Parchment_C, BackgroundBlur) == 0x0004D8, "Member 'UBP_Parchment_C::BackgroundBlur' has a wrong offset!");
static_assert(offsetof(UBP_Parchment_C, BottomScreenFrame) == 0x0004E0, "Member 'UBP_Parchment_C::BottomScreenFrame' has a wrong offset!");
static_assert(offsetof(UBP_Parchment_C, BtnHotkeyB) == 0x0004E8, "Member 'UBP_Parchment_C::BtnHotkeyB' has a wrong offset!");
static_assert(offsetof(UBP_Parchment_C, ParchmentText) == 0x0004F0, "Member 'UBP_Parchment_C::ParchmentText' has a wrong offset!");
static_assert(offsetof(UBP_Parchment_C, ParchmentTexture) == 0x0004F8, "Member 'UBP_Parchment_C::ParchmentTexture' has a wrong offset!");
static_assert(offsetof(UBP_Parchment_C, TopScreenFrame) == 0x000500, "Member 'UBP_Parchment_C::TopScreenFrame' has a wrong offset!");

}

