#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestReward

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_QuestReward.BP_QuestReward_C
// 0x0020 (0x0280 - 0x0260)
class UBP_QuestReward_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 IconFrame;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconImage;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             Icon;                                              // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_QuestReward(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void SetIcon(class UTexture2D* Icon_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_QuestReward_C">();
	}
	static class UBP_QuestReward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_QuestReward_C>();
	}
};
static_assert(alignof(UBP_QuestReward_C) == 0x000008, "Wrong alignment on UBP_QuestReward_C");
static_assert(sizeof(UBP_QuestReward_C) == 0x000280, "Wrong size on UBP_QuestReward_C");
static_assert(offsetof(UBP_QuestReward_C, UberGraphFrame) == 0x000260, "Member 'UBP_QuestReward_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_QuestReward_C, IconFrame) == 0x000268, "Member 'UBP_QuestReward_C::IconFrame' has a wrong offset!");
static_assert(offsetof(UBP_QuestReward_C, IconImage) == 0x000270, "Member 'UBP_QuestReward_C::IconImage' has a wrong offset!");
static_assert(offsetof(UBP_QuestReward_C, Icon) == 0x000278, "Member 'UBP_QuestReward_C::Icon' has a wrong offset!");

}

