#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestUpdatedWindow

#include "Basic.hpp"

#include "man_structs.hpp"


namespace SDK::Params
{

// Function BP_QuestUpdatedWindow.BP_QuestUpdatedWindow_C.ExecuteUbergraph_BP_QuestUpdatedWindow
// 0x0088 (0x0088 - 0x0000)
struct BP_QuestUpdatedWindow_C_ExecuteUbergraph_BP_QuestUpdatedWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHUDPopupQueue                         K2Node_Event_InHUDPopupQueue;                      // 0x0008(0x0058)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_AnimDuration_1;                       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue;         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration;                         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue_1;       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuestUpdatedWindow_C_ExecuteUbergraph_BP_QuestUpdatedWindow) == 0x000008, "Wrong alignment on BP_QuestUpdatedWindow_C_ExecuteUbergraph_BP_QuestUpdatedWindow");
static_assert(sizeof(BP_QuestUpdatedWindow_C_ExecuteUbergraph_BP_QuestUpdatedWindow) == 0x000088, "Wrong size on BP_QuestUpdatedWindow_C_ExecuteUbergraph_BP_QuestUpdatedWindow");
static_assert(offsetof(BP_QuestUpdatedWindow_C_ExecuteUbergraph_BP_QuestUpdatedWindow, EntryPoint) == 0x000000, "Member 'BP_QuestUpdatedWindow_C_ExecuteUbergraph_BP_QuestUpdatedWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_QuestUpdatedWindow_C_ExecuteUbergraph_BP_QuestUpdatedWindow, K2Node_Event_InHUDPopupQueue) == 0x000008, "Member 'BP_QuestUpdatedWindow_C_ExecuteUbergraph_BP_QuestUpdatedWindow::K2Node_Event_InHUDPopupQueue' has a wrong offset!");
static_assert(offsetof(BP_QuestUpdatedWindow_C_ExecuteUbergraph_BP_QuestUpdatedWindow, K2Node_Event_IsDesignTime) == 0x000060, "Member 'BP_QuestUpdatedWindow_C_ExecuteUbergraph_BP_QuestUpdatedWindow::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_QuestUpdatedWindow_C_ExecuteUbergraph_BP_QuestUpdatedWindow, K2Node_Event_AnimDuration_1) == 0x000064, "Member 'BP_QuestUpdatedWindow_C_ExecuteUbergraph_BP_QuestUpdatedWindow::K2Node_Event_AnimDuration_1' has a wrong offset!");
static_assert(offsetof(BP_QuestUpdatedWindow_C_ExecuteUbergraph_BP_QuestUpdatedWindow, CallFunc_GetAnimPlaybackSpeed_ReturnValue) == 0x000068, "Member 'BP_QuestUpdatedWindow_C_ExecuteUbergraph_BP_QuestUpdatedWindow::CallFunc_GetAnimPlaybackSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestUpdatedWindow_C_ExecuteUbergraph_BP_QuestUpdatedWindow, K2Node_Event_AnimDuration) == 0x00006C, "Member 'BP_QuestUpdatedWindow_C_ExecuteUbergraph_BP_QuestUpdatedWindow::K2Node_Event_AnimDuration' has a wrong offset!");
static_assert(offsetof(BP_QuestUpdatedWindow_C_ExecuteUbergraph_BP_QuestUpdatedWindow, CallFunc_PlayAnimation_ReturnValue) == 0x000070, "Member 'BP_QuestUpdatedWindow_C_ExecuteUbergraph_BP_QuestUpdatedWindow::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestUpdatedWindow_C_ExecuteUbergraph_BP_QuestUpdatedWindow, CallFunc_GetAnimPlaybackSpeed_ReturnValue_1) == 0x000078, "Member 'BP_QuestUpdatedWindow_C_ExecuteUbergraph_BP_QuestUpdatedWindow::CallFunc_GetAnimPlaybackSpeed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QuestUpdatedWindow_C_ExecuteUbergraph_BP_QuestUpdatedWindow, CallFunc_PlayAnimation_ReturnValue_1) == 0x000080, "Member 'BP_QuestUpdatedWindow_C_ExecuteUbergraph_BP_QuestUpdatedWindow::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function BP_QuestUpdatedWindow.BP_QuestUpdatedWindow_C.OnSetData
// 0x0058 (0x0058 - 0x0000)
struct BP_QuestUpdatedWindow_C_OnSetData final
{
public:
	struct FHUDPopupQueue                         InHUDPopupQueue;                                   // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_QuestUpdatedWindow_C_OnSetData) == 0x000008, "Wrong alignment on BP_QuestUpdatedWindow_C_OnSetData");
static_assert(sizeof(BP_QuestUpdatedWindow_C_OnSetData) == 0x000058, "Wrong size on BP_QuestUpdatedWindow_C_OnSetData");
static_assert(offsetof(BP_QuestUpdatedWindow_C_OnSetData, InHUDPopupQueue) == 0x000000, "Member 'BP_QuestUpdatedWindow_C_OnSetData::InHUDPopupQueue' has a wrong offset!");

// Function BP_QuestUpdatedWindow.BP_QuestUpdatedWindow_C.OnShow
// 0x0004 (0x0004 - 0x0000)
struct BP_QuestUpdatedWindow_C_OnShow final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuestUpdatedWindow_C_OnShow) == 0x000004, "Wrong alignment on BP_QuestUpdatedWindow_C_OnShow");
static_assert(sizeof(BP_QuestUpdatedWindow_C_OnShow) == 0x000004, "Wrong size on BP_QuestUpdatedWindow_C_OnShow");
static_assert(offsetof(BP_QuestUpdatedWindow_C_OnShow, AnimDuration) == 0x000000, "Member 'BP_QuestUpdatedWindow_C_OnShow::AnimDuration' has a wrong offset!");

// Function BP_QuestUpdatedWindow.BP_QuestUpdatedWindow_C.OnHide
// 0x0004 (0x0004 - 0x0000)
struct BP_QuestUpdatedWindow_C_OnHide final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuestUpdatedWindow_C_OnHide) == 0x000004, "Wrong alignment on BP_QuestUpdatedWindow_C_OnHide");
static_assert(sizeof(BP_QuestUpdatedWindow_C_OnHide) == 0x000004, "Wrong size on BP_QuestUpdatedWindow_C_OnHide");
static_assert(offsetof(BP_QuestUpdatedWindow_C_OnHide, AnimDuration) == 0x000000, "Member 'BP_QuestUpdatedWindow_C_OnHide::AnimDuration' has a wrong offset!");

// Function BP_QuestUpdatedWindow.BP_QuestUpdatedWindow_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_QuestUpdatedWindow_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_QuestUpdatedWindow_C_PreConstruct) == 0x000001, "Wrong alignment on BP_QuestUpdatedWindow_C_PreConstruct");
static_assert(sizeof(BP_QuestUpdatedWindow_C_PreConstruct) == 0x000001, "Wrong size on BP_QuestUpdatedWindow_C_PreConstruct");
static_assert(offsetof(BP_QuestUpdatedWindow_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_QuestUpdatedWindow_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_QuestUpdatedWindow.BP_QuestUpdatedWindow_C.BPSetData
// 0x0090 (0x0090 - 0x0000)
struct BP_QuestUpdatedWindow_C_BPSetData final
{
public:
	struct FHUDPopupQueue                         InHUDPopupQueue;                                   // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0058(0x0018)()
	class FText                                   CallFunc_BPGetObjectiveText_ReturnValue;           // 0x0070(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_QuestUpdatedWindow_C_BPSetData) == 0x000008, "Wrong alignment on BP_QuestUpdatedWindow_C_BPSetData");
static_assert(sizeof(BP_QuestUpdatedWindow_C_BPSetData) == 0x000090, "Wrong size on BP_QuestUpdatedWindow_C_BPSetData");
static_assert(offsetof(BP_QuestUpdatedWindow_C_BPSetData, InHUDPopupQueue) == 0x000000, "Member 'BP_QuestUpdatedWindow_C_BPSetData::InHUDPopupQueue' has a wrong offset!");
static_assert(offsetof(BP_QuestUpdatedWindow_C_BPSetData, CallFunc_GetEmptyText_ReturnValue) == 0x000058, "Member 'BP_QuestUpdatedWindow_C_BPSetData::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestUpdatedWindow_C_BPSetData, CallFunc_BPGetObjectiveText_ReturnValue) == 0x000070, "Member 'BP_QuestUpdatedWindow_C_BPSetData::CallFunc_BPGetObjectiveText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestUpdatedWindow_C_BPSetData, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'BP_QuestUpdatedWindow_C_BPSetData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestUpdatedWindow_C_BPSetData, CallFunc_TextIsEmpty_ReturnValue) == 0x000089, "Member 'BP_QuestUpdatedWindow_C_BPSetData::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");

}

