#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Quest_ListCategory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Quest_ListCategory.BP_Quest_ListCategory_C
// 0x0080 (0x0308 - 0x0288)
class UBP_Quest_ListCategory_C final : public UQuestListCategoryUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image;                                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_128;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_199;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NameCaption;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UBP_Quest_ListCategory_C* ItemReference)> OnHovered;                                         // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnReleased;                                        // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnPressed;                                         // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UBP_Quest_ListCategory_C* ItemReference)> OnUnfocus;                                         // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   Name_0;                                            // 0x02F0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BP_Quest_ListCategory(int32 EntryPoint);
	void OnSetState(bool InIsCollapsed);
	void OnUnfocused(bool bAnimate);
	void OnFocused(bool bAnimate);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void ToggleState(bool InIsCollapsed);
	void Set_Name(const class FText& InName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Quest_ListCategory_C">();
	}
	static class UBP_Quest_ListCategory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Quest_ListCategory_C>();
	}
};
static_assert(alignof(UBP_Quest_ListCategory_C) == 0x000008, "Wrong alignment on UBP_Quest_ListCategory_C");
static_assert(sizeof(UBP_Quest_ListCategory_C) == 0x000308, "Wrong size on UBP_Quest_ListCategory_C");
static_assert(offsetof(UBP_Quest_ListCategory_C, UberGraphFrame) == 0x000288, "Member 'UBP_Quest_ListCategory_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Quest_ListCategory_C, Image) == 0x000290, "Member 'UBP_Quest_ListCategory_C::Image' has a wrong offset!");
static_assert(offsetof(UBP_Quest_ListCategory_C, Image_128) == 0x000298, "Member 'UBP_Quest_ListCategory_C::Image_128' has a wrong offset!");
static_assert(offsetof(UBP_Quest_ListCategory_C, Image_199) == 0x0002A0, "Member 'UBP_Quest_ListCategory_C::Image_199' has a wrong offset!");
static_assert(offsetof(UBP_Quest_ListCategory_C, NameCaption) == 0x0002A8, "Member 'UBP_Quest_ListCategory_C::NameCaption' has a wrong offset!");
static_assert(offsetof(UBP_Quest_ListCategory_C, OnHovered) == 0x0002B0, "Member 'UBP_Quest_ListCategory_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UBP_Quest_ListCategory_C, OnReleased) == 0x0002C0, "Member 'UBP_Quest_ListCategory_C::OnReleased' has a wrong offset!");
static_assert(offsetof(UBP_Quest_ListCategory_C, OnPressed) == 0x0002D0, "Member 'UBP_Quest_ListCategory_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UBP_Quest_ListCategory_C, OnUnfocus) == 0x0002E0, "Member 'UBP_Quest_ListCategory_C::OnUnfocus' has a wrong offset!");
static_assert(offsetof(UBP_Quest_ListCategory_C, Name_0) == 0x0002F0, "Member 'UBP_Quest_ListCategory_C::Name_0' has a wrong offset!");

}

