#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_QuestItem.BP_QuestItem_C
// 0x0050 (0x02C8 - 0x0278)
class UBP_QuestItem_C final : public UQuestItemUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             CaptionAmount;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconImage;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Item;                                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NameText;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         resource;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ResourceIcon;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManRichTextBlock*                      ResourceText;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsItem;                                            // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	EHorizontalAlignment                          Alignment;                                         // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsSmallScreen;                                     // 0x02C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BP_QuestItem(int32 EntryPoint);
	void OnSetEssence(const class FText& EssenceText);
	void OnSetGold(const class FText& GoldText);
	void OnSetAmount(int32 InAmount);
	void OnSetItem(class UItemAbility* InItemAbility);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void SetItem(class UItemAbility* InItemAbility);
	void SetAmount(int32 InAmount);
	void SetMode(bool InIsItem);
	void SetAlignment(EHorizontalAlignment InAlignment);
	void ToggleSmallScreen(bool InIsSmallScreen);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_QuestItem_C">();
	}
	static class UBP_QuestItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_QuestItem_C>();
	}
};
static_assert(alignof(UBP_QuestItem_C) == 0x000008, "Wrong alignment on UBP_QuestItem_C");
static_assert(sizeof(UBP_QuestItem_C) == 0x0002C8, "Wrong size on UBP_QuestItem_C");
static_assert(offsetof(UBP_QuestItem_C, UberGraphFrame) == 0x000278, "Member 'UBP_QuestItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_QuestItem_C, CaptionAmount) == 0x000280, "Member 'UBP_QuestItem_C::CaptionAmount' has a wrong offset!");
static_assert(offsetof(UBP_QuestItem_C, IconImage) == 0x000288, "Member 'UBP_QuestItem_C::IconImage' has a wrong offset!");
static_assert(offsetof(UBP_QuestItem_C, Item) == 0x000290, "Member 'UBP_QuestItem_C::Item' has a wrong offset!");
static_assert(offsetof(UBP_QuestItem_C, NameText) == 0x000298, "Member 'UBP_QuestItem_C::NameText' has a wrong offset!");
static_assert(offsetof(UBP_QuestItem_C, Overlay_0) == 0x0002A0, "Member 'UBP_QuestItem_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UBP_QuestItem_C, resource) == 0x0002A8, "Member 'UBP_QuestItem_C::resource' has a wrong offset!");
static_assert(offsetof(UBP_QuestItem_C, ResourceIcon) == 0x0002B0, "Member 'UBP_QuestItem_C::ResourceIcon' has a wrong offset!");
static_assert(offsetof(UBP_QuestItem_C, ResourceText) == 0x0002B8, "Member 'UBP_QuestItem_C::ResourceText' has a wrong offset!");
static_assert(offsetof(UBP_QuestItem_C, IsItem) == 0x0002C0, "Member 'UBP_QuestItem_C::IsItem' has a wrong offset!");
static_assert(offsetof(UBP_QuestItem_C, Alignment) == 0x0002C1, "Member 'UBP_QuestItem_C::Alignment' has a wrong offset!");
static_assert(offsetof(UBP_QuestItem_C, IsSmallScreen) == 0x0002C2, "Member 'UBP_QuestItem_C::IsSmallScreen' has a wrong offset!");

}

