#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestNotification

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_QuestNotification.BP_QuestNotification_C
// 0x00E0 (0x0340 - 0x0260)
class UBP_QuestNotification_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeInBg;                                          // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeBg;                                            // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HighlightPanel;                                    // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadePanel;                                         // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowObjective;                                     // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideObjective;                                     // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HidePanel;                                         // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowPanel;                                         // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Bg;                                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeaderBg;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NameText;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_QuestNotificationObjective_C*       Objective0;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_QuestNotificationObjective_C*       Objective1;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_QuestNotificationObjective_C*       Objective2;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_QuestNotificationObjective_C*       Objective3;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_QuestNotificationObjective_C*       Objective4;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ObjectiveContainer;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_2;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 QuestIcon;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             Icon;                                              // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           FadeTimer;                                         // 0x0318(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UManQuest*                              ManQuest;                                          // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class UManQuestObjective*>             Objectives;                                        // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         RequestShowObjectives;                             // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSmallScreen;                                     // 0x033C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BP_QuestNotification(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void SetQuest(class UManQuest* InManQuest, TArray<class UManQuestObjective*>& InObjectives);
	void ShowQuest();
	void HideQuest();
	void UpdateObjective(TArray<class UManQuestObjective*>& InObjectives);
	void ShowNewObjective();
	void FadeQuest();
	void SetObjectivesState(TArray<class UManQuestObjective*>& InObjectives);
	void FadeOutBackground();
	void FadeInBackground();
	void ToggleSmallScreen(bool InIsSmallScreen);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_QuestNotification_C">();
	}
	static class UBP_QuestNotification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_QuestNotification_C>();
	}
};
static_assert(alignof(UBP_QuestNotification_C) == 0x000008, "Wrong alignment on UBP_QuestNotification_C");
static_assert(sizeof(UBP_QuestNotification_C) == 0x000340, "Wrong size on UBP_QuestNotification_C");
static_assert(offsetof(UBP_QuestNotification_C, UberGraphFrame) == 0x000260, "Member 'UBP_QuestNotification_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, FadeInBg) == 0x000268, "Member 'UBP_QuestNotification_C::FadeInBg' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, FadeBg) == 0x000270, "Member 'UBP_QuestNotification_C::FadeBg' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, HighlightPanel) == 0x000278, "Member 'UBP_QuestNotification_C::HighlightPanel' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, FadePanel) == 0x000280, "Member 'UBP_QuestNotification_C::FadePanel' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, ShowObjective) == 0x000288, "Member 'UBP_QuestNotification_C::ShowObjective' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, HideObjective) == 0x000290, "Member 'UBP_QuestNotification_C::HideObjective' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, HidePanel) == 0x000298, "Member 'UBP_QuestNotification_C::HidePanel' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, ShowPanel) == 0x0002A0, "Member 'UBP_QuestNotification_C::ShowPanel' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, Bg) == 0x0002A8, "Member 'UBP_QuestNotification_C::Bg' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, Border_0) == 0x0002B0, "Member 'UBP_QuestNotification_C::Border_0' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, HeaderBg) == 0x0002B8, "Member 'UBP_QuestNotification_C::HeaderBg' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, NameText) == 0x0002C0, "Member 'UBP_QuestNotification_C::NameText' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, Objective0) == 0x0002C8, "Member 'UBP_QuestNotification_C::Objective0' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, Objective1) == 0x0002D0, "Member 'UBP_QuestNotification_C::Objective1' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, Objective2) == 0x0002D8, "Member 'UBP_QuestNotification_C::Objective2' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, Objective3) == 0x0002E0, "Member 'UBP_QuestNotification_C::Objective3' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, Objective4) == 0x0002E8, "Member 'UBP_QuestNotification_C::Objective4' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, ObjectiveContainer) == 0x0002F0, "Member 'UBP_QuestNotification_C::ObjectiveContainer' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, Overlay_2) == 0x0002F8, "Member 'UBP_QuestNotification_C::Overlay_2' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, QuestIcon) == 0x000300, "Member 'UBP_QuestNotification_C::QuestIcon' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, SizeBox_0) == 0x000308, "Member 'UBP_QuestNotification_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, Icon) == 0x000310, "Member 'UBP_QuestNotification_C::Icon' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, FadeTimer) == 0x000318, "Member 'UBP_QuestNotification_C::FadeTimer' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, ManQuest) == 0x000320, "Member 'UBP_QuestNotification_C::ManQuest' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, Objectives) == 0x000328, "Member 'UBP_QuestNotification_C::Objectives' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, RequestShowObjectives) == 0x000338, "Member 'UBP_QuestNotification_C::RequestShowObjectives' has a wrong offset!");
static_assert(offsetof(UBP_QuestNotification_C, IsSmallScreen) == 0x00033C, "Member 'UBP_QuestNotification_C::IsSmallScreen' has a wrong offset!");

}

