#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestCompletedWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_QuestCompletedWindow.BP_QuestCompletedWindow_C
// 0x0080 (0x0590 - 0x0510)
class UBP_QuestCompletedWindow_C final : public UHUDPopupUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 DecorLeft;                                         // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DecorRight;                                        // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DecorUnder;                                        // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconImage;                                         // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NameText;                                          // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RewardBox;                                         // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RewardCaption;                                     // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleText;                                         // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             Icon;                                              // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           RemoveTimer;                                       // 0x0578(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     RewardIcons;                                       // 0x0580(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_QuestCompletedWindow(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void OnSetData(const struct FHUDPopupQueue& InHUDPopupQueue);
	void OnHideFinished();
	void OnShow(float AnimDuration);
	void OnHide(float AnimDuration);
	void ShowRewards(bool Show);
	void SetRewards();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_QuestCompletedWindow_C">();
	}
	static class UBP_QuestCompletedWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_QuestCompletedWindow_C>();
	}
};
static_assert(alignof(UBP_QuestCompletedWindow_C) == 0x000008, "Wrong alignment on UBP_QuestCompletedWindow_C");
static_assert(sizeof(UBP_QuestCompletedWindow_C) == 0x000590, "Wrong size on UBP_QuestCompletedWindow_C");
static_assert(offsetof(UBP_QuestCompletedWindow_C, UberGraphFrame) == 0x000510, "Member 'UBP_QuestCompletedWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_QuestCompletedWindow_C, FadeOutAnim) == 0x000518, "Member 'UBP_QuestCompletedWindow_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_QuestCompletedWindow_C, FadeInAnim) == 0x000520, "Member 'UBP_QuestCompletedWindow_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_QuestCompletedWindow_C, DecorLeft) == 0x000528, "Member 'UBP_QuestCompletedWindow_C::DecorLeft' has a wrong offset!");
static_assert(offsetof(UBP_QuestCompletedWindow_C, DecorRight) == 0x000530, "Member 'UBP_QuestCompletedWindow_C::DecorRight' has a wrong offset!");
static_assert(offsetof(UBP_QuestCompletedWindow_C, DecorUnder) == 0x000538, "Member 'UBP_QuestCompletedWindow_C::DecorUnder' has a wrong offset!");
static_assert(offsetof(UBP_QuestCompletedWindow_C, Frame) == 0x000540, "Member 'UBP_QuestCompletedWindow_C::Frame' has a wrong offset!");
static_assert(offsetof(UBP_QuestCompletedWindow_C, IconImage) == 0x000548, "Member 'UBP_QuestCompletedWindow_C::IconImage' has a wrong offset!");
static_assert(offsetof(UBP_QuestCompletedWindow_C, NameText) == 0x000550, "Member 'UBP_QuestCompletedWindow_C::NameText' has a wrong offset!");
static_assert(offsetof(UBP_QuestCompletedWindow_C, RewardBox) == 0x000558, "Member 'UBP_QuestCompletedWindow_C::RewardBox' has a wrong offset!");
static_assert(offsetof(UBP_QuestCompletedWindow_C, RewardCaption) == 0x000560, "Member 'UBP_QuestCompletedWindow_C::RewardCaption' has a wrong offset!");
static_assert(offsetof(UBP_QuestCompletedWindow_C, TitleText) == 0x000568, "Member 'UBP_QuestCompletedWindow_C::TitleText' has a wrong offset!");
static_assert(offsetof(UBP_QuestCompletedWindow_C, Icon) == 0x000570, "Member 'UBP_QuestCompletedWindow_C::Icon' has a wrong offset!");
static_assert(offsetof(UBP_QuestCompletedWindow_C, RemoveTimer) == 0x000578, "Member 'UBP_QuestCompletedWindow_C::RemoveTimer' has a wrong offset!");
static_assert(offsetof(UBP_QuestCompletedWindow_C, RewardIcons) == 0x000580, "Member 'UBP_QuestCompletedWindow_C::RewardIcons' has a wrong offset!");

}

