#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_QuestWindow.BP_QuestWindow_C
// 0x01D0 (0x06E8 - 0x0518)
class UBP_QuestWindow_C final : public UQuestWindowUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0518(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x0528(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_Quest_ListCategory_C*               ActiveQuests;                                      // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BgTexture;                                         // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BottomScreenFrame;                                 // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           BountyList;                                        // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Quest_ListCategory_C*               BountyQuests;                                      // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_QuestObjective_C*                   BP_QuestObjective;                                 // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_QuestObjective_C*                   BP_QuestObjective_1;                               // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_QuestObjective_C*                   BP_QuestObjective_2;                               // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_QuestObjective_C*                   BP_QuestObjective_104;                             // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_QuestObjective_C*                   BP_QuestObjective_182;                             // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CloseButton_C*                      BtnClose;                                          // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Double_C*            BtnHotkeyA;                                        // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyB;                                        // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyRS_Up_Down;                               // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnNextTab;                                        // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnPreviousTab;                                    // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanelBase;                                   // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Quest_ListCategory_C*               CompletedQuests;                                   // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ContentFrame;                                      // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HeadingQuestLog;                                   // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HeadingQuestRewards;                               // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_416;                                         // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_643;                                         // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               LeftPanel;                                         // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_QuestItem_C*                        QuestItem_1;                                       // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_QuestItem_C*                        QuestItem_2;                                       // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           QuestListActive;                                   // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           QuestListCompleted;                                // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           QuestListSecondary;                                // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 QuestNameSeparator;                                // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           QuestObjectives;                                   // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_QuestItem_C*                        QuestResource_1;                                   // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_QuestItem_C*                        QuestResource_2;                                   // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManScrollBox*                          QuestsScrollBox;                                   // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManRichTextBlock*                      QuestStory;                                        // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RightPanel;                                        // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManScrollBox*                          RightScrollBox;                                    // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScreenBg2;                                         // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollMaskBottom;                                  // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollMaskTop;                                     // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Quest_ListCategory_C*               SecondaryQuests;                                   // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SelectedQuestName;                                 // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectedQuestStateIcon;                            // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Attributes;                                    // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Character;                                     // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Inventory;                                     // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Map;                                           // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Quests;                                        // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Skills;                                        // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_WitchLantern;                                  // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Tabs;                                              // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleQuestLog;                                     // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleQuestRewards;                                 // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TopScreenFrame;                                    // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ESlateVisibility                              Resource2Visibility;                               // 0x06E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_QuestWindow(int32 EntryPoint);
	void OnSetInputDisplay(EInputDisplay InInputDisplay, EInputDisplay InControlDisplay);
	void BndEvt__BP_QuestWindow_BtnClose_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void OnIngameMenuEvent();
	void BndEvt__BP_QuestWindow_Tab_Map_1_K2Node_ComponentBoundEvent_17_OnClicked__DelegateSignature();
	void BndEvt__BP_QuestWindow_Tab_WitchLantern_1_K2Node_ComponentBoundEvent_15_OnClicked__DelegateSignature();
	void BndEvt__BP_QuestWindow_Tab_Skills_1_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature();
	void BndEvt__BP_QuestWindow_Tab_Attributes_1_K2Node_ComponentBoundEvent_13_OnClicked__DelegateSignature();
	void BndEvt__BP_QuestWindow_Tab_Inventory_1_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature();
	void BndEvt__BP_QuestWindow_Tab_Character_1_K2Node_ComponentBoundEvent_9_OnClicked__DelegateSignature();
	void OnGamepadLeftStickDownEvent();
	void OnGamepadLeftStickUpEvent();
	void BndEvt__BP_QuestWindow_BtnHotkeyA_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature();
	void OnRebuildQuestList(int32 InVisibleActiveQuestNum, int32 InVisibleBountyQuestNum, int32 InVisibleCompletedQuestNum);
	void OnGamepadRBEvent();
	void OnGamepadLBEvent();
	void BndEvt__BtnNextTab_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature();
	void BndEvt__BtnPreviousTab_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature();
	void BndEvt__BtnHotkeyB_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature();
	void OnSetSelectedQuest(class UManQuest* ManQuest, const class FText& StoryText);
	void OnHide(float AnimDuration);
	void OnShow(float AnimDuration);
	void OnGamepadBEvent();
	void OnGamepadAEvent();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void BP_SetSelectedQuest(class UManQuest* ManQuest, const class FText& StoryText);
	void BtnHotkeyBClicked(bool OpenPauseMenu);
	void BtnHotkeyAClicked();
	void SetType(bool InIsMainQuest);
	void SetBtnCloseVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_QuestWindow_C">();
	}
	static class UBP_QuestWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_QuestWindow_C>();
	}
};
static_assert(alignof(UBP_QuestWindow_C) == 0x000008, "Wrong alignment on UBP_QuestWindow_C");
static_assert(sizeof(UBP_QuestWindow_C) == 0x0006E8, "Wrong size on UBP_QuestWindow_C");
static_assert(offsetof(UBP_QuestWindow_C, UberGraphFrame) == 0x000518, "Member 'UBP_QuestWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, FadeOutAnim) == 0x000520, "Member 'UBP_QuestWindow_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, FadeInAnim) == 0x000528, "Member 'UBP_QuestWindow_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, ActiveQuests) == 0x000530, "Member 'UBP_QuestWindow_C::ActiveQuests' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, BgTexture) == 0x000538, "Member 'UBP_QuestWindow_C::BgTexture' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, BottomScreenFrame) == 0x000540, "Member 'UBP_QuestWindow_C::BottomScreenFrame' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, BountyList) == 0x000548, "Member 'UBP_QuestWindow_C::BountyList' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, BountyQuests) == 0x000550, "Member 'UBP_QuestWindow_C::BountyQuests' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, BP_QuestObjective) == 0x000558, "Member 'UBP_QuestWindow_C::BP_QuestObjective' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, BP_QuestObjective_1) == 0x000560, "Member 'UBP_QuestWindow_C::BP_QuestObjective_1' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, BP_QuestObjective_2) == 0x000568, "Member 'UBP_QuestWindow_C::BP_QuestObjective_2' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, BP_QuestObjective_104) == 0x000570, "Member 'UBP_QuestWindow_C::BP_QuestObjective_104' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, BP_QuestObjective_182) == 0x000578, "Member 'UBP_QuestWindow_C::BP_QuestObjective_182' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, BtnClose) == 0x000580, "Member 'UBP_QuestWindow_C::BtnClose' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, BtnHotkeyA) == 0x000588, "Member 'UBP_QuestWindow_C::BtnHotkeyA' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, BtnHotkeyB) == 0x000590, "Member 'UBP_QuestWindow_C::BtnHotkeyB' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, BtnHotkeyRS_Up_Down) == 0x000598, "Member 'UBP_QuestWindow_C::BtnHotkeyRS_Up_Down' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, BtnNextTab) == 0x0005A0, "Member 'UBP_QuestWindow_C::BtnNextTab' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, BtnPreviousTab) == 0x0005A8, "Member 'UBP_QuestWindow_C::BtnPreviousTab' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, CanvasPanelBase) == 0x0005B0, "Member 'UBP_QuestWindow_C::CanvasPanelBase' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, CompletedQuests) == 0x0005B8, "Member 'UBP_QuestWindow_C::CompletedQuests' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, ContentFrame) == 0x0005C0, "Member 'UBP_QuestWindow_C::ContentFrame' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, HeadingQuestLog) == 0x0005C8, "Member 'UBP_QuestWindow_C::HeadingQuestLog' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, HeadingQuestRewards) == 0x0005D0, "Member 'UBP_QuestWindow_C::HeadingQuestRewards' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, Image_416) == 0x0005D8, "Member 'UBP_QuestWindow_C::Image_416' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, Image_643) == 0x0005E0, "Member 'UBP_QuestWindow_C::Image_643' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, LeftPanel) == 0x0005E8, "Member 'UBP_QuestWindow_C::LeftPanel' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, QuestItem_1) == 0x0005F0, "Member 'UBP_QuestWindow_C::QuestItem_1' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, QuestItem_2) == 0x0005F8, "Member 'UBP_QuestWindow_C::QuestItem_2' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, QuestListActive) == 0x000600, "Member 'UBP_QuestWindow_C::QuestListActive' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, QuestListCompleted) == 0x000608, "Member 'UBP_QuestWindow_C::QuestListCompleted' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, QuestListSecondary) == 0x000610, "Member 'UBP_QuestWindow_C::QuestListSecondary' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, QuestNameSeparator) == 0x000618, "Member 'UBP_QuestWindow_C::QuestNameSeparator' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, QuestObjectives) == 0x000620, "Member 'UBP_QuestWindow_C::QuestObjectives' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, QuestResource_1) == 0x000628, "Member 'UBP_QuestWindow_C::QuestResource_1' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, QuestResource_2) == 0x000630, "Member 'UBP_QuestWindow_C::QuestResource_2' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, QuestsScrollBox) == 0x000638, "Member 'UBP_QuestWindow_C::QuestsScrollBox' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, QuestStory) == 0x000640, "Member 'UBP_QuestWindow_C::QuestStory' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, RightPanel) == 0x000648, "Member 'UBP_QuestWindow_C::RightPanel' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, RightScrollBox) == 0x000650, "Member 'UBP_QuestWindow_C::RightScrollBox' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, ScreenBg2) == 0x000658, "Member 'UBP_QuestWindow_C::ScreenBg2' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, ScrollMaskBottom) == 0x000660, "Member 'UBP_QuestWindow_C::ScrollMaskBottom' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, ScrollMaskTop) == 0x000668, "Member 'UBP_QuestWindow_C::ScrollMaskTop' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, SecondaryQuests) == 0x000670, "Member 'UBP_QuestWindow_C::SecondaryQuests' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, SelectedQuestName) == 0x000678, "Member 'UBP_QuestWindow_C::SelectedQuestName' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, SelectedQuestStateIcon) == 0x000680, "Member 'UBP_QuestWindow_C::SelectedQuestStateIcon' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, Tab_Attributes) == 0x000688, "Member 'UBP_QuestWindow_C::Tab_Attributes' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, Tab_Character) == 0x000690, "Member 'UBP_QuestWindow_C::Tab_Character' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, Tab_Inventory) == 0x000698, "Member 'UBP_QuestWindow_C::Tab_Inventory' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, Tab_Map) == 0x0006A0, "Member 'UBP_QuestWindow_C::Tab_Map' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, Tab_Quests) == 0x0006A8, "Member 'UBP_QuestWindow_C::Tab_Quests' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, Tab_Skills) == 0x0006B0, "Member 'UBP_QuestWindow_C::Tab_Skills' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, Tab_WitchLantern) == 0x0006B8, "Member 'UBP_QuestWindow_C::Tab_WitchLantern' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, Tabs) == 0x0006C0, "Member 'UBP_QuestWindow_C::Tabs' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, TitleQuestLog) == 0x0006C8, "Member 'UBP_QuestWindow_C::TitleQuestLog' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, TitleQuestRewards) == 0x0006D0, "Member 'UBP_QuestWindow_C::TitleQuestRewards' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, TopScreenFrame) == 0x0006D8, "Member 'UBP_QuestWindow_C::TopScreenFrame' has a wrong offset!");
static_assert(offsetof(UBP_QuestWindow_C, Resource2Visibility) == 0x0006E0, "Member 'UBP_QuestWindow_C::Resource2Visibility' has a wrong offset!");

}

