#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestUpdatedWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_QuestUpdatedWindow.BP_QuestUpdatedWindow_C
// 0x0038 (0x0548 - 0x0510)
class UBP_QuestUpdatedWindow_C final : public UHUDPopupUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconImage;                                         // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NameText;                                          // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleText;                                         // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_QuestUpdatedWindow(int32 EntryPoint);
	void OnSetData(const struct FHUDPopupQueue& InHUDPopupQueue);
	void OnShow(float AnimDuration);
	void OnHide(float AnimDuration);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void BPSetData(const struct FHUDPopupQueue& InHUDPopupQueue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_QuestUpdatedWindow_C">();
	}
	static class UBP_QuestUpdatedWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_QuestUpdatedWindow_C>();
	}
};
static_assert(alignof(UBP_QuestUpdatedWindow_C) == 0x000008, "Wrong alignment on UBP_QuestUpdatedWindow_C");
static_assert(sizeof(UBP_QuestUpdatedWindow_C) == 0x000548, "Wrong size on UBP_QuestUpdatedWindow_C");
static_assert(offsetof(UBP_QuestUpdatedWindow_C, UberGraphFrame) == 0x000510, "Member 'UBP_QuestUpdatedWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_QuestUpdatedWindow_C, FadeOutAnim) == 0x000518, "Member 'UBP_QuestUpdatedWindow_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_QuestUpdatedWindow_C, FadeInAnim) == 0x000520, "Member 'UBP_QuestUpdatedWindow_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_QuestUpdatedWindow_C, Frame) == 0x000528, "Member 'UBP_QuestUpdatedWindow_C::Frame' has a wrong offset!");
static_assert(offsetof(UBP_QuestUpdatedWindow_C, IconImage) == 0x000530, "Member 'UBP_QuestUpdatedWindow_C::IconImage' has a wrong offset!");
static_assert(offsetof(UBP_QuestUpdatedWindow_C, NameText) == 0x000538, "Member 'UBP_QuestUpdatedWindow_C::NameText' has a wrong offset!");
static_assert(offsetof(UBP_QuestUpdatedWindow_C, TitleText) == 0x000540, "Member 'UBP_QuestUpdatedWindow_C::TitleText' has a wrong offset!");

}

