#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestObjective

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_QuestObjective.BP_QuestObjective_C
// 0x0030 (0x02C8 - 0x0298)
class UBP_QuestObjective_C final : public UQuestObjectiveUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             ObjectiveCounter;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ObjectiveTextCaption;                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Separator;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StateIcon;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsFirstItem;                                       // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          IsSmallScreen;                                     // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BP_QuestObjective(int32 EntryPoint);
	void OnSetCounterText(const class FText& InCounterText);
	void OnSetObjectiveState(EQuestState InObjectiveState);
	void OnSetObjectiveText(const class FText& InObjectiveText);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void SetState(EQuestState InObjectiveState);
	void SetFirstItem(bool IsTop);
	void ShowCount(bool IsCountVisible);
	void ToggleSmallScreen(bool InIsSmallScreen);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_QuestObjective_C">();
	}
	static class UBP_QuestObjective_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_QuestObjective_C>();
	}
};
static_assert(alignof(UBP_QuestObjective_C) == 0x000008, "Wrong alignment on UBP_QuestObjective_C");
static_assert(sizeof(UBP_QuestObjective_C) == 0x0002C8, "Wrong size on UBP_QuestObjective_C");
static_assert(offsetof(UBP_QuestObjective_C, UberGraphFrame) == 0x000298, "Member 'UBP_QuestObjective_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_QuestObjective_C, ObjectiveCounter) == 0x0002A0, "Member 'UBP_QuestObjective_C::ObjectiveCounter' has a wrong offset!");
static_assert(offsetof(UBP_QuestObjective_C, ObjectiveTextCaption) == 0x0002A8, "Member 'UBP_QuestObjective_C::ObjectiveTextCaption' has a wrong offset!");
static_assert(offsetof(UBP_QuestObjective_C, Separator) == 0x0002B0, "Member 'UBP_QuestObjective_C::Separator' has a wrong offset!");
static_assert(offsetof(UBP_QuestObjective_C, StateIcon) == 0x0002B8, "Member 'UBP_QuestObjective_C::StateIcon' has a wrong offset!");
static_assert(offsetof(UBP_QuestObjective_C, IsFirstItem) == 0x0002C0, "Member 'UBP_QuestObjective_C::IsFirstItem' has a wrong offset!");
static_assert(offsetof(UBP_QuestObjective_C, IsSmallScreen) == 0x0002C1, "Member 'UBP_QuestObjective_C::IsSmallScreen' has a wrong offset!");

}

