#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RedEyeEntropic_ScreamPrecursor_VisualEntity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_RedEyeEntropic_ScreamPrecursor_VisualEntity.BP_RedEyeEntropic_ScreamPrecursor_VisualEntity_C.ExecuteUbergraph_BP_RedEyeEntropic_ScreamPrecursor_VisualEntity
// 0x0038 (0x0038 - 0x0000)
struct BP_RedEyeEntropic_ScreamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_RedEyeEntropic_ScreamPrecursor_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RedEyeEntropic_C*                   K2Node_DynamicCast_AsBP_Red_Eye_Entropic;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetScaledBoxExtent_ReturnValue;           // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RedEyeEntropic_ScreamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_RedEyeEntropic_ScreamPrecursor_VisualEntity) == 0x000008, "Wrong alignment on BP_RedEyeEntropic_ScreamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_RedEyeEntropic_ScreamPrecursor_VisualEntity");
static_assert(sizeof(BP_RedEyeEntropic_ScreamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_RedEyeEntropic_ScreamPrecursor_VisualEntity) == 0x000038, "Wrong size on BP_RedEyeEntropic_ScreamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_RedEyeEntropic_ScreamPrecursor_VisualEntity");
static_assert(offsetof(BP_RedEyeEntropic_ScreamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_RedEyeEntropic_ScreamPrecursor_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_RedEyeEntropic_ScreamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_RedEyeEntropic_ScreamPrecursor_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RedEyeEntropic_ScreamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_RedEyeEntropic_ScreamPrecursor_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_RedEyeEntropic_ScreamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_RedEyeEntropic_ScreamPrecursor_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedEyeEntropic_ScreamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_RedEyeEntropic_ScreamPrecursor_VisualEntity, K2Node_DynamicCast_AsBP_Red_Eye_Entropic) == 0x000010, "Member 'BP_RedEyeEntropic_ScreamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_RedEyeEntropic_ScreamPrecursor_VisualEntity::K2Node_DynamicCast_AsBP_Red_Eye_Entropic' has a wrong offset!");
static_assert(offsetof(BP_RedEyeEntropic_ScreamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_RedEyeEntropic_ScreamPrecursor_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_RedEyeEntropic_ScreamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_RedEyeEntropic_ScreamPrecursor_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_RedEyeEntropic_ScreamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_RedEyeEntropic_ScreamPrecursor_VisualEntity, CallFunc_GetScaledBoxExtent_ReturnValue) == 0x00001C, "Member 'BP_RedEyeEntropic_ScreamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_RedEyeEntropic_ScreamPrecursor_VisualEntity::CallFunc_GetScaledBoxExtent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedEyeEntropic_ScreamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_RedEyeEntropic_ScreamPrecursor_VisualEntity, CallFunc_BreakVector_X) == 0x000028, "Member 'BP_RedEyeEntropic_ScreamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_RedEyeEntropic_ScreamPrecursor_VisualEntity::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_RedEyeEntropic_ScreamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_RedEyeEntropic_ScreamPrecursor_VisualEntity, CallFunc_BreakVector_Y) == 0x00002C, "Member 'BP_RedEyeEntropic_ScreamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_RedEyeEntropic_ScreamPrecursor_VisualEntity::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_RedEyeEntropic_ScreamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_RedEyeEntropic_ScreamPrecursor_VisualEntity, CallFunc_BreakVector_Z) == 0x000030, "Member 'BP_RedEyeEntropic_ScreamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_RedEyeEntropic_ScreamPrecursor_VisualEntity::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_RedEyeEntropic_ScreamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_RedEyeEntropic_ScreamPrecursor_VisualEntity, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000034, "Member 'BP_RedEyeEntropic_ScreamPrecursor_VisualEntity_C_ExecuteUbergraph_BP_RedEyeEntropic_ScreamPrecursor_VisualEntity::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

}

