#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RelicDischargeMarker_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RelicDischargeMarker_VisualEntity.BP_RelicDischargeMarker_VisualEntity_C
// 0x0028 (0x0378 - 0x0350)
class ABP_RelicDischargeMarker_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara_Area;                                      // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ChargedUp;                                         // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChargedUpMulti;                                    // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URelicDischargeAbility*                 DischargeAbility;                                  // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_RelicDischargeMarker_VisualEntity(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void OnKill();
	void VisualEntityConstructionFinished();
	void SelectVFXAsset(class UAbilityController* OwnerAbilityController);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RelicDischargeMarker_VisualEntity_C">();
	}
	static class ABP_RelicDischargeMarker_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RelicDischargeMarker_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_RelicDischargeMarker_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_RelicDischargeMarker_VisualEntity_C");
static_assert(sizeof(ABP_RelicDischargeMarker_VisualEntity_C) == 0x000378, "Wrong size on ABP_RelicDischargeMarker_VisualEntity_C");
static_assert(offsetof(ABP_RelicDischargeMarker_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_RelicDischargeMarker_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_RelicDischargeMarker_VisualEntity_C, Ak) == 0x000358, "Member 'ABP_RelicDischargeMarker_VisualEntity_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_RelicDischargeMarker_VisualEntity_C, Niagara_Area) == 0x000360, "Member 'ABP_RelicDischargeMarker_VisualEntity_C::Niagara_Area' has a wrong offset!");
static_assert(offsetof(ABP_RelicDischargeMarker_VisualEntity_C, ChargedUp) == 0x000368, "Member 'ABP_RelicDischargeMarker_VisualEntity_C::ChargedUp' has a wrong offset!");
static_assert(offsetof(ABP_RelicDischargeMarker_VisualEntity_C, ChargedUpMulti) == 0x00036C, "Member 'ABP_RelicDischargeMarker_VisualEntity_C::ChargedUpMulti' has a wrong offset!");
static_assert(offsetof(ABP_RelicDischargeMarker_VisualEntity_C, DischargeAbility) == 0x000370, "Member 'ABP_RelicDischargeMarker_VisualEntity_C::DischargeAbility' has a wrong offset!");

}

