#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RedEye_Beam_VisualEntity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_RedEye_Beam_VisualEntity.BP_RedEye_Beam_VisualEntity_C.ExecuteUbergraph_BP_RedEye_Beam_VisualEntity
// 0x0110 (0x0110 - 0x0000)
struct BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_FloatingRedEye_C*                   K2Node_DynamicCast_AsBP_Floating_Red_Eye;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0034(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0044(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBeamLength_Length;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0080(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity) == 0x000008, "Wrong alignment on BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity");
static_assert(sizeof(BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity) == 0x000110, "Wrong size on BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity");
static_assert(offsetof(BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity, K2Node_DynamicCast_AsBP_Floating_Red_Eye) == 0x000010, "Member 'BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity::K2Node_DynamicCast_AsBP_Floating_Red_Eye' has a wrong offset!");
static_assert(offsetof(BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity, CallFunc_IsActive_ReturnValue) == 0x000019, "Member 'BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00001C, "Member 'BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity, CallFunc_GetActorForwardVector_ReturnValue) == 0x000028, "Member 'BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity, Temp_delegate_Variable) == 0x000034, "Member 'BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity, Temp_delegate_Variable_1) == 0x000044, "Member 'BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity, CallFunc_PostAkEvent_ReturnValue) == 0x000054, "Member 'BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity, CallFunc_GetBeamLength_Length) == 0x00005C, "Member 'BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity::CallFunc_GetBeamLength_Length' has a wrong offset!");
static_assert(offsetof(BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity, CallFunc_Less_FloatFloat_ReturnValue) == 0x000060, "Member 'BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000061, "Member 'BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000064, "Member 'BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000070, "Member 'BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity, CallFunc_Add_VectorVector_ReturnValue) == 0x000074, "Member 'BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000080, "Member 'BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity, CallFunc_PostAkEvent_ReturnValue_1) == 0x000108, "Member 'BP_RedEye_Beam_VisualEntity_C_ExecuteUbergraph_BP_RedEye_Beam_VisualEntity::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");

// Function BP_RedEye_Beam_VisualEntity.BP_RedEye_Beam_VisualEntity_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_RedEye_Beam_VisualEntity_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RedEye_Beam_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_RedEye_Beam_VisualEntity_C_ReceiveTick");
static_assert(sizeof(BP_RedEye_Beam_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong size on BP_RedEye_Beam_VisualEntity_C_ReceiveTick");
static_assert(offsetof(BP_RedEye_Beam_VisualEntity_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_RedEye_Beam_VisualEntity_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

