#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RetalentWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_RetalentWindow.BP_RetalentWindow_C
// 0x0138 (0x05E8 - 0x04B0)
class UBP_RetalentWindow_C final : public URetalentUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ErrorAnim;                                         // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RetalentAnimFinish;                                // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RetalentAnimStart;                                 // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BgTexture;                                         // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BottomScreenFrame;                                 // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyB;                                        // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyHoldA;                                    // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnNextTab;                                        // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnPreviousTab;                                    // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Caption_Title;                                     // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Caption_Title_Glow;                                // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ContentFrame;                                      // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Data;                                              // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Description;                                       // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             EssenceRequiredText;                               // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Label_LevelUp;                                     // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SeparatorBottom;                                   // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SeparatorTop;                                      // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Attributes;                                    // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Retalent;                                      // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_SkillsUpgrade;                                 // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_WitchLantern;                                  // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Tabs;                                              // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TopScreenFrame;                                    // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TotalEssenceText;                                  // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Tree_Flare;                                        // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Tree_Flare2;                                       // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Tree_Glow;                                         // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Tree_Highlight;                                    // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Tree_Locked;                                       // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Tree_Unlocked;                                     // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Tree_Wipe1;                                        // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Tree_Wipe2;                                        // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Tree_Wipe3;                                        // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Tree_Wipe4;                                        // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          NotEnoughEssence;                                  // 0x05E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_RetalentWindow(int32 EntryPoint);
	void OnErrorHiglight(class UInteractButtonUserWidget* InteractButtonUserWidget);
	void BndEvt__BP_WitchLantern_Tab_Attributes_1_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature();
	void OnIngameMenuEvent();
	void OnHoldFinished(class UInteractButtonUserWidget* InteractButtonUserWidget);
	void OnHoldCanceled(class UInteractButtonUserWidget* InteractButtonUserWidget, bool bMinTimeCancel);
	void OnHoldStarted(class UInteractButtonUserWidget* InteractButtonUserWidget);
	void OnSetRetalentText(const class FText& RetalentText, bool bDefaultTree);
	void OnRetalent();
	void BndEvt__BP_LevelUpWindow_Tab_Map1_K2Node_ComponentBoundEvent_15_OnClicked__DelegateSignature();
	void BndEvt__BP_LevelUpWindow_Tab_WitchLantern1_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature();
	void BndEvt__BP_LevelUpWindow_Tab_Skills1_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature();
	void BndEvt__BtnNextTab_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature();
	void BndEvt__BtnPreviousTab_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature();
	void OnGamepadRBEvent();
	void OnGamepadLBEvent();
	void BndEvt__BtnHotkeyB1_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature();
	void OnHide(float AnimDuration);
	void OnShow(float AnimDuration);
	void OnGamepadBEvent();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BtnHotkeyBClicked(bool OpenPauseMenu);
	void SetEssenceTexts();
	void Set_State(bool IsTreeDefault);
	void ErrorHighlight();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RetalentWindow_C">();
	}
	static class UBP_RetalentWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_RetalentWindow_C>();
	}
};
static_assert(alignof(UBP_RetalentWindow_C) == 0x000008, "Wrong alignment on UBP_RetalentWindow_C");
static_assert(sizeof(UBP_RetalentWindow_C) == 0x0005E8, "Wrong size on UBP_RetalentWindow_C");
static_assert(offsetof(UBP_RetalentWindow_C, UberGraphFrame) == 0x0004B0, "Member 'UBP_RetalentWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, ErrorAnim) == 0x0004B8, "Member 'UBP_RetalentWindow_C::ErrorAnim' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, RetalentAnimFinish) == 0x0004C0, "Member 'UBP_RetalentWindow_C::RetalentAnimFinish' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, RetalentAnimStart) == 0x0004C8, "Member 'UBP_RetalentWindow_C::RetalentAnimStart' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, FadeOutAnim) == 0x0004D0, "Member 'UBP_RetalentWindow_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, FadeInAnim) == 0x0004D8, "Member 'UBP_RetalentWindow_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, BgTexture) == 0x0004E0, "Member 'UBP_RetalentWindow_C::BgTexture' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, BottomScreenFrame) == 0x0004E8, "Member 'UBP_RetalentWindow_C::BottomScreenFrame' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, BtnHotkeyB) == 0x0004F0, "Member 'UBP_RetalentWindow_C::BtnHotkeyB' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, BtnHotkeyHoldA) == 0x0004F8, "Member 'UBP_RetalentWindow_C::BtnHotkeyHoldA' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, BtnNextTab) == 0x000500, "Member 'UBP_RetalentWindow_C::BtnNextTab' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, BtnPreviousTab) == 0x000508, "Member 'UBP_RetalentWindow_C::BtnPreviousTab' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, Caption_Title) == 0x000510, "Member 'UBP_RetalentWindow_C::Caption_Title' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, Caption_Title_Glow) == 0x000518, "Member 'UBP_RetalentWindow_C::Caption_Title_Glow' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, ContentFrame) == 0x000520, "Member 'UBP_RetalentWindow_C::ContentFrame' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, Data) == 0x000528, "Member 'UBP_RetalentWindow_C::Data' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, Description) == 0x000530, "Member 'UBP_RetalentWindow_C::Description' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, EssenceRequiredText) == 0x000538, "Member 'UBP_RetalentWindow_C::EssenceRequiredText' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, Label_LevelUp) == 0x000540, "Member 'UBP_RetalentWindow_C::Label_LevelUp' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, SeparatorBottom) == 0x000548, "Member 'UBP_RetalentWindow_C::SeparatorBottom' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, SeparatorTop) == 0x000550, "Member 'UBP_RetalentWindow_C::SeparatorTop' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, Tab_Attributes) == 0x000558, "Member 'UBP_RetalentWindow_C::Tab_Attributes' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, Tab_Retalent) == 0x000560, "Member 'UBP_RetalentWindow_C::Tab_Retalent' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, Tab_SkillsUpgrade) == 0x000568, "Member 'UBP_RetalentWindow_C::Tab_SkillsUpgrade' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, Tab_WitchLantern) == 0x000570, "Member 'UBP_RetalentWindow_C::Tab_WitchLantern' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, Tabs) == 0x000578, "Member 'UBP_RetalentWindow_C::Tabs' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, TopScreenFrame) == 0x000580, "Member 'UBP_RetalentWindow_C::TopScreenFrame' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, TotalEssenceText) == 0x000588, "Member 'UBP_RetalentWindow_C::TotalEssenceText' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, Tree_Flare) == 0x000590, "Member 'UBP_RetalentWindow_C::Tree_Flare' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, Tree_Flare2) == 0x000598, "Member 'UBP_RetalentWindow_C::Tree_Flare2' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, Tree_Glow) == 0x0005A0, "Member 'UBP_RetalentWindow_C::Tree_Glow' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, Tree_Highlight) == 0x0005A8, "Member 'UBP_RetalentWindow_C::Tree_Highlight' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, Tree_Locked) == 0x0005B0, "Member 'UBP_RetalentWindow_C::Tree_Locked' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, Tree_Unlocked) == 0x0005B8, "Member 'UBP_RetalentWindow_C::Tree_Unlocked' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, Tree_Wipe1) == 0x0005C0, "Member 'UBP_RetalentWindow_C::Tree_Wipe1' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, Tree_Wipe2) == 0x0005C8, "Member 'UBP_RetalentWindow_C::Tree_Wipe2' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, Tree_Wipe3) == 0x0005D0, "Member 'UBP_RetalentWindow_C::Tree_Wipe3' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, Tree_Wipe4) == 0x0005D8, "Member 'UBP_RetalentWindow_C::Tree_Wipe4' has a wrong offset!");
static_assert(offsetof(UBP_RetalentWindow_C, NotEnoughEssence) == 0x0005E0, "Member 'UBP_RetalentWindow_C::NotEnoughEssence' has a wrong offset!");

}

