#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RedEyeEntropic_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "man_classes.hpp"
#include "KawaiiPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_RedEyeEntropic_Anim.BP_RedEyeEntropic_Anim_C
// 0x1AE0 (0x2180 - 0x06A0)
class UBP_RedEyeEntropic_Anim_C final : public UAnimInstanceBase
{
public:
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0030)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x06D8(0x00A8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0780(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x07C8(0x0080)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x0848(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0910(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0A68(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0A90(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0AB8(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0B38(0x00A8)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x0BE0(0x0250)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0E30(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0E50(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x0E70(0x0250)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x10C0(0x0250)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x1310(0x0250)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x1560(0x0250)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x17B0(0x0250)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1A00(0x0080)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x1A80(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1B48(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1BC8(0x0080)()
	uint8                                         Pad_1C48[0x8];                                     // 0x1C48(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x1C50(0x0250)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x1EA0(0x0250)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x20F0(0x0080)()
	bool                                          Blinking;                                          // 0x2170(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2171[0x3];                                     // 0x2171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlinkTimeBack;                                     // 0x2174(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_RedEyeEntropic_Anim(int32 EntryPoint);
	void AnimNotify_BlinkEnd();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_RedEyeEntropic_Anim_AnimGraphNode_KawaiiPhysics_419740AF4258843472706386A760486A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_RedEyeEntropic_Anim_AnimGraphNode_KawaiiPhysics_2D01A2D7403BFF8F63A179844F98F6B5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_RedEyeEntropic_Anim_AnimGraphNode_KawaiiPhysics_E2A9E3354982173A37CDC087DC99A320();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_RedEyeEntropic_Anim_AnimGraphNode_KawaiiPhysics_F945453E438EFEDB8677CDA831391266();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_RedEyeEntropic_Anim_AnimGraphNode_KawaiiPhysics_60361EED417495694FF0D482EA3D940E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_RedEyeEntropic_Anim_AnimGraphNode_KawaiiPhysics_7E8F240B45C6226EC14F308515832BEE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_RedEyeEntropic_Anim_AnimGraphNode_ApplyAdditive_817D888F412B477FC401358FD3202535();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_RedEyeEntropic_Anim_AnimGraphNode_KawaiiPhysics_51DD54BC4304B8A5465919A76F23ABC2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_RedEyeEntropic_Anim_AnimGraphNode_KawaiiPhysics_A8CEAAA44C40E86D8791979EA15D283D();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RedEyeEntropic_Anim_C">();
	}
	static class UBP_RedEyeEntropic_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_RedEyeEntropic_Anim_C>();
	}
};
static_assert(alignof(UBP_RedEyeEntropic_Anim_C) == 0x000010, "Wrong alignment on UBP_RedEyeEntropic_Anim_C");
static_assert(sizeof(UBP_RedEyeEntropic_Anim_C) == 0x002180, "Wrong size on UBP_RedEyeEntropic_Anim_C");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, UberGraphFrame) == 0x0006A0, "Member 'UBP_RedEyeEntropic_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UBP_RedEyeEntropic_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, AnimGraphNode_BlendListByInt) == 0x0006D8, "Member 'UBP_RedEyeEntropic_Anim_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, AnimGraphNode_Slot) == 0x000780, "Member 'UBP_RedEyeEntropic_Anim_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, AnimGraphNode_SequencePlayer_5) == 0x0007C8, "Member 'UBP_RedEyeEntropic_Anim_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, AnimGraphNode_ApplyAdditive_1) == 0x000848, "Member 'UBP_RedEyeEntropic_Anim_C::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, AnimGraphNode_SaveCachedPose) == 0x000910, "Member 'UBP_RedEyeEntropic_Anim_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, AnimGraphNode_UseCachedPose_1) == 0x000A68, "Member 'UBP_RedEyeEntropic_Anim_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, AnimGraphNode_UseCachedPose) == 0x000A90, "Member 'UBP_RedEyeEntropic_Anim_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, AnimGraphNode_SequencePlayer_4) == 0x000AB8, "Member 'UBP_RedEyeEntropic_Anim_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, AnimGraphNode_BlendListByBool) == 0x000B38, "Member 'UBP_RedEyeEntropic_Anim_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, AnimGraphNode_KawaiiPhysics_7) == 0x000BE0, "Member 'UBP_RedEyeEntropic_Anim_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, AnimGraphNode_LocalToComponentSpace) == 0x000E30, "Member 'UBP_RedEyeEntropic_Anim_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, AnimGraphNode_ComponentToLocalSpace) == 0x000E50, "Member 'UBP_RedEyeEntropic_Anim_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, AnimGraphNode_KawaiiPhysics_6) == 0x000E70, "Member 'UBP_RedEyeEntropic_Anim_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, AnimGraphNode_KawaiiPhysics_5) == 0x0010C0, "Member 'UBP_RedEyeEntropic_Anim_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, AnimGraphNode_KawaiiPhysics_4) == 0x001310, "Member 'UBP_RedEyeEntropic_Anim_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, AnimGraphNode_KawaiiPhysics_3) == 0x001560, "Member 'UBP_RedEyeEntropic_Anim_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, AnimGraphNode_KawaiiPhysics_2) == 0x0017B0, "Member 'UBP_RedEyeEntropic_Anim_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, AnimGraphNode_SequencePlayer_3) == 0x001A00, "Member 'UBP_RedEyeEntropic_Anim_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, AnimGraphNode_ApplyAdditive) == 0x001A80, "Member 'UBP_RedEyeEntropic_Anim_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, AnimGraphNode_SequencePlayer_2) == 0x001B48, "Member 'UBP_RedEyeEntropic_Anim_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, AnimGraphNode_SequencePlayer_1) == 0x001BC8, "Member 'UBP_RedEyeEntropic_Anim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, AnimGraphNode_KawaiiPhysics_1) == 0x001C50, "Member 'UBP_RedEyeEntropic_Anim_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, AnimGraphNode_KawaiiPhysics) == 0x001EA0, "Member 'UBP_RedEyeEntropic_Anim_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, AnimGraphNode_SequencePlayer) == 0x0020F0, "Member 'UBP_RedEyeEntropic_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, Blinking) == 0x002170, "Member 'UBP_RedEyeEntropic_Anim_C::Blinking' has a wrong offset!");
static_assert(offsetof(UBP_RedEyeEntropic_Anim_C, BlinkTimeBack) == 0x002174, "Member 'UBP_RedEyeEntropic_Anim_C::BlinkTimeBack' has a wrong offset!");

}

