#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RetreatAttack_Landed_VisualEntity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_RetreatAttack_Landed_VisualEntity.BP_RetreatAttack_Landed_VisualEntity_C.ExecuteUbergraph_BP_RetreatAttack_Landed_VisualEntity
// 0x0050 (0x0050 - 0x0000)
struct BP_RetreatAttack_Landed_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Landed_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSurfaceTypeSystemAtLocation_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SpawnSurfaceTypeSystemAtLocation_bSuccess; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RetreatAttack_Landed_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Landed_VisualEntity) == 0x000010, "Wrong alignment on BP_RetreatAttack_Landed_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Landed_VisualEntity");
static_assert(sizeof(BP_RetreatAttack_Landed_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Landed_VisualEntity) == 0x000050, "Wrong size on BP_RetreatAttack_Landed_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Landed_VisualEntity");
static_assert(offsetof(BP_RetreatAttack_Landed_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Landed_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_RetreatAttack_Landed_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Landed_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RetreatAttack_Landed_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Landed_VisualEntity, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'BP_RetreatAttack_Landed_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Landed_VisualEntity::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RetreatAttack_Landed_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Landed_VisualEntity, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_RetreatAttack_Landed_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Landed_VisualEntity::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RetreatAttack_Landed_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Landed_VisualEntity, CallFunc_SpawnSurfaceTypeSystemAtLocation_ReturnValue) == 0x000040, "Member 'BP_RetreatAttack_Landed_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Landed_VisualEntity::CallFunc_SpawnSurfaceTypeSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RetreatAttack_Landed_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Landed_VisualEntity, CallFunc_SpawnSurfaceTypeSystemAtLocation_bSuccess) == 0x000048, "Member 'BP_RetreatAttack_Landed_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Landed_VisualEntity::CallFunc_SpawnSurfaceTypeSystemAtLocation_bSuccess' has a wrong offset!");

}

