#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RedEyeEntropic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SplineMoveEyeBase_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RedEyeEntropic.BP_RedEyeEntropic_C
// 0x0070 (0x1B80 - 0x1B10)
class ABP_RedEyeEntropic_C final : public ABP_SplineMoveEyeBase_C
{
public:
	uint8                                         Pad_1B01[0x7];                                     // 0x1B01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_RedEyeEntropic_C;                // 0x1B08(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_EntropyInsideMesh_C*                BP_EntropyInsideMesh;                              // 0x1B10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_EntropyEnemy_Die;                               // 0x1B18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_MandragoraScream;                               // 0x1B20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                HitBoxScream1;                                     // 0x1B28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                HitBoxScream5;                                     // 0x1B30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                HitBoxScream4;                                     // 0x1B38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                HitBoxScream3;                                     // 0x1B40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                HitBoxScream2;                                     // 0x1B48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                HitBoxScream;                                      // 0x1B50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_EntropicEnemy;                                  // 0x1B58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        VFX;                                               // 0x1B60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow1;                                            // 0x1B68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                BeamBox;                                           // 0x1B70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SavedSpeed;                                        // 0x1B78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_RedEyeEntropic(int32 EntryPoint);
	void OnKilled(class UObject* Killer, class UAbilityController* KillerAbilityController);
	void OnVfxEvent(class FName VfxEventType);
	void ReceiveTick(float DeltaSeconds);
	void BPPostBeginPlay();
	void EventOnCustomEvent_Event_0(class FName CustomName);
	void GetBeamLength(float* Length);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RedEyeEntropic_C">();
	}
	static class ABP_RedEyeEntropic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RedEyeEntropic_C>();
	}
};
static_assert(alignof(ABP_RedEyeEntropic_C) == 0x000010, "Wrong alignment on ABP_RedEyeEntropic_C");
static_assert(sizeof(ABP_RedEyeEntropic_C) == 0x001B80, "Wrong size on ABP_RedEyeEntropic_C");
static_assert(offsetof(ABP_RedEyeEntropic_C, UberGraphFrame_BP_RedEyeEntropic_C) == 0x001B08, "Member 'ABP_RedEyeEntropic_C::UberGraphFrame_BP_RedEyeEntropic_C' has a wrong offset!");
static_assert(offsetof(ABP_RedEyeEntropic_C, BP_EntropyInsideMesh) == 0x001B10, "Member 'ABP_RedEyeEntropic_C::BP_EntropyInsideMesh' has a wrong offset!");
static_assert(offsetof(ABP_RedEyeEntropic_C, NS_EntropyEnemy_Die) == 0x001B18, "Member 'ABP_RedEyeEntropic_C::NS_EntropyEnemy_Die' has a wrong offset!");
static_assert(offsetof(ABP_RedEyeEntropic_C, NS_MandragoraScream) == 0x001B20, "Member 'ABP_RedEyeEntropic_C::NS_MandragoraScream' has a wrong offset!");
static_assert(offsetof(ABP_RedEyeEntropic_C, HitBoxScream1) == 0x001B28, "Member 'ABP_RedEyeEntropic_C::HitBoxScream1' has a wrong offset!");
static_assert(offsetof(ABP_RedEyeEntropic_C, HitBoxScream5) == 0x001B30, "Member 'ABP_RedEyeEntropic_C::HitBoxScream5' has a wrong offset!");
static_assert(offsetof(ABP_RedEyeEntropic_C, HitBoxScream4) == 0x001B38, "Member 'ABP_RedEyeEntropic_C::HitBoxScream4' has a wrong offset!");
static_assert(offsetof(ABP_RedEyeEntropic_C, HitBoxScream3) == 0x001B40, "Member 'ABP_RedEyeEntropic_C::HitBoxScream3' has a wrong offset!");
static_assert(offsetof(ABP_RedEyeEntropic_C, HitBoxScream2) == 0x001B48, "Member 'ABP_RedEyeEntropic_C::HitBoxScream2' has a wrong offset!");
static_assert(offsetof(ABP_RedEyeEntropic_C, HitBoxScream) == 0x001B50, "Member 'ABP_RedEyeEntropic_C::HitBoxScream' has a wrong offset!");
static_assert(offsetof(ABP_RedEyeEntropic_C, NS_EntropicEnemy) == 0x001B58, "Member 'ABP_RedEyeEntropic_C::NS_EntropicEnemy' has a wrong offset!");
static_assert(offsetof(ABP_RedEyeEntropic_C, VFX) == 0x001B60, "Member 'ABP_RedEyeEntropic_C::VFX' has a wrong offset!");
static_assert(offsetof(ABP_RedEyeEntropic_C, Arrow1) == 0x001B68, "Member 'ABP_RedEyeEntropic_C::Arrow1' has a wrong offset!");
static_assert(offsetof(ABP_RedEyeEntropic_C, BeamBox) == 0x001B70, "Member 'ABP_RedEyeEntropic_C::BeamBox' has a wrong offset!");
static_assert(offsetof(ABP_RedEyeEntropic_C, SavedSpeed) == 0x001B78, "Member 'ABP_RedEyeEntropic_C::SavedSpeed' has a wrong offset!");

}

