#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RedEye_Beam_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RedEye_Beam_VisualEntity.BP_RedEye_Beam_VisualEntity_C
// 0x0030 (0x0380 - 0x0350)
class ABP_RedEye_Beam_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara_BeamEnd;                                   // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_FloatingRedEye_C*                   OwnerActor;                                        // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Alive;                                             // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_RedEye_Beam_VisualEntity(int32 EntryPoint);
	void OnKill();
	void ReceiveTick(float DeltaSeconds);
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RedEye_Beam_VisualEntity_C">();
	}
	static class ABP_RedEye_Beam_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RedEye_Beam_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_RedEye_Beam_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_RedEye_Beam_VisualEntity_C");
static_assert(sizeof(ABP_RedEye_Beam_VisualEntity_C) == 0x000380, "Wrong size on ABP_RedEye_Beam_VisualEntity_C");
static_assert(offsetof(ABP_RedEye_Beam_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_RedEye_Beam_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_RedEye_Beam_VisualEntity_C, Ak) == 0x000358, "Member 'ABP_RedEye_Beam_VisualEntity_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_RedEye_Beam_VisualEntity_C, Niagara_BeamEnd) == 0x000360, "Member 'ABP_RedEye_Beam_VisualEntity_C::Niagara_BeamEnd' has a wrong offset!");
static_assert(offsetof(ABP_RedEye_Beam_VisualEntity_C, Niagara) == 0x000368, "Member 'ABP_RedEye_Beam_VisualEntity_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_RedEye_Beam_VisualEntity_C, OwnerActor) == 0x000370, "Member 'ABP_RedEye_Beam_VisualEntity_C::OwnerActor' has a wrong offset!");
static_assert(offsetof(ABP_RedEye_Beam_VisualEntity_C, Alive) == 0x000378, "Member 'ABP_RedEye_Beam_VisualEntity_C::Alive' has a wrong offset!");

}

