#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RakeProjectile

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_RakeProjectile.BP_RakeProjectile_C.ExecuteUbergraph_BP_RakeProjectile
// 0x0070 (0x0070 - 0x0000)
struct BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0010(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue_1;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue_1;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue_2;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue_2;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile) == 0x000008, "Wrong alignment on BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile");
static_assert(sizeof(BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile) == 0x000070, "Wrong size on BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile");
static_assert(offsetof(BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile, EntryPoint) == 0x000000, "Member 'BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile, Temp_delegate_Variable) == 0x000010, "Member 'BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile, CallFunc_GetManGameMode_ReturnValue) == 0x000030, "Member 'BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile::CallFunc_GetManGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile, CallFunc_PostEventAtLocation_ReturnValue) == 0x000038, "Member 'BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000040, "Member 'BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile, CallFunc_GetManGameMode_ReturnValue_1) == 0x000048, "Member 'BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile::CallFunc_GetManGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile, CallFunc_SpawnVisualEntity_ReturnValue_1) == 0x000050, "Member 'BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile::CallFunc_SpawnVisualEntity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile, CallFunc_GetManGameMode_ReturnValue_2) == 0x000058, "Member 'BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile::CallFunc_GetManGameMode_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile, CallFunc_SpawnVisualEntity_ReturnValue_2) == 0x000060, "Member 'BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile::CallFunc_SpawnVisualEntity_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile, CallFunc_PostAkEvent_ReturnValue) == 0x000068, "Member 'BP_RakeProjectile_C_ExecuteUbergraph_BP_RakeProjectile::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

}

