#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RetreatAttack_Chain_VisualEntity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_RetreatAttack_Chain_VisualEntity.BP_RetreatAttack_Chain_VisualEntity_C.ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity
// 0x00A8 (0x00A8 - 0x0000)
struct BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHeroBase*                              K2Node_DynamicCast_AsHero_Base;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URetreatAttackAbility*                  K2Node_DynamicCast_AsRetreat_Attack_Ability;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RetreatAttackProjectile_C*          K2Node_DynamicCast_AsBP_Retreat_Attack_Projectile; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OnTheFly;                       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Pullback;                       // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWarningActive_ReturnValue;              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0094(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity) == 0x000008, "Wrong alignment on BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity");
static_assert(sizeof(BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity) == 0x0000A8, "Wrong size on BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity");
static_assert(offsetof(BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity, K2Node_DynamicCast_AsHero_Base) == 0x000008, "Member 'BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity::K2Node_DynamicCast_AsHero_Base' has a wrong offset!");
static_assert(offsetof(BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity, CallFunc_GetAbilityController_ReturnValue) == 0x000018, "Member 'BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000028, "Member 'BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity, K2Node_DynamicCast_AsRetreat_Attack_Ability) == 0x000030, "Member 'BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity::K2Node_DynamicCast_AsRetreat_Attack_Ability' has a wrong offset!");
static_assert(offsetof(BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity, K2Node_DynamicCast_AsCharacter_Base) == 0x000040, "Member 'BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity, CallFunc_GetSocketLocation_ReturnValue) == 0x00004C, "Member 'BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00005C, "Member 'BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000068, "Member 'BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity, K2Node_DynamicCast_AsBP_Retreat_Attack_Projectile) == 0x000070, "Member 'BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity::K2Node_DynamicCast_AsBP_Retreat_Attack_Projectile' has a wrong offset!");
static_assert(offsetof(BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity, K2Node_DynamicCast_bSuccess_3) == 0x000078, "Member 'BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity, CallFunc_GetOwner_ReturnValue_1) == 0x000080, "Member 'BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity, K2Node_CustomEvent_OnTheFly) == 0x000088, "Member 'BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity::K2Node_CustomEvent_OnTheFly' has a wrong offset!");
static_assert(offsetof(BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity, K2Node_CustomEvent_Pullback) == 0x00008C, "Member 'BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity::K2Node_CustomEvent_Pullback' has a wrong offset!");
static_assert(offsetof(BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity, CallFunc_IsWarningActive_ReturnValue) == 0x000090, "Member 'BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity::CallFunc_IsWarningActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity, CallFunc_SelectColor_ReturnValue) == 0x000094, "Member 'BP_RetreatAttack_Chain_VisualEntity_C_ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity::CallFunc_SelectColor_ReturnValue' has a wrong offset!");

// Function BP_RetreatAttack_Chain_VisualEntity.BP_RetreatAttack_Chain_VisualEntity_C.UpdateVFX
// 0x0008 (0x0008 - 0x0000)
struct BP_RetreatAttack_Chain_VisualEntity_C_UpdateVFX final
{
public:
	float                                         OntheFly;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PullBack;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RetreatAttack_Chain_VisualEntity_C_UpdateVFX) == 0x000004, "Wrong alignment on BP_RetreatAttack_Chain_VisualEntity_C_UpdateVFX");
static_assert(sizeof(BP_RetreatAttack_Chain_VisualEntity_C_UpdateVFX) == 0x000008, "Wrong size on BP_RetreatAttack_Chain_VisualEntity_C_UpdateVFX");
static_assert(offsetof(BP_RetreatAttack_Chain_VisualEntity_C_UpdateVFX, OntheFly) == 0x000000, "Member 'BP_RetreatAttack_Chain_VisualEntity_C_UpdateVFX::OntheFly' has a wrong offset!");
static_assert(offsetof(BP_RetreatAttack_Chain_VisualEntity_C_UpdateVFX, PullBack) == 0x000004, "Member 'BP_RetreatAttack_Chain_VisualEntity_C_UpdateVFX::PullBack' has a wrong offset!");

}

