#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ReactiveBlast_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ReactiveBlast_VisualEntity.BP_ReactiveBlast_VisualEntity_C
// 0x0040 (0x0390 - 0x0350)
class ABP_ReactiveBlast_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara1;                                          // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ReactiveBlast_ActiveAbility_C*      Ability;                                           // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 VETarget;                                          // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MoveTimeCurrent;                                   // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MoveTimeTotal;                                     // 0x037C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FlyDuration;                                       // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartLocation;                                     // 0x0384(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ReactiveBlast_VisualEntity(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ReactiveBlast_VisualEntity_C">();
	}
	static class ABP_ReactiveBlast_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ReactiveBlast_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_ReactiveBlast_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_ReactiveBlast_VisualEntity_C");
static_assert(sizeof(ABP_ReactiveBlast_VisualEntity_C) == 0x000390, "Wrong size on ABP_ReactiveBlast_VisualEntity_C");
static_assert(offsetof(ABP_ReactiveBlast_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_ReactiveBlast_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ReactiveBlast_VisualEntity_C, Niagara1) == 0x000358, "Member 'ABP_ReactiveBlast_VisualEntity_C::Niagara1' has a wrong offset!");
static_assert(offsetof(ABP_ReactiveBlast_VisualEntity_C, Niagara) == 0x000360, "Member 'ABP_ReactiveBlast_VisualEntity_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_ReactiveBlast_VisualEntity_C, Ability) == 0x000368, "Member 'ABP_ReactiveBlast_VisualEntity_C::Ability' has a wrong offset!");
static_assert(offsetof(ABP_ReactiveBlast_VisualEntity_C, VETarget) == 0x000370, "Member 'ABP_ReactiveBlast_VisualEntity_C::VETarget' has a wrong offset!");
static_assert(offsetof(ABP_ReactiveBlast_VisualEntity_C, MoveTimeCurrent) == 0x000378, "Member 'ABP_ReactiveBlast_VisualEntity_C::MoveTimeCurrent' has a wrong offset!");
static_assert(offsetof(ABP_ReactiveBlast_VisualEntity_C, MoveTimeTotal) == 0x00037C, "Member 'ABP_ReactiveBlast_VisualEntity_C::MoveTimeTotal' has a wrong offset!");
static_assert(offsetof(ABP_ReactiveBlast_VisualEntity_C, FlyDuration) == 0x000380, "Member 'ABP_ReactiveBlast_VisualEntity_C::FlyDuration' has a wrong offset!");
static_assert(offsetof(ABP_ReactiveBlast_VisualEntity_C, StartLocation) == 0x000384, "Member 'ABP_ReactiveBlast_VisualEntity_C::StartLocation' has a wrong offset!");

}

