#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RetreatAttackProjectile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RetreatAttackProjectile.BP_RetreatAttackProjectile_C
// 0x0030 (0x0B98 - 0x0B68)
class ABP_RetreatAttackProjectile_C final : public ARetreatBladeProjectile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B68(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_RetreatAttack_Proj_Empowered_Start;             // 0x0B70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_RetreatAttack_Proj_Start;                       // 0x0B78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0B80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UManBoxComponent*                       ManProjectileEnviormentalCollider;                 // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_RetreatAttack_Chain_VisualEntity_C* VE;                                                // 0x0B90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_RetreatAttackProjectile(int32 EntryPoint);
	void BPEmpowered();
	void BPPostBeginPlay();
	void BPOnRecalled();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RetreatAttackProjectile_C">();
	}
	static class ABP_RetreatAttackProjectile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RetreatAttackProjectile_C>();
	}
};
static_assert(alignof(ABP_RetreatAttackProjectile_C) == 0x000008, "Wrong alignment on ABP_RetreatAttackProjectile_C");
static_assert(sizeof(ABP_RetreatAttackProjectile_C) == 0x000B98, "Wrong size on ABP_RetreatAttackProjectile_C");
static_assert(offsetof(ABP_RetreatAttackProjectile_C, UberGraphFrame) == 0x000B68, "Member 'ABP_RetreatAttackProjectile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_RetreatAttackProjectile_C, NS_RetreatAttack_Proj_Empowered_Start) == 0x000B70, "Member 'ABP_RetreatAttackProjectile_C::NS_RetreatAttack_Proj_Empowered_Start' has a wrong offset!");
static_assert(offsetof(ABP_RetreatAttackProjectile_C, NS_RetreatAttack_Proj_Start) == 0x000B78, "Member 'ABP_RetreatAttackProjectile_C::NS_RetreatAttack_Proj_Start' has a wrong offset!");
static_assert(offsetof(ABP_RetreatAttackProjectile_C, Ak) == 0x000B80, "Member 'ABP_RetreatAttackProjectile_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_RetreatAttackProjectile_C, ManProjectileEnviormentalCollider) == 0x000B88, "Member 'ABP_RetreatAttackProjectile_C::ManProjectileEnviormentalCollider' has a wrong offset!");
static_assert(offsetof(ABP_RetreatAttackProjectile_C, VE) == 0x000B90, "Member 'ABP_RetreatAttackProjectile_C::VE' has a wrong offset!");

}

