#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ReverberatingStrikes_Weapon_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ReverberatingStrikes_Weapon_VisualEntity.BP_ReverberatingStrikes_Weapon_VisualEntity_C
// 0x0018 (0x0368 - 0x0350)
class ABP_ReverberatingStrikes_Weapon_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_Resonance_Weapon;                               // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        AttachComp;                                        // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ReverberatingStrikes_Weapon_VisualEntity(int32 EntryPoint);
	void OnKill();
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ReverberatingStrikes_Weapon_VisualEntity_C">();
	}
	static class ABP_ReverberatingStrikes_Weapon_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ReverberatingStrikes_Weapon_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_ReverberatingStrikes_Weapon_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_ReverberatingStrikes_Weapon_VisualEntity_C");
static_assert(sizeof(ABP_ReverberatingStrikes_Weapon_VisualEntity_C) == 0x000368, "Wrong size on ABP_ReverberatingStrikes_Weapon_VisualEntity_C");
static_assert(offsetof(ABP_ReverberatingStrikes_Weapon_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_ReverberatingStrikes_Weapon_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ReverberatingStrikes_Weapon_VisualEntity_C, NS_Resonance_Weapon) == 0x000358, "Member 'ABP_ReverberatingStrikes_Weapon_VisualEntity_C::NS_Resonance_Weapon' has a wrong offset!");
static_assert(offsetof(ABP_ReverberatingStrikes_Weapon_VisualEntity_C, AttachComp) == 0x000360, "Member 'ABP_ReverberatingStrikes_Weapon_VisualEntity_C::AttachComp' has a wrong offset!");

}

