#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RetreatAttack_Chain_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RetreatAttack_Chain_VisualEntity.BP_RetreatAttack_Chain_VisualEntity_C
// 0x0050 (0x03A0 - 0x0350)
class ABP_RetreatAttack_Chain_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_RetreatAttack_Projectile;                       // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         EmpowerTimeline_Alpha_B675E9B14BCC39010762A88BD6A80E46; // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            EmpowerTimeline__Direction_B675E9B14BCC39010762A88BD6A80E46; // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     EmpowerTimeline;                                   // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FakeTick__Direction_6109671449348E77286015B9F372D158; // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FakeTick;                                          // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OwnerEntity;                                       // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RetreatAttackProjectile_C*          OwnerActor;                                        // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URetreatAttackAbility*                  Ability;                                           // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_RetreatAttack_Chain_VisualEntity(int32 EntryPoint);
	void Empower();
	void VisualEntityConstructionFinished();
	void UpdateVFX(float OntheFly, float PullBack);
	void OnKill();
	void EmpowerTimeline__UpdateFunc();
	void EmpowerTimeline__FinishedFunc();
	void FakeTick__UpdateFunc();
	void FakeTick__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RetreatAttack_Chain_VisualEntity_C">();
	}
	static class ABP_RetreatAttack_Chain_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RetreatAttack_Chain_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_RetreatAttack_Chain_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_RetreatAttack_Chain_VisualEntity_C");
static_assert(sizeof(ABP_RetreatAttack_Chain_VisualEntity_C) == 0x0003A0, "Wrong size on ABP_RetreatAttack_Chain_VisualEntity_C");
static_assert(offsetof(ABP_RetreatAttack_Chain_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_RetreatAttack_Chain_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_RetreatAttack_Chain_VisualEntity_C, NS_RetreatAttack_Projectile) == 0x000358, "Member 'ABP_RetreatAttack_Chain_VisualEntity_C::NS_RetreatAttack_Projectile' has a wrong offset!");
static_assert(offsetof(ABP_RetreatAttack_Chain_VisualEntity_C, Niagara) == 0x000360, "Member 'ABP_RetreatAttack_Chain_VisualEntity_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_RetreatAttack_Chain_VisualEntity_C, EmpowerTimeline_Alpha_B675E9B14BCC39010762A88BD6A80E46) == 0x000368, "Member 'ABP_RetreatAttack_Chain_VisualEntity_C::EmpowerTimeline_Alpha_B675E9B14BCC39010762A88BD6A80E46' has a wrong offset!");
static_assert(offsetof(ABP_RetreatAttack_Chain_VisualEntity_C, EmpowerTimeline__Direction_B675E9B14BCC39010762A88BD6A80E46) == 0x00036C, "Member 'ABP_RetreatAttack_Chain_VisualEntity_C::EmpowerTimeline__Direction_B675E9B14BCC39010762A88BD6A80E46' has a wrong offset!");
static_assert(offsetof(ABP_RetreatAttack_Chain_VisualEntity_C, EmpowerTimeline) == 0x000370, "Member 'ABP_RetreatAttack_Chain_VisualEntity_C::EmpowerTimeline' has a wrong offset!");
static_assert(offsetof(ABP_RetreatAttack_Chain_VisualEntity_C, FakeTick__Direction_6109671449348E77286015B9F372D158) == 0x000378, "Member 'ABP_RetreatAttack_Chain_VisualEntity_C::FakeTick__Direction_6109671449348E77286015B9F372D158' has a wrong offset!");
static_assert(offsetof(ABP_RetreatAttack_Chain_VisualEntity_C, FakeTick) == 0x000380, "Member 'ABP_RetreatAttack_Chain_VisualEntity_C::FakeTick' has a wrong offset!");
static_assert(offsetof(ABP_RetreatAttack_Chain_VisualEntity_C, OwnerEntity) == 0x000388, "Member 'ABP_RetreatAttack_Chain_VisualEntity_C::OwnerEntity' has a wrong offset!");
static_assert(offsetof(ABP_RetreatAttack_Chain_VisualEntity_C, OwnerActor) == 0x000390, "Member 'ABP_RetreatAttack_Chain_VisualEntity_C::OwnerActor' has a wrong offset!");
static_assert(offsetof(ABP_RetreatAttack_Chain_VisualEntity_C, Ability) == 0x000398, "Member 'ABP_RetreatAttack_Chain_VisualEntity_C::Ability' has a wrong offset!");

}

