#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ReactiveBlast_VisualEntity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ReactiveBlast_VisualEntity.BP_ReactiveBlast_VisualEntity_C.ExecuteUbergraph_BP_ReactiveBlast_VisualEntity
// 0x0290 (0x0290 - 0x0000)
struct BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHeroBase*                              K2Node_DynamicCast_AsHero_Base;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ReactiveBlast_ActiveAbility_C*      K2Node_DynamicCast_AsBP_Reactive_Blast_Active_Ability; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x00B8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0158(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetVETarget_ReturnValue;                  // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEnemyCharacter*                        K2Node_DynamicCast_AsEnemy_Character;              // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_2;          // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x0208(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity) == 0x000008, "Wrong alignment on BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity");
static_assert(sizeof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity) == 0x000290, "Wrong size on BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, Temp_bool_Has_Been_Initd_Variable) == 0x000010, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000014, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, CallFunc_PostEventAtLocation_ReturnValue) == 0x000020, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, Temp_bool_IsClosed_Variable) == 0x000024, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000028, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, K2Node_Event_DeltaSeconds) == 0x000030, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, K2Node_DynamicCast_AsHero_Base) == 0x000038, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::K2Node_DynamicCast_AsHero_Base' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, CallFunc_GetAbilityController_ReturnValue) == 0x000048, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000050, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, K2Node_DynamicCast_AsCharacter_Base) == 0x000058, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, K2Node_DynamicCast_AsBP_Reactive_Blast_Active_Ability) == 0x000068, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::K2Node_DynamicCast_AsBP_Reactive_Blast_Active_Ability' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, CallFunc_GetSocketLocation_ReturnValue) == 0x000074, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000080, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, CallFunc_Add_FloatFloat_ReturnValue) == 0x000084, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000088, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00008C, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x000098, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000A0, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, CallFunc_GetSocketLocation_ReturnValue_1) == 0x0000AC, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0000B8, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000140, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, CallFunc_Add_VectorVector_ReturnValue) == 0x00014C, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000158, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0001E0, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, CallFunc_GetVETarget_ReturnValue) == 0x0001E8, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::CallFunc_GetVETarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, K2Node_DynamicCast_AsEnemy_Character) == 0x0001F0, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::K2Node_DynamicCast_AsEnemy_Character' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, K2Node_DynamicCast_bSuccess_3) == 0x0001F8, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, CallFunc_GetSocketLocation_ReturnValue_2) == 0x0001FC, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::CallFunc_GetSocketLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x000208, "Member 'BP_ReactiveBlast_VisualEntity_C_ExecuteUbergraph_BP_ReactiveBlast_VisualEntity::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");

// Function BP_ReactiveBlast_VisualEntity.BP_ReactiveBlast_VisualEntity_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ReactiveBlast_VisualEntity_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReactiveBlast_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ReactiveBlast_VisualEntity_C_ReceiveTick");
static_assert(sizeof(BP_ReactiveBlast_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong size on BP_ReactiveBlast_VisualEntity_C_ReceiveTick");
static_assert(offsetof(BP_ReactiveBlast_VisualEntity_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ReactiveBlast_VisualEntity_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

