#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Rosalie

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Rosalie.BP_Rosalie_C
// 0x0040 (0x08C0 - 0x0880)
class ABP_Rosalie_C final : public AVendorActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0880(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMiniMapActorComponent*                 MiniMapActor;                                      // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CameraSphere;                                      // 0x0890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SpeechBubbleComponent_C*            BP_SpeechBubbleComponent;                          // 0x0898(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Rosi;                                           // 0x08A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_InteractPrompWidgetComponent_C*     BP_InteractPrompWidgetComponent;                   // 0x08A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTriggerBoxComponent*                   TriggerBox;                                        // 0x08B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x08B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_Rosalie(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Rosalie_C">();
	}
	static class ABP_Rosalie_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Rosalie_C>();
	}
};
static_assert(alignof(ABP_Rosalie_C) == 0x000008, "Wrong alignment on ABP_Rosalie_C");
static_assert(sizeof(ABP_Rosalie_C) == 0x0008C0, "Wrong size on ABP_Rosalie_C");
static_assert(offsetof(ABP_Rosalie_C, UberGraphFrame) == 0x000880, "Member 'ABP_Rosalie_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Rosalie_C, MiniMapActor) == 0x000888, "Member 'ABP_Rosalie_C::MiniMapActor' has a wrong offset!");
static_assert(offsetof(ABP_Rosalie_C, CameraSphere) == 0x000890, "Member 'ABP_Rosalie_C::CameraSphere' has a wrong offset!");
static_assert(offsetof(ABP_Rosalie_C, BP_SpeechBubbleComponent) == 0x000898, "Member 'ABP_Rosalie_C::BP_SpeechBubbleComponent' has a wrong offset!");
static_assert(offsetof(ABP_Rosalie_C, SK_Rosi) == 0x0008A0, "Member 'ABP_Rosalie_C::SK_Rosi' has a wrong offset!");
static_assert(offsetof(ABP_Rosalie_C, BP_InteractPrompWidgetComponent) == 0x0008A8, "Member 'ABP_Rosalie_C::BP_InteractPrompWidgetComponent' has a wrong offset!");
static_assert(offsetof(ABP_Rosalie_C, TriggerBox) == 0x0008B0, "Member 'ABP_Rosalie_C::TriggerBox' has a wrong offset!");
static_assert(offsetof(ABP_Rosalie_C, DefaultSceneRoot) == 0x0008B8, "Member 'ABP_Rosalie_C::DefaultSceneRoot' has a wrong offset!");

}

