#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RedEyeEntropic_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_RedEyeEntropic_Anim.BP_RedEyeEntropic_Anim_C.ExecuteUbergraph_BP_RedEyeEntropic_Anim
// 0x0028 (0x0028 - 0x0000)
struct BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimToggled_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_1;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimToggled_ReturnValue_1;              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimToggled_ReturnValue_2;              // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim) == 0x000004, "Wrong alignment on BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim");
static_assert(sizeof(BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim) == 0x000028, "Wrong size on BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim");
static_assert(offsetof(BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim, EntryPoint) == 0x000000, "Member 'BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim, CallFunc_IsAnimToggled_ReturnValue) == 0x000004, "Member 'BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim::CallFunc_IsAnimToggled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim, CallFunc_GetCurveValue_ReturnValue) == 0x000008, "Member 'BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim, CallFunc_GetCurveValue_ReturnValue_1) == 0x000010, "Member 'BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim::CallFunc_GetCurveValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim, K2Node_Event_DeltaTimeX) == 0x000014, "Member 'BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim, CallFunc_RandomFloatInRange_ReturnValue) == 0x000018, "Member 'BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00001C, "Member 'BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim, CallFunc_IsAnimToggled_ReturnValue_1) == 0x00001D, "Member 'BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim::CallFunc_IsAnimToggled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim, CallFunc_BooleanOR_ReturnValue) == 0x00001E, "Member 'BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim, CallFunc_IsAnimToggled_ReturnValue_2) == 0x00001F, "Member 'BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim::CallFunc_IsAnimToggled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000020, "Member 'BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim, CallFunc_BooleanOR_ReturnValue_1) == 0x000024, "Member 'BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim, CallFunc_BooleanOR_ReturnValue_2) == 0x000025, "Member 'BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim, CallFunc_Not_PreBool_ReturnValue) == 0x000026, "Member 'BP_RedEyeEntropic_Anim_C_ExecuteUbergraph_BP_RedEyeEntropic_Anim::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_RedEyeEntropic_Anim.BP_RedEyeEntropic_Anim_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct BP_RedEyeEntropic_Anim_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RedEyeEntropic_Anim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on BP_RedEyeEntropic_Anim_C_BlueprintUpdateAnimation");
static_assert(sizeof(BP_RedEyeEntropic_Anim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on BP_RedEyeEntropic_Anim_C_BlueprintUpdateAnimation");
static_assert(offsetof(BP_RedEyeEntropic_Anim_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'BP_RedEyeEntropic_Anim_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function BP_RedEyeEntropic_Anim.BP_RedEyeEntropic_Anim_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct BP_RedEyeEntropic_Anim_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BP_RedEyeEntropic_Anim_C_AnimGraph) == 0x000008, "Wrong alignment on BP_RedEyeEntropic_Anim_C_AnimGraph");
static_assert(sizeof(BP_RedEyeEntropic_Anim_C_AnimGraph) == 0x000010, "Wrong size on BP_RedEyeEntropic_Anim_C_AnimGraph");
static_assert(offsetof(BP_RedEyeEntropic_Anim_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'BP_RedEyeEntropic_Anim_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

