#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SubLevelTransition

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SubLevelTransition.BP_SubLevelTransition_C.ExecuteUbergraph_BP_SubLevelTransition
// 0x01C0 (0x01C0 - 0x0000)
struct BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0024(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0034(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue;                  // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_1;         // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_2;                      // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue_1;                // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               CallFunc_MakeVector4_ReturnValue_2;                // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_3;                      // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_2;         // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_4;                      // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               CallFunc_MakeVector4_ReturnValue_3;                // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_4;                          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_4;                          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_4;                          // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue_4;                // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_3;         // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_5;                      // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_5;                          // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_5;                          // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_5;                          // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimelineLength_ReturnValue;            // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue_5;                // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimelineLength_ReturnValue_1;          // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AManPlayerController*                   K2Node_DynamicCast_AsMan_Player_Controller;        // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UManLocalPlayer*                        CallFunc_GetManLocalPlayer_ReturnValue;            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAbleControlCharacterBeforeFadeOutEndTime_ReturnValue; // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition) == 0x000010, "Wrong alignment on BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition");
static_assert(sizeof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition) == 0x0001C0, "Wrong size on BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, EntryPoint) == 0x000000, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, Temp_delegate_Variable) == 0x000024, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, Temp_delegate_Variable_1) == 0x000034, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_PostEvent_ReturnValue) == 0x000044, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_PostEvent_ReturnValue_1) == 0x000048, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000050, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000058, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_VLerp_ReturnValue) == 0x000064, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_BreakVector_X) == 0x000070, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_BreakVector_Y) == 0x000074, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_BreakVector_Z) == 0x000078, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_MakeVector4_ReturnValue) == 0x000080, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_MakeVector4_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_Conv_FloatToVector_ReturnValue_1) == 0x000090, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_Conv_FloatToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_VLerp_ReturnValue_1) == 0x00009C, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_VLerp_ReturnValue_2) == 0x0000A8, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_VLerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_BreakVector_X_1) == 0x0000B4, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_BreakVector_Y_1) == 0x0000B8, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_BreakVector_Z_1) == 0x0000BC, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_BreakVector_X_2) == 0x0000C0, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_BreakVector_Y_2) == 0x0000C4, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_BreakVector_Z_2) == 0x0000C8, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_MakeVector4_ReturnValue_1) == 0x0000D0, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_MakeVector4_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_MakeVector4_ReturnValue_2) == 0x0000E0, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_MakeVector4_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_VLerp_ReturnValue_3) == 0x0000F0, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_VLerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_Conv_FloatToVector_ReturnValue_2) == 0x0000FC, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_Conv_FloatToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_BreakVector_X_3) == 0x000108, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_BreakVector_Y_3) == 0x00010C, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_BreakVector_Z_3) == 0x000110, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_VLerp_ReturnValue_4) == 0x000114, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_VLerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_MakeVector4_ReturnValue_3) == 0x000120, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_MakeVector4_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_BreakVector_X_4) == 0x000130, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_BreakVector_Y_4) == 0x000134, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_BreakVector_Y_4' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_BreakVector_Z_4) == 0x000138, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_BreakVector_Z_4' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_MakeVector4_ReturnValue_4) == 0x000140, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_MakeVector4_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_Conv_FloatToVector_ReturnValue_3) == 0x000150, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_Conv_FloatToVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_VLerp_ReturnValue_5) == 0x00015C, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_VLerp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_BreakVector_X_5) == 0x000168, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_BreakVector_X_5' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_BreakVector_Y_5) == 0x00016C, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_BreakVector_Y_5' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_BreakVector_Z_5) == 0x000170, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_BreakVector_Z_5' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_GetTimelineLength_ReturnValue) == 0x000174, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_GetTimelineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_MakeVector4_ReturnValue_5) == 0x000180, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_MakeVector4_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_GetTimelineLength_ReturnValue_1) == 0x000190, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_GetTimelineLength_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_GetPlayerController_ReturnValue) == 0x000198, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, K2Node_DynamicCast_AsMan_Player_Controller) == 0x0001A0, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::K2Node_DynamicCast_AsMan_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, K2Node_DynamicCast_bSuccess) == 0x0001A8, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_GetManLocalPlayer_ReturnValue) == 0x0001B0, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_GetManLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_GetAbleControlCharacterBeforeFadeOutEndTime_ReturnValue) == 0x0001B8, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_GetAbleControlCharacterBeforeFadeOutEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition, CallFunc_Less_FloatFloat_ReturnValue) == 0x0001BC, "Member 'BP_SubLevelTransition_C_ExecuteUbergraph_BP_SubLevelTransition::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_SubLevelTransition.BP_SubLevelTransition_C.ShowWidget
// 0x0028 (0x0028 - 0x0000)
struct BP_SubLevelTransition_C_ShowWidget final
{
public:
	class ULevelTransitionUserWidget*             K2Node_DynamicCast_AsLevel_Transition_User_Widget; // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UManLocalPlayer*                        CallFunc_GetManLocalPlayer_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManUserWidgetBase*                     CallFunc_ShowManUserWidgetByZorder_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMenuGame_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SubLevelTransition_C_ShowWidget) == 0x000008, "Wrong alignment on BP_SubLevelTransition_C_ShowWidget");
static_assert(sizeof(BP_SubLevelTransition_C_ShowWidget) == 0x000028, "Wrong size on BP_SubLevelTransition_C_ShowWidget");
static_assert(offsetof(BP_SubLevelTransition_C_ShowWidget, K2Node_DynamicCast_AsLevel_Transition_User_Widget) == 0x000000, "Member 'BP_SubLevelTransition_C_ShowWidget::K2Node_DynamicCast_AsLevel_Transition_User_Widget' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ShowWidget, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'BP_SubLevelTransition_C_ShowWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ShowWidget, CallFunc_GetManLocalPlayer_ReturnValue) == 0x000010, "Member 'BP_SubLevelTransition_C_ShowWidget::CallFunc_GetManLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ShowWidget, CallFunc_ShowManUserWidgetByZorder_ReturnValue) == 0x000018, "Member 'BP_SubLevelTransition_C_ShowWidget::CallFunc_ShowManUserWidgetByZorder_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SubLevelTransition_C_ShowWidget, CallFunc_IsMenuGame_ReturnValue) == 0x000020, "Member 'BP_SubLevelTransition_C_ShowWidget::CallFunc_IsMenuGame_ReturnValue' has a wrong offset!");

}

