#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkipCutscene

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_SkipCutscene.BP_SkipCutscene_C.ExecuteUbergraph_BP_SkipCutscene
// 0x0028 (0x0028 - 0x0000)
struct BP_SkipCutscene_C_ExecuteUbergraph_BP_SkipCutscene final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration_1;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue_1;       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkipCutscene_C_ExecuteUbergraph_BP_SkipCutscene) == 0x000008, "Wrong alignment on BP_SkipCutscene_C_ExecuteUbergraph_BP_SkipCutscene");
static_assert(sizeof(BP_SkipCutscene_C_ExecuteUbergraph_BP_SkipCutscene) == 0x000028, "Wrong size on BP_SkipCutscene_C_ExecuteUbergraph_BP_SkipCutscene");
static_assert(offsetof(BP_SkipCutscene_C_ExecuteUbergraph_BP_SkipCutscene, EntryPoint) == 0x000000, "Member 'BP_SkipCutscene_C_ExecuteUbergraph_BP_SkipCutscene::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SkipCutscene_C_ExecuteUbergraph_BP_SkipCutscene, K2Node_Event_AnimDuration_1) == 0x000004, "Member 'BP_SkipCutscene_C_ExecuteUbergraph_BP_SkipCutscene::K2Node_Event_AnimDuration_1' has a wrong offset!");
static_assert(offsetof(BP_SkipCutscene_C_ExecuteUbergraph_BP_SkipCutscene, CallFunc_GetAnimPlaybackSpeed_ReturnValue) == 0x000008, "Member 'BP_SkipCutscene_C_ExecuteUbergraph_BP_SkipCutscene::CallFunc_GetAnimPlaybackSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkipCutscene_C_ExecuteUbergraph_BP_SkipCutscene, K2Node_Event_AnimDuration) == 0x00000C, "Member 'BP_SkipCutscene_C_ExecuteUbergraph_BP_SkipCutscene::K2Node_Event_AnimDuration' has a wrong offset!");
static_assert(offsetof(BP_SkipCutscene_C_ExecuteUbergraph_BP_SkipCutscene, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'BP_SkipCutscene_C_ExecuteUbergraph_BP_SkipCutscene::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkipCutscene_C_ExecuteUbergraph_BP_SkipCutscene, CallFunc_GetAnimPlaybackSpeed_ReturnValue_1) == 0x000018, "Member 'BP_SkipCutscene_C_ExecuteUbergraph_BP_SkipCutscene::CallFunc_GetAnimPlaybackSpeed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkipCutscene_C_ExecuteUbergraph_BP_SkipCutscene, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'BP_SkipCutscene_C_ExecuteUbergraph_BP_SkipCutscene::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function BP_SkipCutscene.BP_SkipCutscene_C.OnHide
// 0x0004 (0x0004 - 0x0000)
struct BP_SkipCutscene_C_OnHide final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkipCutscene_C_OnHide) == 0x000004, "Wrong alignment on BP_SkipCutscene_C_OnHide");
static_assert(sizeof(BP_SkipCutscene_C_OnHide) == 0x000004, "Wrong size on BP_SkipCutscene_C_OnHide");
static_assert(offsetof(BP_SkipCutscene_C_OnHide, AnimDuration) == 0x000000, "Member 'BP_SkipCutscene_C_OnHide::AnimDuration' has a wrong offset!");

// Function BP_SkipCutscene.BP_SkipCutscene_C.OnShow
// 0x0004 (0x0004 - 0x0000)
struct BP_SkipCutscene_C_OnShow final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkipCutscene_C_OnShow) == 0x000004, "Wrong alignment on BP_SkipCutscene_C_OnShow");
static_assert(sizeof(BP_SkipCutscene_C_OnShow) == 0x000004, "Wrong size on BP_SkipCutscene_C_OnShow");
static_assert(offsetof(BP_SkipCutscene_C_OnShow, AnimDuration) == 0x000000, "Member 'BP_SkipCutscene_C_OnShow::AnimDuration' has a wrong offset!");

}

