#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkullEntropic_Anim

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_SkullEntropic_Anim.BP_SkullEntropic_Anim_C
// 0x0630 (0x0CD0 - 0x06A0)
class UBP_SkullEntropic_Anim_C final : public UAnimInstanceBase
{
public:
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0030)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x06D8(0x00A8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0780(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x07C8(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0848(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0870(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x08F0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0920(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x09A0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x09D0(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0A80(0x0080)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0B00(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0BC8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0C48(0x0080)()

public:
	void ExecuteUbergraph_BP_SkullEntropic_Anim(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_SkullEntropic_Anim_AnimGraphNode_ApplyAdditive_66200C194B3DAF5E5ACDDAB9B5DFC4B1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_SkullEntropic_Anim_AnimGraphNode_TransitionResult_21CF6C094929B466174600B355AF2905();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SkullEntropic_Anim_C">();
	}
	static class UBP_SkullEntropic_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SkullEntropic_Anim_C>();
	}
};
static_assert(alignof(UBP_SkullEntropic_Anim_C) == 0x000010, "Wrong alignment on UBP_SkullEntropic_Anim_C");
static_assert(sizeof(UBP_SkullEntropic_Anim_C) == 0x000CD0, "Wrong size on UBP_SkullEntropic_Anim_C");
static_assert(offsetof(UBP_SkullEntropic_Anim_C, UberGraphFrame) == 0x0006A0, "Member 'UBP_SkullEntropic_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SkullEntropic_Anim_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UBP_SkullEntropic_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_SkullEntropic_Anim_C, AnimGraphNode_BlendListByInt) == 0x0006D8, "Member 'UBP_SkullEntropic_Anim_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UBP_SkullEntropic_Anim_C, AnimGraphNode_Slot) == 0x000780, "Member 'UBP_SkullEntropic_Anim_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UBP_SkullEntropic_Anim_C, AnimGraphNode_SequencePlayer_5) == 0x0007C8, "Member 'UBP_SkullEntropic_Anim_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UBP_SkullEntropic_Anim_C, AnimGraphNode_TransitionResult) == 0x000848, "Member 'UBP_SkullEntropic_Anim_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UBP_SkullEntropic_Anim_C, AnimGraphNode_SequencePlayer_4) == 0x000870, "Member 'UBP_SkullEntropic_Anim_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UBP_SkullEntropic_Anim_C, AnimGraphNode_StateResult_1) == 0x0008F0, "Member 'UBP_SkullEntropic_Anim_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UBP_SkullEntropic_Anim_C, AnimGraphNode_SequencePlayer_3) == 0x000920, "Member 'UBP_SkullEntropic_Anim_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UBP_SkullEntropic_Anim_C, AnimGraphNode_StateResult) == 0x0009A0, "Member 'UBP_SkullEntropic_Anim_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UBP_SkullEntropic_Anim_C, AnimGraphNode_StateMachine) == 0x0009D0, "Member 'UBP_SkullEntropic_Anim_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UBP_SkullEntropic_Anim_C, AnimGraphNode_SequencePlayer_2) == 0x000A80, "Member 'UBP_SkullEntropic_Anim_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_SkullEntropic_Anim_C, AnimGraphNode_ApplyAdditive) == 0x000B00, "Member 'UBP_SkullEntropic_Anim_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UBP_SkullEntropic_Anim_C, AnimGraphNode_SequencePlayer_1) == 0x000BC8, "Member 'UBP_SkullEntropic_Anim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_SkullEntropic_Anim_C, AnimGraphNode_SequencePlayer) == 0x000C48, "Member 'UBP_SkullEntropic_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");

}

