#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SubLevelTransition_Widget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_SubLevelTransition_Widget.BP_SubLevelTransition_Widget_C
// 0x0018 (0x04C8 - 0x04B0)
class UBP_SubLevelTransition_Widget_C final : public ULevelTransitionUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Fade;                                              // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               FadeMaterial;                                      // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SubLevelTransition_Widget(int32 EntryPoint);
	void OnShowWidget(class UMaterialInterface* Material);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SubLevelTransition_Widget_C">();
	}
	static class UBP_SubLevelTransition_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SubLevelTransition_Widget_C>();
	}
};
static_assert(alignof(UBP_SubLevelTransition_Widget_C) == 0x000008, "Wrong alignment on UBP_SubLevelTransition_Widget_C");
static_assert(sizeof(UBP_SubLevelTransition_Widget_C) == 0x0004C8, "Wrong size on UBP_SubLevelTransition_Widget_C");
static_assert(offsetof(UBP_SubLevelTransition_Widget_C, UberGraphFrame) == 0x0004B0, "Member 'UBP_SubLevelTransition_Widget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SubLevelTransition_Widget_C, Fade) == 0x0004B8, "Member 'UBP_SubLevelTransition_Widget_C::Fade' has a wrong offset!");
static_assert(offsetof(UBP_SubLevelTransition_Widget_C, FadeMaterial) == 0x0004C0, "Member 'UBP_SubLevelTransition_Widget_C::FadeMaterial' has a wrong offset!");

}

