#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShaderGeneratorScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ShaderGeneratorScreen.BP_ShaderGeneratorScreen_C
// 0x0038 (0x04E8 - 0x04B0)
class UBP_ShaderGeneratorScreen_C final : public UShaderGeneratorScreenUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Darkening;                                         // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DescriptionText;                                   // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LoadingAnim;                                       // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleText;                                         // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ShaderGeneratorScreen(int32 EntryPoint);
	void OnHide(float AnimDuration);
	void OnShow(float AnimDuration);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ShaderGeneratorScreen_C">();
	}
	static class UBP_ShaderGeneratorScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ShaderGeneratorScreen_C>();
	}
};
static_assert(alignof(UBP_ShaderGeneratorScreen_C) == 0x000008, "Wrong alignment on UBP_ShaderGeneratorScreen_C");
static_assert(sizeof(UBP_ShaderGeneratorScreen_C) == 0x0004E8, "Wrong size on UBP_ShaderGeneratorScreen_C");
static_assert(offsetof(UBP_ShaderGeneratorScreen_C, UberGraphFrame) == 0x0004B0, "Member 'UBP_ShaderGeneratorScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ShaderGeneratorScreen_C, FadeOutAnim) == 0x0004B8, "Member 'UBP_ShaderGeneratorScreen_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_ShaderGeneratorScreen_C, FadeInAnim) == 0x0004C0, "Member 'UBP_ShaderGeneratorScreen_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_ShaderGeneratorScreen_C, Darkening) == 0x0004C8, "Member 'UBP_ShaderGeneratorScreen_C::Darkening' has a wrong offset!");
static_assert(offsetof(UBP_ShaderGeneratorScreen_C, DescriptionText) == 0x0004D0, "Member 'UBP_ShaderGeneratorScreen_C::DescriptionText' has a wrong offset!");
static_assert(offsetof(UBP_ShaderGeneratorScreen_C, LoadingAnim) == 0x0004D8, "Member 'UBP_ShaderGeneratorScreen_C::LoadingAnim' has a wrong offset!");
static_assert(offsetof(UBP_ShaderGeneratorScreen_C, TitleText) == 0x0004E0, "Member 'UBP_ShaderGeneratorScreen_C::TitleText' has a wrong offset!");

}

