#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Striga_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_Striga_Anim.BP_Striga_Anim_C
// 0x4260 (0x4900 - 0x06A0)
class UBP_Striga_Anim_C final : public UAnimInstanceBase
{
public:
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0030)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_2;                    // 0x06D8(0x00A8)()
	struct FAnimNode_MirrorBones                  AnimGraphNode_MirrorBones;                         // 0x0780(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x07C8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0810(0x00A8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x08B8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x08D8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x08F8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0A00(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0B08(0x0108)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_1;                         // 0x0C10(0x01E0)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x0DF0(0x01E0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_1;                          // 0x0FD0(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone;                            // 0x10C0(0x00F0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_38;                   // 0x11B0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_37;                   // 0x1230(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_36;                   // 0x12B0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_35;                   // 0x1330(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_34;                   // 0x13B0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_33;                   // 0x1430(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_32;                   // 0x14B0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_31;                   // 0x1530(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_30;                   // 0x15B0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_29;                   // 0x1630(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_28;                   // 0x16B0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_27;                   // 0x1730(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_26;                   // 0x17B0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_25;                   // 0x1830(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_24;                   // 0x18B0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_23;                   // 0x1930(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_22;                   // 0x19B0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_21;                   // 0x1A30(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_20;                   // 0x1AB0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x1B30(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_19;                   // 0x1B58(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1BD8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_18;                   // 0x1C08(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1C88(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1CB8(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_17;                   // 0x1D68(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16;                   // 0x1DE8(0x0080)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_1;                    // 0x1E68(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0x1F10(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x1F90(0x0080)()
	struct FAnimNode_HitReaction                  AnimGraphNode_HitReaction_3;                       // 0x2010(0x00E8)()
	struct FAnimNode_HitReaction                  AnimGraphNode_HitReaction_2;                       // 0x20F8(0x00E8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x21E0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x2338(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x2360(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x2388(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x23B0(0x0080)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2430(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x2450(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x2470(0x0250)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x26C0(0x0250)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x2910(0x0250)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x2B60(0x0250)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x2DB0(0x0250)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x3000(0x0250)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x3250(0x0250)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x34A0(0x0250)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x36F0(0x0080)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x3770(0x0250)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x39C0(0x0250)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x3C10(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x3C90(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x3D10(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x3D90(0x0080)()
	struct FAnimNode_HitReaction                  AnimGraphNode_HitReaction_1;                       // 0x3E10(0x00E8)()
	struct FAnimNode_HitReaction                  AnimGraphNode_HitReaction;                         // 0x3EF8(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x3FE0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x4008(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x4030(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x40B0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x4130(0x0080)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x41B0(0x00E8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x4298(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x4318(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x4398(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x4418(0x0080)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x4498(0x00A8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x4540(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x4568(0x0158)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0x46C0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x4788(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x47B0(0x0080)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x4830(0x00C8)()
	int32                                         AdditiveHitAnimIx;                                 // 0x48F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OffCombatMode;                                     // 0x48FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Striga_Anim_AnimGraphNode_TransitionResult_FE68FDBD4C27CE1AD38EC2BAA80BC5DB();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void OnFacingChanged(bool bForced);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Striga_Anim_AnimGraphNode_BlendListByInt_6AB12736421524955D38149731D8EB88();
	void OnAnimStartRequest(class UAnimID* AnimID);
	void OnAnimStopRequest(class UAnimID* AnimID);
	void ExecuteUbergraph_BP_Striga_Anim(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Striga_Anim_C">();
	}
	static class UBP_Striga_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Striga_Anim_C>();
	}
};
static_assert(alignof(UBP_Striga_Anim_C) == 0x000010, "Wrong alignment on UBP_Striga_Anim_C");
static_assert(sizeof(UBP_Striga_Anim_C) == 0x004900, "Wrong size on UBP_Striga_Anim_C");
static_assert(offsetof(UBP_Striga_Anim_C, UberGraphFrame) == 0x0006A0, "Member 'UBP_Striga_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UBP_Striga_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_BlendListByInt_2) == 0x0006D8, "Member 'UBP_Striga_Anim_C::AnimGraphNode_BlendListByInt_2' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_MirrorBones) == 0x000780, "Member 'UBP_Striga_Anim_C::AnimGraphNode_MirrorBones' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_Slot) == 0x0007C8, "Member 'UBP_Striga_Anim_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_BlendListByBool) == 0x000810, "Member 'UBP_Striga_Anim_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_LocalToComponentSpace_1) == 0x0008B8, "Member 'UBP_Striga_Anim_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x0008D8, "Member 'UBP_Striga_Anim_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_ModifyBone_2) == 0x0008F8, "Member 'UBP_Striga_Anim_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_ModifyBone_1) == 0x000A00, "Member 'UBP_Striga_Anim_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_ModifyBone) == 0x000B08, "Member 'UBP_Striga_Anim_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_TwoBoneIK_1) == 0x000C10, "Member 'UBP_Striga_Anim_C::AnimGraphNode_TwoBoneIK_1' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_TwoBoneIK) == 0x000DF0, "Member 'UBP_Striga_Anim_C::AnimGraphNode_TwoBoneIK' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_CopyBone_1) == 0x000FD0, "Member 'UBP_Striga_Anim_C::AnimGraphNode_CopyBone_1' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_CopyBone) == 0x0010C0, "Member 'UBP_Striga_Anim_C::AnimGraphNode_CopyBone' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_38) == 0x0011B0, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_38' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_37) == 0x001230, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_37' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_36) == 0x0012B0, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_36' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_35) == 0x001330, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_35' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_34) == 0x0013B0, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_34' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_33) == 0x001430, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_33' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_32) == 0x0014B0, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_32' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_31) == 0x001530, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_31' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_30) == 0x0015B0, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_30' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_29) == 0x001630, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_29' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_28) == 0x0016B0, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_28' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_27) == 0x001730, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_27' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_26) == 0x0017B0, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_26' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_25) == 0x001830, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_25' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_24) == 0x0018B0, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_24' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_23) == 0x001930, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_23' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_22) == 0x0019B0, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_22' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_21) == 0x001A30, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_21' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_20) == 0x001AB0, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_20' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_TransitionResult) == 0x001B30, "Member 'UBP_Striga_Anim_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_19) == 0x001B58, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_19' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_StateResult_1) == 0x001BD8, "Member 'UBP_Striga_Anim_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_18) == 0x001C08, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_18' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_StateResult) == 0x001C88, "Member 'UBP_Striga_Anim_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_StateMachine) == 0x001CB8, "Member 'UBP_Striga_Anim_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_17) == 0x001D68, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_17' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_16) == 0x001DE8, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_16' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_BlendListByInt_1) == 0x001E68, "Member 'UBP_Striga_Anim_C::AnimGraphNode_BlendListByInt_1' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_15) == 0x001F10, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_15' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_14) == 0x001F90, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_14' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_HitReaction_3) == 0x002010, "Member 'UBP_Striga_Anim_C::AnimGraphNode_HitReaction_3' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_HitReaction_2) == 0x0020F8, "Member 'UBP_Striga_Anim_C::AnimGraphNode_HitReaction_2' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SaveCachedPose_1) == 0x0021E0, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_UseCachedPose_6) == 0x002338, "Member 'UBP_Striga_Anim_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_UseCachedPose_5) == 0x002360, "Member 'UBP_Striga_Anim_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_UseCachedPose_4) == 0x002388, "Member 'UBP_Striga_Anim_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_13) == 0x0023B0, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_13' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_LocalToComponentSpace) == 0x002430, "Member 'UBP_Striga_Anim_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_ComponentToLocalSpace) == 0x002450, "Member 'UBP_Striga_Anim_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_KawaiiPhysics_9) == 0x002470, "Member 'UBP_Striga_Anim_C::AnimGraphNode_KawaiiPhysics_9' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_KawaiiPhysics_8) == 0x0026C0, "Member 'UBP_Striga_Anim_C::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_KawaiiPhysics_7) == 0x002910, "Member 'UBP_Striga_Anim_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_KawaiiPhysics_6) == 0x002B60, "Member 'UBP_Striga_Anim_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_KawaiiPhysics_5) == 0x002DB0, "Member 'UBP_Striga_Anim_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_KawaiiPhysics_4) == 0x003000, "Member 'UBP_Striga_Anim_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_KawaiiPhysics_3) == 0x003250, "Member 'UBP_Striga_Anim_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_KawaiiPhysics_2) == 0x0034A0, "Member 'UBP_Striga_Anim_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_12) == 0x0036F0, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_12' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_KawaiiPhysics_1) == 0x003770, "Member 'UBP_Striga_Anim_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_KawaiiPhysics) == 0x0039C0, "Member 'UBP_Striga_Anim_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_11) == 0x003C10, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_11' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_10) == 0x003C90, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_9) == 0x003D10, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_8) == 0x003D90, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_HitReaction_1) == 0x003E10, "Member 'UBP_Striga_Anim_C::AnimGraphNode_HitReaction_1' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_HitReaction) == 0x003EF8, "Member 'UBP_Striga_Anim_C::AnimGraphNode_HitReaction' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_UseCachedPose_3) == 0x003FE0, "Member 'UBP_Striga_Anim_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_UseCachedPose_2) == 0x004008, "Member 'UBP_Striga_Anim_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_7) == 0x004030, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_6) == 0x0040B0, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_5) == 0x004130, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_BlendSpacePlayer) == 0x0041B0, "Member 'UBP_Striga_Anim_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_4) == 0x004298, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_3) == 0x004318, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_2) == 0x004398, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer_1) == 0x004418, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_BlendListByInt) == 0x004498, "Member 'UBP_Striga_Anim_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_UseCachedPose_1) == 0x004540, "Member 'UBP_Striga_Anim_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SaveCachedPose) == 0x004568, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_TwoWayBlend_1) == 0x0046C0, "Member 'UBP_Striga_Anim_C::AnimGraphNode_TwoWayBlend_1' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_UseCachedPose) == 0x004788, "Member 'UBP_Striga_Anim_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_SequencePlayer) == 0x0047B0, "Member 'UBP_Striga_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AnimGraphNode_TwoWayBlend) == 0x004830, "Member 'UBP_Striga_Anim_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, AdditiveHitAnimIx) == 0x0048F8, "Member 'UBP_Striga_Anim_C::AdditiveHitAnimIx' has a wrong offset!");
static_assert(offsetof(UBP_Striga_Anim_C, OffCombatMode) == 0x0048FC, "Member 'UBP_Striga_Anim_C::OffCombatMode' has a wrong offset!");

}

