#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShieldCharge_swoosh_straigth_VisualEntity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ShieldCharge_swoosh_straigth_VisualEntity.BP_ShieldCharge_swoosh_straigth_VisualEntity_C.ExecuteUbergraph_BP_ShieldCharge_swoosh_straigth_VisualEntity
// 0x00B0 (0x00B0 - 0x0000)
struct BP_ShieldCharge_swoosh_straigth_VisualEntity_C_ExecuteUbergraph_BP_ShieldCharge_swoosh_straigth_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0028(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ShieldCharge_swoosh_straigth_VisualEntity_C_ExecuteUbergraph_BP_ShieldCharge_swoosh_straigth_VisualEntity) == 0x000008, "Wrong alignment on BP_ShieldCharge_swoosh_straigth_VisualEntity_C_ExecuteUbergraph_BP_ShieldCharge_swoosh_straigth_VisualEntity");
static_assert(sizeof(BP_ShieldCharge_swoosh_straigth_VisualEntity_C_ExecuteUbergraph_BP_ShieldCharge_swoosh_straigth_VisualEntity) == 0x0000B0, "Wrong size on BP_ShieldCharge_swoosh_straigth_VisualEntity_C_ExecuteUbergraph_BP_ShieldCharge_swoosh_straigth_VisualEntity");
static_assert(offsetof(BP_ShieldCharge_swoosh_straigth_VisualEntity_C_ExecuteUbergraph_BP_ShieldCharge_swoosh_straigth_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_ShieldCharge_swoosh_straigth_VisualEntity_C_ExecuteUbergraph_BP_ShieldCharge_swoosh_straigth_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ShieldCharge_swoosh_straigth_VisualEntity_C_ExecuteUbergraph_BP_ShieldCharge_swoosh_straigth_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_ShieldCharge_swoosh_straigth_VisualEntity_C_ExecuteUbergraph_BP_ShieldCharge_swoosh_straigth_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShieldCharge_swoosh_straigth_VisualEntity_C_ExecuteUbergraph_BP_ShieldCharge_swoosh_straigth_VisualEntity, K2Node_DynamicCast_AsCharacter_Base) == 0x000010, "Member 'BP_ShieldCharge_swoosh_straigth_VisualEntity_C_ExecuteUbergraph_BP_ShieldCharge_swoosh_straigth_VisualEntity::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_ShieldCharge_swoosh_straigth_VisualEntity_C_ExecuteUbergraph_BP_ShieldCharge_swoosh_straigth_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_ShieldCharge_swoosh_straigth_VisualEntity_C_ExecuteUbergraph_BP_ShieldCharge_swoosh_straigth_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ShieldCharge_swoosh_straigth_VisualEntity_C_ExecuteUbergraph_BP_ShieldCharge_swoosh_straigth_VisualEntity, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000019, "Member 'BP_ShieldCharge_swoosh_straigth_VisualEntity_C_ExecuteUbergraph_BP_ShieldCharge_swoosh_straigth_VisualEntity::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShieldCharge_swoosh_straigth_VisualEntity_C_ExecuteUbergraph_BP_ShieldCharge_swoosh_straigth_VisualEntity, CallFunc_SelectRotator_ReturnValue) == 0x00001C, "Member 'BP_ShieldCharge_swoosh_straigth_VisualEntity_C_ExecuteUbergraph_BP_ShieldCharge_swoosh_straigth_VisualEntity::CallFunc_SelectRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShieldCharge_swoosh_straigth_VisualEntity_C_ExecuteUbergraph_BP_ShieldCharge_swoosh_straigth_VisualEntity, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000028, "Member 'BP_ShieldCharge_swoosh_straigth_VisualEntity_C_ExecuteUbergraph_BP_ShieldCharge_swoosh_straigth_VisualEntity::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");

}

