#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpiritWolf_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_SpiritWolf_Anim.BP_SpiritWolf_Anim_C
// 0x3040 (0x36E0 - 0x06A0)
class UBP_SpiritWolf_Anim_C final : public UAnimInstanceBase
{
public:
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0030)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_3;                    // 0x06D8(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_39;                   // 0x0780(0x0080)()
	struct FAnimNode_MirrorBones                  AnimGraphNode_MirrorBones;                         // 0x0800(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0848(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x09A0(0x0158)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_38;                   // 0x0AF8(0x0080)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_2;                    // 0x0B78(0x00A8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0C20(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_37;                   // 0x0C48(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0CC8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_36;                   // 0x0CF8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0D78(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x0DA8(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_35;                   // 0x0E58(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x0ED8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x0F00(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x0F28(0x0028)()
	struct FAnimNode_HitReactionFourLegs          AnimGraphNode_HitReactionFourLegs_3;               // 0x0F50(0x0220)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_34;                   // 0x1170(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_33;                   // 0x11F0(0x0080)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_1;                    // 0x1270(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_32;                   // 0x1318(0x0080)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x1398(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x1460(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1488(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x14B0(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x14F8(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1600(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1620(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x1640(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x1748(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x1850(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x1958(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1A60(0x0108)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_31;                   // 0x1B68(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1BE8(0x0108)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_30;                   // 0x1CF0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_29;                   // 0x1D70(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_28;                   // 0x1DF0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_27;                   // 0x1E70(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_26;                   // 0x1EF0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_25;                   // 0x1F70(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_24;                   // 0x1FF0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_23;                   // 0x2070(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_22;                   // 0x20F0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_21;                   // 0x2170(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_20;                   // 0x21F0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_19;                   // 0x2270(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_18;                   // 0x22F0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_17;                   // 0x2370(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16;                   // 0x23F0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0x2470(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x24F0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x2518(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x2598(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x25C8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x2648(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x2678(0x00B0)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x2728(0x00A8)()
	struct FAnimNode_RandomPlayer                 AnimGraphNode_RandomPlayer_1;                      // 0x27D0(0x0078)()
	struct FAnimNode_RandomPlayer                 AnimGraphNode_RandomPlayer;                        // 0x2848(0x0078)()
	struct FAnimNode_HitReactionFourLegs          AnimGraphNode_HitReactionFourLegs_2;               // 0x28C0(0x0220)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x2AE0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x2B60(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x2BE0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x2C60(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x2CE0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x2D60(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x2DE0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x2E60(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x2EE0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x2F60(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x2FE0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x3060(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x3088(0x0028)()
	struct FAnimNode_HitReactionFourLegs          AnimGraphNode_HitReactionFourLegs_1;               // 0x30B0(0x0220)()
	struct FAnimNode_HitReactionFourLegs          AnimGraphNode_HitReactionFourLegs;                 // 0x32D0(0x0220)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x34F0(0x00E8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x35D8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x3658(0x0080)()
	int32                                         AdditiveHitAnimIx;                                 // 0x36D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DieSequenceIndex;                                  // 0x36DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SpiritWolf_Anim(int32 EntryPoint);
	void BlueprintBeginPlay();
	void OnFacingChanged(bool bForced);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_SpiritWolf_Anim_AnimGraphNode_BlendListByInt_93279E724A874EE7D0AEE987670287B7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_SpiritWolf_Anim_AnimGraphNode_ModifyBone_F7BC56D441040409AF9713820FBBC970();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_SpiritWolf_Anim_AnimGraphNode_ModifyBone_9C0CAAB747A81A6F11287BA1C05665B4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_SpiritWolf_Anim_AnimGraphNode_ModifyBone_DDE8D15B4FB90B9A0744A19182FDC086();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_SpiritWolf_Anim_AnimGraphNode_ModifyBone_936C28A14364E1CC13DAC6AFA64AF64F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_SpiritWolf_Anim_AnimGraphNode_ModifyBone_4C0264434D6AA1F5D2DDA58DC571E0C4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_SpiritWolf_Anim_AnimGraphNode_ModifyBone_56AFF49346C8994C1EA118AFBED17DCF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_SpiritWolf_Anim_AnimGraphNode_ModifyBone_78A58CEB4FF06F249AA5249D5B2A5B7B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_SpiritWolf_Anim_AnimGraphNode_TransitionResult_C2A19DF549DC6BAB1B31E688BC5233B9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_SpiritWolf_Anim_AnimGraphNode_TransitionResult_65C35EC546321EC600DE949C088EC7C5();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SpiritWolf_Anim_C">();
	}
	static class UBP_SpiritWolf_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SpiritWolf_Anim_C>();
	}
};
static_assert(alignof(UBP_SpiritWolf_Anim_C) == 0x000010, "Wrong alignment on UBP_SpiritWolf_Anim_C");
static_assert(sizeof(UBP_SpiritWolf_Anim_C) == 0x0036E0, "Wrong size on UBP_SpiritWolf_Anim_C");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, UberGraphFrame) == 0x0006A0, "Member 'UBP_SpiritWolf_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_BlendListByInt_3) == 0x0006D8, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_BlendListByInt_3' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_39) == 0x000780, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_39' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_MirrorBones) == 0x000800, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_MirrorBones' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SaveCachedPose_1) == 0x000848, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SaveCachedPose) == 0x0009A0, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_38) == 0x000AF8, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_38' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_BlendListByInt_2) == 0x000B78, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_BlendListByInt_2' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_TransitionResult_1) == 0x000C20, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_37) == 0x000C48, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_37' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_StateResult_3) == 0x000CC8, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_36) == 0x000CF8, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_36' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_StateResult_2) == 0x000D78, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_StateMachine_1) == 0x000DA8, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_35) == 0x000E58, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_35' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_UseCachedPose_6) == 0x000ED8, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_UseCachedPose_5) == 0x000F00, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_UseCachedPose_4) == 0x000F28, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_HitReactionFourLegs_3) == 0x000F50, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_HitReactionFourLegs_3' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_34) == 0x001170, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_34' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_33) == 0x0011F0, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_33' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_BlendListByInt_1) == 0x001270, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_BlendListByInt_1' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_32) == 0x001318, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_32' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_TwoWayBlend) == 0x001398, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_UseCachedPose_3) == 0x001460, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_UseCachedPose_2) == 0x001488, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_Slot) == 0x0014B0, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_ModifyBone_6) == 0x0014F8, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_LocalToComponentSpace) == 0x001600, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_ComponentToLocalSpace) == 0x001620, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_ModifyBone_5) == 0x001640, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_ModifyBone_4) == 0x001748, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_ModifyBone_3) == 0x001850, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_ModifyBone_2) == 0x001958, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_ModifyBone_1) == 0x001A60, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_31) == 0x001B68, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_31' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_ModifyBone) == 0x001BE8, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_30) == 0x001CF0, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_30' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_29) == 0x001D70, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_29' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_28) == 0x001DF0, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_28' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_27) == 0x001E70, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_27' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_26) == 0x001EF0, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_26' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_25) == 0x001F70, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_25' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_24) == 0x001FF0, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_24' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_23) == 0x002070, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_23' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_22) == 0x0020F0, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_22' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_21) == 0x002170, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_21' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_20) == 0x0021F0, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_20' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_19) == 0x002270, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_19' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_18) == 0x0022F0, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_18' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_17) == 0x002370, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_17' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_16) == 0x0023F0, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_16' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_15) == 0x002470, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_15' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_TransitionResult) == 0x0024F0, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_14) == 0x002518, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_14' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_StateResult_1) == 0x002598, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_13) == 0x0025C8, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_13' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_StateResult) == 0x002648, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_StateMachine) == 0x002678, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_BlendListByInt) == 0x002728, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_RandomPlayer_1) == 0x0027D0, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_RandomPlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_RandomPlayer) == 0x002848, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_RandomPlayer' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_HitReactionFourLegs_2) == 0x0028C0, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_HitReactionFourLegs_2' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_12) == 0x002AE0, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_12' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_11) == 0x002B60, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_11' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_10) == 0x002BE0, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_9) == 0x002C60, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_8) == 0x002CE0, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_7) == 0x002D60, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_6) == 0x002DE0, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_5) == 0x002E60, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_4) == 0x002EE0, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_3) == 0x002F60, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_2) == 0x002FE0, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_UseCachedPose_1) == 0x003060, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_UseCachedPose) == 0x003088, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_HitReactionFourLegs_1) == 0x0030B0, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_HitReactionFourLegs_1' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_HitReactionFourLegs) == 0x0032D0, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_HitReactionFourLegs' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_BlendSpacePlayer) == 0x0034F0, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer_1) == 0x0035D8, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AnimGraphNode_SequencePlayer) == 0x003658, "Member 'UBP_SpiritWolf_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, AdditiveHitAnimIx) == 0x0036D8, "Member 'UBP_SpiritWolf_Anim_C::AdditiveHitAnimIx' has a wrong offset!");
static_assert(offsetof(UBP_SpiritWolf_Anim_C, DieSequenceIndex) == 0x0036DC, "Member 'UBP_SpiritWolf_Anim_C::DieSequenceIndex' has a wrong offset!");

}

