#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShaderGeneratorScreen

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_ShaderGeneratorScreen.BP_ShaderGeneratorScreen_C.ExecuteUbergraph_BP_ShaderGeneratorScreen
// 0x0068 (0x0068 - 0x0000)
struct BP_ShaderGeneratorScreen_C_ExecuteUbergraph_BP_ShaderGeneratorScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration_1;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue;         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue_1;       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShaderGeneratorScreen_C_ExecuteUbergraph_BP_ShaderGeneratorScreen) == 0x000008, "Wrong alignment on BP_ShaderGeneratorScreen_C_ExecuteUbergraph_BP_ShaderGeneratorScreen");
static_assert(sizeof(BP_ShaderGeneratorScreen_C_ExecuteUbergraph_BP_ShaderGeneratorScreen) == 0x000068, "Wrong size on BP_ShaderGeneratorScreen_C_ExecuteUbergraph_BP_ShaderGeneratorScreen");
static_assert(offsetof(BP_ShaderGeneratorScreen_C_ExecuteUbergraph_BP_ShaderGeneratorScreen, EntryPoint) == 0x000000, "Member 'BP_ShaderGeneratorScreen_C_ExecuteUbergraph_BP_ShaderGeneratorScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ShaderGeneratorScreen_C_ExecuteUbergraph_BP_ShaderGeneratorScreen, K2Node_Event_MyGeometry) == 0x000004, "Member 'BP_ShaderGeneratorScreen_C_ExecuteUbergraph_BP_ShaderGeneratorScreen::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_ShaderGeneratorScreen_C_ExecuteUbergraph_BP_ShaderGeneratorScreen, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'BP_ShaderGeneratorScreen_C_ExecuteUbergraph_BP_ShaderGeneratorScreen::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_ShaderGeneratorScreen_C_ExecuteUbergraph_BP_ShaderGeneratorScreen, K2Node_Event_AnimDuration_1) == 0x000040, "Member 'BP_ShaderGeneratorScreen_C_ExecuteUbergraph_BP_ShaderGeneratorScreen::K2Node_Event_AnimDuration_1' has a wrong offset!");
static_assert(offsetof(BP_ShaderGeneratorScreen_C_ExecuteUbergraph_BP_ShaderGeneratorScreen, CallFunc_GetAnimPlaybackSpeed_ReturnValue) == 0x000044, "Member 'BP_ShaderGeneratorScreen_C_ExecuteUbergraph_BP_ShaderGeneratorScreen::CallFunc_GetAnimPlaybackSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShaderGeneratorScreen_C_ExecuteUbergraph_BP_ShaderGeneratorScreen, K2Node_Event_AnimDuration) == 0x000048, "Member 'BP_ShaderGeneratorScreen_C_ExecuteUbergraph_BP_ShaderGeneratorScreen::K2Node_Event_AnimDuration' has a wrong offset!");
static_assert(offsetof(BP_ShaderGeneratorScreen_C_ExecuteUbergraph_BP_ShaderGeneratorScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'BP_ShaderGeneratorScreen_C_ExecuteUbergraph_BP_ShaderGeneratorScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShaderGeneratorScreen_C_ExecuteUbergraph_BP_ShaderGeneratorScreen, CallFunc_GetAnimPlaybackSpeed_ReturnValue_1) == 0x000058, "Member 'BP_ShaderGeneratorScreen_C_ExecuteUbergraph_BP_ShaderGeneratorScreen::CallFunc_GetAnimPlaybackSpeed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShaderGeneratorScreen_C_ExecuteUbergraph_BP_ShaderGeneratorScreen, CallFunc_PlayAnimation_ReturnValue_1) == 0x000060, "Member 'BP_ShaderGeneratorScreen_C_ExecuteUbergraph_BP_ShaderGeneratorScreen::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function BP_ShaderGeneratorScreen.BP_ShaderGeneratorScreen_C.OnHide
// 0x0004 (0x0004 - 0x0000)
struct BP_ShaderGeneratorScreen_C_OnHide final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShaderGeneratorScreen_C_OnHide) == 0x000004, "Wrong alignment on BP_ShaderGeneratorScreen_C_OnHide");
static_assert(sizeof(BP_ShaderGeneratorScreen_C_OnHide) == 0x000004, "Wrong size on BP_ShaderGeneratorScreen_C_OnHide");
static_assert(offsetof(BP_ShaderGeneratorScreen_C_OnHide, AnimDuration) == 0x000000, "Member 'BP_ShaderGeneratorScreen_C_OnHide::AnimDuration' has a wrong offset!");

// Function BP_ShaderGeneratorScreen.BP_ShaderGeneratorScreen_C.OnShow
// 0x0004 (0x0004 - 0x0000)
struct BP_ShaderGeneratorScreen_C_OnShow final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShaderGeneratorScreen_C_OnShow) == 0x000004, "Wrong alignment on BP_ShaderGeneratorScreen_C_OnShow");
static_assert(sizeof(BP_ShaderGeneratorScreen_C_OnShow) == 0x000004, "Wrong size on BP_ShaderGeneratorScreen_C_OnShow");
static_assert(offsetof(BP_ShaderGeneratorScreen_C_OnShow, AnimDuration) == 0x000000, "Member 'BP_ShaderGeneratorScreen_C_OnShow::AnimDuration' has a wrong offset!");

// Function BP_ShaderGeneratorScreen.BP_ShaderGeneratorScreen_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_ShaderGeneratorScreen_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShaderGeneratorScreen_C_Tick) == 0x000004, "Wrong alignment on BP_ShaderGeneratorScreen_C_Tick");
static_assert(sizeof(BP_ShaderGeneratorScreen_C_Tick) == 0x00003C, "Wrong size on BP_ShaderGeneratorScreen_C_Tick");
static_assert(offsetof(BP_ShaderGeneratorScreen_C_Tick, MyGeometry) == 0x000000, "Member 'BP_ShaderGeneratorScreen_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_ShaderGeneratorScreen_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_ShaderGeneratorScreen_C_Tick::InDeltaTime' has a wrong offset!");

}

