#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SoundTrack

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_SoundTrack.BP_SoundTrack_C.BtnHotkeyDPadDownClicked
// 0x0001 (0x0001 - 0x0000)
struct BP_SoundTrack_C_BtnHotkeyDPadDownClicked final
{
public:
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SoundTrack_C_BtnHotkeyDPadDownClicked) == 0x000001, "Wrong alignment on BP_SoundTrack_C_BtnHotkeyDPadDownClicked");
static_assert(sizeof(BP_SoundTrack_C_BtnHotkeyDPadDownClicked) == 0x000001, "Wrong size on BP_SoundTrack_C_BtnHotkeyDPadDownClicked");
static_assert(offsetof(BP_SoundTrack_C_BtnHotkeyDPadDownClicked, CallFunc_IsActive_ReturnValue) == 0x000000, "Member 'BP_SoundTrack_C_BtnHotkeyDPadDownClicked::CallFunc_IsActive_ReturnValue' has a wrong offset!");

// Function BP_SoundTrack.BP_SoundTrack_C.BtnHotkeyDPadUpClicked
// 0x0001 (0x0001 - 0x0000)
struct BP_SoundTrack_C_BtnHotkeyDPadUpClicked final
{
public:
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SoundTrack_C_BtnHotkeyDPadUpClicked) == 0x000001, "Wrong alignment on BP_SoundTrack_C_BtnHotkeyDPadUpClicked");
static_assert(sizeof(BP_SoundTrack_C_BtnHotkeyDPadUpClicked) == 0x000001, "Wrong size on BP_SoundTrack_C_BtnHotkeyDPadUpClicked");
static_assert(offsetof(BP_SoundTrack_C_BtnHotkeyDPadUpClicked, CallFunc_IsActive_ReturnValue) == 0x000000, "Member 'BP_SoundTrack_C_BtnHotkeyDPadUpClicked::CallFunc_IsActive_ReturnValue' has a wrong offset!");

// Function BP_SoundTrack.BP_SoundTrack_C.HideTOC
// 0x0048 (0x0048 - 0x0000)
struct BP_SoundTrack_C_HideTOC final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Options_Button_C*                   K2Node_DynamicCast_AsBP_Options_Button;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SoundTrack_C_HideTOC) == 0x000008, "Wrong alignment on BP_SoundTrack_C_HideTOC");
static_assert(sizeof(BP_SoundTrack_C_HideTOC) == 0x000048, "Wrong size on BP_SoundTrack_C_HideTOC");
static_assert(offsetof(BP_SoundTrack_C_HideTOC, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_SoundTrack_C_HideTOC::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SoundTrack_C_HideTOC, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_SoundTrack_C_HideTOC::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SoundTrack_C_HideTOC, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_SoundTrack_C_HideTOC::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SoundTrack_C_HideTOC, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'BP_SoundTrack_C_HideTOC::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SoundTrack_C_HideTOC, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_SoundTrack_C_HideTOC::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SoundTrack_C_HideTOC, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_SoundTrack_C_HideTOC::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SoundTrack_C_HideTOC, K2Node_DynamicCast_AsBP_Options_Button) == 0x000030, "Member 'BP_SoundTrack_C_HideTOC::K2Node_DynamicCast_AsBP_Options_Button' has a wrong offset!");
static_assert(offsetof(BP_SoundTrack_C_HideTOC, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_SoundTrack_C_HideTOC::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SoundTrack_C_HideTOC, CallFunc_Less_IntInt_ReturnValue) == 0x000039, "Member 'BP_SoundTrack_C_HideTOC::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SoundTrack_C_HideTOC, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'BP_SoundTrack_C_HideTOC::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BP_SoundTrack.BP_SoundTrack_C.ShowTOC
// 0x0050 (0x0050 - 0x0000)
struct BP_SoundTrack_C_ShowTOC final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Options_Button_C*                   K2Node_DynamicCast_AsBP_Options_Button;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SoundTrack_C_ShowTOC) == 0x000008, "Wrong alignment on BP_SoundTrack_C_ShowTOC");
static_assert(sizeof(BP_SoundTrack_C_ShowTOC) == 0x000050, "Wrong size on BP_SoundTrack_C_ShowTOC");
static_assert(offsetof(BP_SoundTrack_C_ShowTOC, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_SoundTrack_C_ShowTOC::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SoundTrack_C_ShowTOC, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_SoundTrack_C_ShowTOC::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SoundTrack_C_ShowTOC, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_SoundTrack_C_ShowTOC::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SoundTrack_C_ShowTOC, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'BP_SoundTrack_C_ShowTOC::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SoundTrack_C_ShowTOC, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_SoundTrack_C_ShowTOC::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SoundTrack_C_ShowTOC, CallFunc_GetChildAt_ReturnValue) == 0x000028, "Member 'BP_SoundTrack_C_ShowTOC::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SoundTrack_C_ShowTOC, K2Node_DynamicCast_AsBP_Options_Button) == 0x000030, "Member 'BP_SoundTrack_C_ShowTOC::K2Node_DynamicCast_AsBP_Options_Button' has a wrong offset!");
static_assert(offsetof(BP_SoundTrack_C_ShowTOC, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_SoundTrack_C_ShowTOC::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SoundTrack_C_ShowTOC, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BP_SoundTrack_C_ShowTOC::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SoundTrack_C_ShowTOC, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_SoundTrack_C_ShowTOC::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SoundTrack_C_ShowTOC, CallFunc_PlayAnimation_ReturnValue) == 0x000048, "Member 'BP_SoundTrack_C_ShowTOC::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BP_SoundTrack.BP_SoundTrack_C.HideControlBars
// 0x0008 (0x0008 - 0x0000)
struct BP_SoundTrack_C_HideControlBars final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SoundTrack_C_HideControlBars) == 0x000008, "Wrong alignment on BP_SoundTrack_C_HideControlBars");
static_assert(sizeof(BP_SoundTrack_C_HideControlBars) == 0x000008, "Wrong size on BP_SoundTrack_C_HideControlBars");
static_assert(offsetof(BP_SoundTrack_C_HideControlBars, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'BP_SoundTrack_C_HideControlBars::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BP_SoundTrack.BP_SoundTrack_C.ShowControlBars
// 0x0008 (0x0008 - 0x0000)
struct BP_SoundTrack_C_ShowControlBars final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SoundTrack_C_ShowControlBars) == 0x000008, "Wrong alignment on BP_SoundTrack_C_ShowControlBars");
static_assert(sizeof(BP_SoundTrack_C_ShowControlBars) == 0x000008, "Wrong size on BP_SoundTrack_C_ShowControlBars");
static_assert(offsetof(BP_SoundTrack_C_ShowControlBars, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'BP_SoundTrack_C_ShowControlBars::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BP_SoundTrack.BP_SoundTrack_C.BtnHotkeyAClicked
// 0x0001 (0x0001 - 0x0000)
struct BP_SoundTrack_C_BtnHotkeyAClicked final
{
public:
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SoundTrack_C_BtnHotkeyAClicked) == 0x000001, "Wrong alignment on BP_SoundTrack_C_BtnHotkeyAClicked");
static_assert(sizeof(BP_SoundTrack_C_BtnHotkeyAClicked) == 0x000001, "Wrong size on BP_SoundTrack_C_BtnHotkeyAClicked");
static_assert(offsetof(BP_SoundTrack_C_BtnHotkeyAClicked, CallFunc_IsActive_ReturnValue) == 0x000000, "Member 'BP_SoundTrack_C_BtnHotkeyAClicked::CallFunc_IsActive_ReturnValue' has a wrong offset!");

// Function BP_SoundTrack.BP_SoundTrack_C.BtnHotkeyRBClicked
// 0x0001 (0x0001 - 0x0000)
struct BP_SoundTrack_C_BtnHotkeyRBClicked final
{
public:
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SoundTrack_C_BtnHotkeyRBClicked) == 0x000001, "Wrong alignment on BP_SoundTrack_C_BtnHotkeyRBClicked");
static_assert(sizeof(BP_SoundTrack_C_BtnHotkeyRBClicked) == 0x000001, "Wrong size on BP_SoundTrack_C_BtnHotkeyRBClicked");
static_assert(offsetof(BP_SoundTrack_C_BtnHotkeyRBClicked, CallFunc_IsActive_ReturnValue) == 0x000000, "Member 'BP_SoundTrack_C_BtnHotkeyRBClicked::CallFunc_IsActive_ReturnValue' has a wrong offset!");

// Function BP_SoundTrack.BP_SoundTrack_C.BtnHotkeyLBClicked
// 0x0001 (0x0001 - 0x0000)
struct BP_SoundTrack_C_BtnHotkeyLBClicked final
{
public:
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SoundTrack_C_BtnHotkeyLBClicked) == 0x000001, "Wrong alignment on BP_SoundTrack_C_BtnHotkeyLBClicked");
static_assert(sizeof(BP_SoundTrack_C_BtnHotkeyLBClicked) == 0x000001, "Wrong size on BP_SoundTrack_C_BtnHotkeyLBClicked");
static_assert(offsetof(BP_SoundTrack_C_BtnHotkeyLBClicked, CallFunc_IsActive_ReturnValue) == 0x000000, "Member 'BP_SoundTrack_C_BtnHotkeyLBClicked::CallFunc_IsActive_ReturnValue' has a wrong offset!");

// Function BP_SoundTrack.BP_SoundTrack_C.OnShow
// 0x0004 (0x0004 - 0x0000)
struct BP_SoundTrack_C_OnShow final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SoundTrack_C_OnShow) == 0x000004, "Wrong alignment on BP_SoundTrack_C_OnShow");
static_assert(sizeof(BP_SoundTrack_C_OnShow) == 0x000004, "Wrong size on BP_SoundTrack_C_OnShow");
static_assert(offsetof(BP_SoundTrack_C_OnShow, AnimDuration) == 0x000000, "Member 'BP_SoundTrack_C_OnShow::AnimDuration' has a wrong offset!");

// Function BP_SoundTrack.BP_SoundTrack_C.OnHide
// 0x0004 (0x0004 - 0x0000)
struct BP_SoundTrack_C_OnHide final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SoundTrack_C_OnHide) == 0x000004, "Wrong alignment on BP_SoundTrack_C_OnHide");
static_assert(sizeof(BP_SoundTrack_C_OnHide) == 0x000004, "Wrong size on BP_SoundTrack_C_OnHide");
static_assert(offsetof(BP_SoundTrack_C_OnHide, AnimDuration) == 0x000000, "Member 'BP_SoundTrack_C_OnHide::AnimDuration' has a wrong offset!");

// Function BP_SoundTrack.BP_SoundTrack_C.OnSetTrack
// 0x0020 (0x0020 - 0x0000)
struct BP_SoundTrack_C_OnSetTrack final
{
public:
	class FText                                   TrackName;                                         // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         InCurrentTrack;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMaxTrack;                                        // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SoundTrack_C_OnSetTrack) == 0x000008, "Wrong alignment on BP_SoundTrack_C_OnSetTrack");
static_assert(sizeof(BP_SoundTrack_C_OnSetTrack) == 0x000020, "Wrong size on BP_SoundTrack_C_OnSetTrack");
static_assert(offsetof(BP_SoundTrack_C_OnSetTrack, TrackName) == 0x000000, "Member 'BP_SoundTrack_C_OnSetTrack::TrackName' has a wrong offset!");
static_assert(offsetof(BP_SoundTrack_C_OnSetTrack, InCurrentTrack) == 0x000018, "Member 'BP_SoundTrack_C_OnSetTrack::InCurrentTrack' has a wrong offset!");
static_assert(offsetof(BP_SoundTrack_C_OnSetTrack, InMaxTrack) == 0x00001C, "Member 'BP_SoundTrack_C_OnSetTrack::InMaxTrack' has a wrong offset!");

// Function BP_SoundTrack.BP_SoundTrack_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct BP_SoundTrack_C_CustomEvent_0 final
{
public:
	class UBP_Options_Button_C*                   OptionsButton;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SoundTrack_C_CustomEvent_0) == 0x000008, "Wrong alignment on BP_SoundTrack_C_CustomEvent_0");
static_assert(sizeof(BP_SoundTrack_C_CustomEvent_0) == 0x000008, "Wrong size on BP_SoundTrack_C_CustomEvent_0");
static_assert(offsetof(BP_SoundTrack_C_CustomEvent_0, OptionsButton) == 0x000000, "Member 'BP_SoundTrack_C_CustomEvent_0::OptionsButton' has a wrong offset!");

// Function BP_SoundTrack.BP_SoundTrack_C.ExecuteUbergraph_BP_SoundTrack
// 0x00D0 (0x00D0 - 0x0000)
struct BP_SoundTrack_C_ExecuteUbergraph_BP_SoundTrack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBP_Options_Button_C* OptionsButton)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0034(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration_1;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue;         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue_1;       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_TrackName;                            // 0x0070(0x0018)(ConstParm)
	int32                                         K2Node_Event_InCurrentTrack;                       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InMaxTrack;                           // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Options_Button_C*                   K2Node_CustomEvent_OptionsButton;                  // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0098(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_GetIndex_ReturnValue;                     // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Options_Button_C*                   K2Node_DynamicCast_AsBP_Options_Button;            // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SoundTrack_C_ExecuteUbergraph_BP_SoundTrack) == 0x000008, "Wrong alignment on BP_SoundTrack_C_ExecuteUbergraph_BP_SoundTrack");
static_assert(sizeof(BP_SoundTrack_C_ExecuteUbergraph_BP_SoundTrack) == 0x0000D0, "Wrong size on BP_SoundTrack_C_ExecuteUbergraph_BP_SoundTrack");
static_assert(offsetof(BP_SoundTrack_C_ExecuteUbergraph_BP_SoundTrack, EntryPoint) == 0x000000, "Member 'BP_SoundTrack_C_ExecuteUbergraph_BP_SoundTrack::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SoundTrack_C_ExecuteUbergraph_BP_SoundTrack, Temp_delegate_Variable) == 0x000004, "Member 'BP_SoundTrack_C_ExecuteUbergraph_BP_SoundTrack::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_SoundTrack_C_ExecuteUbergraph_BP_SoundTrack, CallFunc_PostEvent_ReturnValue) == 0x000014, "Member 'BP_SoundTrack_C_ExecuteUbergraph_BP_SoundTrack::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
