#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SimpleFog_fx

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SimpleFog_fx.BP_SimpleFog_fx_C
// 0x0030 (0x0258 - 0x0228)
class ABP_SimpleFog_fx_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_fog_plane;                                      // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FogDensity;                                        // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 FogColor;                                          // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FogScale;                                          // 0x0240(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FogGlow;                                           // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Additive;                                          // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TranslucentPrio;                                   // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetUpMaterialAdditive();
	void SetUpMaterialBlend();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SimpleFog_fx_C">();
	}
	static class ABP_SimpleFog_fx_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SimpleFog_fx_C>();
	}
};
static_assert(alignof(ABP_SimpleFog_fx_C) == 0x000008, "Wrong alignment on ABP_SimpleFog_fx_C");
static_assert(sizeof(ABP_SimpleFog_fx_C) == 0x000258, "Wrong size on ABP_SimpleFog_fx_C");
static_assert(offsetof(ABP_SimpleFog_fx_C, SM_fog_plane) == 0x000228, "Member 'ABP_SimpleFog_fx_C::SM_fog_plane' has a wrong offset!");
static_assert(offsetof(ABP_SimpleFog_fx_C, DefaultSceneRoot) == 0x000230, "Member 'ABP_SimpleFog_fx_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_SimpleFog_fx_C, FogDensity) == 0x000238, "Member 'ABP_SimpleFog_fx_C::FogDensity' has a wrong offset!");
static_assert(offsetof(ABP_SimpleFog_fx_C, FogColor) == 0x00023C, "Member 'ABP_SimpleFog_fx_C::FogColor' has a wrong offset!");
static_assert(offsetof(ABP_SimpleFog_fx_C, FogScale) == 0x000240, "Member 'ABP_SimpleFog_fx_C::FogScale' has a wrong offset!");
static_assert(offsetof(ABP_SimpleFog_fx_C, FogGlow) == 0x00024C, "Member 'ABP_SimpleFog_fx_C::FogGlow' has a wrong offset!");
static_assert(offsetof(ABP_SimpleFog_fx_C, Additive) == 0x000250, "Member 'ABP_SimpleFog_fx_C::Additive' has a wrong offset!");
static_assert(offsetof(ABP_SimpleFog_fx_C, TranslucentPrio) == 0x000254, "Member 'ABP_SimpleFog_fx_C::TranslucentPrio' has a wrong offset!");

}

