#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpeechBubbleComponent

#include "Basic.hpp"

#include "man_structs.hpp"


namespace SDK::Params
{

// Function BP_SpeechBubbleComponent.BP_SpeechBubbleComponent_C.ExecuteUbergraph_BP_SpeechBubbleComponent
// 0x0040 (0x0040 - 0x0000)
struct BP_SpeechBubbleComponent_C_ExecuteUbergraph_BP_SpeechBubbleComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Text;                                 // 0x0008(0x0018)(ConstParm)
	class FText                                   K2Node_Event_LineIDText;                           // 0x0020(0x0018)(ConstParm)
	EDialogueBubbleType                           K2Node_Event_DialogueBubbleType;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpeechBubbleComponent_C_ExecuteUbergraph_BP_SpeechBubbleComponent) == 0x000008, "Wrong alignment on BP_SpeechBubbleComponent_C_ExecuteUbergraph_BP_SpeechBubbleComponent");
static_assert(sizeof(BP_SpeechBubbleComponent_C_ExecuteUbergraph_BP_SpeechBubbleComponent) == 0x000040, "Wrong size on BP_SpeechBubbleComponent_C_ExecuteUbergraph_BP_SpeechBubbleComponent");
static_assert(offsetof(BP_SpeechBubbleComponent_C_ExecuteUbergraph_BP_SpeechBubbleComponent, EntryPoint) == 0x000000, "Member 'BP_SpeechBubbleComponent_C_ExecuteUbergraph_BP_SpeechBubbleComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SpeechBubbleComponent_C_ExecuteUbergraph_BP_SpeechBubbleComponent, K2Node_Event_Text) == 0x000008, "Member 'BP_SpeechBubbleComponent_C_ExecuteUbergraph_BP_SpeechBubbleComponent::K2Node_Event_Text' has a wrong offset!");
static_assert(offsetof(BP_SpeechBubbleComponent_C_ExecuteUbergraph_BP_SpeechBubbleComponent, K2Node_Event_LineIDText) == 0x000020, "Member 'BP_SpeechBubbleComponent_C_ExecuteUbergraph_BP_SpeechBubbleComponent::K2Node_Event_LineIDText' has a wrong offset!");
static_assert(offsetof(BP_SpeechBubbleComponent_C_ExecuteUbergraph_BP_SpeechBubbleComponent, K2Node_Event_DialogueBubbleType) == 0x000038, "Member 'BP_SpeechBubbleComponent_C_ExecuteUbergraph_BP_SpeechBubbleComponent::K2Node_Event_DialogueBubbleType' has a wrong offset!");

// Function BP_SpeechBubbleComponent.BP_SpeechBubbleComponent_C.BPInit
// 0x0038 (0x0038 - 0x0000)
struct BP_SpeechBubbleComponent_C_BPInit final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   LineIDText_0;                                      // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EDialogueBubbleType                           DialogueBubbleType;                                // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpeechBubbleComponent_C_BPInit) == 0x000008, "Wrong alignment on BP_SpeechBubbleComponent_C_BPInit");
static_assert(sizeof(BP_SpeechBubbleComponent_C_BPInit) == 0x000038, "Wrong size on BP_SpeechBubbleComponent_C_BPInit");
static_assert(offsetof(BP_SpeechBubbleComponent_C_BPInit, Text) == 0x000000, "Member 'BP_SpeechBubbleComponent_C_BPInit::Text' has a wrong offset!");
static_assert(offsetof(BP_SpeechBubbleComponent_C_BPInit, LineIDText_0) == 0x000018, "Member 'BP_SpeechBubbleComponent_C_BPInit::LineIDText_0' has a wrong offset!");
static_assert(offsetof(BP_SpeechBubbleComponent_C_BPInit, DialogueBubbleType) == 0x000030, "Member 'BP_SpeechBubbleComponent_C_BPInit::DialogueBubbleType' has a wrong offset!");

// Function BP_SpeechBubbleComponent.BP_SpeechBubbleComponent_C.Init
// 0x0038 (0x0038 - 0x0000)
struct BP_SpeechBubbleComponent_C_Init final
{
public:
	EDialogueBubbleType                           InDialogueType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   InCaption;                                         // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InLineIDText;                                      // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_SpeechBubbleComponent_C_Init) == 0x000008, "Wrong alignment on BP_SpeechBubbleComponent_C_Init");
static_assert(sizeof(BP_SpeechBubbleComponent_C_Init) == 0x000038, "Wrong size on BP_SpeechBubbleComponent_C_Init");
static_assert(offsetof(BP_SpeechBubbleComponent_C_Init, InDialogueType) == 0x000000, "Member 'BP_SpeechBubbleComponent_C_Init::InDialogueType' has a wrong offset!");
static_assert(offsetof(BP_SpeechBubbleComponent_C_Init, InCaption) == 0x000008, "Member 'BP_SpeechBubbleComponent_C_Init::InCaption' has a wrong offset!");
static_assert(offsetof(BP_SpeechBubbleComponent_C_Init, InLineIDText) == 0x000020, "Member 'BP_SpeechBubbleComponent_C_Init::InLineIDText' has a wrong offset!");

// Function BP_SpeechBubbleComponent.BP_SpeechBubbleComponent_C.FadeIn
// 0x0030 (0x0030 - 0x0000)
struct BP_SpeechBubbleComponent_C_FadeIn final
{
public:
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue_1;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_SpeechBubble_C*                     K2Node_DynamicCast_AsBP_Speech_Bubble;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SpeechBubble_C*                     K2Node_DynamicCast_AsBP_Speech_Bubble_1;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SpeechBubbleComponent_C_FadeIn) == 0x000008, "Wrong alignment on BP_SpeechBubbleComponent_C_FadeIn");
static_assert(sizeof(BP_SpeechBubbleComponent_C_FadeIn) == 0x000030, "Wrong size on BP_SpeechBubbleComponent_C_FadeIn");
static_assert(offsetof(BP_SpeechBubbleComponent_C_FadeIn, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000000, "Member 'BP_SpeechBubbleComponent_C_FadeIn::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpeechBubbleComponent_C_FadeIn, CallFunc_GetUserWidgetObject_ReturnValue_1) == 0x000008, "Member 'BP_SpeechBubbleComponent_C_FadeIn::CallFunc_GetUserWidgetObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpeechBubbleComponent_C_FadeIn, K2Node_DynamicCast_AsBP_Speech_Bubble) == 0x000010, "Member 'BP_SpeechBubbleComponent_C_FadeIn::K2Node_DynamicCast_AsBP_Speech_Bubble' has a wrong offset!");
static_assert(offsetof(BP_SpeechBubbleComponent_C_FadeIn, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_SpeechBubbleComponent_C_FadeIn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SpeechBubbleComponent_C_FadeIn, K2Node_DynamicCast_AsBP_Speech_Bubble_1) == 0x000020, "Member 'BP_SpeechBubbleComponent_C_FadeIn::K2Node_DynamicCast_AsBP_Speech_Bubble_1' has a wrong offset!");
static_assert(offsetof(BP_SpeechBubbleComponent_C_FadeIn, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'BP_SpeechBubbleComponent_C_FadeIn::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_SpeechBubbleComponent.BP_SpeechBubbleComponent_C.FadeOut
// 0x0018 (0x0018 - 0x0000)
struct BP_SpeechBubbleComponent_C_FadeOut final
{
public:
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_SpeechBubble_C*                     K2Node_DynamicCast_AsBP_Speech_Bubble;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SpeechBubbleComponent_C_FadeOut) == 0x000008, "Wrong alignment on BP_SpeechBubbleComponent_C_FadeOut");
static_assert(sizeof(BP_SpeechBubbleComponent_C_FadeOut) == 0x000018, "Wrong size on BP_SpeechBubbleComponent_C_FadeOut");
static_assert(offsetof(BP_SpeechBubbleComponent_C_FadeOut, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000000, "Member 'BP_SpeechBubbleComponent_C_FadeOut::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpeechBubbleComponent_C_FadeOut, K2Node_DynamicCast_AsBP_Speech_Bubble) == 0x000008, "Member 'BP_SpeechBubbleComponent_C_FadeOut::K2Node_DynamicCast_AsBP_Speech_Bubble' has a wrong offset!");
static_assert(offsetof(BP_SpeechBubbleComponent_C_FadeOut, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_SpeechBubbleComponent_C_FadeOut::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

