#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShadowShards_VE

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ShadowShards_VE.BP_ShadowShards_VE_C.ExecuteUbergraph_BP_ShadowShards_VE
// 0x0110 (0x0110 - 0x0000)
struct BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(class FName CustomName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CustomName;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChaosShardAbility*                     K2Node_DynamicCast_AsChaos_Shard_Ability;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpowerUnlocked_ReturnValue;            // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult;    // 0x0088(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE) == 0x000008, "Wrong alignment on BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE");
static_assert(sizeof(BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE) == 0x000110, "Wrong size on BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE");
static_assert(offsetof(BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE, EntryPoint) == 0x000000, "Member 'BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE, Temp_delegate_Variable) == 0x000004, "Member 'BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE, CallFunc_PostAkEvent_ReturnValue) == 0x000024, "Member 'BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE, CallFunc_GetAttachParentActor_ReturnValue) == 0x000028, "Member 'BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE, K2Node_CustomEvent_CustomName) == 0x000030, "Member 'BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE::K2Node_CustomEvent_CustomName' has a wrong offset!");
static_assert(offsetof(BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE, K2Node_DynamicCast_AsCharacter_Base) == 0x000038, "Member 'BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000041, "Member 'BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE, CallFunc_GetAbilityController_ReturnValue) == 0x000048, "Member 'BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000050, "Member 'BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000058, "Member 'BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE, K2Node_DynamicCast_AsChaos_Shard_Ability) == 0x000060, "Member 'BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE::K2Node_DynamicCast_AsChaos_Shard_Ability' has a wrong offset!");
static_assert(offsetof(BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE, CallFunc_IsEmpowerUnlocked_ReturnValue) == 0x000069, "Member 'BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE::CallFunc_IsEmpowerUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE, CallFunc_SelectFloat_ReturnValue) == 0x00006C, "Member 'BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE, CallFunc_MakeVector_ReturnValue) == 0x000070, "Member 'BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00007C, "Member 'BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000080, "Member 'BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000084, "Member 'BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE, CallFunc_K2_AddRelativeLocation_SweepHitResult) == 0x000088, "Member 'BP_ShadowShards_VE_C_ExecuteUbergraph_BP_ShadowShards_VE::CallFunc_K2_AddRelativeLocation_SweepHitResult' has a wrong offset!");

// Function BP_ShadowShards_VE.BP_ShadowShards_VE_C.OnAbilityCustomEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_ShadowShards_VE_C_OnAbilityCustomEvent final
{
public:
	class FName                                   CustomName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShadowShards_VE_C_OnAbilityCustomEvent) == 0x000004, "Wrong alignment on BP_ShadowShards_VE_C_OnAbilityCustomEvent");
static_assert(sizeof(BP_ShadowShards_VE_C_OnAbilityCustomEvent) == 0x000008, "Wrong size on BP_ShadowShards_VE_C_OnAbilityCustomEvent");
static_assert(offsetof(BP_ShadowShards_VE_C_OnAbilityCustomEvent, CustomName) == 0x000000, "Member 'BP_ShadowShards_VE_C_OnAbilityCustomEvent::CustomName' has a wrong offset!");

}

