#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Soldier_TrainingArcher_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_Soldier_TrainingArcher_Anim.BP_Soldier_TrainingArcher_Anim_C
// 0x0480 (0x0B70 - 0x06F0)
class UBP_Soldier_TrainingArcher_Anim_C final : public UNpcAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06F8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0728(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0750(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0778(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x07A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x07C8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x07F0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0870(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x08A0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0920(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0950(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x09D0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0A00(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0A80(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0AB0(0x00B0)()
	bool                                          InteractStarted;                                   // 0x0B60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Soldier_TrainingArcher_Anim_AnimGraphNode_TransitionResult_9E739F1741950790EF0CA7BC5B013092();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Soldier_TrainingArcher_Anim_AnimGraphNode_TransitionResult_E027DEA74D006CE174FE0E988AE1E83D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Soldier_TrainingArcher_Anim_AnimGraphNode_TransitionResult_FA3B7C0F4F2A46FC7F02F284F587AF32();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Soldier_TrainingArcher_Anim_AnimGraphNode_TransitionResult_EAEA11494A7D1881A26B48BB30A13DB2();
	void OnAnimStartRequest(class UAnimID* AnimID);
	void OnAnimStopRequest(class UAnimID* AnimID);
	void ExecuteUbergraph_BP_Soldier_TrainingArcher_Anim(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Soldier_TrainingArcher_Anim_C">();
	}
	static class UBP_Soldier_TrainingArcher_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Soldier_TrainingArcher_Anim_C>();
	}
};
static_assert(alignof(UBP_Soldier_TrainingArcher_Anim_C) == 0x000010, "Wrong alignment on UBP_Soldier_TrainingArcher_Anim_C");
static_assert(sizeof(UBP_Soldier_TrainingArcher_Anim_C) == 0x000B70, "Wrong size on UBP_Soldier_TrainingArcher_Anim_C");
static_assert(offsetof(UBP_Soldier_TrainingArcher_Anim_C, UberGraphFrame) == 0x0006F0, "Member 'UBP_Soldier_TrainingArcher_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingArcher_Anim_C, AnimGraphNode_Root) == 0x0006F8, "Member 'UBP_Soldier_TrainingArcher_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingArcher_Anim_C, AnimGraphNode_TransitionResult_4) == 0x000728, "Member 'UBP_Soldier_TrainingArcher_Anim_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingArcher_Anim_C, AnimGraphNode_TransitionResult_3) == 0x000750, "Member 'UBP_Soldier_TrainingArcher_Anim_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingArcher_Anim_C, AnimGraphNode_TransitionResult_2) == 0x000778, "Member 'UBP_Soldier_TrainingArcher_Anim_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingArcher_Anim_C, AnimGraphNode_TransitionResult_1) == 0x0007A0, "Member 'UBP_Soldier_TrainingArcher_Anim_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingArcher_Anim_C, AnimGraphNode_TransitionResult) == 0x0007C8, "Member 'UBP_Soldier_TrainingArcher_Anim_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingArcher_Anim_C, AnimGraphNode_SequencePlayer_3) == 0x0007F0, "Member 'UBP_Soldier_TrainingArcher_Anim_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingArcher_Anim_C, AnimGraphNode_StateResult_3) == 0x000870, "Member 'UBP_Soldier_TrainingArcher_Anim_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingArcher_Anim_C, AnimGraphNode_SequencePlayer_2) == 0x0008A0, "Member 'UBP_Soldier_TrainingArcher_Anim_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingArcher_Anim_C, AnimGraphNode_StateResult_2) == 0x000920, "Member 'UBP_Soldier_TrainingArcher_Anim_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingArcher_Anim_C, AnimGraphNode_SequencePlayer_1) == 0x000950, "Member 'UBP_Soldier_TrainingArcher_Anim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingArcher_Anim_C, AnimGraphNode_StateResult_1) == 0x0009D0, "Member 'UBP_Soldier_TrainingArcher_Anim_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingArcher_Anim_C, AnimGraphNode_SequencePlayer) == 0x000A00, "Member 'UBP_Soldier_TrainingArcher_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingArcher_Anim_C, AnimGraphNode_StateResult) == 0x000A80, "Member 'UBP_Soldier_TrainingArcher_Anim_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingArcher_Anim_C, AnimGraphNode_StateMachine) == 0x000AB0, "Member 'UBP_Soldier_TrainingArcher_Anim_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingArcher_Anim_C, InteractStarted) == 0x000B60, "Member 'UBP_Soldier_TrainingArcher_Anim_C::InteractStarted' has a wrong offset!");

}

