#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SummonedBook_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_SummonedBook_Anim.BP_SummonedBook_Anim_C
// 0x04A0 (0x0B40 - 0x06A0)
class UBP_SummonedBook_Anim_C final : public UAnimInstanceBase
{
public:
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0030)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x06D8(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0780(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0800(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0828(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x08A8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x08D8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0958(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0988(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0A38(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0AB8(0x0080)()

public:
	void ExecuteUbergraph_BP_SummonedBook_Anim(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_SummonedBook_Anim_AnimGraphNode_TransitionResult_59FC0F9B492D5046150877A4B5134CF6();
	void OnFacingChanged(bool bForced);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SummonedBook_Anim_C">();
	}
	static class UBP_SummonedBook_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SummonedBook_Anim_C>();
	}
};
static_assert(alignof(UBP_SummonedBook_Anim_C) == 0x000010, "Wrong alignment on UBP_SummonedBook_Anim_C");
static_assert(sizeof(UBP_SummonedBook_Anim_C) == 0x000B40, "Wrong size on UBP_SummonedBook_Anim_C");
static_assert(offsetof(UBP_SummonedBook_Anim_C, UberGraphFrame) == 0x0006A0, "Member 'UBP_SummonedBook_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SummonedBook_Anim_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UBP_SummonedBook_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_SummonedBook_Anim_C, AnimGraphNode_BlendListByInt) == 0x0006D8, "Member 'UBP_SummonedBook_Anim_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UBP_SummonedBook_Anim_C, AnimGraphNode_SequencePlayer_4) == 0x000780, "Member 'UBP_SummonedBook_Anim_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UBP_SummonedBook_Anim_C, AnimGraphNode_TransitionResult) == 0x000800, "Member 'UBP_SummonedBook_Anim_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UBP_SummonedBook_Anim_C, AnimGraphNode_SequencePlayer_3) == 0x000828, "Member 'UBP_SummonedBook_Anim_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UBP_SummonedBook_Anim_C, AnimGraphNode_StateResult_1) == 0x0008A8, "Member 'UBP_SummonedBook_Anim_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UBP_SummonedBook_Anim_C, AnimGraphNode_SequencePlayer_2) == 0x0008D8, "Member 'UBP_SummonedBook_Anim_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_SummonedBook_Anim_C, AnimGraphNode_StateResult) == 0x000958, "Member 'UBP_SummonedBook_Anim_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UBP_SummonedBook_Anim_C, AnimGraphNode_StateMachine) == 0x000988, "Member 'UBP_SummonedBook_Anim_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UBP_SummonedBook_Anim_C, AnimGraphNode_SequencePlayer_1) == 0x000A38, "Member 'UBP_SummonedBook_Anim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_SummonedBook_Anim_C, AnimGraphNode_SequencePlayer) == 0x000AB8, "Member 'UBP_SummonedBook_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");

}

