#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SummonedBook

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SummonedBook.BP_SummonedBook_C
// 0x0060 (0x1B20 - 0x1AC0)
#pragma pack(push, 0x1)
class alignas(0x10) ABP_SummonedBook_C : public AEnemyCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1AC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHitBox*                                VFXJank;                                           // 0x1AC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                BeamHitbox;                                        // 0x1AD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         DissolveTimeline_Dissolve_C3D5F1FD40953D7BA5495499F44AD1BB; // 0x1AD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            DissolveTimeline__Direction_C3D5F1FD40953D7BA5495499F44AD1BB; // 0x1ADC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ADD[0x3];                                     // 0x1ADD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     DissolveTimeline;                                  // 0x1AE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PoisonColor;                                       // 0x1AE8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BurnColor;                                         // 0x1AF8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LibrarianBoss_C*                    Librarian;                                         // 0x1B08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Poison;                                            // 0x1B10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_SummonedBook(int32 EntryPoint);
	void BPPostBeginPlay();
	void ReceiveBeginPlay();
	void DisappearVFX();
	void AppearVFX();
	void DissolveTimeline__UpdateFunc();
	void DissolveTimeline__FinishedFunc();
	void GetColor(struct FLinearColor* Color);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SummonedBook_C">();
	}
	static class ABP_SummonedBook_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SummonedBook_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(ABP_SummonedBook_C) == 0x000010, "Wrong alignment on ABP_SummonedBook_C");
static_assert(sizeof(ABP_SummonedBook_C) == 0x001B20, "Wrong size on ABP_SummonedBook_C");
static_assert(offsetof(ABP_SummonedBook_C, UberGraphFrame) == 0x001AC0, "Member 'ABP_SummonedBook_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SummonedBook_C, VFXJank) == 0x001AC8, "Member 'ABP_SummonedBook_C::VFXJank' has a wrong offset!");
static_assert(offsetof(ABP_SummonedBook_C, BeamHitbox) == 0x001AD0, "Member 'ABP_SummonedBook_C::BeamHitbox' has a wrong offset!");
static_assert(offsetof(ABP_SummonedBook_C, DissolveTimeline_Dissolve_C3D5F1FD40953D7BA5495499F44AD1BB) == 0x001AD8, "Member 'ABP_SummonedBook_C::DissolveTimeline_Dissolve_C3D5F1FD40953D7BA5495499F44AD1BB' has a wrong offset!");
static_assert(offsetof(ABP_SummonedBook_C, DissolveTimeline__Direction_C3D5F1FD40953D7BA5495499F44AD1BB) == 0x001ADC, "Member 'ABP_SummonedBook_C::DissolveTimeline__Direction_C3D5F1FD40953D7BA5495499F44AD1BB' has a wrong offset!");
static_assert(offsetof(ABP_SummonedBook_C, DissolveTimeline) == 0x001AE0, "Member 'ABP_SummonedBook_C::DissolveTimeline' has a wrong offset!");
static_assert(offsetof(ABP_SummonedBook_C, PoisonColor) == 0x001AE8, "Member 'ABP_SummonedBook_C::PoisonColor' has a wrong offset!");
static_assert(offsetof(ABP_SummonedBook_C, BurnColor) == 0x001AF8, "Member 'ABP_SummonedBook_C::BurnColor' has a wrong offset!");
static_assert(offsetof(ABP_SummonedBook_C, Librarian) == 0x001B08, "Member 'ABP_SummonedBook_C::Librarian' has a wrong offset!");
static_assert(offsetof(ABP_SummonedBook_C, Poison) == 0x001B10, "Member 'ABP_SummonedBook_C::Poison' has a wrong offset!");

}

