#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Soldier_TrainingSpearman2_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_Soldier_TrainingSpearman2_Anim.BP_Soldier_TrainingSpearman2_Anim_C
// 0x0380 (0x0A70 - 0x06F0)
class UBP_Soldier_TrainingSpearman2_Anim_C final : public UNpcAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06F8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0728(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0750(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0778(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x07A0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0820(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0850(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x08D0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0900(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0980(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x09B0(0x00B0)()
	bool                                          InteractStarted;                                   // 0x0A60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          WatchingStarted;                                   // 0x0A61(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Soldier_TrainingSpearman2_Anim_AnimGraphNode_TransitionResult_522653894425D04796B3B4A87AB2ADCF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Soldier_TrainingSpearman2_Anim_AnimGraphNode_TransitionResult_7975664C431986415FA6D68E238A5622();
	void OnAnimStartRequest(class UAnimID* AnimID);
	void OnAnimStopRequest(class UAnimID* AnimID);
	void AnimNotify_OnStartWatching();
	void ExecuteUbergraph_BP_Soldier_TrainingSpearman2_Anim(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Soldier_TrainingSpearman2_Anim_C">();
	}
	static class UBP_Soldier_TrainingSpearman2_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Soldier_TrainingSpearman2_Anim_C>();
	}
};
static_assert(alignof(UBP_Soldier_TrainingSpearman2_Anim_C) == 0x000010, "Wrong alignment on UBP_Soldier_TrainingSpearman2_Anim_C");
static_assert(sizeof(UBP_Soldier_TrainingSpearman2_Anim_C) == 0x000A70, "Wrong size on UBP_Soldier_TrainingSpearman2_Anim_C");
static_assert(offsetof(UBP_Soldier_TrainingSpearman2_Anim_C, UberGraphFrame) == 0x0006F0, "Member 'UBP_Soldier_TrainingSpearman2_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingSpearman2_Anim_C, AnimGraphNode_Root) == 0x0006F8, "Member 'UBP_Soldier_TrainingSpearman2_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingSpearman2_Anim_C, AnimGraphNode_TransitionResult_2) == 0x000728, "Member 'UBP_Soldier_TrainingSpearman2_Anim_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingSpearman2_Anim_C, AnimGraphNode_TransitionResult_1) == 0x000750, "Member 'UBP_Soldier_TrainingSpearman2_Anim_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingSpearman2_Anim_C, AnimGraphNode_TransitionResult) == 0x000778, "Member 'UBP_Soldier_TrainingSpearman2_Anim_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingSpearman2_Anim_C, AnimGraphNode_SequencePlayer_2) == 0x0007A0, "Member 'UBP_Soldier_TrainingSpearman2_Anim_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingSpearman2_Anim_C, AnimGraphNode_StateResult_2) == 0x000820, "Member 'UBP_Soldier_TrainingSpearman2_Anim_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingSpearman2_Anim_C, AnimGraphNode_SequencePlayer_1) == 0x000850, "Member 'UBP_Soldier_TrainingSpearman2_Anim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingSpearman2_Anim_C, AnimGraphNode_StateResult_1) == 0x0008D0, "Member 'UBP_Soldier_TrainingSpearman2_Anim_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingSpearman2_Anim_C, AnimGraphNode_SequencePlayer) == 0x000900, "Member 'UBP_Soldier_TrainingSpearman2_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingSpearman2_Anim_C, AnimGraphNode_StateResult) == 0x000980, "Member 'UBP_Soldier_TrainingSpearman2_Anim_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingSpearman2_Anim_C, AnimGraphNode_StateMachine) == 0x0009B0, "Member 'UBP_Soldier_TrainingSpearman2_Anim_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingSpearman2_Anim_C, InteractStarted) == 0x000A60, "Member 'UBP_Soldier_TrainingSpearman2_Anim_C::InteractStarted' has a wrong offset!");
static_assert(offsetof(UBP_Soldier_TrainingSpearman2_Anim_C, WatchingStarted) == 0x000A61, "Member 'UBP_Soldier_TrainingSpearman2_Anim_C::WatchingStarted' has a wrong offset!");

}

