#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpiritWolf

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SpiritWolf.BP_SpiritWolf_C.ExecuteUbergraph_BP_SpiritWolf
// 0x0020 (0x0020 - 0x0000)
struct BP_SpiritWolf_C_ExecuteUbergraph_BP_SpiritWolf final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_VfxEventType;                         // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SpiritWolf_C_ExecuteUbergraph_BP_SpiritWolf) == 0x000004, "Wrong alignment on BP_SpiritWolf_C_ExecuteUbergraph_BP_SpiritWolf");
static_assert(sizeof(BP_SpiritWolf_C_ExecuteUbergraph_BP_SpiritWolf) == 0x000020, "Wrong size on BP_SpiritWolf_C_ExecuteUbergraph_BP_SpiritWolf");
static_assert(offsetof(BP_SpiritWolf_C_ExecuteUbergraph_BP_SpiritWolf, EntryPoint) == 0x000000, "Member 'BP_SpiritWolf_C_ExecuteUbergraph_BP_SpiritWolf::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SpiritWolf_C_ExecuteUbergraph_BP_SpiritWolf, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000004, "Member 'BP_SpiritWolf_C_ExecuteUbergraph_BP_SpiritWolf::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpiritWolf_C_ExecuteUbergraph_BP_SpiritWolf, CallFunc_PostEventAtLocation_ReturnValue) == 0x000010, "Member 'BP_SpiritWolf_C_ExecuteUbergraph_BP_SpiritWolf::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpiritWolf_C_ExecuteUbergraph_BP_SpiritWolf, K2Node_Event_VfxEventType) == 0x000014, "Member 'BP_SpiritWolf_C_ExecuteUbergraph_BP_SpiritWolf::K2Node_Event_VfxEventType' has a wrong offset!");
static_assert(offsetof(BP_SpiritWolf_C_ExecuteUbergraph_BP_SpiritWolf, K2Node_SwitchName_CmpSuccess) == 0x00001C, "Member 'BP_SpiritWolf_C_ExecuteUbergraph_BP_SpiritWolf::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function BP_SpiritWolf.BP_SpiritWolf_C.OnVfxEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_SpiritWolf_C_OnVfxEvent final
{
public:
	class FName                                   VfxEventType;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpiritWolf_C_OnVfxEvent) == 0x000004, "Wrong alignment on BP_SpiritWolf_C_OnVfxEvent");
static_assert(sizeof(BP_SpiritWolf_C_OnVfxEvent) == 0x000008, "Wrong size on BP_SpiritWolf_C_OnVfxEvent");
static_assert(offsetof(BP_SpiritWolf_C_OnVfxEvent, VfxEventType) == 0x000000, "Member 'BP_SpiritWolf_C_OnVfxEvent::VfxEventType' has a wrong offset!");

}

