#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StaticElectricityEffect

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_StaticElectricityEffect.BP_StaticElectricityEffect_C.ExecuteUbergraph_BP_StaticElectricityEffect
// 0x0050 (0x0050 - 0x0000)
struct BP_StaticElectricityEffect_C_ExecuteUbergraph_BP_StaticElectricityEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BPGetCaster_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMandragoraGameMode*                    CallFunc_GetGameMode_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_StaticElectricity_Beam_VisualEntity_C* K2Node_DynamicCast_AsBP_Static_Electricity_Beam_Visual_Entity; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StaticElectricityEffect_C_ExecuteUbergraph_BP_StaticElectricityEffect) == 0x000008, "Wrong alignment on BP_StaticElectricityEffect_C_ExecuteUbergraph_BP_StaticElectricityEffect");
static_assert(sizeof(BP_StaticElectricityEffect_C_ExecuteUbergraph_BP_StaticElectricityEffect) == 0x000050, "Wrong size on BP_StaticElectricityEffect_C_ExecuteUbergraph_BP_StaticElectricityEffect");
static_assert(offsetof(BP_StaticElectricityEffect_C_ExecuteUbergraph_BP_StaticElectricityEffect, EntryPoint) == 0x000000, "Member 'BP_StaticElectricityEffect_C_ExecuteUbergraph_BP_StaticElectricityEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_StaticElectricityEffect_C_ExecuteUbergraph_BP_StaticElectricityEffect, CallFunc_GetAbilityController_ReturnValue) == 0x000008, "Member 'BP_StaticElectricityEffect_C_ExecuteUbergraph_BP_StaticElectricityEffect::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StaticElectricityEffect_C_ExecuteUbergraph_BP_StaticElectricityEffect, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_StaticElectricityEffect_C_ExecuteUbergraph_BP_StaticElectricityEffect::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StaticElectricityEffect_C_ExecuteUbergraph_BP_StaticElectricityEffect, CallFunc_BPGetCaster_ReturnValue) == 0x000018, "Member 'BP_StaticElectricityEffect_C_ExecuteUbergraph_BP_StaticElectricityEffect::CallFunc_BPGetCaster_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StaticElectricityEffect_C_ExecuteUbergraph_BP_StaticElectricityEffect, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'BP_StaticElectricityEffect_C_ExecuteUbergraph_BP_StaticElectricityEffect::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StaticElectricityEffect_C_ExecuteUbergraph_BP_StaticElectricityEffect, CallFunc_GetGameMode_ReturnValue) == 0x000030, "Member 'BP_StaticElectricityEffect_C_ExecuteUbergraph_BP_StaticElectricityEffect::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StaticElectricityEffect_C_ExecuteUbergraph_BP_StaticElectricityEffect, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000038, "Member 'BP_StaticElectricityEffect_C_ExecuteUbergraph_BP_StaticElectricityEffect::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StaticElectricityEffect_C_ExecuteUbergraph_BP_StaticElectricityEffect, K2Node_DynamicCast_AsBP_Static_Electricity_Beam_Visual_Entity) == 0x000040, "Member 'BP_StaticElectricityEffect_C_ExecuteUbergraph_BP_StaticElectricityEffect::K2Node_DynamicCast_AsBP_Static_Electricity_Beam_Visual_Entity' has a wrong offset!");
static_assert(offsetof(BP_StaticElectricityEffect_C_ExecuteUbergraph_BP_StaticElectricityEffect, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_StaticElectricityEffect_C_ExecuteUbergraph_BP_StaticElectricityEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

