#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkullEntropic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SplineMoveEyeBase_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SkullEntropic.BP_SkullEntropic_C
// 0x0040 (0x1B50 - 0x1B10)
class ABP_SkullEntropic_C final : public ABP_SplineMoveEyeBase_C
{
public:
	uint8                                         Pad_1B01[0x7];                                     // 0x1B01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_SkullEntropic_C;                 // 0x1B08(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_EntropyInsideMesh_C*                BP_EntropyInsideMesh;                              // 0x1B10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_EntropyEnemy_Die;                               // 0x1B18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                VFXJank;                                           // 0x1B20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_EntropicEnemy;                                  // 0x1B28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        VFX;                                               // 0x1B30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow1;                                            // 0x1B38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                BeamHitbox;                                        // 0x1B40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SavedSpeed;                                        // 0x1B48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SkullEntropic(int32 EntryPoint);
	void OnKilled(class UObject* Killer, class UAbilityController* KillerAbilityController);
	void ReceiveTick(float DeltaSeconds);
	void BPPostBeginPlay();
	void EventOnCustomEvent_Event_0(class FName CustomName);
	void GetBeamLength(float* Length);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SkullEntropic_C">();
	}
	static class ABP_SkullEntropic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SkullEntropic_C>();
	}
};
static_assert(alignof(ABP_SkullEntropic_C) == 0x000010, "Wrong alignment on ABP_SkullEntropic_C");
static_assert(sizeof(ABP_SkullEntropic_C) == 0x001B50, "Wrong size on ABP_SkullEntropic_C");
static_assert(offsetof(ABP_SkullEntropic_C, UberGraphFrame_BP_SkullEntropic_C) == 0x001B08, "Member 'ABP_SkullEntropic_C::UberGraphFrame_BP_SkullEntropic_C' has a wrong offset!");
static_assert(offsetof(ABP_SkullEntropic_C, BP_EntropyInsideMesh) == 0x001B10, "Member 'ABP_SkullEntropic_C::BP_EntropyInsideMesh' has a wrong offset!");
static_assert(offsetof(ABP_SkullEntropic_C, NS_EntropyEnemy_Die) == 0x001B18, "Member 'ABP_SkullEntropic_C::NS_EntropyEnemy_Die' has a wrong offset!");
static_assert(offsetof(ABP_SkullEntropic_C, VFXJank) == 0x001B20, "Member 'ABP_SkullEntropic_C::VFXJank' has a wrong offset!");
static_assert(offsetof(ABP_SkullEntropic_C, NS_EntropicEnemy) == 0x001B28, "Member 'ABP_SkullEntropic_C::NS_EntropicEnemy' has a wrong offset!");
static_assert(offsetof(ABP_SkullEntropic_C, VFX) == 0x001B30, "Member 'ABP_SkullEntropic_C::VFX' has a wrong offset!");
static_assert(offsetof(ABP_SkullEntropic_C, Arrow1) == 0x001B38, "Member 'ABP_SkullEntropic_C::Arrow1' has a wrong offset!");
static_assert(offsetof(ABP_SkullEntropic_C, BeamHitbox) == 0x001B40, "Member 'ABP_SkullEntropic_C::BeamHitbox' has a wrong offset!");
static_assert(offsetof(ABP_SkullEntropic_C, SavedSpeed) == 0x001B48, "Member 'ABP_SkullEntropic_C::SavedSpeed' has a wrong offset!");

}

