#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpringTrapDamage

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SpringTrapDamage.BP_SpringTrapDamage_C.ExecuteUbergraph_BP_SpringTrapDamage
// 0x0088 (0x0088 - 0x0000)
struct BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetGameMode_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetActor_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_GetChildComponent_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackComponent*                CallFunc_SpawnForceFeedbackAttached_ReturnValue;   // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackComponent*                CallFunc_SpawnForceFeedbackAttached_ReturnValue_1; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackComponent*                CallFunc_SpawnForceFeedbackAttached_ReturnValue_2; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceFeedbackComponent*                CallFunc_SpawnForceFeedbackAttached_ReturnValue_3; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage) == 0x000008, "Wrong alignment on BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage");
static_assert(sizeof(BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage) == 0x000088, "Wrong size on BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage");
static_assert(offsetof(BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage, EntryPoint) == 0x000000, "Member 'BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage, CallFunc_GetAbilityController_ReturnValue) == 0x000008, "Member 'BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage, CallFunc_GetGameMode_ReturnValue) == 0x000010, "Member 'BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage, CallFunc_GetActor_ReturnValue) == 0x000018, "Member 'BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage::CallFunc_GetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000020, "Member 'BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage, CallFunc_GetChildComponent_ReturnValue) == 0x000030, "Member 'BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage::CallFunc_GetChildComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage, CallFunc_SpawnForceFeedbackAttached_ReturnValue) == 0x000038, "Member 'BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage::CallFunc_SpawnForceFeedbackAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage, CallFunc_SpawnForceFeedbackAttached_ReturnValue_1) == 0x000040, "Member 'BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage::CallFunc_SpawnForceFeedbackAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage, CallFunc_SpawnForceFeedbackAttached_ReturnValue_2) == 0x000048, "Member 'BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage::CallFunc_SpawnForceFeedbackAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000050, "Member 'BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage, CallFunc_SpawnForceFeedbackAttached_ReturnValue_3) == 0x000060, "Member 'BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage::CallFunc_SpawnForceFeedbackAttached_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000068, "Member 'BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage, CallFunc_BreakVector_X) == 0x000074, "Member 'BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage, CallFunc_BreakVector_Y) == 0x000078, "Member 'BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage, CallFunc_BreakVector_Z) == 0x00007C, "Member 'BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000080, "Member 'BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000081, "Member 'BP_SpringTrapDamage_C_ExecuteUbergraph_BP_SpringTrapDamage::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

