#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkillLearn

#include "Basic.hpp"

#include "man_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_SkillLearn.BP_SkillLearn_C.ExecuteUbergraph_BP_SkillLearn
// 0x00A0 (0x00A0 - 0x0000)
struct BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHUDPopupQueue                         K2Node_Event_InHUDPopupQueue;                      // 0x0008(0x0058)()
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0060(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_AnimDuration_1;                       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue;         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration;                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue_1;       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn) == 0x000008, "Wrong alignment on BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn");
static_assert(sizeof(BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn) == 0x0000A0, "Wrong size on BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn");
static_assert(offsetof(BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn, EntryPoint) == 0x000000, "Member 'BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn, K2Node_Event_InHUDPopupQueue) == 0x000008, "Member 'BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn::K2Node_Event_InHUDPopupQueue' has a wrong offset!");
static_assert(offsetof(BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn, Temp_delegate_Variable) == 0x000060, "Member 'BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn, CallFunc_PostEvent_ReturnValue) == 0x000070, "Member 'BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn, K2Node_Event_IsDesignTime) == 0x000074, "Member 'BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn, K2Node_Event_AnimDuration_1) == 0x000078, "Member 'BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn::K2Node_Event_AnimDuration_1' has a wrong offset!");
static_assert(offsetof(BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn, CallFunc_GetAnimPlaybackSpeed_ReturnValue) == 0x00007C, "Member 'BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn::CallFunc_GetAnimPlaybackSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn, K2Node_Event_AnimDuration) == 0x000080, "Member 'BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn::K2Node_Event_AnimDuration' has a wrong offset!");
static_assert(offsetof(BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn, CallFunc_PlayAnimation_ReturnValue) == 0x000088, "Member 'BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn, CallFunc_GetAnimPlaybackSpeed_ReturnValue_1) == 0x000090, "Member 'BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn::CallFunc_GetAnimPlaybackSpeed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn, CallFunc_PlayAnimation_ReturnValue_1) == 0x000098, "Member 'BP_SkillLearn_C_ExecuteUbergraph_BP_SkillLearn::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function BP_SkillLearn.BP_SkillLearn_C.OnSetData
// 0x0058 (0x0058 - 0x0000)
struct BP_SkillLearn_C_OnSetData final
{
public:
	struct FHUDPopupQueue                         InHUDPopupQueue;                                   // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_SkillLearn_C_OnSetData) == 0x000008, "Wrong alignment on BP_SkillLearn_C_OnSetData");
static_assert(sizeof(BP_SkillLearn_C_OnSetData) == 0x000058, "Wrong size on BP_SkillLearn_C_OnSetData");
static_assert(offsetof(BP_SkillLearn_C_OnSetData, InHUDPopupQueue) == 0x000000, "Member 'BP_SkillLearn_C_OnSetData::InHUDPopupQueue' has a wrong offset!");

// Function BP_SkillLearn.BP_SkillLearn_C.OnShow
// 0x0004 (0x0004 - 0x0000)
struct BP_SkillLearn_C_OnShow final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillLearn_C_OnShow) == 0x000004, "Wrong alignment on BP_SkillLearn_C_OnShow");
static_assert(sizeof(BP_SkillLearn_C_OnShow) == 0x000004, "Wrong size on BP_SkillLearn_C_OnShow");
static_assert(offsetof(BP_SkillLearn_C_OnShow, AnimDuration) == 0x000000, "Member 'BP_SkillLearn_C_OnShow::AnimDuration' has a wrong offset!");

// Function BP_SkillLearn.BP_SkillLearn_C.OnHide
// 0x0004 (0x0004 - 0x0000)
struct BP_SkillLearn_C_OnHide final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillLearn_C_OnHide) == 0x000004, "Wrong alignment on BP_SkillLearn_C_OnHide");
static_assert(sizeof(BP_SkillLearn_C_OnHide) == 0x000004, "Wrong size on BP_SkillLearn_C_OnHide");
static_assert(offsetof(BP_SkillLearn_C_OnHide, AnimDuration) == 0x000000, "Member 'BP_SkillLearn_C_OnHide::AnimDuration' has a wrong offset!");

// Function BP_SkillLearn.BP_SkillLearn_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_SkillLearn_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SkillLearn_C_PreConstruct) == 0x000001, "Wrong alignment on BP_SkillLearn_C_PreConstruct");
static_assert(sizeof(BP_SkillLearn_C_PreConstruct) == 0x000001, "Wrong size on BP_SkillLearn_C_PreConstruct");
static_assert(offsetof(BP_SkillLearn_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_SkillLearn_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_SkillLearn.BP_SkillLearn_C.SetData
// 0x0028 (0x0028 - 0x0000)
struct BP_SkillLearn_C_SetData final
{
public:
	class FText                                   Param_Name_0;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTexture2D*                             Icon_0;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillLearn_C_SetData) == 0x000008, "Wrong alignment on BP_SkillLearn_C_SetData");
static_assert(sizeof(BP_SkillLearn_C_SetData) == 0x000028, "Wrong size on BP_SkillLearn_C_SetData");
static_assert(offsetof(BP_SkillLearn_C_SetData, Param_Name_0) == 0x000000, "Member 'BP_SkillLearn_C_SetData::Param_Name_0' has a wrong offset!");
static_assert(offsetof(BP_SkillLearn_C_SetData, Icon_0) == 0x000018, "Member 'BP_SkillLearn_C_SetData::Icon_0' has a wrong offset!");
static_assert(offsetof(BP_SkillLearn_C_SetData, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'BP_SkillLearn_C_SetData::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

