#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StaticElectricity_Beam_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_StaticElectricity_Beam_VisualEntity.BP_StaticElectricity_Beam_VisualEntity_C
// 0x0020 (0x0370 - 0x0350)
class ABP_StaticElectricity_Beam_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_StaticElectricity_Beam;                         // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Origin;                                            // 0x0360(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_StaticElectricity_Beam_VisualEntity(int32 EntryPoint);
	void OnKill();
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_StaticElectricity_Beam_VisualEntity_C">();
	}
	static class ABP_StaticElectricity_Beam_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_StaticElectricity_Beam_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_StaticElectricity_Beam_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_StaticElectricity_Beam_VisualEntity_C");
static_assert(sizeof(ABP_StaticElectricity_Beam_VisualEntity_C) == 0x000370, "Wrong size on ABP_StaticElectricity_Beam_VisualEntity_C");
static_assert(offsetof(ABP_StaticElectricity_Beam_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_StaticElectricity_Beam_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_StaticElectricity_Beam_VisualEntity_C, NS_StaticElectricity_Beam) == 0x000358, "Member 'ABP_StaticElectricity_Beam_VisualEntity_C::NS_StaticElectricity_Beam' has a wrong offset!");
static_assert(offsetof(ABP_StaticElectricity_Beam_VisualEntity_C, Origin) == 0x000360, "Member 'ABP_StaticElectricity_Beam_VisualEntity_C::Origin' has a wrong offset!");

}

