#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Subtitle

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_Subtitle.BP_Subtitle_C.ExecuteUbergraph_BP_Subtitle
// 0x00B8 (0x00B8 - 0x0000)
struct BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration_3;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration_2;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue;         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_InText;                               // 0x0050(0x0018)(ConstParm)
	class FText                                   K2Node_Event_InLineIDText;                         // 0x0068(0x0018)(ConstParm)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue_1;       // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0098(0x0018)()
	float                                         K2Node_Event_AnimDuration_1;                       // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle) == 0x000008, "Wrong alignment on BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle");
static_assert(sizeof(BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle) == 0x0000B8, "Wrong size on BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle");
static_assert(offsetof(BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle, EntryPoint) == 0x000000, "Member 'BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle, K2Node_Event_AnimDuration) == 0x000004, "Member 'BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle::K2Node_Event_AnimDuration' has a wrong offset!");
static_assert(offsetof(BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle, K2Node_Event_MyGeometry) == 0x000008, "Member 'BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle, K2Node_Event_InDeltaTime) == 0x000040, "Member 'BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle, K2Node_Event_AnimDuration_3) == 0x000044, "Member 'BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle::K2Node_Event_AnimDuration_3' has a wrong offset!");
static_assert(offsetof(BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle, K2Node_Event_AnimDuration_2) == 0x000048, "Member 'BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle::K2Node_Event_AnimDuration_2' has a wrong offset!");
static_assert(offsetof(BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle, CallFunc_GetAnimPlaybackSpeed_ReturnValue) == 0x00004C, "Member 'BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle::CallFunc_GetAnimPlaybackSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle, K2Node_Event_InText) == 0x000050, "Member 'BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle::K2Node_Event_InText' has a wrong offset!");
static_assert(offsetof(BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle, K2Node_Event_InLineIDText) == 0x000068, "Member 'BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle::K2Node_Event_InLineIDText' has a wrong offset!");
static_assert(offsetof(BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle, CallFunc_GetAnimPlaybackSpeed_ReturnValue_1) == 0x000080, "Member 'BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle::CallFunc_GetAnimPlaybackSpeed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle, CallFunc_PlayAnimation_ReturnValue) == 0x000088, "Member 'BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle, CallFunc_PlayAnimation_ReturnValue_1) == 0x000090, "Member 'BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle, CallFunc_GetEmptyText_ReturnValue) == 0x000098, "Member 'BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle, K2Node_Event_AnimDuration_1) == 0x0000B0, "Member 'BP_Subtitle_C_ExecuteUbergraph_BP_Subtitle::K2Node_Event_AnimDuration_1' has a wrong offset!");

// Function BP_Subtitle.BP_Subtitle_C.OnMoveToNormal
// 0x0004 (0x0004 - 0x0000)
struct BP_Subtitle_C_OnMoveToNormal final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Subtitle_C_OnMoveToNormal) == 0x000004, "Wrong alignment on BP_Subtitle_C_OnMoveToNormal");
static_assert(sizeof(BP_Subtitle_C_OnMoveToNormal) == 0x000004, "Wrong size on BP_Subtitle_C_OnMoveToNormal");
static_assert(offsetof(BP_Subtitle_C_OnMoveToNormal, AnimDuration) == 0x000000, "Member 'BP_Subtitle_C_OnMoveToNormal::AnimDuration' has a wrong offset!");

// Function BP_Subtitle.BP_Subtitle_C.OnMoveToUltrawide
// 0x0004 (0x0004 - 0x0000)
struct BP_Subtitle_C_OnMoveToUltrawide final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Subtitle_C_OnMoveToUltrawide) == 0x000004, "Wrong alignment on BP_Subtitle_C_OnMoveToUltrawide");
static_assert(sizeof(BP_Subtitle_C_OnMoveToUltrawide) == 0x000004, "Wrong size on BP_Subtitle_C_OnMoveToUltrawide");
static_assert(offsetof(BP_Subtitle_C_OnMoveToUltrawide, AnimDuration) == 0x000000, "Member 'BP_Subtitle_C_OnMoveToUltrawide::AnimDuration' has a wrong offset!");

// Function BP_Subtitle.BP_Subtitle_C.OnShowSubtitleText
// 0x0030 (0x0030 - 0x0000)
struct BP_Subtitle_C_OnShowSubtitleText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   InLineIDText;                                      // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Subtitle_C_OnShowSubtitleText) == 0x000008, "Wrong alignment on BP_Subtitle_C_OnShowSubtitleText");
static_assert(sizeof(BP_Subtitle_C_OnShowSubtitleText) == 0x000030, "Wrong size on BP_Subtitle_C_OnShowSubtitleText");
static_assert(offsetof(BP_Subtitle_C_OnShowSubtitleText, InText) == 0x000000, "Member 'BP_Subtitle_C_OnShowSubtitleText::InText' has a wrong offset!");
static_assert(offsetof(BP_Subtitle_C_OnShowSubtitleText, InLineIDText) == 0x000018, "Member 'BP_Subtitle_C_OnShowSubtitleText::InLineIDText' has a wrong offset!");

// Function BP_Subtitle.BP_Subtitle_C.OnHide
// 0x0004 (0x0004 - 0x0000)
struct BP_Subtitle_C_OnHide final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Subtitle_C_OnHide) == 0x000004, "Wrong alignment on BP_Subtitle_C_OnHide");
static_assert(sizeof(BP_Subtitle_C_OnHide) == 0x000004, "Wrong size on BP_Subtitle_C_OnHide");
static_assert(offsetof(BP_Subtitle_C_OnHide, AnimDuration) == 0x000000, "Member 'BP_Subtitle_C_OnHide::AnimDuration' has a wrong offset!");

// Function BP_Subtitle.BP_Subtitle_C.OnShow
// 0x0004 (0x0004 - 0x0000)
struct BP_Subtitle_C_OnShow final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Subtitle_C_OnShow) == 0x000004, "Wrong alignment on BP_Subtitle_C_OnShow");
static_assert(sizeof(BP_Subtitle_C_OnShow) == 0x000004, "Wrong size on BP_Subtitle_C_OnShow");
static_assert(offsetof(BP_Subtitle_C_OnShow, AnimDuration) == 0x000000, "Member 'BP_Subtitle_C_OnShow::AnimDuration' has a wrong offset!");

// Function BP_Subtitle.BP_Subtitle_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_Subtitle_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Subtitle_C_Tick) == 0x000004, "Wrong alignment on BP_Subtitle_C_Tick");
static_assert(sizeof(BP_Subtitle_C_Tick) == 0x00003C, "Wrong size on BP_Subtitle_C_Tick");
static_assert(offsetof(BP_Subtitle_C_Tick, MyGeometry) == 0x000000, "Member 'BP_Subtitle_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_Subtitle_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_Subtitle_C_Tick::InDeltaTime' has a wrong offset!");

// Function BP_Subtitle.BP_Subtitle_C.MoveToUltrawide
// 0x0004 (0x0004 - 0x0000)
struct BP_Subtitle_C_MoveToUltrawide final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Subtitle_C_MoveToUltrawide) == 0x000004, "Wrong alignment on BP_Subtitle_C_MoveToUltrawide");
static_assert(sizeof(BP_Subtitle_C_MoveToUltrawide) == 0x000004, "Wrong size on BP_Subtitle_C_MoveToUltrawide");
static_assert(offsetof(BP_Subtitle_C_MoveToUltrawide, AnimDuration) == 0x000000, "Member 'BP_Subtitle_C_MoveToUltrawide::AnimDuration' has a wrong offset!");

// Function BP_Subtitle.BP_Subtitle_C.MoveToNormal
// 0x0004 (0x0004 - 0x0000)
struct BP_Subtitle_C_MoveToNormal final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Subtitle_C_MoveToNormal) == 0x000004, "Wrong alignment on BP_Subtitle_C_MoveToNormal");
static_assert(sizeof(BP_Subtitle_C_MoveToNormal) == 0x000004, "Wrong size on BP_Subtitle_C_MoveToNormal");
static_assert(offsetof(BP_Subtitle_C_MoveToNormal, AnimDuration) == 0x000000, "Member 'BP_Subtitle_C_MoveToNormal::AnimDuration' has a wrong offset!");

}

