#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StrikingRevelationSummonedBook

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_StrikingRevelationSummonedBook.BP_StrikingRevelationSummonedBook_C
// 0x0050 (0x1B10 - 0x1AC0)
class ABP_StrikingRevelationSummonedBook_C final : public AEnemyCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1AC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   TempCube;                                          // 0x1AC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                VFXJank;                                           // 0x1AD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                BeamHitbox;                                        // 0x1AD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Alpha_43DF5BF447E230D1FB38B69A1E133347; // 0x1AE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_43DF5BF447E230D1FB38B69A1E133347; // 0x1AE4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AE5[0x3];                                     // 0x1AE5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x1AE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PoisonColor;                                       // 0x1AF0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BurnColor;                                         // 0x1B00(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_StrikingRevelationSummonedBook(int32 EntryPoint);
	void OnVfxEvent(class FName VfxEventType);
	void BPPostBeginPlay();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_StrikingRevelationSummonedBook_C">();
	}
	static class ABP_StrikingRevelationSummonedBook_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_StrikingRevelationSummonedBook_C>();
	}
};
static_assert(alignof(ABP_StrikingRevelationSummonedBook_C) == 0x000010, "Wrong alignment on ABP_StrikingRevelationSummonedBook_C");
static_assert(sizeof(ABP_StrikingRevelationSummonedBook_C) == 0x001B10, "Wrong size on ABP_StrikingRevelationSummonedBook_C");
static_assert(offsetof(ABP_StrikingRevelationSummonedBook_C, UberGraphFrame) == 0x001AC0, "Member 'ABP_StrikingRevelationSummonedBook_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_StrikingRevelationSummonedBook_C, TempCube) == 0x001AC8, "Member 'ABP_StrikingRevelationSummonedBook_C::TempCube' has a wrong offset!");
static_assert(offsetof(ABP_StrikingRevelationSummonedBook_C, VFXJank) == 0x001AD0, "Member 'ABP_StrikingRevelationSummonedBook_C::VFXJank' has a wrong offset!");
static_assert(offsetof(ABP_StrikingRevelationSummonedBook_C, BeamHitbox) == 0x001AD8, "Member 'ABP_StrikingRevelationSummonedBook_C::BeamHitbox' has a wrong offset!");
static_assert(offsetof(ABP_StrikingRevelationSummonedBook_C, Timeline_0_Alpha_43DF5BF447E230D1FB38B69A1E133347) == 0x001AE0, "Member 'ABP_StrikingRevelationSummonedBook_C::Timeline_0_Alpha_43DF5BF447E230D1FB38B69A1E133347' has a wrong offset!");
static_assert(offsetof(ABP_StrikingRevelationSummonedBook_C, Timeline_0__Direction_43DF5BF447E230D1FB38B69A1E133347) == 0x001AE4, "Member 'ABP_StrikingRevelationSummonedBook_C::Timeline_0__Direction_43DF5BF447E230D1FB38B69A1E133347' has a wrong offset!");
static_assert(offsetof(ABP_StrikingRevelationSummonedBook_C, Timeline_0) == 0x001AE8, "Member 'ABP_StrikingRevelationSummonedBook_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_StrikingRevelationSummonedBook_C, PoisonColor) == 0x001AF0, "Member 'ABP_StrikingRevelationSummonedBook_C::PoisonColor' has a wrong offset!");
static_assert(offsetof(ABP_StrikingRevelationSummonedBook_C, BurnColor) == 0x001B00, "Member 'ABP_StrikingRevelationSummonedBook_C::BurnColor' has a wrong offset!");

}

