#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkillTree_Tree_Warden

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_SkillTree_Tree_Warden.BP_SkillTree_Tree_Warden_C.ExecuteUbergraph_BP_SkillTree_Tree_Warden
// 0x0008 (0x0008 - 0x0000)
struct BP_SkillTree_Tree_Warden_C_ExecuteUbergraph_BP_SkillTree_Tree_Warden final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SkillTree_Tree_Warden_C_ExecuteUbergraph_BP_SkillTree_Tree_Warden) == 0x000004, "Wrong alignment on BP_SkillTree_Tree_Warden_C_ExecuteUbergraph_BP_SkillTree_Tree_Warden");
static_assert(sizeof(BP_SkillTree_Tree_Warden_C_ExecuteUbergraph_BP_SkillTree_Tree_Warden) == 0x000008, "Wrong size on BP_SkillTree_Tree_Warden_C_ExecuteUbergraph_BP_SkillTree_Tree_Warden");
static_assert(offsetof(BP_SkillTree_Tree_Warden_C_ExecuteUbergraph_BP_SkillTree_Tree_Warden, EntryPoint) == 0x000000, "Member 'BP_SkillTree_Tree_Warden_C_ExecuteUbergraph_BP_SkillTree_Tree_Warden::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SkillTree_Tree_Warden_C_ExecuteUbergraph_BP_SkillTree_Tree_Warden, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BP_SkillTree_Tree_Warden_C_ExecuteUbergraph_BP_SkillTree_Tree_Warden::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function BP_SkillTree_Tree_Warden.BP_SkillTree_Tree_Warden_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_SkillTree_Tree_Warden_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SkillTree_Tree_Warden_C_PreConstruct) == 0x000001, "Wrong alignment on BP_SkillTree_Tree_Warden_C_PreConstruct");
static_assert(sizeof(BP_SkillTree_Tree_Warden_C_PreConstruct) == 0x000001, "Wrong size on BP_SkillTree_Tree_Warden_C_PreConstruct");
static_assert(offsetof(BP_SkillTree_Tree_Warden_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_SkillTree_Tree_Warden_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

