#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShieldOfOrderHitVisualEntity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ShieldOfOrderHitVisualEntity.BP_ShieldOfOrderHitVisualEntity_C.ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity
// 0x0168 (0x0168 - 0x0000)
struct BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CustomName;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_PriestLightBarrierPassive_C*        K2Node_DynamicCast_AsBP_Priest_Light_Barrier_Passive; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbsorbDamageAbilityComponent*          CallFunc_GetAbsorbComponent_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName CustomName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue_1;       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastIncomingDamagePoint_ReturnValue;   // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_1;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_2;                          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x00E0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity) == 0x000008, "Wrong alignment on BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity");
static_assert(sizeof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity) == 0x000168, "Wrong size on BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, EntryPoint) == 0x000000, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, CallFunc_BreakVector_X) == 0x000010, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, CallFunc_BreakVector_Y) == 0x000014, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, CallFunc_BreakVector_Z) == 0x000018, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, CallFunc_GetAttachParentActor_ReturnValue) == 0x000020, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, K2Node_CustomEvent_CustomName) == 0x000028, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::K2Node_CustomEvent_CustomName' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, K2Node_DynamicCast_AsCharacter_Base) == 0x000030, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000039, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, CallFunc_GetAbilityController_ReturnValue) == 0x000040, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000048, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, K2Node_DynamicCast_AsBP_Priest_Light_Barrier_Passive) == 0x000050, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::K2Node_DynamicCast_AsBP_Priest_Light_Barrier_Passive' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00005C, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, CallFunc_GetAbsorbComponent_ReturnValue) == 0x000068, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::CallFunc_GetAbsorbComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, CallFunc_GetAttachParentActor_ReturnValue_1) == 0x000080, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::CallFunc_GetAttachParentActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, CallFunc_GetLastIncomingDamagePoint_ReturnValue) == 0x000088, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::CallFunc_GetLastIncomingDamagePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, CallFunc_IsValid_ReturnValue) == 0x000094, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, CallFunc_BreakVector_X_1) == 0x000098, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, CallFunc_BreakVector_Y_1) == 0x00009C, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, CallFunc_BreakVector_Z_1) == 0x0000A0, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000A4, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, CallFunc_IsValid_ReturnValue_1) == 0x0000B0, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, CallFunc_BreakVector_X_2) == 0x0000B4, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, CallFunc_BreakVector_Y_2) == 0x0000B8, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, CallFunc_BreakVector_Z_2) == 0x0000BC, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, CallFunc_BooleanAND_ReturnValue) == 0x0000C0, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, CallFunc_SelectFloat_ReturnValue) == 0x0000C4, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, CallFunc_MakeVector_ReturnValue) == 0x0000C8, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000D4, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0000E0, "Member 'BP_ShieldOfOrderHitVisualEntity_C_ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

// Function BP_ShieldOfOrderHitVisualEntity.BP_ShieldOfOrderHitVisualEntity_C.OnAbilityCustomEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_ShieldOfOrderHitVisualEntity_C_OnAbilityCustomEvent final
{
public:
	class FName                                   CustomName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShieldOfOrderHitVisualEntity_C_OnAbilityCustomEvent) == 0x000004, "Wrong alignment on BP_ShieldOfOrderHitVisualEntity_C_OnAbilityCustomEvent");
static_assert(sizeof(BP_ShieldOfOrderHitVisualEntity_C_OnAbilityCustomEvent) == 0x000008, "Wrong size on BP_ShieldOfOrderHitVisualEntity_C_OnAbilityCustomEvent");
static_assert(offsetof(BP_ShieldOfOrderHitVisualEntity_C_OnAbilityCustomEvent, CustomName) == 0x000000, "Member 'BP_ShieldOfOrderHitVisualEntity_C_OnAbilityCustomEvent::CustomName' has a wrong offset!");

}

