#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SimpleFog_fx

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SimpleFog_fx.BP_SimpleFog_fx_C.SetUpMaterialAdditive
// 0x0030 (0x0030 - 0x0000)
struct BP_SimpleFog_fx_C_SetUpMaterialAdditive final
{
public:
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue;    // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SimpleFog_fx_C_SetUpMaterialAdditive) == 0x000008, "Wrong alignment on BP_SimpleFog_fx_C_SetUpMaterialAdditive");
static_assert(sizeof(BP_SimpleFog_fx_C_SetUpMaterialAdditive) == 0x000030, "Wrong size on BP_SimpleFog_fx_C_SetUpMaterialAdditive");
static_assert(offsetof(BP_SimpleFog_fx_C_SetUpMaterialAdditive, CallFunc_Add_FloatFloat_ReturnValue) == 0x000000, "Member 'BP_SimpleFog_fx_C_SetUpMaterialAdditive::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleFog_fx_C_SetUpMaterialAdditive, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000004, "Member 'BP_SimpleFog_fx_C_SetUpMaterialAdditive::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleFog_fx_C_SetUpMaterialAdditive, CallFunc_Multiply_LinearColorFloat_ReturnValue) == 0x000014, "Member 'BP_SimpleFog_fx_C_SetUpMaterialAdditive::CallFunc_Multiply_LinearColorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleFog_fx_C_SetUpMaterialAdditive, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000028, "Member 'BP_SimpleFog_fx_C_SetUpMaterialAdditive::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_SimpleFog_fx.BP_SimpleFog_fx_C.SetUpMaterialBlend
// 0x0030 (0x0030 - 0x0000)
struct BP_SimpleFog_fx_C_SetUpMaterialBlend final
{
public:
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue;    // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SimpleFog_fx_C_SetUpMaterialBlend) == 0x000008, "Wrong alignment on BP_SimpleFog_fx_C_SetUpMaterialBlend");
static_assert(sizeof(BP_SimpleFog_fx_C_SetUpMaterialBlend) == 0x000030, "Wrong size on BP_SimpleFog_fx_C_SetUpMaterialBlend");
static_assert(offsetof(BP_SimpleFog_fx_C_SetUpMaterialBlend, CallFunc_Add_FloatFloat_ReturnValue) == 0x000000, "Member 'BP_SimpleFog_fx_C_SetUpMaterialBlend::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleFog_fx_C_SetUpMaterialBlend, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000004, "Member 'BP_SimpleFog_fx_C_SetUpMaterialBlend::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleFog_fx_C_SetUpMaterialBlend, CallFunc_Multiply_LinearColorFloat_ReturnValue) == 0x000014, "Member 'BP_SimpleFog_fx_C_SetUpMaterialBlend::CallFunc_Multiply_LinearColorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleFog_fx_C_SetUpMaterialBlend, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000028, "Member 'BP_SimpleFog_fx_C_SetUpMaterialBlend::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

