#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Subtitle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Subtitle.BP_Subtitle_C
// 0x0040 (0x0580 - 0x0540)
class UBP_Subtitle_C final : public USubtitleUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0540(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x0548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x0550(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             DebugLineID;                                       // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SubtitleBox;                                       // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UManRichTextBlock*                      SubtitleText;                                      // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         ShowTextAnimDuration;                              // 0x0578(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Subtitle(int32 EntryPoint);
	void OnMoveToNormal(float AnimDuration);
	void OnMoveToUltrawide(float AnimDuration);
	void OnShowSubtitleText(const class FText& InText, const class FText& InLineIDText);
	void OnHide(float AnimDuration);
	void OnShow(float AnimDuration);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void MoveToUltrawide(float AnimDuration);
	void MoveToNormal(float AnimDuration);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Subtitle_C">();
	}
	static class UBP_Subtitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Subtitle_C>();
	}
};
static_assert(alignof(UBP_Subtitle_C) == 0x000008, "Wrong alignment on UBP_Subtitle_C");
static_assert(sizeof(UBP_Subtitle_C) == 0x000580, "Wrong size on UBP_Subtitle_C");
static_assert(offsetof(UBP_Subtitle_C, UberGraphFrame) == 0x000540, "Member 'UBP_Subtitle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Subtitle_C, FadeOutAnim) == 0x000548, "Member 'UBP_Subtitle_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_Subtitle_C, FadeInAnim) == 0x000550, "Member 'UBP_Subtitle_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_Subtitle_C, DebugLineID) == 0x000558, "Member 'UBP_Subtitle_C::DebugLineID' has a wrong offset!");
static_assert(offsetof(UBP_Subtitle_C, HorizontalBox_0) == 0x000560, "Member 'UBP_Subtitle_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(UBP_Subtitle_C, SubtitleBox) == 0x000568, "Member 'UBP_Subtitle_C::SubtitleBox' has a wrong offset!");
static_assert(offsetof(UBP_Subtitle_C, SubtitleText) == 0x000570, "Member 'UBP_Subtitle_C::SubtitleText' has a wrong offset!");
static_assert(offsetof(UBP_Subtitle_C, ShowTextAnimDuration) == 0x000578, "Member 'UBP_Subtitle_C::ShowTextAnimDuration' has a wrong offset!");

}

