#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SideDoor02

#include "Basic.hpp"

#include "BP_SideDoor_ActorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SideDoor02.BP_SideDoor02_C
// 0x0020 (0x0B00 - 0x0AE0)
class ABP_SideDoor02_C final : public ABP_SideDoor_ActorBase_C
{
public:
	class UAkComponent*                           Ak_0_0;                                            // 0x0AE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_InteractiveDoorFrame;                           // 0x0AE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ClosedCollision;                                   // 0x0AF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_InteractiveDoorFrame1;                          // 0x0AF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SideDoor02_C">();
	}
	static class ABP_SideDoor02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SideDoor02_C>();
	}
};
static_assert(alignof(ABP_SideDoor02_C) == 0x000008, "Wrong alignment on ABP_SideDoor02_C");
static_assert(sizeof(ABP_SideDoor02_C) == 0x000B00, "Wrong size on ABP_SideDoor02_C");
static_assert(offsetof(ABP_SideDoor02_C, Ak_0_0) == 0x000AE0, "Member 'ABP_SideDoor02_C::Ak_0_0' has a wrong offset!");
static_assert(offsetof(ABP_SideDoor02_C, SM_InteractiveDoorFrame) == 0x000AE8, "Member 'ABP_SideDoor02_C::SM_InteractiveDoorFrame' has a wrong offset!");
static_assert(offsetof(ABP_SideDoor02_C, ClosedCollision) == 0x000AF0, "Member 'ABP_SideDoor02_C::ClosedCollision' has a wrong offset!");
static_assert(offsetof(ABP_SideDoor02_C, SM_InteractiveDoorFrame1) == 0x000AF8, "Member 'ABP_SideDoor02_C::SM_InteractiveDoorFrame1' has a wrong offset!");

}

