#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Smash_TerrorWolf_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SmashBase_VisualEntity_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Smash_TerrorWolf_VisualEntity.BP_Smash_TerrorWolf_VisualEntity_C
// 0x0020 (0x03F8 - 0x03D8)
class ABP_Smash_TerrorWolf_VisualEntity_C final : public ABP_SmashBase_VisualEntity_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Smash_TerrorWolf_VisualEntity_C; // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPoseableMeshComponent*                 PoseableMesh;                                      // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_88C2AA36475621B1F5F57D86A055E53D; // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_88C2AA36475621B1F5F57D86A055E53D; // 0x03EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED[0x3];                                      // 0x03ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void VisualEntityConstructionFinished();
	void ExecuteUbergraph_BP_Smash_TerrorWolf_VisualEntity(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Smash_TerrorWolf_VisualEntity_C">();
	}
	static class ABP_Smash_TerrorWolf_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Smash_TerrorWolf_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_Smash_TerrorWolf_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_Smash_TerrorWolf_VisualEntity_C");
static_assert(sizeof(ABP_Smash_TerrorWolf_VisualEntity_C) == 0x0003F8, "Wrong size on ABP_Smash_TerrorWolf_VisualEntity_C");
static_assert(offsetof(ABP_Smash_TerrorWolf_VisualEntity_C, UberGraphFrame_BP_Smash_TerrorWolf_VisualEntity_C) == 0x0003D8, "Member 'ABP_Smash_TerrorWolf_VisualEntity_C::UberGraphFrame_BP_Smash_TerrorWolf_VisualEntity_C' has a wrong offset!");
static_assert(offsetof(ABP_Smash_TerrorWolf_VisualEntity_C, PoseableMesh) == 0x0003E0, "Member 'ABP_Smash_TerrorWolf_VisualEntity_C::PoseableMesh' has a wrong offset!");
static_assert(offsetof(ABP_Smash_TerrorWolf_VisualEntity_C, Timeline_0_NewTrack_0_88C2AA36475621B1F5F57D86A055E53D) == 0x0003E8, "Member 'ABP_Smash_TerrorWolf_VisualEntity_C::Timeline_0_NewTrack_0_88C2AA36475621B1F5F57D86A055E53D' has a wrong offset!");
static_assert(offsetof(ABP_Smash_TerrorWolf_VisualEntity_C, Timeline_0__Direction_88C2AA36475621B1F5F57D86A055E53D) == 0x0003EC, "Member 'ABP_Smash_TerrorWolf_VisualEntity_C::Timeline_0__Direction_88C2AA36475621B1F5F57D86A055E53D' has a wrong offset!");
static_assert(offsetof(ABP_Smash_TerrorWolf_VisualEntity_C, Timeline_0) == 0x0003F0, "Member 'ABP_Smash_TerrorWolf_VisualEntity_C::Timeline_0' has a wrong offset!");

}

