#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkillTree_ClassIcon

#include "Basic.hpp"

#include "man_structs.hpp"
#include "man_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_SkillTree_ClassIcon.BP_SkillTree_ClassIcon_C
// 0x0060 (0x02E0 - 0x0280)
class UBP_SkillTree_ClassIcon_C final : public USkillTreeClassIconUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SelectedAnim;                                      // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                ButtonFrame;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Highlight;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_sel;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_up;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HighlightVFX;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ECharacterClass                               Class_0;                                           // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x02C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_2CA[0x6];                                      // 0x02CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_SkillTree_ClassIcon(int32 EntryPoint);
	void OnUnfocused(bool bAnimate);
	void OnFocused(bool bAnimate);
	void BndEvt__BP_SkillTree_ClassIcon_ButtonFrame_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void SetClass(ECharacterClass InNewClass);
	void ToggleSelected(bool InIsSelected);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SkillTree_ClassIcon_C">();
	}
	static class UBP_SkillTree_ClassIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SkillTree_ClassIcon_C>();
	}
};
static_assert(alignof(UBP_SkillTree_ClassIcon_C) == 0x000008, "Wrong alignment on UBP_SkillTree_ClassIcon_C");
static_assert(sizeof(UBP_SkillTree_ClassIcon_C) == 0x0002E0, "Wrong size on UBP_SkillTree_ClassIcon_C");
static_assert(offsetof(UBP_SkillTree_ClassIcon_C, UberGraphFrame) == 0x000280, "Member 'UBP_SkillTree_ClassIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SkillTree_ClassIcon_C, HoverAnim) == 0x000288, "Member 'UBP_SkillTree_ClassIcon_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UBP_SkillTree_ClassIcon_C, SelectedAnim) == 0x000290, "Member 'UBP_SkillTree_ClassIcon_C::SelectedAnim' has a wrong offset!");
static_assert(offsetof(UBP_SkillTree_ClassIcon_C, ButtonFrame) == 0x000298, "Member 'UBP_SkillTree_ClassIcon_C::ButtonFrame' has a wrong offset!");
static_assert(offsetof(UBP_SkillTree_ClassIcon_C, Frame_Highlight) == 0x0002A0, "Member 'UBP_SkillTree_ClassIcon_C::Frame_Highlight' has a wrong offset!");
static_assert(offsetof(UBP_SkillTree_ClassIcon_C, Frame_sel) == 0x0002A8, "Member 'UBP_SkillTree_ClassIcon_C::Frame_sel' has a wrong offset!");
static_assert(offsetof(UBP_SkillTree_ClassIcon_C, Frame_up) == 0x0002B0, "Member 'UBP_SkillTree_ClassIcon_C::Frame_up' has a wrong offset!");
static_assert(offsetof(UBP_SkillTree_ClassIcon_C, HighlightVFX) == 0x0002B8, "Member 'UBP_SkillTree_ClassIcon_C::HighlightVFX' has a wrong offset!");
static_assert(offsetof(UBP_SkillTree_ClassIcon_C, Icon) == 0x0002C0, "Member 'UBP_SkillTree_ClassIcon_C::Icon' has a wrong offset!");
static_assert(offsetof(UBP_SkillTree_ClassIcon_C, Class_0) == 0x0002C8, "Member 'UBP_SkillTree_ClassIcon_C::Class_0' has a wrong offset!");
static_assert(offsetof(UBP_SkillTree_ClassIcon_C, IsSelected) == 0x0002C9, "Member 'UBP_SkillTree_ClassIcon_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UBP_SkillTree_ClassIcon_C, OnClicked) == 0x0002D0, "Member 'UBP_SkillTree_ClassIcon_C::OnClicked' has a wrong offset!");

}

