#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShieldOfOrderHitVisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ShieldOfOrderHitVisualEntity.BP_ShieldOfOrderHitVisualEntity_C
// 0x0018 (0x0368 - 0x0350)
class ABP_ShieldOfOrderHitVisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      HitVFX;                                            // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbsorbDamageAbilityComponent*          AbsorbComp;                                        // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ShieldOfOrderHitVisualEntity(int32 EntryPoint);
	void OnAbilityCustomEvent(class FName CustomName);
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ShieldOfOrderHitVisualEntity_C">();
	}
	static class ABP_ShieldOfOrderHitVisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ShieldOfOrderHitVisualEntity_C>();
	}
};
static_assert(alignof(ABP_ShieldOfOrderHitVisualEntity_C) == 0x000008, "Wrong alignment on ABP_ShieldOfOrderHitVisualEntity_C");
static_assert(sizeof(ABP_ShieldOfOrderHitVisualEntity_C) == 0x000368, "Wrong size on ABP_ShieldOfOrderHitVisualEntity_C");
static_assert(offsetof(ABP_ShieldOfOrderHitVisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_ShieldOfOrderHitVisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ShieldOfOrderHitVisualEntity_C, HitVFX) == 0x000358, "Member 'ABP_ShieldOfOrderHitVisualEntity_C::HitVFX' has a wrong offset!");
static_assert(offsetof(ABP_ShieldOfOrderHitVisualEntity_C, AbsorbComp) == 0x000360, "Member 'ABP_ShieldOfOrderHitVisualEntity_C::AbsorbComp' has a wrong offset!");

}

