#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TEMP_Dissolve

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TEMP_Dissolve.BP_TEMP_Dissolve_C
// 0x0030 (0x0380 - 0x0350)
class ABP_TEMP_Dissolve_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkelMesh;                                          // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEnemyCharacter*                        EnemyChar;                                         // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              CharacterDissolved;                                // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_TEMP_Dissolve(int32 EntryPoint);
	void ReceiveDestroyed();
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TEMP_Dissolve_C">();
	}
	static class ABP_TEMP_Dissolve_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TEMP_Dissolve_C>();
	}
};
static_assert(alignof(ABP_TEMP_Dissolve_C) == 0x000008, "Wrong alignment on ABP_TEMP_Dissolve_C");
static_assert(sizeof(ABP_TEMP_Dissolve_C) == 0x000380, "Wrong size on ABP_TEMP_Dissolve_C");
static_assert(offsetof(ABP_TEMP_Dissolve_C, UberGraphFrame) == 0x000350, "Member 'ABP_TEMP_Dissolve_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TEMP_Dissolve_C, Niagara) == 0x000358, "Member 'ABP_TEMP_Dissolve_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_TEMP_Dissolve_C, SkelMesh) == 0x000360, "Member 'ABP_TEMP_Dissolve_C::SkelMesh' has a wrong offset!");
static_assert(offsetof(ABP_TEMP_Dissolve_C, EnemyChar) == 0x000368, "Member 'ABP_TEMP_Dissolve_C::EnemyChar' has a wrong offset!");
static_assert(offsetof(ABP_TEMP_Dissolve_C, CharacterDissolved) == 0x000370, "Member 'ABP_TEMP_Dissolve_C::CharacterDissolved' has a wrong offset!");

}

