#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Tab_Button_New

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_Tab_Button_New.BP_Tab_Button_New_C.ExecuteUbergraph_BP_Tab_Button_New
// 0x00A0 (0x00A0 - 0x0000)
struct BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x000C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsActive;                          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default_1;                           // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInEnabled;                           // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Text;                                 // 0x0050(0x0018)(ConstParm)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInVisible;                           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bAnimate_1;                           // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bAnimate;                             // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetSeedFromCaption_OutSeed1;              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSeedFromCaption_OutSeed2;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New) == 0x000008, "Wrong alignment on BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New");
static_assert(sizeof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New) == 0x0000A0, "Wrong size on BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, EntryPoint) == 0x000000, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, Temp_bool_Variable) == 0x000004, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, Temp_byte_Variable) == 0x000005, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, Temp_byte_Variable_1) == 0x000006, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, Temp_bool_Variable_1) == 0x000007, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, Temp_byte_Variable_2) == 0x000008, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, Temp_byte_Variable_3) == 0x000009, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, K2Node_Event_IsDesignTime) == 0x00000A, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, K2Node_Event_MyGeometry) == 0x00000C, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, K2Node_Event_InDeltaTime) == 0x000044, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, K2Node_Event_bInIsActive) == 0x000048, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::K2Node_Event_bInIsActive' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, K2Node_Select_Default) == 0x000049, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, K2Node_Select_Default_1) == 0x00004A, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, K2Node_Event_bInEnabled) == 0x00004B, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::K2Node_Event_bInEnabled' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, K2Node_Event_Text) == 0x000050, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::K2Node_Event_Text' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, CallFunc_GetEndTime_ReturnValue) == 0x000068, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, CallFunc_PlayAnimation_ReturnValue) == 0x000070, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, K2Node_Event_bInVisible) == 0x000078, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::K2Node_Event_bInVisible' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, K2Node_Event_bAnimate_1) == 0x000079, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::K2Node_Event_bAnimate_1' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, CallFunc_Not_PreBool_ReturnValue) == 0x00007A, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, K2Node_Event_bAnimate) == 0x00007B, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::K2Node_Event_bAnimate' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, CallFunc_GetSeedFromCaption_OutSeed1) == 0x00007C, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::CallFunc_GetSeedFromCaption_OutSeed1' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, CallFunc_GetSeedFromCaption_OutSeed2) == 0x000080, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::CallFunc_GetSeedFromCaption_OutSeed2' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000088, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, CallFunc_GetRenderOpacity_ReturnValue) == 0x000090, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000094, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New, CallFunc_PlayAnimation_ReturnValue_1) == 0x000098, "Member 'BP_Tab_Button_New_C_ExecuteUbergraph_BP_Tab_Button_New::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function BP_Tab_Button_New.BP_Tab_Button_New_C.OnUnfocused
// 0x0001 (0x0001 - 0x0000)
struct BP_Tab_Button_New_C_OnUnfocused final
{
public:
	bool                                          bAnimate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Tab_Button_New_C_OnUnfocused) == 0x000001, "Wrong alignment on BP_Tab_Button_New_C_OnUnfocused");
static_assert(sizeof(BP_Tab_Button_New_C_OnUnfocused) == 0x000001, "Wrong size on BP_Tab_Button_New_C_OnUnfocused");
static_assert(offsetof(BP_Tab_Button_New_C_OnUnfocused, bAnimate) == 0x000000, "Member 'BP_Tab_Button_New_C_OnUnfocused::bAnimate' has a wrong offset!");

// Function BP_Tab_Button_New.BP_Tab_Button_New_C.OnFocused
// 0x0001 (0x0001 - 0x0000)
struct BP_Tab_Button_New_C_OnFocused final
{
public:
	bool                                          bAnimate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Tab_Button_New_C_OnFocused) == 0x000001, "Wrong alignment on BP_Tab_Button_New_C_OnFocused");
static_assert(sizeof(BP_Tab_Button_New_C_OnFocused) == 0x000001, "Wrong size on BP_Tab_Button_New_C_OnFocused");
static_assert(offsetof(BP_Tab_Button_New_C_OnFocused, bAnimate) == 0x000000, "Member 'BP_Tab_Button_New_C_OnFocused::bAnimate' has a wrong offset!");

// Function BP_Tab_Button_New.BP_Tab_Button_New_C.OnToggleNewItemWarning
// 0x0001 (0x0001 - 0x0000)
struct BP_Tab_Button_New_C_OnToggleNewItemWarning final
{
public:
	bool                                          bInVisible;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Tab_Button_New_C_OnToggleNewItemWarning) == 0x000001, "Wrong alignment on BP_Tab_Button_New_C_OnToggleNewItemWarning");
static_assert(sizeof(BP_Tab_Button_New_C_OnToggleNewItemWarning) == 0x000001, "Wrong size on BP_Tab_Button_New_C_OnToggleNewItemWarning");
static_assert(offsetof(BP_Tab_Button_New_C_OnToggleNewItemWarning, bInVisible) == 0x000000, "Member 'BP_Tab_Button_New_C_OnToggleNewItemWarning::bInVisible' has a wrong offset!");

// Function BP_Tab_Button_New.BP_Tab_Button_New_C.OnSetText
// 0x0018 (0x0018 - 0x0000)
struct BP_Tab_Button_New_C_OnSetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Tab_Button_New_C_OnSetText) == 0x000008, "Wrong alignment on BP_Tab_Button_New_C_OnSetText");
static_assert(sizeof(BP_Tab_Button_New_C_OnSetText) == 0x000018, "Wrong size on BP_Tab_Button_New_C_OnSetText");
static_assert(offsetof(BP_Tab_Button_New_C_OnSetText, Text) == 0x000000, "Member 'BP_Tab_Button_New_C_OnSetText::Text' has a wrong offset!");

// Function BP_Tab_Button_New.BP_Tab_Button_New_C.OnSetEnabled
// 0x0001 (0x0001 - 0x0000)
struct BP_Tab_Button_New_C_OnSetEnabled final
{
public:
	bool                                          bInEnabled;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Tab_Button_New_C_OnSetEnabled) == 0x000001, "Wrong alignment on BP_Tab_Button_New_C_OnSetEnabled");
static_assert(sizeof(BP_Tab_Button_New_C_OnSetEnabled) == 0x000001, "Wrong size on BP_Tab_Button_New_C_OnSetEnabled");
static_assert(offsetof(BP_Tab_Button_New_C_OnSetEnabled, bInEnabled) == 0x000000, "Member 'BP_Tab_Button_New_C_OnSetEnabled::bInEnabled' has a wrong offset!");

// Function BP_Tab_Button_New.BP_Tab_Button_New_C.OnSetActive
// 0x0001 (0x0001 - 0x0000)
struct BP_Tab_Button_New_C_OnSetActive final
{
public:
	bool                                          bInIsActive;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Tab_Button_New_C_OnSetActive) == 0x000001, "Wrong alignment on BP_Tab_Button_New_C_OnSetActive");
static_assert(sizeof(BP_Tab_Button_New_C_OnSetActive) == 0x000001, "Wrong size on BP_Tab_Button_New_C_OnSetActive");
static_assert(offsetof(BP_Tab_Button_New_C_OnSetActive, bInIsActive) == 0x000000, "Member 'BP_Tab_Button_New_C_OnSetActive::bInIsActive' has a wrong offset!");

// Function BP_Tab_Button_New.BP_Tab_Button_New_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_Tab_Button_New_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tab_Button_New_C_Tick) == 0x000004, "Wrong alignment on BP_Tab_Button_New_C_Tick");
static_assert(sizeof(BP_Tab_Button_New_C_Tick) == 0x00003C, "Wrong size on BP_Tab_Button_New_C_Tick");
static_assert(offsetof(BP_Tab_Button_New_C_Tick, MyGeometry) == 0x000000, "Member 'BP_Tab_Button_New_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_Tab_Button_New_C_Tick::InDeltaTime' has a wrong offset!");

// Function BP_Tab_Button_New.BP_Tab_Button_New_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_Tab_Button_New_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Tab_Button_New_C_PreConstruct) == 0x000001, "Wrong alignment on BP_Tab_Button_New_C_PreConstruct");
static_assert(sizeof(BP_Tab_Button_New_C_PreConstruct) == 0x000001, "Wrong size on BP_Tab_Button_New_C_PreConstruct");
static_assert(offsetof(BP_Tab_Button_New_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_Tab_Button_New_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_Tab_Button_New.BP_Tab_Button_New_C.SetCaption
// 0x0018 (0x0018 - 0x0000)
struct BP_Tab_Button_New_C_SetCaption final
{
public:
	class FText                                   InCaptionText;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_Tab_Button_New_C_SetCaption) == 0x000008, "Wrong alignment on BP_Tab_Button_New_C_SetCaption");
static_assert(sizeof(BP_Tab_Button_New_C_SetCaption) == 0x000018, "Wrong size on BP_Tab_Button_New_C_SetCaption");
static_assert(offsetof(BP_Tab_Button_New_C_SetCaption, InCaptionText) == 0x000000, "Member 'BP_Tab_Button_New_C_SetCaption::InCaptionText' has a wrong offset!");

// Function BP_Tab_Button_New.BP_Tab_Button_New_C.SetEnabled
// 0x0070 (0x0070 - 0x0000)
struct BP_Tab_Button_New_C_SetEnabled final
{
public:
	bool                                          InIsEnabled;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0048(0x0028)()
};
static_assert(alignof(BP_Tab_Button_New_C_SetEnabled) == 0x000008, "Wrong alignment on BP_Tab_Button_New_C_SetEnabled");
static_assert(sizeof(BP_Tab_Button_New_C_SetEnabled) == 0x000070, "Wrong size on BP_Tab_Button_New_C_SetEnabled");
static_assert(offsetof(BP_Tab_Button_New_C_SetEnabled, InIsEnabled) == 0x000000, "Member 'BP_Tab_Button_New_C_SetEnabled::InIsEnabled' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_SetEnabled, Temp_bool_Variable) == 0x000001, "Member 'BP_Tab_Button_New_C_SetEnabled::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_SetEnabled, Temp_float_Variable) == 0x000004, "Member 'BP_Tab_Button_New_C_SetEnabled::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_SetEnabled, Temp_float_Variable_1) == 0x000008, "Member 'BP_Tab_Button_New_C_SetEnabled::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_SetEnabled, Temp_bool_Variable_1) == 0x00000C, "Member 'BP_Tab_Button_New_C_SetEnabled::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_SetEnabled, Temp_struct_Variable) == 0x000010, "Member 'BP_Tab_Button_New_C_SetEnabled::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_SetEnabled, Temp_struct_Variable_1) == 0x000020, "Member 'BP_Tab_Button_New_C_SetEnabled::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_SetEnabled, K2Node_Select_Default) == 0x000030, "Member 'BP_Tab_Button_New_C_SetEnabled::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_SetEnabled, K2Node_Select_Default_1) == 0x000040, "Member 'BP_Tab_Button_New_C_SetEnabled::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_SetEnabled, K2Node_MakeStruct_SlateColor) == 0x000048, "Member 'BP_Tab_Button_New_C_SetEnabled::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function BP_Tab_Button_New.BP_Tab_Button_New_C.ToggleNewItemWarning
// 0x0020 (0x0020 - 0x0000)
struct BP_Tab_Button_New_C_ToggleNewItemWarning final
{
public:
	bool                                          InVisible;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InAnimate;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tab_Button_New_C_ToggleNewItemWarning) == 0x000008, "Wrong alignment on BP_Tab_Button_New_C_ToggleNewItemWarning");
static_assert(sizeof(BP_Tab_Button_New_C_ToggleNewItemWarning) == 0x000020, "Wrong size on BP_Tab_Button_New_C_ToggleNewItemWarning");
static_assert(offsetof(BP_Tab_Button_New_C_ToggleNewItemWarning, InVisible) == 0x000000, "Member 'BP_Tab_Button_New_C_ToggleNewItemWarning::InVisible' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ToggleNewItemWarning, InAnimate) == 0x000001, "Member 'BP_Tab_Button_New_C_ToggleNewItemWarning::InAnimate' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ToggleNewItemWarning, Temp_bool_Variable) == 0x000002, "Member 'BP_Tab_Button_New_C_ToggleNewItemWarning::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ToggleNewItemWarning, Temp_float_Variable) == 0x000004, "Member 'BP_Tab_Button_New_C_ToggleNewItemWarning::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ToggleNewItemWarning, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'BP_Tab_Button_New_C_ToggleNewItemWarning::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ToggleNewItemWarning, CallFunc_GetEndTime_ReturnValue) == 0x000010, "Member 'BP_Tab_Button_New_C_ToggleNewItemWarning::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ToggleNewItemWarning, K2Node_Select_Default) == 0x000014, "Member 'BP_Tab_Button_New_C_ToggleNewItemWarning::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_ToggleNewItemWarning, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'BP_Tab_Button_New_C_ToggleNewItemWarning::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BP_Tab_Button_New.BP_Tab_Button_New_C.GetSeedFromCaption
// 0x0058 (0x0058 - 0x0000)
struct BP_Tab_Button_New_C_GetSeedFromCaption final
{
public:
	float                                         OutSeed1;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutSeed2;                                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Seed2;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Seed1;                                             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeToRange_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeToRange_ReturnValue_1;           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterAsNumber_ReturnValue;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterAsNumber_ReturnValue_1;       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_2;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_3;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tab_Button_New_C_GetSeedFromCaption) == 0x000008, "Wrong alignment on BP_Tab_Button_New_C_GetSeedFromCaption");
static_assert(sizeof(BP_Tab_Button_New_C_GetSeedFromCaption) == 0x000058, "Wrong size on BP_Tab_Button_New_C_GetSeedFromCaption");
static_assert(offsetof(BP_Tab_Button_New_C_GetSeedFromCaption, OutSeed1) == 0x000000, "Member 'BP_Tab_Button_New_C_GetSeedFromCaption::OutSeed1' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_GetSeedFromCaption, OutSeed2) == 0x000004, "Member 'BP_Tab_Button_New_C_GetSeedFromCaption::OutSeed2' has a wrong offset!");
static_assert(offsetof(BP_Tab_Button_New_C_GetSeedFromCaption, Seed2) == 0x000008, "Member 'BP_Tab_Button_New_C_GetSeedFromCaption::Seed2' has a wrong offset!");
