#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ThrowingKnife_Projectile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ThrowingKnife_Projectile.BP_ThrowingKnife_Projectile_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ThrowingKnife_Projectile_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ThrowingKnife_Projectile_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ThrowingKnife_Projectile_C_ReceiveTick");
static_assert(sizeof(BP_ThrowingKnife_Projectile_C_ReceiveTick) == 0x000004, "Wrong size on BP_ThrowingKnife_Projectile_C_ReceiveTick");
static_assert(offsetof(BP_ThrowingKnife_Projectile_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ThrowingKnife_Projectile_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ThrowingKnife_Projectile.BP_ThrowingKnife_Projectile_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_ThrowingKnife_Projectile_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ThrowingKnife_Projectile_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_ThrowingKnife_Projectile_C_ReceiveEndPlay");
static_assert(sizeof(BP_ThrowingKnife_Projectile_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_ThrowingKnife_Projectile_C_ReceiveEndPlay");
static_assert(offsetof(BP_ThrowingKnife_Projectile_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_ThrowingKnife_Projectile_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_ThrowingKnife_Projectile.BP_ThrowingKnife_Projectile_C.ExecuteUbergraph_BP_ThrowingKnife_Projectile
// 0x0228 (0x0228 - 0x0000)
struct BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0050(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x00D8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x0198(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile) == 0x000008, "Wrong alignment on BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile");
static_assert(sizeof(BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile) == 0x000228, "Wrong size on BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile");
static_assert(offsetof(BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile, EntryPoint) == 0x000000, "Member 'BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile, Temp_delegate_Variable) == 0x000004, "Member 'BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000014, "Member 'BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile, CallFunc_PostEventAtLocation_ReturnValue) == 0x000020, "Member 'BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000028, "Member 'BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00002C, "Member 'BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile, CallFunc_GetManGameMode_ReturnValue) == 0x000030, "Member 'BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile::CallFunc_GetManGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000048, "Member 'BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000050, "Member 'BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0000D8, "Member 'BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000160, "Member 'BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00016C, "Member 'BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile, CallFunc_BreakVector_X) == 0x000178, "Member 'BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile, CallFunc_BreakVector_Y) == 0x00017C, "Member 'BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile, CallFunc_BreakVector_Z) == 0x000180, "Member 'BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile, CallFunc_Less_FloatFloat_ReturnValue) == 0x000184, "Member 'BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile, CallFunc_SelectFloat_ReturnValue) == 0x000188, "Member 'BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile, CallFunc_MakeRotator_ReturnValue) == 0x00018C, "Member 'BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile, CallFunc_K2_AddRelativeRotation_SweepHitResult) == 0x000198, "Member 'BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile::CallFunc_K2_AddRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile, CallFunc_PostAkEvent_ReturnValue) == 0x000220, "Member 'BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile, K2Node_Event_EndPlayReason) == 0x000224, "Member 'BP_ThrowingKnife_Projectile_C_ExecuteUbergraph_BP_ThrowingKnife_Projectile::K2Node_Event_EndPlayReason' has a wrong offset!");

}

