#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ToggleButton_Material

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_ToggleButton_Material.BP_ToggleButton_Material_C.PlayClickedAnim
// 0x0008 (0x0008 - 0x0000)
struct BP_ToggleButton_Material_C_PlayClickedAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ToggleButton_Material_C_PlayClickedAnim) == 0x000008, "Wrong alignment on BP_ToggleButton_Material_C_PlayClickedAnim");
static_assert(sizeof(BP_ToggleButton_Material_C_PlayClickedAnim) == 0x000008, "Wrong size on BP_ToggleButton_Material_C_PlayClickedAnim");
static_assert(offsetof(BP_ToggleButton_Material_C_PlayClickedAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'BP_ToggleButton_Material_C_PlayClickedAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BP_ToggleButton_Material.BP_ToggleButton_Material_C.ToggleEnabled
// 0x00A8 (0x00A8 - 0x0000)
struct BP_ToggleButton_Material_C_ToggleEnabled final
{
public:
	bool                                          InIsEnabled;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_3;                           // 0x006C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0080(0x0028)()
};
static_assert(alignof(BP_ToggleButton_Material_C_ToggleEnabled) == 0x000008, "Wrong alignment on BP_ToggleButton_Material_C_ToggleEnabled");
static_assert(sizeof(BP_ToggleButton_Material_C_ToggleEnabled) == 0x0000A8, "Wrong size on BP_ToggleButton_Material_C_ToggleEnabled");
static_assert(offsetof(BP_ToggleButton_Material_C_ToggleEnabled, InIsEnabled) == 0x000000, "Member 'BP_ToggleButton_Material_C_ToggleEnabled::InIsEnabled' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ToggleEnabled, Temp_bool_Variable) == 0x000001, "Member 'BP_ToggleButton_Material_C_ToggleEnabled::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ToggleEnabled, Temp_struct_Variable) == 0x000004, "Member 'BP_ToggleButton_Material_C_ToggleEnabled::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ToggleEnabled, Temp_struct_Variable_1) == 0x000014, "Member 'BP_ToggleButton_Material_C_ToggleEnabled::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ToggleEnabled, Temp_bool_Variable_1) == 0x000024, "Member 'BP_ToggleButton_Material_C_ToggleEnabled::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ToggleEnabled, Temp_float_Variable) == 0x000028, "Member 'BP_ToggleButton_Material_C_ToggleEnabled::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ToggleEnabled, Temp_float_Variable_1) == 0x00002C, "Member 'BP_ToggleButton_Material_C_ToggleEnabled::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ToggleEnabled, Temp_bool_Variable_2) == 0x000030, "Member 'BP_ToggleButton_Material_C_ToggleEnabled::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ToggleEnabled, Temp_struct_Variable_2) == 0x000034, "Member 'BP_ToggleButton_Material_C_ToggleEnabled::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ToggleEnabled, Temp_struct_Variable_3) == 0x000044, "Member 'BP_ToggleButton_Material_C_ToggleEnabled::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ToggleEnabled, Temp_bool_Variable_3) == 0x000054, "Member 'BP_ToggleButton_Material_C_ToggleEnabled::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ToggleEnabled, Temp_byte_Variable) == 0x000055, "Member 'BP_ToggleButton_Material_C_ToggleEnabled::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ToggleEnabled, Temp_byte_Variable_1) == 0x000056, "Member 'BP_ToggleButton_Material_C_ToggleEnabled::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ToggleEnabled, K2Node_Select_Default) == 0x000057, "Member 'BP_ToggleButton_Material_C_ToggleEnabled::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ToggleEnabled, K2Node_Select_Default_1) == 0x000058, "Member 'BP_ToggleButton_Material_C_ToggleEnabled::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ToggleEnabled, K2Node_Select_Default_2) == 0x000068, "Member 'BP_ToggleButton_Material_C_ToggleEnabled::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ToggleEnabled, K2Node_Select_Default_3) == 0x00006C, "Member 'BP_ToggleButton_Material_C_ToggleEnabled::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ToggleEnabled, K2Node_MakeStruct_SlateColor) == 0x000080, "Member 'BP_ToggleButton_Material_C_ToggleEnabled::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function BP_ToggleButton_Material.BP_ToggleButton_Material_C.ToggleSelected
// 0x0010 (0x0010 - 0x0000)
struct BP_ToggleButton_Material_C_ToggleSelected final
{
public:
	bool                                          InIsSelected;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ToggleButton_Material_C_ToggleSelected) == 0x000008, "Wrong alignment on BP_ToggleButton_Material_C_ToggleSelected");
static_assert(sizeof(BP_ToggleButton_Material_C_ToggleSelected) == 0x000010, "Wrong size on BP_ToggleButton_Material_C_ToggleSelected");
static_assert(offsetof(BP_ToggleButton_Material_C_ToggleSelected, InIsSelected) == 0x000000, "Member 'BP_ToggleButton_Material_C_ToggleSelected::InIsSelected' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ToggleSelected, Temp_bool_Variable) == 0x000001, "Member 'BP_ToggleButton_Material_C_ToggleSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ToggleSelected, Temp_byte_Variable) == 0x000002, "Member 'BP_ToggleButton_Material_C_ToggleSelected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ToggleSelected, Temp_byte_Variable_1) == 0x000003, "Member 'BP_ToggleButton_Material_C_ToggleSelected::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ToggleSelected, K2Node_Select_Default) == 0x000004, "Member 'BP_ToggleButton_Material_C_ToggleSelected::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ToggleSelected, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000005, "Member 'BP_ToggleButton_Material_C_ToggleSelected::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ToggleSelected, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'BP_ToggleButton_Material_C_ToggleSelected::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BP_ToggleButton_Material.BP_ToggleButton_Material_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct BP_ToggleButton_Material_C_SetText final
{
public:
	class FText                                   Caption;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_ToggleButton_Material_C_SetText) == 0x000008, "Wrong alignment on BP_ToggleButton_Material_C_SetText");
static_assert(sizeof(BP_ToggleButton_Material_C_SetText) == 0x000018, "Wrong size on BP_ToggleButton_Material_C_SetText");
static_assert(offsetof(BP_ToggleButton_Material_C_SetText, Caption) == 0x000000, "Member 'BP_ToggleButton_Material_C_SetText::Caption' has a wrong offset!");

// Function BP_ToggleButton_Material.BP_ToggleButton_Material_C.Setup Interact
// 0x0070 (0x0070 - 0x0000)
struct BP_ToggleButton_Material_C_Setup_Interact final
{
public:
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm)
	TArray<class UTextBlock*>                     CallFunc_GetHotkeyTextUserWidgets_ReturnValue;     // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UBorder*>                        CallFunc_GetHotkeyTextBorderUserWidgets_ReturnValue; // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UImage*>                         CallFunc_GetHotkeyIconUserWidgets_ReturnValue;     // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UTexture2D*>                     CallFunc_GetGamepadHotkeyImages_ReturnValue;       // 0x0040(0x0010)(ReferenceParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ToggleButton_Material_C_Setup_Interact) == 0x000008, "Wrong alignment on BP_ToggleButton_Material_C_Setup_Interact");
static_assert(sizeof(BP_ToggleButton_Material_C_Setup_Interact) == 0x000070, "Wrong size on BP_ToggleButton_Material_C_Setup_Interact");
static_assert(offsetof(BP_ToggleButton_Material_C_Setup_Interact, K2Node_MakeArray_Array) == 0x000000, "Member 'BP_ToggleButton_Material_C_Setup_Interact::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_Setup_Interact, CallFunc_GetHotkeyTextUserWidgets_ReturnValue) == 0x000010, "Member 'BP_ToggleButton_Material_C_Setup_Interact::CallFunc_GetHotkeyTextUserWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_Setup_Interact, CallFunc_GetHotkeyTextBorderUserWidgets_ReturnValue) == 0x000020, "Member 'BP_ToggleButton_Material_C_Setup_Interact::CallFunc_GetHotkeyTextBorderUserWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_Setup_Interact, CallFunc_GetHotkeyIconUserWidgets_ReturnValue) == 0x000030, "Member 'BP_ToggleButton_Material_C_Setup_Interact::CallFunc_GetHotkeyIconUserWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_Setup_Interact, CallFunc_GetGamepadHotkeyImages_ReturnValue) == 0x000040, "Member 'BP_ToggleButton_Material_C_Setup_Interact::CallFunc_GetGamepadHotkeyImages_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_Setup_Interact, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000050, "Member 'BP_ToggleButton_Material_C_Setup_Interact::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_Setup_Interact, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000058, "Member 'BP_ToggleButton_Material_C_Setup_Interact::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_Setup_Interact, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000060, "Member 'BP_ToggleButton_Material_C_Setup_Interact::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_Setup_Interact, CallFunc_GetDynamicMaterial_ReturnValue_3) == 0x000068, "Member 'BP_ToggleButton_Material_C_Setup_Interact::CallFunc_GetDynamicMaterial_ReturnValue_3' has a wrong offset!");

// Function BP_ToggleButton_Material.BP_ToggleButton_Material_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_ToggleButton_Material_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ToggleButton_Material_C_PreConstruct) == 0x000001, "Wrong alignment on BP_ToggleButton_Material_C_PreConstruct");
static_assert(sizeof(BP_ToggleButton_Material_C_PreConstruct) == 0x000001, "Wrong size on BP_ToggleButton_Material_C_PreConstruct");
static_assert(offsetof(BP_ToggleButton_Material_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_ToggleButton_Material_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_ToggleButton_Material.BP_ToggleButton_Material_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_ToggleButton_Material_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ToggleButton_Material_C_Tick) == 0x000004, "Wrong alignment on BP_ToggleButton_Material_C_Tick");
static_assert(sizeof(BP_ToggleButton_Material_C_Tick) == 0x00003C, "Wrong size on BP_ToggleButton_Material_C_Tick");
static_assert(offsetof(BP_ToggleButton_Material_C_Tick, MyGeometry) == 0x000000, "Member 'BP_ToggleButton_Material_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_ToggleButton_Material_C_Tick::InDeltaTime' has a wrong offset!");

// Function BP_ToggleButton_Material.BP_ToggleButton_Material_C.OnSetHotkeyImages
// 0x0010 (0x0010 - 0x0000)
struct BP_ToggleButton_Material_C_OnSetHotkeyImages final
{
public:
	TArray<class UTexture2D*>                     HotkeyImages;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_ToggleButton_Material_C_OnSetHotkeyImages) == 0x000008, "Wrong alignment on BP_ToggleButton_Material_C_OnSetHotkeyImages");
static_assert(sizeof(BP_ToggleButton_Material_C_OnSetHotkeyImages) == 0x000010, "Wrong size on BP_ToggleButton_Material_C_OnSetHotkeyImages");
static_assert(offsetof(BP_ToggleButton_Material_C_OnSetHotkeyImages, HotkeyImages) == 0x000000, "Member 'BP_ToggleButton_Material_C_OnSetHotkeyImages::HotkeyImages' has a wrong offset!");

// Function BP_ToggleButton_Material.BP_ToggleButton_Material_C.OnSetHotkeyText
// 0x0010 (0x0010 - 0x0000)
struct BP_ToggleButton_Material_C_OnSetHotkeyText final
{
public:
	TArray<class FText>                           HotkeyTexts;                                       // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_ToggleButton_Material_C_OnSetHotkeyText) == 0x000008, "Wrong alignment on BP_ToggleButton_Material_C_OnSetHotkeyText");
static_assert(sizeof(BP_ToggleButton_Material_C_OnSetHotkeyText) == 0x000010, "Wrong size on BP_ToggleButton_Material_C_OnSetHotkeyText");
static_assert(offsetof(BP_ToggleButton_Material_C_OnSetHotkeyText, HotkeyTexts) == 0x000000, "Member 'BP_ToggleButton_Material_C_OnSetHotkeyText::HotkeyTexts' has a wrong offset!");

// Function BP_ToggleButton_Material.BP_ToggleButton_Material_C.ExecuteUbergraph_BP_ToggleButton_Material
// 0x00C0 (0x00C0 - 0x0000)
struct BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     K2Node_Event_HotkeyImages;                         // 0x0068(0x0010)(ConstParm, ReferenceParm)
	TArray<class FText>                           K2Node_Event_HotkeyTexts;                          // 0x0078(0x0010)(ConstParm, ReferenceParm)
	TArray<class UImage*>                         CallFunc_GetHotkeyIconUserWidgets_ReturnValue;     // 0x0088(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UBorder*>                        CallFunc_GetHotkeyTextBorderUserWidgets_ReturnValue; // 0x0098(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UTextBlock*>                     CallFunc_GetHotkeyTextUserWidgets_ReturnValue;     // 0x00A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material) == 0x000008, "Wrong alignment on BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material");
static_assert(sizeof(BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material) == 0x0000C0, "Wrong size on BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material");
static_assert(offsetof(BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material, EntryPoint) == 0x000000, "Member 'BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material, K2Node_Event_MyGeometry) == 0x000008, "Member 'BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material, K2Node_Event_InDeltaTime) == 0x000040, "Member 'BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material, CallFunc_PlayAnimation_ReturnValue) == 0x000048, "Member 'BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material, CallFunc_PlayAnimation_ReturnValue_1) == 0x000050, "Member 'BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000058, "Member 'BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000060, "Member 'BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material, K2Node_Event_HotkeyImages) == 0x000068, "Member 'BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material::K2Node_Event_HotkeyImages' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material, K2Node_Event_HotkeyTexts) == 0x000078, "Member 'BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material::K2Node_Event_HotkeyTexts' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material, CallFunc_GetHotkeyIconUserWidgets_ReturnValue) == 0x000088, "Member 'BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material::CallFunc_GetHotkeyIconUserWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material, CallFunc_GetHotkeyTextBorderUserWidgets_ReturnValue) == 0x000098, "Member 'BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material::CallFunc_GetHotkeyTextBorderUserWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material, CallFunc_GetHotkeyTextUserWidgets_ReturnValue) == 0x0000A8, "Member 'BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material::CallFunc_GetHotkeyTextUserWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000B8, "Member 'BP_ToggleButton_Material_C_ExecuteUbergraph_BP_ToggleButton_Material::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

}

