#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TailorAndHorseNPC

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_TailorAndHorseNPC.BP_TailorAndHorseNPC_C.ExecuteUbergraph_BP_TailorAndHorseNPC
// 0x0060 (0x0060 - 0x0000)
struct BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInCaravan_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMandragoraGameMode*                    CallFunc_GetGameMode_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelVisualVolume*                     K2Node_CustomEvent_Volume;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_TailorAndHorse_Anim_C*              K2Node_DynamicCast_AsBP_Tailor_and_Horse_Anim;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_NPCHorseTailor_Anim_C*              K2Node_DynamicCast_AsBP_NPCHorse_Tailor_Anim;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ALevelVisualVolume* Volume)> K2Node_CreateDelegate_OutputDelegate;              // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC) == 0x000008, "Wrong alignment on BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC");
static_assert(sizeof(BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC) == 0x000060, "Wrong size on BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC");
static_assert(offsetof(BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC, EntryPoint) == 0x000000, "Member 'BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC, CallFunc_IsInCaravan_ReturnValue) == 0x000004, "Member 'BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC::CallFunc_IsInCaravan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC, CallFunc_GetGameMode_ReturnValue) == 0x000008, "Member 'BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC, K2Node_CustomEvent_Volume) == 0x000010, "Member 'BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC::K2Node_CustomEvent_Volume' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC, CallFunc_GetAnimInstance_ReturnValue) == 0x000018, "Member 'BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000020, "Member 'BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC, K2Node_DynamicCast_AsBP_Tailor_and_Horse_Anim) == 0x000028, "Member 'BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC::K2Node_DynamicCast_AsBP_Tailor_and_Horse_Anim' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000034, "Member 'BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000038, "Member 'BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC, K2Node_DynamicCast_AsBP_NPCHorse_Tailor_Anim) == 0x000040, "Member 'BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC::K2Node_DynamicCast_AsBP_NPCHorse_Tailor_Anim' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC, K2Node_CreateDelegate_OutputDelegate) == 0x00004C, "Member 'BP_TailorAndHorseNPC_C_ExecuteUbergraph_BP_TailorAndHorseNPC::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_TailorAndHorseNPC.BP_TailorAndHorseNPC_C.VisualVolumeEnter
// 0x0008 (0x0008 - 0x0000)
struct BP_TailorAndHorseNPC_C_VisualVolumeEnter final
{
public:
	class ALevelVisualVolume*                     Volume;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TailorAndHorseNPC_C_VisualVolumeEnter) == 0x000008, "Wrong alignment on BP_TailorAndHorseNPC_C_VisualVolumeEnter");
static_assert(sizeof(BP_TailorAndHorseNPC_C_VisualVolumeEnter) == 0x000008, "Wrong size on BP_TailorAndHorseNPC_C_VisualVolumeEnter");
static_assert(offsetof(BP_TailorAndHorseNPC_C_VisualVolumeEnter, Volume) == 0x000000, "Member 'BP_TailorAndHorseNPC_C_VisualVolumeEnter::Volume' has a wrong offset!");

}

