#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TerrorWolf_Anim

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_TerrorWolf_Anim.BP_TerrorWolf_Anim_C
// 0x2F20 (0x35C0 - 0x06A0)
class UBP_TerrorWolf_Anim_C final : public UAnimInstanceBase
{
public:
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0030)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_3;                    // 0x06D8(0x00A8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0780(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_37;                   // 0x07A8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0828(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_36;                   // 0x0858(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x08D8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x0908(0x00B0)()
	struct FAnimNode_MirrorBones                  AnimGraphNode_MirrorBones;                         // 0x09B8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0A00(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0B58(0x0158)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_35;                   // 0x0CB0(0x0080)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_2;                    // 0x0D30(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_34;                   // 0x0DD8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_33;                   // 0x0E58(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x0ED8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x0F00(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x0F28(0x0028)()
	struct FAnimNode_HitReactionFourLegs          AnimGraphNode_HitReactionFourLegs_3;               // 0x0F50(0x0220)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_32;                   // 0x1170(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_31;                   // 0x11F0(0x0080)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_1;                    // 0x1270(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_30;                   // 0x1318(0x0080)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0x1398(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x1460(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1488(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x14B0(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x14F8(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1600(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1620(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x1640(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x1748(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x1850(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x1958(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1A60(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1B68(0x0108)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_29;                   // 0x1C70(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_28;                   // 0x1CF0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_27;                   // 0x1D70(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_26;                   // 0x1DF0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_25;                   // 0x1E70(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_24;                   // 0x1EF0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_23;                   // 0x1F70(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_22;                   // 0x1FF0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_21;                   // 0x2070(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_20;                   // 0x20F0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_19;                   // 0x2170(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_18;                   // 0x21F0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_17;                   // 0x2270(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16;                   // 0x22F0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x2370(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0x2398(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x2418(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x2448(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x24C8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x24F8(0x00B0)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x25A8(0x00A8)()
	struct FAnimNode_RandomPlayer                 AnimGraphNode_RandomPlayer_1;                      // 0x2650(0x0078)()
	struct FAnimNode_RandomPlayer                 AnimGraphNode_RandomPlayer;                        // 0x26C8(0x0078)()
	struct FAnimNode_HitReactionFourLegs          AnimGraphNode_HitReactionFourLegs_2;               // 0x2740(0x0220)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x2960(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x29E0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x2A60(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x2AE0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x2B60(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x2BE0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x2C60(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x2CE0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x2D60(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x2DE0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x2E60(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x2EE0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x2F08(0x0028)()
	struct FAnimNode_HitReactionFourLegs          AnimGraphNode_HitReactionFourLegs_1;               // 0x2F30(0x0220)()
	struct FAnimNode_HitReactionFourLegs          AnimGraphNode_HitReactionFourLegs;                 // 0x3150(0x0220)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x3370(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x33F0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x3470(0x0080)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x34F0(0x00C8)()
	int32                                         AdditiveHitAnimIx;                                 // 0x35B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DieSequenceIndex;                                  // 0x35BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_TerrorWolf_Anim_AnimGraphNode_TransitionResult_190934DE4C2CAF44D86196969D63564E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_TerrorWolf_Anim_AnimGraphNode_TransitionResult_011FDFA54DC60933101CCCAD7A7D07CA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_TerrorWolf_Anim_AnimGraphNode_ModifyBone_6EFB5A5D4F209895936CD59ADA0D1F36();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_TerrorWolf_Anim_AnimGraphNode_ModifyBone_914AB1D64F3D2CB4CB6B288EE3877AD3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_TerrorWolf_Anim_AnimGraphNode_ModifyBone_9EFB226B4F9087447A9044A31386699B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_TerrorWolf_Anim_AnimGraphNode_ModifyBone_3C145E314ED0B987CD095583B561518E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_TerrorWolf_Anim_AnimGraphNode_ModifyBone_0E787E6D41E9406FA1D19EBAC9B1A0D4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_TerrorWolf_Anim_AnimGraphNode_ModifyBone_361426424DA6D68A787783996BD22572();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_TerrorWolf_Anim_AnimGraphNode_ModifyBone_43B48CDB449BDD9519244E8B8B2DFC3F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_TerrorWolf_Anim_AnimGraphNode_BlendListByInt_D6F2D085436F46B75C992ABC6BF45275();
	void OnFacingChanged(bool bForced);
	void BlueprintBeginPlay();
	void ExecuteUbergraph_BP_TerrorWolf_Anim(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TerrorWolf_Anim_C">();
	}
	static class UBP_TerrorWolf_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_TerrorWolf_Anim_C>();
	}
};
static_assert(alignof(UBP_TerrorWolf_Anim_C) == 0x000010, "Wrong alignment on UBP_TerrorWolf_Anim_C");
static_assert(sizeof(UBP_TerrorWolf_Anim_C) == 0x0035C0, "Wrong size on UBP_TerrorWolf_Anim_C");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, UberGraphFrame) == 0x0006A0, "Member 'UBP_TerrorWolf_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_BlendListByInt_3) == 0x0006D8, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_BlendListByInt_3' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_TransitionResult_1) == 0x000780, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_37) == 0x0007A8, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_37' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_StateResult_3) == 0x000828, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_36) == 0x000858, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_36' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_StateResult_2) == 0x0008D8, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_StateMachine_1) == 0x000908, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_MirrorBones) == 0x0009B8, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_MirrorBones' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SaveCachedPose_1) == 0x000A00, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SaveCachedPose) == 0x000B58, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_35) == 0x000CB0, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_35' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_BlendListByInt_2) == 0x000D30, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_BlendListByInt_2' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_34) == 0x000DD8, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_34' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_33) == 0x000E58, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_33' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_UseCachedPose_6) == 0x000ED8, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_UseCachedPose_5) == 0x000F00, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_UseCachedPose_4) == 0x000F28, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_HitReactionFourLegs_3) == 0x000F50, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_HitReactionFourLegs_3' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_32) == 0x001170, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_32' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_31) == 0x0011F0, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_31' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_BlendListByInt_1) == 0x001270, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_BlendListByInt_1' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_30) == 0x001318, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_30' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_TwoWayBlend_1) == 0x001398, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_TwoWayBlend_1' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_UseCachedPose_3) == 0x001460, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_UseCachedPose_2) == 0x001488, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_Slot) == 0x0014B0, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_ModifyBone_6) == 0x0014F8, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_LocalToComponentSpace) == 0x001600, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_ComponentToLocalSpace) == 0x001620, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_ModifyBone_5) == 0x001640, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_ModifyBone_4) == 0x001748, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_ModifyBone_3) == 0x001850, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_ModifyBone_2) == 0x001958, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_ModifyBone_1) == 0x001A60, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_ModifyBone) == 0x001B68, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_29) == 0x001C70, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_29' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_28) == 0x001CF0, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_28' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_27) == 0x001D70, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_27' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_26) == 0x001DF0, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_26' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_25) == 0x001E70, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_25' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_24) == 0x001EF0, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_24' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_23) == 0x001F70, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_23' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_22) == 0x001FF0, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_22' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_21) == 0x002070, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_21' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_20) == 0x0020F0, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_20' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_19) == 0x002170, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_19' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_18) == 0x0021F0, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_18' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_17) == 0x002270, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_17' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_16) == 0x0022F0, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_16' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_TransitionResult) == 0x002370, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_15) == 0x002398, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_15' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_StateResult_1) == 0x002418, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_14) == 0x002448, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_14' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_StateResult) == 0x0024C8, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_StateMachine) == 0x0024F8, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_BlendListByInt) == 0x0025A8, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_RandomPlayer_1) == 0x002650, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_RandomPlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_RandomPlayer) == 0x0026C8, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_RandomPlayer' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_HitReactionFourLegs_2) == 0x002740, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_HitReactionFourLegs_2' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_13) == 0x002960, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_13' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_12) == 0x0029E0, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_12' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_11) == 0x002A60, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_11' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_10) == 0x002AE0, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_9) == 0x002B60, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_8) == 0x002BE0, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_7) == 0x002C60, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_6) == 0x002CE0, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_5) == 0x002D60, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_4) == 0x002DE0, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_3) == 0x002E60, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_UseCachedPose_1) == 0x002EE0, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_UseCachedPose) == 0x002F08, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_HitReactionFourLegs_1) == 0x002F30, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_HitReactionFourLegs_1' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_HitReactionFourLegs) == 0x003150, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_HitReactionFourLegs' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_2) == 0x003370, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer_1) == 0x0033F0, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_SequencePlayer) == 0x003470, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AnimGraphNode_TwoWayBlend) == 0x0034F0, "Member 'UBP_TerrorWolf_Anim_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, AdditiveHitAnimIx) == 0x0035B8, "Member 'UBP_TerrorWolf_Anim_C::AdditiveHitAnimIx' has a wrong offset!");
static_assert(offsetof(UBP_TerrorWolf_Anim_C, DieSequenceIndex) == 0x0035BC, "Member 'UBP_TerrorWolf_Anim_C::DieSequenceIndex' has a wrong offset!");

}

