#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TerrorWolf

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TerrorWolf.BP_TerrorWolf_C
// 0x00E0 (0x1BA0 - 0x1AC0)
class ABP_TerrorWolf_C final : public AEnemyCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1AC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGroomComponent*                        Groom;                                             // 0x1AC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_HitEffect;                                      // 0x1AD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CultistIndicator;                               // 0x1AD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CollisionBoxVsCharacters;                          // 0x1AE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USurfaceEffectComponent*                LeftFootEffect;                                    // 0x1AE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USurfaceEffectComponent*                LeftFootEffectBack;                                // 0x1AF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USurfaceEffectComponent*                RightFootEffect;                                   // 0x1AF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USurfaceEffectComponent*                RightFootEffectBack;                               // 0x1B00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_TerrorWolf_Living;                              // 0x1B08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Leg4;                                              // 0x1B10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Leg3;                                              // 0x1B18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Tail;                                              // 0x1B20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Leg2;                                              // 0x1B28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Leg1;                                              // 0x1B30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Torso1;                                            // 0x1B38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_HPBarWidgetComponent_C*             BP_HPBarWidgetComponent;                           // 0x1B40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CollisionBox;                                      // 0x1B48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                HitBoxBite;                                        // 0x1B50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                HitBoxLeftLeg;                                     // 0x1B58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                HitBoxRightLeg;                                    // 0x1B60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Head;                                              // 0x1B68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Torso;                                             // 0x1B70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Shield__Direction_9DB1139D488199D1604E2BA3ECB05C32; // 0x1B78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B79[0x7];                                     // 0x1B79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Shield;                                            // 0x1B80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ShieldCaster;                                      // 0x1B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       DynamicMaterials;                                  // 0x1B90(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_TerrorWolf(int32 EntryPoint);
	void BPPostBeginPlay();
	void BPDamageTakenEvent_Event_0(class UAbilityController* Source, class UAbilityController* Bullet, class UAbilityController* Target, class UAbilityBase* Ability, float effectiveDamage, const struct FDamageValue& DamageValue);
	void AbilityEnd(class UAbilityBase* pAbility);
	void AbilityStart(class UAbilityBase* pAbility, bool bDesired);
	void OnKilled_Event_0(class UObject* Killer, class UAbilityController* KillerAbilityController);
	void Shield__UpdateFunc();
	void Shield__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TerrorWolf_C">();
	}
	static class ABP_TerrorWolf_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TerrorWolf_C>();
	}
};
static_assert(alignof(ABP_TerrorWolf_C) == 0x000010, "Wrong alignment on ABP_TerrorWolf_C");
static_assert(sizeof(ABP_TerrorWolf_C) == 0x001BA0, "Wrong size on ABP_TerrorWolf_C");
static_assert(offsetof(ABP_TerrorWolf_C, UberGraphFrame) == 0x001AC0, "Member 'ABP_TerrorWolf_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TerrorWolf_C, Groom) == 0x001AC8, "Member 'ABP_TerrorWolf_C::Groom' has a wrong offset!");
static_assert(offsetof(ABP_TerrorWolf_C, NS_HitEffect) == 0x001AD0, "Member 'ABP_TerrorWolf_C::NS_HitEffect' has a wrong offset!");
static_assert(offsetof(ABP_TerrorWolf_C, NS_CultistIndicator) == 0x001AD8, "Member 'ABP_TerrorWolf_C::NS_CultistIndicator' has a wrong offset!");
static_assert(offsetof(ABP_TerrorWolf_C, CollisionBoxVsCharacters) == 0x001AE0, "Member 'ABP_TerrorWolf_C::CollisionBoxVsCharacters' has a wrong offset!");
static_assert(offsetof(ABP_TerrorWolf_C, LeftFootEffect) == 0x001AE8, "Member 'ABP_TerrorWolf_C::LeftFootEffect' has a wrong offset!");
static_assert(offsetof(ABP_TerrorWolf_C, LeftFootEffectBack) == 0x001AF0, "Member 'ABP_TerrorWolf_C::LeftFootEffectBack' has a wrong offset!");
static_assert(offsetof(ABP_TerrorWolf_C, RightFootEffect) == 0x001AF8, "Member 'ABP_TerrorWolf_C::RightFootEffect' has a wrong offset!");
static_assert(offsetof(ABP_TerrorWolf_C, RightFootEffectBack) == 0x001B00, "Member 'ABP_TerrorWolf_C::RightFootEffectBack' has a wrong offset!");
static_assert(offsetof(ABP_TerrorWolf_C, NS_TerrorWolf_Living) == 0x001B08, "Member 'ABP_TerrorWolf_C::NS_TerrorWolf_Living' has a wrong offset!");
static_assert(offsetof(ABP_TerrorWolf_C, Leg4) == 0x001B10, "Member 'ABP_TerrorWolf_C::Leg4' has a wrong offset!");
static_assert(offsetof(ABP_TerrorWolf_C, Leg3) == 0x001B18, "Member 'ABP_TerrorWolf_C::Leg3' has a wrong offset!");
static_assert(offsetof(ABP_TerrorWolf_C, Tail) == 0x001B20, "Member 'ABP_TerrorWolf_C::Tail' has a wrong offset!");
static_assert(offsetof(ABP_TerrorWolf_C, Leg2) == 0x001B28, "Member 'ABP_TerrorWolf_C::Leg2' has a wrong offset!");
static_assert(offsetof(ABP_TerrorWolf_C, Leg1) == 0x001B30, "Member 'ABP_TerrorWolf_C::Leg1' has a wrong offset!");
static_assert(offsetof(ABP_TerrorWolf_C, Torso1) == 0x001B38, "Member 'ABP_TerrorWolf_C::Torso1' has a wrong offset!");
static_assert(offsetof(ABP_TerrorWolf_C, BP_HPBarWidgetComponent) == 0x001B40, "Member 'ABP_TerrorWolf_C::BP_HPBarWidgetComponent' has a wrong offset!");
static_assert(offsetof(ABP_TerrorWolf_C, CollisionBox) == 0x001B48, "Member 'ABP_TerrorWolf_C::CollisionBox' has a wrong offset!");
static_assert(offsetof(ABP_TerrorWolf_C, HitBoxBite) == 0x001B50, "Member 'ABP_TerrorWolf_C::HitBoxBite' has a wrong offset!");
static_assert(offsetof(ABP_TerrorWolf_C, HitBoxLeftLeg) == 0x001B58, "Member 'ABP_TerrorWolf_C::HitBoxLeftLeg' has a wrong offset!");
static_assert(offsetof(ABP_TerrorWolf_C, HitBoxRightLeg) == 0x001B60, "Member 'ABP_TerrorWolf_C::HitBoxRightLeg' has a wrong offset!");
static_assert(offsetof(ABP_TerrorWolf_C, Head) == 0x001B68, "Member 'ABP_TerrorWolf_C::Head' has a wrong offset!");
static_assert(offsetof(ABP_TerrorWolf_C, Torso) == 0x001B70, "Member 'ABP_TerrorWolf_C::Torso' has a wrong offset!");
static_assert(offsetof(ABP_TerrorWolf_C, Shield__Direction_9DB1139D488199D1604E2BA3ECB05C32) == 0x001B78, "Member 'ABP_TerrorWolf_C::Shield__Direction_9DB1139D488199D1604E2BA3ECB05C32' has a wrong offset!");
static_assert(offsetof(ABP_TerrorWolf_C, Shield) == 0x001B80, "Member 'ABP_TerrorWolf_C::Shield' has a wrong offset!");
static_assert(offsetof(ABP_TerrorWolf_C, ShieldCaster) == 0x001B88, "Member 'ABP_TerrorWolf_C::ShieldCaster' has a wrong offset!");
static_assert(offsetof(ABP_TerrorWolf_C, DynamicMaterials) == 0x001B90, "Member 'ABP_TerrorWolf_C::DynamicMaterials' has a wrong offset!");

}

