#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ToggleButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ToggleButton.BP_ToggleButton_C
// 0x0150 (0x04A8 - 0x0358)
class UBP_ToggleButton_C final : public UInteractButtonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PressAnim;                                         // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SetSelectedAnim;                                   // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                ButtonFrame;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HotkeyIcon;                                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HotkeyIcon2;                                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HotkeyIcon3;                                       // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HotkeyIcon4;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           HotkeyIconCanvasPanel;                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           HotkeyIconCanvasPanel2;                            // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           HotkeyIconCanvasPanel3;                            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           HotkeyIconCanvasPanel4;                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HotkeyText;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HotkeyText2;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HotkeyText3;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HotkeyText4;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HotkeyTextBorder;                                  // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HotkeyTextBorder2;                                 // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HotkeyTextBorder3;                                 // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HotkeyTextBorder4;                                 // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconDisabled;                                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconOver;                                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconSelected;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconUp;                                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_1;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_2;                                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x0440(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnPressed;                                         // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsEnabled;                                         // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_461[0x3];                                      // 0x0461(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetTransform                       ControllerIconTransform;                           // 0x0464(0x001C)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)
	bool                                          IsSelected;                                        // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             IconTextureUp;                                     // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             IconTextureOver;                                   // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             IconTextureSelected;                               // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             IconTextureDisabled;                               // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ToggleButton(int32 EntryPoint);
	void OnSetHotkeyText(const TArray<class FText>& HotkeyTexts);
	void OnSetHotkeyImages(const TArray<class UTexture2D*>& HotkeyImages);
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void Setup_Interact();
	void SetText(const class FText& Caption);
	void ToggleSelected(bool InIsSelected);
	void ToggleEnabled(bool InIsEnabled);
	void PlayClickedAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ToggleButton_C">();
	}
	static class UBP_ToggleButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ToggleButton_C>();
	}
};
static_assert(alignof(UBP_ToggleButton_C) == 0x000008, "Wrong alignment on UBP_ToggleButton_C");
static_assert(sizeof(UBP_ToggleButton_C) == 0x0004A8, "Wrong size on UBP_ToggleButton_C");
static_assert(offsetof(UBP_ToggleButton_C, UberGraphFrame) == 0x000358, "Member 'UBP_ToggleButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, PressAnim) == 0x000360, "Member 'UBP_ToggleButton_C::PressAnim' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, HoverAnim) == 0x000368, "Member 'UBP_ToggleButton_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, SetSelectedAnim) == 0x000370, "Member 'UBP_ToggleButton_C::SetSelectedAnim' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, ButtonFrame) == 0x000378, "Member 'UBP_ToggleButton_C::ButtonFrame' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, HotkeyIcon) == 0x000380, "Member 'UBP_ToggleButton_C::HotkeyIcon' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, HotkeyIcon2) == 0x000388, "Member 'UBP_ToggleButton_C::HotkeyIcon2' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, HotkeyIcon3) == 0x000390, "Member 'UBP_ToggleButton_C::HotkeyIcon3' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, HotkeyIcon4) == 0x000398, "Member 'UBP_ToggleButton_C::HotkeyIcon4' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, HotkeyIconCanvasPanel) == 0x0003A0, "Member 'UBP_ToggleButton_C::HotkeyIconCanvasPanel' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, HotkeyIconCanvasPanel2) == 0x0003A8, "Member 'UBP_ToggleButton_C::HotkeyIconCanvasPanel2' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, HotkeyIconCanvasPanel3) == 0x0003B0, "Member 'UBP_ToggleButton_C::HotkeyIconCanvasPanel3' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, HotkeyIconCanvasPanel4) == 0x0003B8, "Member 'UBP_ToggleButton_C::HotkeyIconCanvasPanel4' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, HotkeyText) == 0x0003C0, "Member 'UBP_ToggleButton_C::HotkeyText' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, HotkeyText2) == 0x0003C8, "Member 'UBP_ToggleButton_C::HotkeyText2' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, HotkeyText3) == 0x0003D0, "Member 'UBP_ToggleButton_C::HotkeyText3' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, HotkeyText4) == 0x0003D8, "Member 'UBP_ToggleButton_C::HotkeyText4' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, HotkeyTextBorder) == 0x0003E0, "Member 'UBP_ToggleButton_C::HotkeyTextBorder' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, HotkeyTextBorder2) == 0x0003E8, "Member 'UBP_ToggleButton_C::HotkeyTextBorder2' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, HotkeyTextBorder3) == 0x0003F0, "Member 'UBP_ToggleButton_C::HotkeyTextBorder3' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, HotkeyTextBorder4) == 0x0003F8, "Member 'UBP_ToggleButton_C::HotkeyTextBorder4' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, IconDisabled) == 0x000400, "Member 'UBP_ToggleButton_C::IconDisabled' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, IconOver) == 0x000408, "Member 'UBP_ToggleButton_C::IconOver' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, IconSelected) == 0x000410, "Member 'UBP_ToggleButton_C::IconSelected' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, IconUp) == 0x000418, "Member 'UBP_ToggleButton_C::IconUp' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, SizeBox) == 0x000420, "Member 'UBP_ToggleButton_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, SizeBox_0) == 0x000428, "Member 'UBP_ToggleButton_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, SizeBox_1) == 0x000430, "Member 'UBP_ToggleButton_C::SizeBox_1' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, SizeBox_2) == 0x000438, "Member 'UBP_ToggleButton_C::SizeBox_2' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, OnClicked) == 0x000440, "Member 'UBP_ToggleButton_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, OnPressed) == 0x000450, "Member 'UBP_ToggleButton_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, IsEnabled) == 0x000460, "Member 'UBP_ToggleButton_C::IsEnabled' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, ControllerIconTransform) == 0x000464, "Member 'UBP_ToggleButton_C::ControllerIconTransform' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, IsSelected) == 0x000480, "Member 'UBP_ToggleButton_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, IconTextureUp) == 0x000488, "Member 'UBP_ToggleButton_C::IconTextureUp' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, IconTextureOver) == 0x000490, "Member 'UBP_ToggleButton_C::IconTextureOver' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, IconTextureSelected) == 0x000498, "Member 'UBP_ToggleButton_C::IconTextureSelected' has a wrong offset!");
static_assert(offsetof(UBP_ToggleButton_C, IconTextureDisabled) == 0x0004A0, "Member 'UBP_ToggleButton_C::IconTextureDisabled' has a wrong offset!");

}

