#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TargetDummyQuest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TargetDummyQuest.BP_TargetDummyQuest_C
// 0x00A0 (0x1B60 - 0x1AC0)
class ABP_TargetDummyQuest_C final : public ABanditCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1AC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_SpeechBubbleComponent_C*            BP_SpeechBubbleComponent;                          // 0x1AC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule_Static;                                // 0x1AD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                ShowHitBox;                                        // 0x1AD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SS1_pos0;                                          // 0x1AE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SS1_pos2;                                          // 0x1AE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SS1_pos1;                                          // 0x1AF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SSword;                                            // 0x1AF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Arm_Right_Lower;                                   // 0x1B00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Arm_Left_Lower;                                    // 0x1B08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Arm_Right_Upper;                                   // 0x1B10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Arm_Left_Upper;                                    // 0x1B18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Head;                                              // 0x1B20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Leg_Left_Lower;                                    // 0x1B28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Leg_Right_Lower;                                   // 0x1B30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Leg_Left;                                          // 0x1B38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Leg_Right;                                         // 0x1B40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           Torso;                                             // 0x1B48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTimerRunning;                                    // 0x1B50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B51[0x3];                                     // 0x1B51(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DamageTimer;                                       // 0x1B54(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PreviousGameTime;                                  // 0x1B58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_TargetDummyQuest(int32 EntryPoint);
	void CustomDamageReceivedEvent(class AActorSoul* Source, class AActorSoul* Target, class UAbilityBase* Ability, class UAnimID* Anim, float effectiveDamage, const struct FDamageValue& OriginalDamageValue, const struct FDamageValue& DamageValue);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TargetDummyQuest_C">();
	}
	static class ABP_TargetDummyQuest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TargetDummyQuest_C>();
	}
};
static_assert(alignof(ABP_TargetDummyQuest_C) == 0x000010, "Wrong alignment on ABP_TargetDummyQuest_C");
static_assert(sizeof(ABP_TargetDummyQuest_C) == 0x001B60, "Wrong size on ABP_TargetDummyQuest_C");
static_assert(offsetof(ABP_TargetDummyQuest_C, UberGraphFrame) == 0x001AC0, "Member 'ABP_TargetDummyQuest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TargetDummyQuest_C, BP_SpeechBubbleComponent) == 0x001AC8, "Member 'ABP_TargetDummyQuest_C::BP_SpeechBubbleComponent' has a wrong offset!");
static_assert(offsetof(ABP_TargetDummyQuest_C, HurtCapsule_Static) == 0x001AD0, "Member 'ABP_TargetDummyQuest_C::HurtCapsule_Static' has a wrong offset!");
static_assert(offsetof(ABP_TargetDummyQuest_C, ShowHitBox) == 0x001AD8, "Member 'ABP_TargetDummyQuest_C::ShowHitBox' has a wrong offset!");
static_assert(offsetof(ABP_TargetDummyQuest_C, SS1_pos0) == 0x001AE0, "Member 'ABP_TargetDummyQuest_C::SS1_pos0' has a wrong offset!");
static_assert(offsetof(ABP_TargetDummyQuest_C, SS1_pos2) == 0x001AE8, "Member 'ABP_TargetDummyQuest_C::SS1_pos2' has a wrong offset!");
static_assert(offsetof(ABP_TargetDummyQuest_C, SS1_pos1) == 0x001AF0, "Member 'ABP_TargetDummyQuest_C::SS1_pos1' has a wrong offset!");
static_assert(offsetof(ABP_TargetDummyQuest_C, SSword) == 0x001AF8, "Member 'ABP_TargetDummyQuest_C::SSword' has a wrong offset!");
static_assert(offsetof(ABP_TargetDummyQuest_C, Arm_Right_Lower) == 0x001B00, "Member 'ABP_TargetDummyQuest_C::Arm_Right_Lower' has a wrong offset!");
static_assert(offsetof(ABP_TargetDummyQuest_C, Arm_Left_Lower) == 0x001B08, "Member 'ABP_TargetDummyQuest_C::Arm_Left_Lower' has a wrong offset!");
static_assert(offsetof(ABP_TargetDummyQuest_C, Arm_Right_Upper) == 0x001B10, "Member 'ABP_TargetDummyQuest_C::Arm_Right_Upper' has a wrong offset!");
static_assert(offsetof(ABP_TargetDummyQuest_C, Arm_Left_Upper) == 0x001B18, "Member 'ABP_TargetDummyQuest_C::Arm_Left_Upper' has a wrong offset!");
static_assert(offsetof(ABP_TargetDummyQuest_C, Head) == 0x001B20, "Member 'ABP_TargetDummyQuest_C::Head' has a wrong offset!");
static_assert(offsetof(ABP_TargetDummyQuest_C, Leg_Left_Lower) == 0x001B28, "Member 'ABP_TargetDummyQuest_C::Leg_Left_Lower' has a wrong offset!");
static_assert(offsetof(ABP_TargetDummyQuest_C, Leg_Right_Lower) == 0x001B30, "Member 'ABP_TargetDummyQuest_C::Leg_Right_Lower' has a wrong offset!");
static_assert(offsetof(ABP_TargetDummyQuest_C, Leg_Left) == 0x001B38, "Member 'ABP_TargetDummyQuest_C::Leg_Left' has a wrong offset!");
static_assert(offsetof(ABP_TargetDummyQuest_C, Leg_Right) == 0x001B40, "Member 'ABP_TargetDummyQuest_C::Leg_Right' has a wrong offset!");
static_assert(offsetof(ABP_TargetDummyQuest_C, Torso) == 0x001B48, "Member 'ABP_TargetDummyQuest_C::Torso' has a wrong offset!");
static_assert(offsetof(ABP_TargetDummyQuest_C, IsTimerRunning) == 0x001B50, "Member 'ABP_TargetDummyQuest_C::IsTimerRunning' has a wrong offset!");
static_assert(offsetof(ABP_TargetDummyQuest_C, DamageTimer) == 0x001B54, "Member 'ABP_TargetDummyQuest_C::DamageTimer' has a wrong offset!");
static_assert(offsetof(ABP_TargetDummyQuest_C, PreviousGameTime) == 0x001B58, "Member 'ABP_TargetDummyQuest_C::PreviousGameTime' has a wrong offset!");

}

