#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TalentPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_TalentPoint.BP_TalentPoint_C
// 0x0040 (0x0550 - 0x0510)
class UBP_TalentPoint_C final : public UHUDPopupUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Bg;                                                // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DecorLeft;                                         // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DecorRight;                                        // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconImage;                                         // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_TalentPoint(int32 EntryPoint);
	void OnShow(float AnimDuration);
	void OnHide(float AnimDuration);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TalentPoint_C">();
	}
	static class UBP_TalentPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_TalentPoint_C>();
	}
};
static_assert(alignof(UBP_TalentPoint_C) == 0x000008, "Wrong alignment on UBP_TalentPoint_C");
static_assert(sizeof(UBP_TalentPoint_C) == 0x000550, "Wrong size on UBP_TalentPoint_C");
static_assert(offsetof(UBP_TalentPoint_C, UberGraphFrame) == 0x000510, "Member 'UBP_TalentPoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_TalentPoint_C, FadeOutAnim) == 0x000518, "Member 'UBP_TalentPoint_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_TalentPoint_C, FadeInAnim) == 0x000520, "Member 'UBP_TalentPoint_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_TalentPoint_C, Bg) == 0x000528, "Member 'UBP_TalentPoint_C::Bg' has a wrong offset!");
static_assert(offsetof(UBP_TalentPoint_C, DecorLeft) == 0x000530, "Member 'UBP_TalentPoint_C::DecorLeft' has a wrong offset!");
static_assert(offsetof(UBP_TalentPoint_C, DecorRight) == 0x000538, "Member 'UBP_TalentPoint_C::DecorRight' has a wrong offset!");
static_assert(offsetof(UBP_TalentPoint_C, IconImage) == 0x000540, "Member 'UBP_TalentPoint_C::IconImage' has a wrong offset!");
static_assert(offsetof(UBP_TalentPoint_C, Name_0) == 0x000548, "Member 'UBP_TalentPoint_C::Name_0' has a wrong offset!");

}

