#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TutorialScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_TutorialScreen.BP_TutorialScreen_C
// 0x0190 (0x0668 - 0x04D8)
class UBP_TutorialScreen_C final : public UTutorialScreenUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RightBtnHighlightAnim;                             // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RightBtnHighlightLoopAnim;                         // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PageFadeIn;                                        // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TitleFadeIn;                                       // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PageRightAnim;                                     // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PageLeftAnim;                                      // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PageDownAnim;                                      // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PageUpAnim;                                        // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x0528(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur_0;                                  // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BottomScreenFrame;                                 // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CloseButton_C*                      BtnClose;                                          // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                BtnDown;                                           // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               BtnDownContainer;                                  // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnDownDis;                                        // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnDownHighlight;                                  // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyB;                                        // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                BtnLeft;                                           // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnLeftDis;                                        // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnLeftHighlight;                                  // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                BtnRight;                                          // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnRightDis;                                       // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnRightHighlight;                                 // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnRightHighlight2;                                // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                BtnUp;                                             // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               BtnUpContainer;                                    // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnUpDis;                                          // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnUpHighlight;                                    // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ContentFrame;                                      // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            DownHotkey;                                        // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            LeftHotkey;                                        // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NormalFrame;                                       // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Pager;                                             // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PageText;                                          // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            RightHotkey;                                       // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBoxDownHotkey;                                // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBoxLeftHotkey;                                // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBoxRightHotkey;                               // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBoxUpHotkey;                                  // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScreenBg2;                                         // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Title;                                             // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleText;                                         // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         TutorialText;                                      // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TutorialVideo;                                     // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TutorialVideo_1;                                   // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            UpHotkey;                                          // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBinkMediaPlayer*                       BinkMediaPlayer;                                   // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FirstPageSeen;                                     // 0x0660(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_TutorialScreen(int32 EntryPoint);
	void BndEvt__BP_TutorialScreen_BtnUp_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void OnSetReplayBtnsState(bool bUpEnabled, bool bDownEnabled);
	void OnGamepadDPadDownEvent();
	void OnGamepadDPadUpEvent();
	void OnSetInputDisplay(EInputDisplay InInputDisplay, EInputDisplay InControlDisplay);
	void OnGamepadDPadRightEvent();
	void OnGamepadDPadLeftEvent();
	void OnSetDescription(const class FText& Description);
	void OnSetPage(const class FText& Title_0, const class FText& InPageNumber, int32 CurrentPage, int32 MaxPage, bool bFade);
	void BndEvt__BP_Tutorial_BtnDown_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_Tutorial_BtnRight_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_Tutorial_BtnLeft_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void OnHide(float AnimDuration);
	void OnShow(float AnimDuration);
	void BndEvt__BP_Collection_BtnClose_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();
	void BndEvt__BP_Glossary_BtnHotkeyB_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();
	void OnGamepadBEvent();
	void BtnHotkeyBClicked();
	void SetBtnCloseVisibility();
	void BtnHotkeyDPadUpClicked();
	void BtnHotkeyDPadDownClicked();
	void BtnHotkeyDpadLeftClicked();
	void BtnHotkeyDpadRightClicked();
	void SetPageBtnsState(int32 CurrentPage, int32 MaxPage);
	void SetPage(const class FText& Title_0, const class FText& InPageNumber, int32 CurrentPage, int32 MaxPage, bool Fade);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TutorialScreen_C">();
	}
	static class UBP_TutorialScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_TutorialScreen_C>();
	}
};
static_assert(alignof(UBP_TutorialScreen_C) == 0x000008, "Wrong alignment on UBP_TutorialScreen_C");
static_assert(sizeof(UBP_TutorialScreen_C) == 0x000668, "Wrong size on UBP_TutorialScreen_C");
static_assert(offsetof(UBP_TutorialScreen_C, UberGraphFrame) == 0x0004D8, "Member 'UBP_TutorialScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, RightBtnHighlightAnim) == 0x0004E0, "Member 'UBP_TutorialScreen_C::RightBtnHighlightAnim' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, RightBtnHighlightLoopAnim) == 0x0004E8, "Member 'UBP_TutorialScreen_C::RightBtnHighlightLoopAnim' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, PageFadeIn) == 0x0004F0, "Member 'UBP_TutorialScreen_C::PageFadeIn' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, TitleFadeIn) == 0x0004F8, "Member 'UBP_TutorialScreen_C::TitleFadeIn' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, PageRightAnim) == 0x000500, "Member 'UBP_TutorialScreen_C::PageRightAnim' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, PageLeftAnim) == 0x000508, "Member 'UBP_TutorialScreen_C::PageLeftAnim' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, PageDownAnim) == 0x000510, "Member 'UBP_TutorialScreen_C::PageDownAnim' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, PageUpAnim) == 0x000518, "Member 'UBP_TutorialScreen_C::PageUpAnim' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, FadeOutAnim) == 0x000520, "Member 'UBP_TutorialScreen_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, FadeInAnim) == 0x000528, "Member 'UBP_TutorialScreen_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, BackgroundBlur_0) == 0x000530, "Member 'UBP_TutorialScreen_C::BackgroundBlur_0' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, BottomScreenFrame) == 0x000538, "Member 'UBP_TutorialScreen_C::BottomScreenFrame' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, BtnClose) == 0x000540, "Member 'UBP_TutorialScreen_C::BtnClose' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, BtnDown) == 0x000548, "Member 'UBP_TutorialScreen_C::BtnDown' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, BtnDownContainer) == 0x000550, "Member 'UBP_TutorialScreen_C::BtnDownContainer' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, BtnDownDis) == 0x000558, "Member 'UBP_TutorialScreen_C::BtnDownDis' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, BtnDownHighlight) == 0x000560, "Member 'UBP_TutorialScreen_C::BtnDownHighlight' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, BtnHotkeyB) == 0x000568, "Member 'UBP_TutorialScreen_C::BtnHotkeyB' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, BtnLeft) == 0x000570, "Member 'UBP_TutorialScreen_C::BtnLeft' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, BtnLeftDis) == 0x000578, "Member 'UBP_TutorialScreen_C::BtnLeftDis' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, BtnLeftHighlight) == 0x000580, "Member 'UBP_TutorialScreen_C::BtnLeftHighlight' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, BtnRight) == 0x000588, "Member 'UBP_TutorialScreen_C::BtnRight' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, BtnRightDis) == 0x000590, "Member 'UBP_TutorialScreen_C::BtnRightDis' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, BtnRightHighlight) == 0x000598, "Member 'UBP_TutorialScreen_C::BtnRightHighlight' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, BtnRightHighlight2) == 0x0005A0, "Member 'UBP_TutorialScreen_C::BtnRightHighlight2' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, BtnUp) == 0x0005A8, "Member 'UBP_TutorialScreen_C::BtnUp' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, BtnUpContainer) == 0x0005B0, "Member 'UBP_TutorialScreen_C::BtnUpContainer' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, BtnUpDis) == 0x0005B8, "Member 'UBP_TutorialScreen_C::BtnUpDis' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, BtnUpHighlight) == 0x0005C0, "Member 'UBP_TutorialScreen_C::BtnUpHighlight' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, ContentFrame) == 0x0005C8, "Member 'UBP_TutorialScreen_C::ContentFrame' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, DownHotkey) == 0x0005D0, "Member 'UBP_TutorialScreen_C::DownHotkey' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, LeftHotkey) == 0x0005D8, "Member 'UBP_TutorialScreen_C::LeftHotkey' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, NormalFrame) == 0x0005E0, "Member 'UBP_TutorialScreen_C::NormalFrame' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, Pager) == 0x0005E8, "Member 'UBP_TutorialScreen_C::Pager' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, PageText) == 0x0005F0, "Member 'UBP_TutorialScreen_C::PageText' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, RightHotkey) == 0x0005F8, "Member 'UBP_TutorialScreen_C::RightHotkey' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, ScaleBoxDownHotkey) == 0x000600, "Member 'UBP_TutorialScreen_C::ScaleBoxDownHotkey' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, ScaleBoxLeftHotkey) == 0x000608, "Member 'UBP_TutorialScreen_C::ScaleBoxLeftHotkey' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, ScaleBoxRightHotkey) == 0x000610, "Member 'UBP_TutorialScreen_C::ScaleBoxRightHotkey' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, ScaleBoxUpHotkey) == 0x000618, "Member 'UBP_TutorialScreen_C::ScaleBoxUpHotkey' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, ScreenBg2) == 0x000620, "Member 'UBP_TutorialScreen_C::ScreenBg2' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, Title) == 0x000628, "Member 'UBP_TutorialScreen_C::Title' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, TitleText) == 0x000630, "Member 'UBP_TutorialScreen_C::TitleText' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, TutorialText) == 0x000638, "Member 'UBP_TutorialScreen_C::TutorialText' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, TutorialVideo) == 0x000640, "Member 'UBP_TutorialScreen_C::TutorialVideo' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, TutorialVideo_1) == 0x000648, "Member 'UBP_TutorialScreen_C::TutorialVideo_1' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, UpHotkey) == 0x000650, "Member 'UBP_TutorialScreen_C::UpHotkey' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, BinkMediaPlayer) == 0x000658, "Member 'UBP_TutorialScreen_C::BinkMediaPlayer' has a wrong offset!");
static_assert(offsetof(UBP_TutorialScreen_C, FirstPageSeen) == 0x000660, "Member 'UBP_TutorialScreen_C::FirstPageSeen' has a wrong offset!");

}

