#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TrainingSpearman2

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_TrainingSpearman2.BP_TrainingSpearman2_C.ExecuteUbergraph_BP_TrainingSpearman2
// 0x0038 (0x0038 - 0x0000)
struct BP_TrainingSpearman2_C_ExecuteUbergraph_BP_TrainingSpearman2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_TargetDummy03_Anim_C*               K2Node_DynamicCast_AsBP_Target_Dummy_03_Anim;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Soldier_TrainingSpearman2_Anim_C*   K2Node_DynamicCast_AsBP_Soldier_Training_Spearman_2_Anim; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TrainingSpearman2_C_ExecuteUbergraph_BP_TrainingSpearman2) == 0x000008, "Wrong alignment on BP_TrainingSpearman2_C_ExecuteUbergraph_BP_TrainingSpearman2");
static_assert(sizeof(BP_TrainingSpearman2_C_ExecuteUbergraph_BP_TrainingSpearman2) == 0x000038, "Wrong size on BP_TrainingSpearman2_C_ExecuteUbergraph_BP_TrainingSpearman2");
static_assert(offsetof(BP_TrainingSpearman2_C_ExecuteUbergraph_BP_TrainingSpearman2, EntryPoint) == 0x000000, "Member 'BP_TrainingSpearman2_C_ExecuteUbergraph_BP_TrainingSpearman2::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TrainingSpearman2_C_ExecuteUbergraph_BP_TrainingSpearman2, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'BP_TrainingSpearman2_C_ExecuteUbergraph_BP_TrainingSpearman2::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingSpearman2_C_ExecuteUbergraph_BP_TrainingSpearman2, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000010, "Member 'BP_TrainingSpearman2_C_ExecuteUbergraph_BP_TrainingSpearman2::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingSpearman2_C_ExecuteUbergraph_BP_TrainingSpearman2, K2Node_DynamicCast_AsBP_Target_Dummy_03_Anim) == 0x000018, "Member 'BP_TrainingSpearman2_C_ExecuteUbergraph_BP_TrainingSpearman2::K2Node_DynamicCast_AsBP_Target_Dummy_03_Anim' has a wrong offset!");
static_assert(offsetof(BP_TrainingSpearman2_C_ExecuteUbergraph_BP_TrainingSpearman2, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_TrainingSpearman2_C_ExecuteUbergraph_BP_TrainingSpearman2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TrainingSpearman2_C_ExecuteUbergraph_BP_TrainingSpearman2, K2Node_DynamicCast_AsBP_Soldier_Training_Spearman_2_Anim) == 0x000028, "Member 'BP_TrainingSpearman2_C_ExecuteUbergraph_BP_TrainingSpearman2::K2Node_DynamicCast_AsBP_Soldier_Training_Spearman_2_Anim' has a wrong offset!");
static_assert(offsetof(BP_TrainingSpearman2_C_ExecuteUbergraph_BP_TrainingSpearman2, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_TrainingSpearman2_C_ExecuteUbergraph_BP_TrainingSpearman2::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

