#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TailorAndHorse_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_TailorAndHorse_Anim.BP_TailorAndHorse_Anim_C.ExecuteUbergraph_BP_TailorAndHorse_Anim
// 0x0124 (0x0124 - 0x0000)
struct BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_2;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_3;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_4;       // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_1;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_2;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_3;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_5; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_5;       // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_6; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_7; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_6;       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_7;       // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_8; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_4;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_8;       // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_3;            // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_9; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_9;       // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_10; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_10;      // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_11; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_11;      // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_5;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_6;              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_4;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_5;            // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_12; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_10;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_12;      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_13; // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_7;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_13;      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_6;            // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_11;                // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9F[0x1];                                       // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_14; // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_14;      // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_8;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_7;            // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_9;              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_12;                // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_8;            // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_13;                // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B7[0x1];                                       // 0x00B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_10;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_11;             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_9;            // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_14;                // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C3[0x1];                                       // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_15; // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_15;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_15;      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_16; // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_16;      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_17; // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_17;      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_18; // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_18;      // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_16;                // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_17;                // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_12;             // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_13;             // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_10;           // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_14;             // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_11;           // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_18;                // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_15;             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_19;                // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_12;           // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_20;                // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10B[0x1];                                      // 0x010B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_16;             // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_21;                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_3;         // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_17;             // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_13;           // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_22;                // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_19; // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_23;                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_19;      // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim) == 0x000004, "Wrong alignment on BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim");
static_assert(sizeof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim) == 0x000124, "Wrong size on BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, EntryPoint) == 0x000000, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000004, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000009, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1) == 0x00000C, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000010, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_BooleanAND_ReturnValue) == 0x000011, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2) == 0x000014, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_2) == 0x000018, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3) == 0x00001C, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_3) == 0x000020, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000021, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4) == 0x000024, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetCurveValue_ReturnValue) == 0x000028, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_4) == 0x00002C, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_Less_FloatFloat_ReturnValue) == 0x00002D, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetCurveValue_ReturnValue_1) == 0x000030, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetCurveValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000034, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetCurveValue_ReturnValue_2) == 0x000038, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetCurveValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_BooleanAND_ReturnValue_1) == 0x00003C, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00003D, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_BooleanAND_ReturnValue_2) == 0x00003E, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetCurveValue_ReturnValue_3) == 0x000040, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetCurveValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_Less_FloatFloat_ReturnValue_2) == 0x000044, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_Less_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_5) == 0x000048, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_BooleanAND_ReturnValue_3) == 0x00004C, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_5) == 0x00004D, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_BooleanAND_ReturnValue_4) == 0x00004E, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_6) == 0x000050, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_7) == 0x000054, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_6) == 0x000058, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_7) == 0x000059, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_8) == 0x00005C, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetCurveValue_ReturnValue_4) == 0x000060, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetCurveValue_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_8) == 0x000064, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_Less_FloatFloat_ReturnValue_3) == 0x000065, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_Less_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_BooleanAND_ReturnValue_5) == 0x000066, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_BooleanAND_ReturnValue_6) == 0x000067, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_9) == 0x000068, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00006C, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_9) == 0x00006D, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x00006E, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_BooleanAND_ReturnValue_7) == 0x00006F, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_10) == 0x000070, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_10) == 0x000074, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_11) == 0x000078, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_BooleanAND_ReturnValue_8) == 0x00007C, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_BooleanAND_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_11) == 0x00007D, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetCurveValue_ReturnValue_5) == 0x000080, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetCurveValue_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetCurveValue_ReturnValue_6) == 0x000084, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetCurveValue_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_Less_FloatFloat_ReturnValue_4) == 0x000088, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_Less_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_Less_FloatFloat_ReturnValue_5) == 0x000089, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_Less_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_BooleanAND_ReturnValue_9) == 0x00008A, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_BooleanAND_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_12) == 0x00008C, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_BooleanAND_ReturnValue_10) == 0x000090, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_BooleanAND_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_12) == 0x000091, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_13) == 0x000094, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetCurveValue_ReturnValue_7) == 0x000098, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetCurveValue_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_13) == 0x00009C, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_Less_FloatFloat_ReturnValue_6) == 0x00009D, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_Less_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_BooleanAND_ReturnValue_11) == 0x00009E, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_BooleanAND_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_14) == 0x0000A0, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_14) == 0x0000A4, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetCurveValue_ReturnValue_8) == 0x0000A8, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetCurveValue_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_Less_FloatFloat_ReturnValue_7) == 0x0000AC, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_Less_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetCurveValue_ReturnValue_9) == 0x0000B0, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetCurveValue_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_BooleanAND_ReturnValue_12) == 0x0000B4, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_BooleanAND_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_Less_FloatFloat_ReturnValue_8) == 0x0000B5, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_Less_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_BooleanAND_ReturnValue_13) == 0x0000B6, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_BooleanAND_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetCurveValue_ReturnValue_10) == 0x0000B8, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetCurveValue_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetCurveValue_ReturnValue_11) == 0x0000BC, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetCurveValue_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_Less_FloatFloat_ReturnValue_9) == 0x0000C0, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_Less_FloatFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0000C1, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_BooleanAND_ReturnValue_14) == 0x0000C2, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_BooleanAND_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_15) == 0x0000C4, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_BooleanAND_ReturnValue_15) == 0x0000C8, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_BooleanAND_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_15) == 0x0000C9, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_16) == 0x0000CC, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_16) == 0x0000D0, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_17) == 0x0000D4, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_17) == 0x0000D8, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_18) == 0x0000DC, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x0000E0, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_18) == 0x0000E1, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_BooleanAND_ReturnValue_16) == 0x0000E2, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_BooleanAND_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_EqualEqual_IntInt_ReturnValue_5) == 0x0000E3, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_EqualEqual_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_BooleanAND_ReturnValue_17) == 0x0000E4, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_BooleanAND_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetCurveValue_ReturnValue_12) == 0x0000E8, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetCurveValue_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x0000EC, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetCurveValue_ReturnValue_13) == 0x0000F0, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetCurveValue_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_Less_FloatFloat_ReturnValue_10) == 0x0000F4, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_Less_FloatFloat_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, K2Node_Event_DeltaTimeX) == 0x0000F8, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetCurveValue_ReturnValue_14) == 0x0000FC, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetCurveValue_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_Less_FloatFloat_ReturnValue_11) == 0x000100, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_Less_FloatFloat_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_BooleanAND_ReturnValue_18) == 0x000101, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_BooleanAND_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetCurveValue_ReturnValue_15) == 0x000104, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetCurveValue_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_BooleanAND_ReturnValue_19) == 0x000108, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_BooleanAND_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_Less_FloatFloat_ReturnValue_12) == 0x000109, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_Less_FloatFloat_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_BooleanAND_ReturnValue_20) == 0x00010A, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_BooleanAND_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetCurveValue_ReturnValue_16) == 0x00010C, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetCurveValue_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_BooleanAND_ReturnValue_21) == 0x000110, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_BooleanAND_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_Greater_FloatFloat_ReturnValue_3) == 0x000111, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_Greater_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetCurveValue_ReturnValue_17) == 0x000114, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetCurveValue_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_Less_FloatFloat_ReturnValue_13) == 0x000118, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_Less_FloatFloat_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_BooleanAND_ReturnValue_22) == 0x000119, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_BooleanAND_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_19) == 0x00011C, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_BooleanAND_ReturnValue_23) == 0x000120, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_BooleanAND_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_19) == 0x000121, "Member 'BP_TailorAndHorse_Anim_C_ExecuteUbergraph_BP_TailorAndHorse_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_19' has a wrong offset!");

// Function BP_TailorAndHorse_Anim.BP_TailorAndHorse_Anim_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct BP_TailorAndHorse_Anim_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TailorAndHorse_Anim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on BP_TailorAndHorse_Anim_C_BlueprintUpdateAnimation");
static_assert(sizeof(BP_TailorAndHorse_Anim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on BP_TailorAndHorse_Anim_C_BlueprintUpdateAnimation");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'BP_TailorAndHorse_Anim_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function BP_TailorAndHorse_Anim.BP_TailorAndHorse_Anim_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct BP_TailorAndHorse_Anim_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BP_TailorAndHorse_Anim_C_AnimGraph) == 0x000008, "Wrong alignment on BP_TailorAndHorse_Anim_C_AnimGraph");
static_assert(sizeof(BP_TailorAndHorse_Anim_C_AnimGraph) == 0x000010, "Wrong size on BP_TailorAndHorse_Anim_C_AnimGraph");
static_assert(offsetof(BP_TailorAndHorse_Anim_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'BP_TailorAndHorse_Anim_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

