#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TutorialVolume_DestroyCeramic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TutorialVolume_DestroyCeramic.BP_TutorialVolume_DestroyCeramic_C
// 0x0028 (0x0878 - 0x0850)
class ABP_TutorialVolume_DestroyCeramic_C final : public ATutorialPromptVolume_DestroyCeramic
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0850(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMulticastInlineDelegate<void()>              OnFulfilled;                                       // 0x0858(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnSkipped;                                         // 0x0868(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_TutorialVolume_DestroyCeramic(int32 EntryPoint);
	void EventSkipped_BP();
	void EventFulfilled_BP();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TutorialVolume_DestroyCeramic_C">();
	}
	static class ABP_TutorialVolume_DestroyCeramic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TutorialVolume_DestroyCeramic_C>();
	}
};
static_assert(alignof(ABP_TutorialVolume_DestroyCeramic_C) == 0x000008, "Wrong alignment on ABP_TutorialVolume_DestroyCeramic_C");
static_assert(sizeof(ABP_TutorialVolume_DestroyCeramic_C) == 0x000878, "Wrong size on ABP_TutorialVolume_DestroyCeramic_C");
static_assert(offsetof(ABP_TutorialVolume_DestroyCeramic_C, UberGraphFrame) == 0x000850, "Member 'ABP_TutorialVolume_DestroyCeramic_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TutorialVolume_DestroyCeramic_C, OnFulfilled) == 0x000858, "Member 'ABP_TutorialVolume_DestroyCeramic_C::OnFulfilled' has a wrong offset!");
static_assert(offsetof(ABP_TutorialVolume_DestroyCeramic_C, OnSkipped) == 0x000868, "Member 'ABP_TutorialVolume_DestroyCeramic_C::OnSkipped' has a wrong offset!");

}

