#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TutorialPromptActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TutorialPromptActor.BP_TutorialPromptActor_C
// 0x0020 (0x0278 - 0x0258)
class ABP_TutorialPromptActor_C final : public ATutorialPromptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       Widget;                                            // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_TutorialPrompt_C*                   As_BP_Tutorial_Prompt_0;                           // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_TutorialPromptActor(int32 EntryPoint);
	void DataChanged();
	void ReceiveBeginPlay();
	void EventFulfilled();
	void HidePrompt();
	void ShowPrompt();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TutorialPromptActor_C">();
	}
	static class ABP_TutorialPromptActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TutorialPromptActor_C>();
	}
};
static_assert(alignof(ABP_TutorialPromptActor_C) == 0x000008, "Wrong alignment on ABP_TutorialPromptActor_C");
static_assert(sizeof(ABP_TutorialPromptActor_C) == 0x000278, "Wrong size on ABP_TutorialPromptActor_C");
static_assert(offsetof(ABP_TutorialPromptActor_C, UberGraphFrame) == 0x000258, "Member 'ABP_TutorialPromptActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TutorialPromptActor_C, Widget) == 0x000260, "Member 'ABP_TutorialPromptActor_C::Widget' has a wrong offset!");
static_assert(offsetof(ABP_TutorialPromptActor_C, DefaultSceneRoot) == 0x000268, "Member 'ABP_TutorialPromptActor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_TutorialPromptActor_C, As_BP_Tutorial_Prompt_0) == 0x000270, "Member 'ABP_TutorialPromptActor_C::As_BP_Tutorial_Prompt_0' has a wrong offset!");

}

