#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TailorAndHorseNPC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TailorAndHorseNPC.BP_TailorAndHorseNPC_C
// 0x0050 (0x08D0 - 0x0880)
class ABP_TailorAndHorseNPC_C final : public AVendorActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0880(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       CameraSphere;                                      // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMiniMapActorComponent*                 MiniMapActor;                                      // 0x0890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_NPCHorseTailor;                                 // 0x0898(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTriggerBoxComponent*                   TriggerBox;                                        // 0x08A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        NotifMarker;                                       // 0x08A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SpeechBubbleComponent_C*            BP_SpeechBubbleComponent;                          // 0x08B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Tailor;                                         // 0x08B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_InteractPrompWidgetComponent_C*     BP_InteractPrompWidgetComponent;                   // 0x08C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x08C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_TailorAndHorseNPC(int32 EntryPoint);
	void VisualVolumeEnter(class ALevelVisualVolume* Volume);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TailorAndHorseNPC_C">();
	}
	static class ABP_TailorAndHorseNPC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TailorAndHorseNPC_C>();
	}
};
static_assert(alignof(ABP_TailorAndHorseNPC_C) == 0x000008, "Wrong alignment on ABP_TailorAndHorseNPC_C");
static_assert(sizeof(ABP_TailorAndHorseNPC_C) == 0x0008D0, "Wrong size on ABP_TailorAndHorseNPC_C");
static_assert(offsetof(ABP_TailorAndHorseNPC_C, UberGraphFrame) == 0x000880, "Member 'ABP_TailorAndHorseNPC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TailorAndHorseNPC_C, CameraSphere) == 0x000888, "Member 'ABP_TailorAndHorseNPC_C::CameraSphere' has a wrong offset!");
static_assert(offsetof(ABP_TailorAndHorseNPC_C, MiniMapActor) == 0x000890, "Member 'ABP_TailorAndHorseNPC_C::MiniMapActor' has a wrong offset!");
static_assert(offsetof(ABP_TailorAndHorseNPC_C, SK_NPCHorseTailor) == 0x000898, "Member 'ABP_TailorAndHorseNPC_C::SK_NPCHorseTailor' has a wrong offset!");
static_assert(offsetof(ABP_TailorAndHorseNPC_C, TriggerBox) == 0x0008A0, "Member 'ABP_TailorAndHorseNPC_C::TriggerBox' has a wrong offset!");
static_assert(offsetof(ABP_TailorAndHorseNPC_C, NotifMarker) == 0x0008A8, "Member 'ABP_TailorAndHorseNPC_C::NotifMarker' has a wrong offset!");
static_assert(offsetof(ABP_TailorAndHorseNPC_C, BP_SpeechBubbleComponent) == 0x0008B0, "Member 'ABP_TailorAndHorseNPC_C::BP_SpeechBubbleComponent' has a wrong offset!");
static_assert(offsetof(ABP_TailorAndHorseNPC_C, SK_Tailor) == 0x0008B8, "Member 'ABP_TailorAndHorseNPC_C::SK_Tailor' has a wrong offset!");
static_assert(offsetof(ABP_TailorAndHorseNPC_C, BP_InteractPrompWidgetComponent) == 0x0008C0, "Member 'ABP_TailorAndHorseNPC_C::BP_InteractPrompWidgetComponent' has a wrong offset!");
static_assert(offsetof(ABP_TailorAndHorseNPC_C, DefaultSceneRoot) == 0x0008C8, "Member 'ABP_TailorAndHorseNPC_C::DefaultSceneRoot' has a wrong offset!");

}

