#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TownfolkMale03

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TownfolkMale03.BP_TownfolkMale03_C
// 0x0038 (0x0810 - 0x07D8)
class ABP_TownfolkMale03_C final : public AActorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CameraSphere;                                      // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 RightSkeletalMesh;                                 // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh1;                                     // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SpeechBubbleComponent_C*            BP_SpeechBubbleComponent;                          // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_TownfolkMale03(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TownfolkMale03_C">();
	}
	static class ABP_TownfolkMale03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TownfolkMale03_C>();
	}
};
static_assert(alignof(ABP_TownfolkMale03_C) == 0x000008, "Wrong alignment on ABP_TownfolkMale03_C");
static_assert(sizeof(ABP_TownfolkMale03_C) == 0x000810, "Wrong size on ABP_TownfolkMale03_C");
static_assert(offsetof(ABP_TownfolkMale03_C, UberGraphFrame) == 0x0007D8, "Member 'ABP_TownfolkMale03_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TownfolkMale03_C, Ak) == 0x0007E0, "Member 'ABP_TownfolkMale03_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_TownfolkMale03_C, CameraSphere) == 0x0007E8, "Member 'ABP_TownfolkMale03_C::CameraSphere' has a wrong offset!");
static_assert(offsetof(ABP_TownfolkMale03_C, RightSkeletalMesh) == 0x0007F0, "Member 'ABP_TownfolkMale03_C::RightSkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_TownfolkMale03_C, SkeletalMesh1) == 0x0007F8, "Member 'ABP_TownfolkMale03_C::SkeletalMesh1' has a wrong offset!");
static_assert(offsetof(ABP_TownfolkMale03_C, BP_SpeechBubbleComponent) == 0x000800, "Member 'ABP_TownfolkMale03_C::BP_SpeechBubbleComponent' has a wrong offset!");
static_assert(offsetof(ABP_TownfolkMale03_C, DefaultSceneRoot) == 0x000808, "Member 'ABP_TownfolkMale03_C::DefaultSceneRoot' has a wrong offset!");

}

