#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TerrorWolf

#include "Basic.hpp"

#include "man_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_TerrorWolf.BP_TerrorWolf_C.ExecuteUbergraph_BP_TerrorWolf
// 0x02D0 (0x02D0 - 0x0000)
struct BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Killer, class UAbilityController* KillerAbilityController)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UAbilityBase* pAbility, bool bDesired)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UAbilityBase* pAbility)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAbilityController* Source, class UAbilityController* Bullet, class UAbilityController* Target, class UAbilityBase* Ability, float effectiveDamage, const struct FDamageValue& DamageValue)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Killer;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     K2Node_CustomEvent_KillerAbilityController;        // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           K2Node_CustomEvent_pAbility_1;                     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bDesired;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPGetCaster_ReturnValue;                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchOnClass_CmpSuccess;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityBase*                           K2Node_CustomEvent_pAbility;                       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchOnClass_CmpSuccess_1;                 // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x00C4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     K2Node_CustomEvent_Source;                         // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     K2Node_CustomEvent_Bullet;                         // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     K2Node_CustomEvent_Target;                         // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           K2Node_CustomEvent_Ability;                        // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_effectiveDamage;                // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageValue                           K2Node_CustomEvent_DamageValue;                    // 0x0178(0x0138)(ContainsInstancedReference)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       CallFunc_CacheDynamicMaterials_DynamicMaterials;   // 0x02C0(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf) == 0x000008, "Wrong alignment on BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf");
static_assert(sizeof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf) == 0x0002D0, "Wrong size on BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, EntryPoint) == 0x000000, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, K2Node_CreateDelegate_OutputDelegate_3) == 0x000044, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, CallFunc_GetAbilityController_ReturnValue) == 0x000058, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, K2Node_CustomEvent_Killer) == 0x000060, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::K2Node_CustomEvent_Killer' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, K2Node_CustomEvent_KillerAbilityController) == 0x000068, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::K2Node_CustomEvent_KillerAbilityController' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, K2Node_CustomEvent_pAbility_1) == 0x000070, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::K2Node_CustomEvent_pAbility_1' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, K2Node_CustomEvent_bDesired) == 0x000078, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::K2Node_CustomEvent_bDesired' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, CallFunc_BPGetCaster_ReturnValue) == 0x000080, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::CallFunc_BPGetCaster_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, CallFunc_GetObjectClass_ReturnValue) == 0x000088, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, K2Node_SwitchOnClass_CmpSuccess) == 0x000090, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::K2Node_SwitchOnClass_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, K2Node_CustomEvent_pAbility) == 0x000098, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::K2Node_CustomEvent_pAbility' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, CallFunc_GetObjectClass_ReturnValue_1) == 0x0000A0, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, K2Node_SwitchOnClass_CmpSuccess_1) == 0x0000A8, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::K2Node_SwitchOnClass_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000AC, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000B8, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0000C4, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, K2Node_CustomEvent_Source) == 0x000150, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::K2Node_CustomEvent_Source' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, K2Node_CustomEvent_Bullet) == 0x000158, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::K2Node_CustomEvent_Bullet' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, K2Node_CustomEvent_Target) == 0x000160, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, K2Node_CustomEvent_Ability) == 0x000168, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::K2Node_CustomEvent_Ability' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, K2Node_CustomEvent_effectiveDamage) == 0x000170, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::K2Node_CustomEvent_effectiveDamage' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, K2Node_CustomEvent_DamageValue) == 0x000178, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::K2Node_CustomEvent_DamageValue' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, CallFunc_IsActive_ReturnValue) == 0x0002B0, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x0002B4, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x0002B8, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf, CallFunc_CacheDynamicMaterials_DynamicMaterials) == 0x0002C0, "Member 'BP_TerrorWolf_C_ExecuteUbergraph_BP_TerrorWolf::CallFunc_CacheDynamicMaterials_DynamicMaterials' has a wrong offset!");

// Function BP_TerrorWolf.BP_TerrorWolf_C.BPDamageTakenEvent_Event_0
// 0x0160 (0x0160 - 0x0000)
struct BP_TerrorWolf_C_BPDamageTakenEvent_Event_0 final
{
public:
	class UAbilityController*                     Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     Bullet;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     Target;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           Ability;                                           // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         effectiveDamage;                                   // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageValue                           DamageValue;                                       // 0x0028(0x0138)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_TerrorWolf_C_BPDamageTakenEvent_Event_0) == 0x000008, "Wrong alignment on BP_TerrorWolf_C_BPDamageTakenEvent_Event_0");
static_assert(sizeof(BP_TerrorWolf_C_BPDamageTakenEvent_Event_0) == 0x000160, "Wrong size on BP_TerrorWolf_C_BPDamageTakenEvent_Event_0");
static_assert(offsetof(BP_TerrorWolf_C_BPDamageTakenEvent_Event_0, Source) == 0x000000, "Member 'BP_TerrorWolf_C_BPDamageTakenEvent_Event_0::Source' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_BPDamageTakenEvent_Event_0, Bullet) == 0x000008, "Member 'BP_TerrorWolf_C_BPDamageTakenEvent_Event_0::Bullet' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_BPDamageTakenEvent_Event_0, Target) == 0x000010, "Member 'BP_TerrorWolf_C_BPDamageTakenEvent_Event_0::Target' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_BPDamageTakenEvent_Event_0, Ability) == 0x000018, "Member 'BP_TerrorWolf_C_BPDamageTakenEvent_Event_0::Ability' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_BPDamageTakenEvent_Event_0, effectiveDamage) == 0x000020, "Member 'BP_TerrorWolf_C_BPDamageTakenEvent_Event_0::effectiveDamage' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_BPDamageTakenEvent_Event_0, DamageValue) == 0x000028, "Member 'BP_TerrorWolf_C_BPDamageTakenEvent_Event_0::DamageValue' has a wrong offset!");

// Function BP_TerrorWolf.BP_TerrorWolf_C.AbilityEnd
// 0x0008 (0x0008 - 0x0000)
struct BP_TerrorWolf_C_AbilityEnd final
{
public:
	class UAbilityBase*                           pAbility;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TerrorWolf_C_AbilityEnd) == 0x000008, "Wrong alignment on BP_TerrorWolf_C_AbilityEnd");
static_assert(sizeof(BP_TerrorWolf_C_AbilityEnd) == 0x000008, "Wrong size on BP_TerrorWolf_C_AbilityEnd");
static_assert(offsetof(BP_TerrorWolf_C_AbilityEnd, pAbility) == 0x000000, "Member 'BP_TerrorWolf_C_AbilityEnd::pAbility' has a wrong offset!");

// Function BP_TerrorWolf.BP_TerrorWolf_C.AbilityStart
// 0x0010 (0x0010 - 0x0000)
struct BP_TerrorWolf_C_AbilityStart final
{
public:
	class UAbilityBase*                           pAbility;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDesired;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TerrorWolf_C_AbilityStart) == 0x000008, "Wrong alignment on BP_TerrorWolf_C_AbilityStart");
static_assert(sizeof(BP_TerrorWolf_C_AbilityStart) == 0x000010, "Wrong size on BP_TerrorWolf_C_AbilityStart");
static_assert(offsetof(BP_TerrorWolf_C_AbilityStart, pAbility) == 0x000000, "Member 'BP_TerrorWolf_C_AbilityStart::pAbility' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_AbilityStart, bDesired) == 0x000008, "Member 'BP_TerrorWolf_C_AbilityStart::bDesired' has a wrong offset!");

// Function BP_TerrorWolf.BP_TerrorWolf_C.OnKilled_Event_0
// 0x0010 (0x0010 - 0x0000)
struct BP_TerrorWolf_C_OnKilled_Event_0 final
{
public:
	class UObject*                                Killer;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     KillerAbilityController;                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TerrorWolf_C_OnKilled_Event_0) == 0x000008, "Wrong alignment on BP_TerrorWolf_C_OnKilled_Event_0");
static_assert(sizeof(BP_TerrorWolf_C_OnKilled_Event_0) == 0x000010, "Wrong size on BP_TerrorWolf_C_OnKilled_Event_0");
static_assert(offsetof(BP_TerrorWolf_C_OnKilled_Event_0, Killer) == 0x000000, "Member 'BP_TerrorWolf_C_OnKilled_Event_0::Killer' has a wrong offset!");
static_assert(offsetof(BP_TerrorWolf_C_OnKilled_Event_0, KillerAbilityController) == 0x000008, "Member 'BP_TerrorWolf_C_OnKilled_Event_0::KillerAbilityController' has a wrong offset!");

}

