#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TimedDeathDissolve_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TimedDeathDissolve_VisualEntity.BP_TimedDeathDissolve_VisualEntity_C
// 0x0020 (0x0370 - 0x0350)
class ABP_TimedDeathDissolve_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CharacterDissolvedTimer;                           // 0x0360(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           NiagaraDeactivateTimer;                            // 0x0368(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void VisualEntityConstructionFinished();
	void ExecuteUbergraph_BP_TimedDeathDissolve_VisualEntity(int32 EntryPoint);
	void OnKill();
	void SetNiagaraSettings(class UNiagaraSystem* InAsset, float ParticleDensity, float EffectTime);
	void Deactivate();
	void CallCharacterDissolved(float AtTime);
	void CharacterDissolved();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TimedDeathDissolve_VisualEntity_C">();
	}
	static class ABP_TimedDeathDissolve_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TimedDeathDissolve_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_TimedDeathDissolve_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_TimedDeathDissolve_VisualEntity_C");
static_assert(sizeof(ABP_TimedDeathDissolve_VisualEntity_C) == 0x000370, "Wrong size on ABP_TimedDeathDissolve_VisualEntity_C");
static_assert(offsetof(ABP_TimedDeathDissolve_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_TimedDeathDissolve_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TimedDeathDissolve_VisualEntity_C, Niagara) == 0x000358, "Member 'ABP_TimedDeathDissolve_VisualEntity_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_TimedDeathDissolve_VisualEntity_C, CharacterDissolvedTimer) == 0x000360, "Member 'ABP_TimedDeathDissolve_VisualEntity_C::CharacterDissolvedTimer' has a wrong offset!");
static_assert(offsetof(ABP_TimedDeathDissolve_VisualEntity_C, NiagaraDeactivateTimer) == 0x000368, "Member 'ABP_TimedDeathDissolve_VisualEntity_C::NiagaraDeactivateTimer' has a wrong offset!");

}

