#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TargetDummyQuest2

#include "Basic.hpp"

#include "man_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TargetDummyQuest2.BP_TargetDummyQuest2_C.ExecuteUbergraph_BP_TargetDummyQuest2
// 0x03A0 (0x03A0 - 0x0000)
struct BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActorSoul* Source, class AActorSoul* Target, class UAbilityBase* Ability, class UAnimID* Anim, float effectiveDamage, const struct FDamageValue& OriginalDamageValue, const struct FDamageValue& DamageValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActorSoul*                             K2Node_CustomEvent_Source;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActorSoul*                             K2Node_CustomEvent_Target;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           K2Node_CustomEvent_Ability;                        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimID*                                K2Node_CustomEvent_Anim;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_effectiveDamage;                // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageValue                           K2Node_CustomEvent_OriginalDamageValue;            // 0x0050(0x0138)(ContainsInstancedReference)
	struct FDamageValue                           K2Node_CustomEvent_DamageValue;                    // 0x0188(0x0138)(ContainsInstancedReference)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sin_ReturnValue;                          // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sin_ReturnValue_1;                        // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sin_ReturnValue_2;                        // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0314(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2) == 0x000008, "Wrong alignment on BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2");
static_assert(sizeof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2) == 0x0003A0, "Wrong size on BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, EntryPoint) == 0x000000, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, CallFunc_RandomFloatInRange_ReturnValue) == 0x000014, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000018, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x00001C, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000020, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, K2Node_CustomEvent_Source) == 0x000028, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::K2Node_CustomEvent_Source' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, K2Node_CustomEvent_Target) == 0x000030, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, K2Node_CustomEvent_Ability) == 0x000038, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::K2Node_CustomEvent_Ability' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, K2Node_CustomEvent_Anim) == 0x000040, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::K2Node_CustomEvent_Anim' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, K2Node_CustomEvent_effectiveDamage) == 0x000048, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::K2Node_CustomEvent_effectiveDamage' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, K2Node_CustomEvent_OriginalDamageValue) == 0x000050, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::K2Node_CustomEvent_OriginalDamageValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, K2Node_CustomEvent_DamageValue) == 0x000188, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::K2Node_CustomEvent_DamageValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0002C0, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, K2Node_Event_DeltaSeconds) == 0x0002C4, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, CallFunc_Add_FloatFloat_ReturnValue) == 0x0002C8, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0002CC, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0002D0, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0002D4, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, CallFunc_Sin_ReturnValue) == 0x0002D8, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::CallFunc_Sin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, CallFunc_Sin_ReturnValue_1) == 0x0002DC, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::CallFunc_Sin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0002E0, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x0002E4, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0002E8, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x0002EC, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x0002F0, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, CallFunc_Sin_ReturnValue_2) == 0x0002F4, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::CallFunc_Sin_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0002F8, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x0002FC, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x000300, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, CallFunc_Multiply_FloatFloat_ReturnValue_7) == 0x000304, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::CallFunc_Multiply_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, CallFunc_MakeRotator_ReturnValue) == 0x000308, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000314, "Member 'BP_TargetDummyQuest2_C_ExecuteUbergraph_BP_TargetDummyQuest2::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

// Function BP_TargetDummyQuest2.BP_TargetDummyQuest2_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_TargetDummyQuest2_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TargetDummyQuest2_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_TargetDummyQuest2_C_ReceiveTick");
static_assert(sizeof(BP_TargetDummyQuest2_C_ReceiveTick) == 0x000004, "Wrong size on BP_TargetDummyQuest2_C_ReceiveTick");
static_assert(offsetof(BP_TargetDummyQuest2_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_TargetDummyQuest2_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_TargetDummyQuest2.BP_TargetDummyQuest2_C.CustomDamageReceivedEvent
// 0x0298 (0x0298 - 0x0000)
struct BP_TargetDummyQuest2_C_CustomDamageReceivedEvent final
{
public:
	class AActorSoul*                             Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActorSoul*                             Target;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           Ability;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimID*                                Anim;                                              // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         effectiveDamage;                                   // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageValue                           OriginalDamageValue;                               // 0x0028(0x0138)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FDamageValue                           DamageValue;                                       // 0x0160(0x0138)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_TargetDummyQuest2_C_CustomDamageReceivedEvent) == 0x000008, "Wrong alignment on BP_TargetDummyQuest2_C_CustomDamageReceivedEvent");
static_assert(sizeof(BP_TargetDummyQuest2_C_CustomDamageReceivedEvent) == 0x000298, "Wrong size on BP_TargetDummyQuest2_C_CustomDamageReceivedEvent");
static_assert(offsetof(BP_TargetDummyQuest2_C_CustomDamageReceivedEvent, Source) == 0x000000, "Member 'BP_TargetDummyQuest2_C_CustomDamageReceivedEvent::Source' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_CustomDamageReceivedEvent, Target) == 0x000008, "Member 'BP_TargetDummyQuest2_C_CustomDamageReceivedEvent::Target' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_CustomDamageReceivedEvent, Ability) == 0x000010, "Member 'BP_TargetDummyQuest2_C_CustomDamageReceivedEvent::Ability' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_CustomDamageReceivedEvent, Anim) == 0x000018, "Member 'BP_TargetDummyQuest2_C_CustomDamageReceivedEvent::Anim' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_CustomDamageReceivedEvent, effectiveDamage) == 0x000020, "Member 'BP_TargetDummyQuest2_C_CustomDamageReceivedEvent::effectiveDamage' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_CustomDamageReceivedEvent, OriginalDamageValue) == 0x000028, "Member 'BP_TargetDummyQuest2_C_CustomDamageReceivedEvent::OriginalDamageValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest2_C_CustomDamageReceivedEvent, DamageValue) == 0x000160, "Member 'BP_TargetDummyQuest2_C_CustomDamageReceivedEvent::DamageValue' has a wrong offset!");

}

