#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TrainingSpearman1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TrainingSpearman1.BP_TrainingSpearman1_C
// 0x0040 (0x0818 - 0x07D8)
class ABP_TrainingSpearman1_C final : public AActorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak1;                                               // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Spear;                                             // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_TargetDummy;                                    // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Soldier;                                        // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SpeechBubbleComponent_C*            BP_SpeechBubbleComponent;                          // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_TrainingSpearman1(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TrainingSpearman1_C">();
	}
	static class ABP_TrainingSpearman1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TrainingSpearman1_C>();
	}
};
static_assert(alignof(ABP_TrainingSpearman1_C) == 0x000008, "Wrong alignment on ABP_TrainingSpearman1_C");
static_assert(sizeof(ABP_TrainingSpearman1_C) == 0x000818, "Wrong size on ABP_TrainingSpearman1_C");
static_assert(offsetof(ABP_TrainingSpearman1_C, UberGraphFrame) == 0x0007D8, "Member 'ABP_TrainingSpearman1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TrainingSpearman1_C, Ak1) == 0x0007E0, "Member 'ABP_TrainingSpearman1_C::Ak1' has a wrong offset!");
static_assert(offsetof(ABP_TrainingSpearman1_C, Ak) == 0x0007E8, "Member 'ABP_TrainingSpearman1_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_TrainingSpearman1_C, Spear) == 0x0007F0, "Member 'ABP_TrainingSpearman1_C::Spear' has a wrong offset!");
static_assert(offsetof(ABP_TrainingSpearman1_C, SK_TargetDummy) == 0x0007F8, "Member 'ABP_TrainingSpearman1_C::SK_TargetDummy' has a wrong offset!");
static_assert(offsetof(ABP_TrainingSpearman1_C, SK_Soldier) == 0x000800, "Member 'ABP_TrainingSpearman1_C::SK_Soldier' has a wrong offset!");
static_assert(offsetof(ABP_TrainingSpearman1_C, BP_SpeechBubbleComponent) == 0x000808, "Member 'ABP_TrainingSpearman1_C::BP_SpeechBubbleComponent' has a wrong offset!");
static_assert(offsetof(ABP_TrainingSpearman1_C, DefaultSceneRoot) == 0x000810, "Member 'ABP_TrainingSpearman1_C::DefaultSceneRoot' has a wrong offset!");

}

