#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Tab_Button_New

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Tab_Button_New.BP_Tab_Button_New_C
// 0x00B8 (0x0340 - 0x0288)
class UBP_Tab_Button_New_C final : public UTabButtonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideNewItemIcon;                                   // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ActiveAnim;                                        // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                ButtonFrame;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Caption;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Caption_Highlight;                                 // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Caption_Selected;                                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NewItemIcon;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectionIndicator;                                // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   CaptionText;                                       // 0x02D8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnPressed;                                         // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnReleased;                                        // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnHovered;                                         // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUnhovered;                                       // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_Tab_Button_New(int32 EntryPoint);
	void OnUnfocused(bool bAnimate);
	void OnFocused(bool bAnimate);
	void OnToggleNewItemWarning(bool bInVisible);
	void OnSetText(const class FText& Text);
	void OnSetEnabled(bool bInEnabled);
	void OnSetActive(bool bInIsActive);
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_2_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__ButtonFrame_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void SetCaption(const class FText& InCaptionText);
	void SetEnabled(bool InIsEnabled);
	void ToggleNewItemWarning(bool InVisible, bool InAnimate);
	void GetSeedFromCaption(float* OutSeed1, float* OutSeed2);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Tab_Button_New_C">();
	}
	static class UBP_Tab_Button_New_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Tab_Button_New_C>();
	}
};
static_assert(alignof(UBP_Tab_Button_New_C) == 0x000008, "Wrong alignment on UBP_Tab_Button_New_C");
static_assert(sizeof(UBP_Tab_Button_New_C) == 0x000340, "Wrong size on UBP_Tab_Button_New_C");
static_assert(offsetof(UBP_Tab_Button_New_C, UberGraphFrame) == 0x000288, "Member 'UBP_Tab_Button_New_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Tab_Button_New_C, HideNewItemIcon) == 0x000290, "Member 'UBP_Tab_Button_New_C::HideNewItemIcon' has a wrong offset!");
static_assert(offsetof(UBP_Tab_Button_New_C, HoverAnim) == 0x000298, "Member 'UBP_Tab_Button_New_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UBP_Tab_Button_New_C, ActiveAnim) == 0x0002A0, "Member 'UBP_Tab_Button_New_C::ActiveAnim' has a wrong offset!");
static_assert(offsetof(UBP_Tab_Button_New_C, ButtonFrame) == 0x0002A8, "Member 'UBP_Tab_Button_New_C::ButtonFrame' has a wrong offset!");
static_assert(offsetof(UBP_Tab_Button_New_C, Caption) == 0x0002B0, "Member 'UBP_Tab_Button_New_C::Caption' has a wrong offset!");
static_assert(offsetof(UBP_Tab_Button_New_C, Caption_Highlight) == 0x0002B8, "Member 'UBP_Tab_Button_New_C::Caption_Highlight' has a wrong offset!");
static_assert(offsetof(UBP_Tab_Button_New_C, Caption_Selected) == 0x0002C0, "Member 'UBP_Tab_Button_New_C::Caption_Selected' has a wrong offset!");
static_assert(offsetof(UBP_Tab_Button_New_C, NewItemIcon) == 0x0002C8, "Member 'UBP_Tab_Button_New_C::NewItemIcon' has a wrong offset!");
static_assert(offsetof(UBP_Tab_Button_New_C, SelectionIndicator) == 0x0002D0, "Member 'UBP_Tab_Button_New_C::SelectionIndicator' has a wrong offset!");
static_assert(offsetof(UBP_Tab_Button_New_C, CaptionText) == 0x0002D8, "Member 'UBP_Tab_Button_New_C::CaptionText' has a wrong offset!");
static_assert(offsetof(UBP_Tab_Button_New_C, OnClicked) == 0x0002F0, "Member 'UBP_Tab_Button_New_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UBP_Tab_Button_New_C, OnPressed) == 0x000300, "Member 'UBP_Tab_Button_New_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UBP_Tab_Button_New_C, OnReleased) == 0x000310, "Member 'UBP_Tab_Button_New_C::OnReleased' has a wrong offset!");
static_assert(offsetof(UBP_Tab_Button_New_C, OnHovered) == 0x000320, "Member 'UBP_Tab_Button_New_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UBP_Tab_Button_New_C, OnUnhovered) == 0x000330, "Member 'UBP_Tab_Button_New_C::OnUnhovered' has a wrong offset!");

}

