#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TownfolkFemale01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TownfolkFemale01.BP_TownfolkFemale01_C
// 0x0030 (0x0808 - 0x07D8)
class ABP_TownfolkFemale01_C final : public AActorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CameraSphere;                                      // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh1;                                     // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SpeechBubbleComponent_C*            BP_SpeechBubbleComponent;                          // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_TownfolkFemale01(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TownfolkFemale01_C">();
	}
	static class ABP_TownfolkFemale01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TownfolkFemale01_C>();
	}
};
static_assert(alignof(ABP_TownfolkFemale01_C) == 0x000008, "Wrong alignment on ABP_TownfolkFemale01_C");
static_assert(sizeof(ABP_TownfolkFemale01_C) == 0x000808, "Wrong size on ABP_TownfolkFemale01_C");
static_assert(offsetof(ABP_TownfolkFemale01_C, UberGraphFrame) == 0x0007D8, "Member 'ABP_TownfolkFemale01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TownfolkFemale01_C, Ak) == 0x0007E0, "Member 'ABP_TownfolkFemale01_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_TownfolkFemale01_C, CameraSphere) == 0x0007E8, "Member 'ABP_TownfolkFemale01_C::CameraSphere' has a wrong offset!");
static_assert(offsetof(ABP_TownfolkFemale01_C, SkeletalMesh1) == 0x0007F0, "Member 'ABP_TownfolkFemale01_C::SkeletalMesh1' has a wrong offset!");
static_assert(offsetof(ABP_TownfolkFemale01_C, BP_SpeechBubbleComponent) == 0x0007F8, "Member 'ABP_TownfolkFemale01_C::BP_SpeechBubbleComponent' has a wrong offset!");
static_assert(offsetof(ABP_TownfolkFemale01_C, DefaultSceneRoot) == 0x000800, "Member 'ABP_TownfolkFemale01_C::DefaultSceneRoot' has a wrong offset!");

}

