#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TargetDummyQuest

#include "Basic.hpp"

#include "man_structs.hpp"


namespace SDK::Params
{

// Function BP_TargetDummyQuest.BP_TargetDummyQuest_C.ExecuteUbergraph_BP_TargetDummyQuest
// 0x0438 (0x0438 - 0x0000)
struct BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_IsClosedName_Variable;                 // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPathName_ReturnValue;                  // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    K2Node_DynamicCast_AsMandragora_Game_Mode;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ValidateManDoOnceAutogeneratedName_ReturnValue; // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UManConversationManager*                CallFunc_GetConversationManager_ReturnValue;       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GlobalDictionaryGetBool_OutValue;         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GlobalDictionaryGetBool_ReturnValue;      // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsReset_Variable;                        // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class FName EntryKey)>         Temp_delegate_Variable;                            // 0x00BC(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EntryKey)>         Temp_delegate_Variable_1;                          // 0x00CC(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(class AActorSoul* Source, class AActorSoul* Target, class UAbilityBase* Ability, class UAnimID* Anim, float effectiveDamage, const struct FDamageValue& OriginalDamageValue, const struct FDamageValue& DamageValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x00DC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EntryKey)>         Temp_delegate_Variable_2;                          // 0x00EC(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EntryKey)>         Temp_delegate_Variable_3;                          // 0x00FC(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPathName_ReturnValue_1;                // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GlobalDictionarySetBool_ReturnValue;      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Has_Been_Initd_Variable;               // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GlobalDictionarySetBool_ReturnValue_1;    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GlobalDictionarySetBool_ReturnValue_2;    // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GlobalDictionaryGetBool_OutValue_1;       // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GlobalDictionaryGetBool_ReturnValue_1;    // 0x0163(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class FName EntryKey)>         Temp_delegate_Variable_4;                          // 0x0164(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EntryKey)>         Temp_delegate_Variable_5;                          // 0x0174(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GlobalDictionarySetBool_ReturnValue_3;    // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GlobalDictionarySetBool_ReturnValue_4;    // 0x0185(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_186[0x2];                                      // 0x0186(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActorSoul*                             K2Node_CustomEvent_Source;                         // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActorSoul*                             K2Node_CustomEvent_Target;                         // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           K2Node_CustomEvent_Ability;                        // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimID*                                K2Node_CustomEvent_Anim;                           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_effectiveDamage;                // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageValue                           K2Node_CustomEvent_OriginalDamageValue;            // 0x01B8(0x0138)(ContainsInstancedReference)
	struct FDamageValue                           K2Node_CustomEvent_DamageValue;                    // 0x02F0(0x0138)(ContainsInstancedReference)
	class UManConversationManager*                CallFunc_GetConversationManager_ReturnValue_1;     // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0431(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GlobalDictionarySetBool_ReturnValue_5;    // 0x0432(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGlobalBool_ReturnValue;                // 0x0433(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest) == 0x000008, "Wrong alignment on BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest");
static_assert(sizeof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest) == 0x000438, "Wrong size on BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, EntryPoint) == 0x000000, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_MakeLiteralString_ReturnValue) == 0x000008, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, Temp_string_IsClosedName_Variable) == 0x000018, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::Temp_string_IsClosedName_Variable' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000038, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000048, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_Conv_StringToName_ReturnValue) == 0x000058, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_IsEmpty_ReturnValue) == 0x000060, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_GetPathName_ReturnValue) == 0x000068, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_GetPathName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_GetGameMode_ReturnValue) == 0x000078, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000080, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, K2Node_DynamicCast_AsMandragora_Game_Mode) == 0x000090, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::K2Node_DynamicCast_AsMandragora_Game_Mode' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_ValidateManDoOnceAutogeneratedName_ReturnValue) == 0x0000A0, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_ValidateManDoOnceAutogeneratedName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_GetConversationManager_ReturnValue) == 0x0000B0, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_GetConversationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_GlobalDictionaryGetBool_OutValue) == 0x0000B8, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_GlobalDictionaryGetBool_OutValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_GlobalDictionaryGetBool_ReturnValue) == 0x0000B9, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_GlobalDictionaryGetBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, Temp_bool_IsReset_Variable) == 0x0000BA, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::Temp_bool_IsReset_Variable' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_Not_PreBool_ReturnValue) == 0x0000BB, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, Temp_delegate_Variable) == 0x0000BC, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, Temp_delegate_Variable_1) == 0x0000CC, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, K2Node_CreateDelegate_OutputDelegate) == 0x0000DC, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, Temp_delegate_Variable_2) == 0x0000EC, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, Temp_delegate_Variable_3) == 0x0000FC, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_GetPathName_ReturnValue_1) == 0x000110, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_GetPathName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_GlobalDictionarySetBool_ReturnValue) == 0x000120, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_GlobalDictionarySetBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000128, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, Temp_string_Has_Been_Initd_Variable) == 0x000138, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::Temp_string_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000148, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000158, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_GlobalDictionarySetBool_ReturnValue_1) == 0x000160, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_GlobalDictionarySetBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_GlobalDictionarySetBool_ReturnValue_2) == 0x000161, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_GlobalDictionarySetBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_GlobalDictionaryGetBool_OutValue_1) == 0x000162, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_GlobalDictionaryGetBool_OutValue_1' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_GlobalDictionaryGetBool_ReturnValue_1) == 0x000163, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_GlobalDictionaryGetBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, Temp_delegate_Variable_4) == 0x000164, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::Temp_delegate_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, Temp_delegate_Variable_5) == 0x000174, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::Temp_delegate_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_GlobalDictionarySetBool_ReturnValue_3) == 0x000184, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_GlobalDictionarySetBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_GlobalDictionarySetBool_ReturnValue_4) == 0x000185, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_GlobalDictionarySetBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, K2Node_Event_DeltaSeconds) == 0x000188, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, K2Node_CustomEvent_Source) == 0x000190, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::K2Node_CustomEvent_Source' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, K2Node_CustomEvent_Target) == 0x000198, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, K2Node_CustomEvent_Ability) == 0x0001A0, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::K2Node_CustomEvent_Ability' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, K2Node_CustomEvent_Anim) == 0x0001A8, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::K2Node_CustomEvent_Anim' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, K2Node_CustomEvent_effectiveDamage) == 0x0001B0, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::K2Node_CustomEvent_effectiveDamage' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, K2Node_CustomEvent_OriginalDamageValue) == 0x0001B8, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::K2Node_CustomEvent_OriginalDamageValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, K2Node_CustomEvent_DamageValue) == 0x0002F0, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::K2Node_CustomEvent_DamageValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_GetConversationManager_ReturnValue_1) == 0x000428, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_GetConversationManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000430, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_IsValid_ReturnValue) == 0x000431, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_GlobalDictionarySetBool_ReturnValue_5) == 0x000432, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_GlobalDictionarySetBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest, CallFunc_GetGlobalBool_ReturnValue) == 0x000433, "Member 'BP_TargetDummyQuest_C_ExecuteUbergraph_BP_TargetDummyQuest::CallFunc_GetGlobalBool_ReturnValue' has a wrong offset!");

// Function BP_TargetDummyQuest.BP_TargetDummyQuest_C.CustomDamageReceivedEvent
// 0x0298 (0x0298 - 0x0000)
struct BP_TargetDummyQuest_C_CustomDamageReceivedEvent final
{
public:
	class AActorSoul*                             Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActorSoul*                             Target;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           Ability;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimID*                                Anim;                                              // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         effectiveDamage;                                   // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageValue                           OriginalDamageValue;                               // 0x0028(0x0138)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FDamageValue                           DamageValue;                                       // 0x0160(0x0138)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_TargetDummyQuest_C_CustomDamageReceivedEvent) == 0x000008, "Wrong alignment on BP_TargetDummyQuest_C_CustomDamageReceivedEvent");
static_assert(sizeof(BP_TargetDummyQuest_C_CustomDamageReceivedEvent) == 0x000298, "Wrong size on BP_TargetDummyQuest_C_CustomDamageReceivedEvent");
static_assert(offsetof(BP_TargetDummyQuest_C_CustomDamageReceivedEvent, Source) == 0x000000, "Member 'BP_TargetDummyQuest_C_CustomDamageReceivedEvent::Source' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_CustomDamageReceivedEvent, Target) == 0x000008, "Member 'BP_TargetDummyQuest_C_CustomDamageReceivedEvent::Target' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_CustomDamageReceivedEvent, Ability) == 0x000010, "Member 'BP_TargetDummyQuest_C_CustomDamageReceivedEvent::Ability' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_CustomDamageReceivedEvent, Anim) == 0x000018, "Member 'BP_TargetDummyQuest_C_CustomDamageReceivedEvent::Anim' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_CustomDamageReceivedEvent, effectiveDamage) == 0x000020, "Member 'BP_TargetDummyQuest_C_CustomDamageReceivedEvent::effectiveDamage' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_CustomDamageReceivedEvent, OriginalDamageValue) == 0x000028, "Member 'BP_TargetDummyQuest_C_CustomDamageReceivedEvent::OriginalDamageValue' has a wrong offset!");
static_assert(offsetof(BP_TargetDummyQuest_C_CustomDamageReceivedEvent, DamageValue) == 0x000160, "Member 'BP_TargetDummyQuest_C_CustomDamageReceivedEvent::DamageValue' has a wrong offset!");

// Function BP_TargetDummyQuest.BP_TargetDummyQuest_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_TargetDummyQuest_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TargetDummyQuest_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_TargetDummyQuest_C_ReceiveTick");
static_assert(sizeof(BP_TargetDummyQuest_C_ReceiveTick) == 0x000004, "Wrong size on BP_TargetDummyQuest_C_ReceiveTick");
static_assert(offsetof(BP_TargetDummyQuest_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_TargetDummyQuest_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

