#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TownfolkMale04

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TownfolkMale04.BP_TownfolkMale04_C
// 0x0028 (0x0800 - 0x07D8)
class ABP_TownfolkMale04_C final : public AActorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       CameraSphere;                                      // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh1;                                     // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SpeechBubbleComponent_C*            BP_SpeechBubbleComponent;                          // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_TownfolkMale04(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TownfolkMale04_C">();
	}
	static class ABP_TownfolkMale04_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TownfolkMale04_C>();
	}
};
static_assert(alignof(ABP_TownfolkMale04_C) == 0x000008, "Wrong alignment on ABP_TownfolkMale04_C");
static_assert(sizeof(ABP_TownfolkMale04_C) == 0x000800, "Wrong size on ABP_TownfolkMale04_C");
static_assert(offsetof(ABP_TownfolkMale04_C, UberGraphFrame) == 0x0007D8, "Member 'ABP_TownfolkMale04_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TownfolkMale04_C, CameraSphere) == 0x0007E0, "Member 'ABP_TownfolkMale04_C::CameraSphere' has a wrong offset!");
static_assert(offsetof(ABP_TownfolkMale04_C, SkeletalMesh1) == 0x0007E8, "Member 'ABP_TownfolkMale04_C::SkeletalMesh1' has a wrong offset!");
static_assert(offsetof(ABP_TownfolkMale04_C, BP_SpeechBubbleComponent) == 0x0007F0, "Member 'ABP_TownfolkMale04_C::BP_SpeechBubbleComponent' has a wrong offset!");
static_assert(offsetof(ABP_TownfolkMale04_C, DefaultSceneRoot) == 0x0007F8, "Member 'ABP_TownfolkMale04_C::DefaultSceneRoot' has a wrong offset!");

}

