#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TutorialPrompt

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_TutorialPrompt.BP_TutorialPrompt_C.Hide
// 0x0008 (0x0008 - 0x0000)
struct BP_TutorialPrompt_C_Hide final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialPrompt_C_Hide) == 0x000008, "Wrong alignment on BP_TutorialPrompt_C_Hide");
static_assert(sizeof(BP_TutorialPrompt_C_Hide) == 0x000008, "Wrong size on BP_TutorialPrompt_C_Hide");
static_assert(offsetof(BP_TutorialPrompt_C_Hide, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'BP_TutorialPrompt_C_Hide::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BP_TutorialPrompt.BP_TutorialPrompt_C.Show
// 0x0010 (0x0010 - 0x0000)
struct BP_TutorialPrompt_C_Show final
{
public:
	class ABP_TutorialPromptActor_C*              InTutorialPromptActor;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialPrompt_C_Show) == 0x000008, "Wrong alignment on BP_TutorialPrompt_C_Show");
static_assert(sizeof(BP_TutorialPrompt_C_Show) == 0x000010, "Wrong size on BP_TutorialPrompt_C_Show");
static_assert(offsetof(BP_TutorialPrompt_C_Show, InTutorialPromptActor) == 0x000000, "Member 'BP_TutorialPrompt_C_Show::InTutorialPromptActor' has a wrong offset!");
static_assert(offsetof(BP_TutorialPrompt_C_Show, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'BP_TutorialPrompt_C_Show::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BP_TutorialPrompt.BP_TutorialPrompt_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_TutorialPrompt_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialPrompt_C_Tick) == 0x000004, "Wrong alignment on BP_TutorialPrompt_C_Tick");
static_assert(sizeof(BP_TutorialPrompt_C_Tick) == 0x00003C, "Wrong size on BP_TutorialPrompt_C_Tick");
static_assert(offsetof(BP_TutorialPrompt_C_Tick, MyGeometry) == 0x000000, "Member 'BP_TutorialPrompt_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_TutorialPrompt_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_TutorialPrompt_C_Tick::InDeltaTime' has a wrong offset!");

// Function BP_TutorialPrompt.BP_TutorialPrompt_C.ExecuteUbergraph_BP_TutorialPrompt
// 0x0040 (0x0040 - 0x0000)
struct BP_TutorialPrompt_C_ExecuteUbergraph_BP_TutorialPrompt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialPrompt_C_ExecuteUbergraph_BP_TutorialPrompt) == 0x000004, "Wrong alignment on BP_TutorialPrompt_C_ExecuteUbergraph_BP_TutorialPrompt");
static_assert(sizeof(BP_TutorialPrompt_C_ExecuteUbergraph_BP_TutorialPrompt) == 0x000040, "Wrong size on BP_TutorialPrompt_C_ExecuteUbergraph_BP_TutorialPrompt");
static_assert(offsetof(BP_TutorialPrompt_C_ExecuteUbergraph_BP_TutorialPrompt, EntryPoint) == 0x000000, "Member 'BP_TutorialPrompt_C_ExecuteUbergraph_BP_TutorialPrompt::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TutorialPrompt_C_ExecuteUbergraph_BP_TutorialPrompt, K2Node_Event_MyGeometry) == 0x000004, "Member 'BP_TutorialPrompt_C_ExecuteUbergraph_BP_TutorialPrompt::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_TutorialPrompt_C_ExecuteUbergraph_BP_TutorialPrompt, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'BP_TutorialPrompt_C_ExecuteUbergraph_BP_TutorialPrompt::K2Node_Event_InDeltaTime' has a wrong offset!");

}

