#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TEMP_BeamRayLaserLine_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TEMP_BeamRayLaserLine_VisualEntity.BP_TEMP_BeamRayLaserLine_VisualEntity_C
// 0x0020 (0x0370 - 0x0350)
class ABP_TEMP_BeamRayLaserLine_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_TEMP_BeamRayLaserLine;                          // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAISupportedBeamAbility*                BeamAbility;                                       // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UpdateOnTick;                                      // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_TEMP_BeamRayLaserLine_VisualEntity(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void OnKill();
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TEMP_BeamRayLaserLine_VisualEntity_C">();
	}
	static class ABP_TEMP_BeamRayLaserLine_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TEMP_BeamRayLaserLine_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_TEMP_BeamRayLaserLine_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_TEMP_BeamRayLaserLine_VisualEntity_C");
static_assert(sizeof(ABP_TEMP_BeamRayLaserLine_VisualEntity_C) == 0x000370, "Wrong size on ABP_TEMP_BeamRayLaserLine_VisualEntity_C");
static_assert(offsetof(ABP_TEMP_BeamRayLaserLine_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_TEMP_BeamRayLaserLine_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TEMP_BeamRayLaserLine_VisualEntity_C, NS_TEMP_BeamRayLaserLine) == 0x000358, "Member 'ABP_TEMP_BeamRayLaserLine_VisualEntity_C::NS_TEMP_BeamRayLaserLine' has a wrong offset!");
static_assert(offsetof(ABP_TEMP_BeamRayLaserLine_VisualEntity_C, BeamAbility) == 0x000360, "Member 'ABP_TEMP_BeamRayLaserLine_VisualEntity_C::BeamAbility' has a wrong offset!");
static_assert(offsetof(ABP_TEMP_BeamRayLaserLine_VisualEntity_C, UpdateOnTick) == 0x000368, "Member 'ABP_TEMP_BeamRayLaserLine_VisualEntity_C::UpdateOnTick' has a wrong offset!");

}

