#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ThorndanceThorn

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ThorndanceThorn.BP_ThorndanceThorn_C.ExecuteUbergraph_BP_ThorndanceThorn
// 0x02E0 (0x02E0 - 0x0000)
struct BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0050(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DB[0x1];                                       // 0x00DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_168[0x8];                                      // 0x0168(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0170(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01A0(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x01D0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult_1;    // 0x0258(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn) == 0x000010, "Wrong alignment on BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn");
static_assert(sizeof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn) == 0x0002E0, "Wrong size on BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, EntryPoint) == 0x000000, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000004, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, Temp_object_Variable) == 0x000010, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_PostEventAtLocation_ReturnValue) == 0x000020, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_GetManGameMode_ReturnValue) == 0x000028, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_GetManGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000030, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000038, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000044, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_LineTraceSingle_OutHit) == 0x000050, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_LineTraceSingle_ReturnValue) == 0x0000D8, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_BreakHitResult_bBlockingHit) == 0x0000D9, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000DA, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_BreakHitResult_Time) == 0x0000DC, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_BreakHitResult_Distance) == 0x0000E0, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_BreakHitResult_Location) == 0x0000E4, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_BreakHitResult_ImpactPoint) == 0x0000F0, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_BreakHitResult_Normal) == 0x0000FC, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_BreakHitResult_ImpactNormal) == 0x000108, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_BreakHitResult_PhysMat) == 0x000118, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_BreakHitResult_HitActor) == 0x000120, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_BreakHitResult_HitComponent) == 0x000128, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_BreakHitResult_HitBoneName) == 0x000130, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_BreakHitResult_HitItem) == 0x000138, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_BreakHitResult_ElementIndex) == 0x00013C, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_BreakHitResult_FaceIndex) == 0x000140, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_BreakHitResult_TraceStart) == 0x000144, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_BreakHitResult_TraceEnd) == 0x000150, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_MakeRotFromZ_ReturnValue) == 0x00015C, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_MakeRotFromZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000170, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_MakeTransform_ReturnValue) == 0x0001A0, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x0001D0, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn, CallFunc_K2_SetWorldTransform_SweepHitResult_1) == 0x000258, "Member 'BP_ThorndanceThorn_C_ExecuteUbergraph_BP_ThorndanceThorn::CallFunc_K2_SetWorldTransform_SweepHitResult_1' has a wrong offset!");

}

