#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TimedDeathDissolve_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_TimedDeathDissolve_VisualEntity.BP_TimedDeathDissolve_VisualEntity_C.ExecuteUbergraph_BP_TimedDeathDissolve_VisualEntity
// 0x0030 (0x0030 - 0x0000)
struct BP_TimedDeathDissolve_VisualEntity_C_ExecuteUbergraph_BP_TimedDeathDissolve_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0010(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimedDeathDissolve_VisualEntity_C_ExecuteUbergraph_BP_TimedDeathDissolve_VisualEntity) == 0x000008, "Wrong alignment on BP_TimedDeathDissolve_VisualEntity_C_ExecuteUbergraph_BP_TimedDeathDissolve_VisualEntity");
static_assert(sizeof(BP_TimedDeathDissolve_VisualEntity_C_ExecuteUbergraph_BP_TimedDeathDissolve_VisualEntity) == 0x000030, "Wrong size on BP_TimedDeathDissolve_VisualEntity_C_ExecuteUbergraph_BP_TimedDeathDissolve_VisualEntity");
static_assert(offsetof(BP_TimedDeathDissolve_VisualEntity_C_ExecuteUbergraph_BP_TimedDeathDissolve_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_TimedDeathDissolve_VisualEntity_C_ExecuteUbergraph_BP_TimedDeathDissolve_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TimedDeathDissolve_VisualEntity_C_ExecuteUbergraph_BP_TimedDeathDissolve_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_TimedDeathDissolve_VisualEntity_C_ExecuteUbergraph_BP_TimedDeathDissolve_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimedDeathDissolve_VisualEntity_C_ExecuteUbergraph_BP_TimedDeathDissolve_VisualEntity, Temp_delegate_Variable) == 0x000010, "Member 'BP_TimedDeathDissolve_VisualEntity_C_ExecuteUbergraph_BP_TimedDeathDissolve_VisualEntity::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_TimedDeathDissolve_VisualEntity_C_ExecuteUbergraph_BP_TimedDeathDissolve_VisualEntity, K2Node_DynamicCast_AsCharacter_Base) == 0x000020, "Member 'BP_TimedDeathDissolve_VisualEntity_C_ExecuteUbergraph_BP_TimedDeathDissolve_VisualEntity::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_TimedDeathDissolve_VisualEntity_C_ExecuteUbergraph_BP_TimedDeathDissolve_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_TimedDeathDissolve_VisualEntity_C_ExecuteUbergraph_BP_TimedDeathDissolve_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TimedDeathDissolve_VisualEntity_C_ExecuteUbergraph_BP_TimedDeathDissolve_VisualEntity, CallFunc_PostEvent_ReturnValue) == 0x00002C, "Member 'BP_TimedDeathDissolve_VisualEntity_C_ExecuteUbergraph_BP_TimedDeathDissolve_VisualEntity::CallFunc_PostEvent_ReturnValue' has a wrong offset!");

// Function BP_TimedDeathDissolve_VisualEntity.BP_TimedDeathDissolve_VisualEntity_C.SetNiagaraSettings
// 0x0018 (0x0018 - 0x0000)
struct BP_TimedDeathDissolve_VisualEntity_C_SetNiagaraSettings final
{
public:
	class UNiagaraSystem*                         InAsset;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ParticleDensity;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EffectTime;                                        // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimedDeathDissolve_VisualEntity_C_SetNiagaraSettings) == 0x000008, "Wrong alignment on BP_TimedDeathDissolve_VisualEntity_C_SetNiagaraSettings");
static_assert(sizeof(BP_TimedDeathDissolve_VisualEntity_C_SetNiagaraSettings) == 0x000018, "Wrong size on BP_TimedDeathDissolve_VisualEntity_C_SetNiagaraSettings");
static_assert(offsetof(BP_TimedDeathDissolve_VisualEntity_C_SetNiagaraSettings, InAsset) == 0x000000, "Member 'BP_TimedDeathDissolve_VisualEntity_C_SetNiagaraSettings::InAsset' has a wrong offset!");
static_assert(offsetof(BP_TimedDeathDissolve_VisualEntity_C_SetNiagaraSettings, ParticleDensity) == 0x000008, "Member 'BP_TimedDeathDissolve_VisualEntity_C_SetNiagaraSettings::ParticleDensity' has a wrong offset!");
static_assert(offsetof(BP_TimedDeathDissolve_VisualEntity_C_SetNiagaraSettings, EffectTime) == 0x00000C, "Member 'BP_TimedDeathDissolve_VisualEntity_C_SetNiagaraSettings::EffectTime' has a wrong offset!");
static_assert(offsetof(BP_TimedDeathDissolve_VisualEntity_C_SetNiagaraSettings, CallFunc_K2_SetTimer_ReturnValue) == 0x000010, "Member 'BP_TimedDeathDissolve_VisualEntity_C_SetNiagaraSettings::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function BP_TimedDeathDissolve_VisualEntity.BP_TimedDeathDissolve_VisualEntity_C.CallCharacterDissolved
// 0x0010 (0x0010 - 0x0000)
struct BP_TimedDeathDissolve_VisualEntity_C_CallCharacterDissolved final
{
public:
	float                                         AtTime;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimedDeathDissolve_VisualEntity_C_CallCharacterDissolved) == 0x000008, "Wrong alignment on BP_TimedDeathDissolve_VisualEntity_C_CallCharacterDissolved");
static_assert(sizeof(BP_TimedDeathDissolve_VisualEntity_C_CallCharacterDissolved) == 0x000010, "Wrong size on BP_TimedDeathDissolve_VisualEntity_C_CallCharacterDissolved");
static_assert(offsetof(BP_TimedDeathDissolve_VisualEntity_C_CallCharacterDissolved, AtTime) == 0x000000, "Member 'BP_TimedDeathDissolve_VisualEntity_C_CallCharacterDissolved::AtTime' has a wrong offset!");
static_assert(offsetof(BP_TimedDeathDissolve_VisualEntity_C_CallCharacterDissolved, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'BP_TimedDeathDissolve_VisualEntity_C_CallCharacterDissolved::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function BP_TimedDeathDissolve_VisualEntity.BP_TimedDeathDissolve_VisualEntity_C.CharacterDissolved
// 0x0018 (0x0018 - 0x0000)
struct BP_TimedDeathDissolve_VisualEntity_C_CharacterDissolved final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TimedDeathDissolve_VisualEntity_C_CharacterDissolved) == 0x000008, "Wrong alignment on BP_TimedDeathDissolve_VisualEntity_C_CharacterDissolved");
static_assert(sizeof(BP_TimedDeathDissolve_VisualEntity_C_CharacterDissolved) == 0x000018, "Wrong size on BP_TimedDeathDissolve_VisualEntity_C_CharacterDissolved");
static_assert(offsetof(BP_TimedDeathDissolve_VisualEntity_C_CharacterDissolved, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_TimedDeathDissolve_VisualEntity_C_CharacterDissolved::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimedDeathDissolve_VisualEntity_C_CharacterDissolved, K2Node_DynamicCast_AsCharacter_Base) == 0x000008, "Member 'BP_TimedDeathDissolve_VisualEntity_C_CharacterDissolved::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_TimedDeathDissolve_VisualEntity_C_CharacterDissolved, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_TimedDeathDissolve_VisualEntity_C_CharacterDissolved::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TimedDeathDissolve_VisualEntity_C_CharacterDissolved, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_TimedDeathDissolve_VisualEntity_C_CharacterDissolved::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

