#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UnstableTrailExplosion_VisualEntity

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_UnstableTrailExplosion_VisualEntity.BP_UnstableTrailExplosion_VisualEntity_C.ExecuteUbergraph_BP_UnstableTrailExplosion_VisualEntity
// 0x0028 (0x0028 - 0x0000)
struct BP_UnstableTrailExplosion_VisualEntity_C_ExecuteUbergraph_BP_UnstableTrailExplosion_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UnstableTrailExplosion_VisualEntity_C_ExecuteUbergraph_BP_UnstableTrailExplosion_VisualEntity) == 0x000004, "Wrong alignment on BP_UnstableTrailExplosion_VisualEntity_C_ExecuteUbergraph_BP_UnstableTrailExplosion_VisualEntity");
static_assert(sizeof(BP_UnstableTrailExplosion_VisualEntity_C_ExecuteUbergraph_BP_UnstableTrailExplosion_VisualEntity) == 0x000028, "Wrong size on BP_UnstableTrailExplosion_VisualEntity_C_ExecuteUbergraph_BP_UnstableTrailExplosion_VisualEntity");
static_assert(offsetof(BP_UnstableTrailExplosion_VisualEntity_C_ExecuteUbergraph_BP_UnstableTrailExplosion_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_UnstableTrailExplosion_VisualEntity_C_ExecuteUbergraph_BP_UnstableTrailExplosion_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrailExplosion_VisualEntity_C_ExecuteUbergraph_BP_UnstableTrailExplosion_VisualEntity, Temp_delegate_Variable) == 0x000004, "Member 'BP_UnstableTrailExplosion_VisualEntity_C_ExecuteUbergraph_BP_UnstableTrailExplosion_VisualEntity::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrailExplosion_VisualEntity_C_ExecuteUbergraph_BP_UnstableTrailExplosion_VisualEntity, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000014, "Member 'BP_UnstableTrailExplosion_VisualEntity_C_ExecuteUbergraph_BP_UnstableTrailExplosion_VisualEntity::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrailExplosion_VisualEntity_C_ExecuteUbergraph_BP_UnstableTrailExplosion_VisualEntity, CallFunc_PostEvent_ReturnValue) == 0x000020, "Member 'BP_UnstableTrailExplosion_VisualEntity_C_ExecuteUbergraph_BP_UnstableTrailExplosion_VisualEntity::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrailExplosion_VisualEntity_C_ExecuteUbergraph_BP_UnstableTrailExplosion_VisualEntity, CallFunc_PostEventAtLocation_ReturnValue) == 0x000024, "Member 'BP_UnstableTrailExplosion_VisualEntity_C_ExecuteUbergraph_BP_UnstableTrailExplosion_VisualEntity::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");

}

