#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UnopenableDoor_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_UnopenableDoor_Anim.BP_UnopenableDoor_Anim_C
// 0x0870 (0x0F10 - 0x06A0)
class UBP_UnopenableDoor_Anim_C final : public UAnimInstanceBase
{
public:
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0030)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x06D8(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0780(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0800(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0880(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0900(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0980(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0A00(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0AA8(0x0080)()
	struct FAnimNode_MirrorBones                  AnimGraphNode_MirrorBones;                         // 0x0B28(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0B70(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0CC8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0CF0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0D18(0x00A8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0DC0(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0EC8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0EE8(0x0020)()
	bool                                          IsOpen;                                            // 0x0F08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Mirrored;                                          // 0x0F09(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_UnopenableDoor_Anim_AnimGraphNode_ModifyBone_CE56D9C74F86C4806E7CB891EBA559B8();
	void OnAnimStartRequest(class UAnimID* AnimID);
	void ExecuteUbergraph_BP_UnopenableDoor_Anim(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UnopenableDoor_Anim_C">();
	}
	static class UBP_UnopenableDoor_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UnopenableDoor_Anim_C>();
	}
};
static_assert(alignof(UBP_UnopenableDoor_Anim_C) == 0x000010, "Wrong alignment on UBP_UnopenableDoor_Anim_C");
static_assert(sizeof(UBP_UnopenableDoor_Anim_C) == 0x000F10, "Wrong size on UBP_UnopenableDoor_Anim_C");
static_assert(offsetof(UBP_UnopenableDoor_Anim_C, UberGraphFrame) == 0x0006A0, "Member 'UBP_UnopenableDoor_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UnopenableDoor_Anim_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UBP_UnopenableDoor_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_UnopenableDoor_Anim_C, AnimGraphNode_BlendListByInt) == 0x0006D8, "Member 'UBP_UnopenableDoor_Anim_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UBP_UnopenableDoor_Anim_C, AnimGraphNode_SequencePlayer_5) == 0x000780, "Member 'UBP_UnopenableDoor_Anim_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UBP_UnopenableDoor_Anim_C, AnimGraphNode_SequencePlayer_4) == 0x000800, "Member 'UBP_UnopenableDoor_Anim_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UBP_UnopenableDoor_Anim_C, AnimGraphNode_SequencePlayer_3) == 0x000880, "Member 'UBP_UnopenableDoor_Anim_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UBP_UnopenableDoor_Anim_C, AnimGraphNode_SequencePlayer_2) == 0x000900, "Member 'UBP_UnopenableDoor_Anim_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_UnopenableDoor_Anim_C, AnimGraphNode_SequencePlayer_1) == 0x000980, "Member 'UBP_UnopenableDoor_Anim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_UnopenableDoor_Anim_C, AnimGraphNode_BlendListByBool_1) == 0x000A00, "Member 'UBP_UnopenableDoor_Anim_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UBP_UnopenableDoor_Anim_C, AnimGraphNode_SequencePlayer) == 0x000AA8, "Member 'UBP_UnopenableDoor_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBP_UnopenableDoor_Anim_C, AnimGraphNode_MirrorBones) == 0x000B28, "Member 'UBP_UnopenableDoor_Anim_C::AnimGraphNode_MirrorBones' has a wrong offset!");
static_assert(offsetof(UBP_UnopenableDoor_Anim_C, AnimGraphNode_SaveCachedPose) == 0x000B70, "Member 'UBP_UnopenableDoor_Anim_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UBP_UnopenableDoor_Anim_C, AnimGraphNode_UseCachedPose_1) == 0x000CC8, "Member 'UBP_UnopenableDoor_Anim_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UBP_UnopenableDoor_Anim_C, AnimGraphNode_UseCachedPose) == 0x000CF0, "Member 'UBP_UnopenableDoor_Anim_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UBP_UnopenableDoor_Anim_C, AnimGraphNode_BlendListByBool) == 0x000D18, "Member 'UBP_UnopenableDoor_Anim_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UBP_UnopenableDoor_Anim_C, AnimGraphNode_ModifyBone) == 0x000DC0, "Member 'UBP_UnopenableDoor_Anim_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UBP_UnopenableDoor_Anim_C, AnimGraphNode_LocalToComponentSpace) == 0x000EC8, "Member 'UBP_UnopenableDoor_Anim_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UBP_UnopenableDoor_Anim_C, AnimGraphNode_ComponentToLocalSpace) == 0x000EE8, "Member 'UBP_UnopenableDoor_Anim_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UBP_UnopenableDoor_Anim_C, IsOpen) == 0x000F08, "Member 'UBP_UnopenableDoor_Anim_C::IsOpen' has a wrong offset!");
static_assert(offsetof(UBP_UnopenableDoor_Anim_C, Mirrored) == 0x000F09, "Member 'UBP_UnopenableDoor_Anim_C::Mirrored' has a wrong offset!");

}

