#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UnstableTrail_Actor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_UnstableTrail_Actor.BP_UnstableTrail_Actor_C.ExecuteUbergraph_BP_UnstableTrail_Actor
// 0x0138 (0x0138 - 0x0000)
struct BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Msg;                            // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName Msg)>              K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0020(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0030(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(class FName Msg)>              K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_Msg_1;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByName_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0080(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValidDetonator_ReturnValue;             // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_1;        // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor) == 0x000008, "Wrong alignment on BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor");
static_assert(sizeof(BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor) == 0x000138, "Wrong size on BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor");
static_assert(offsetof(BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor, EntryPoint) == 0x000000, "Member 'BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor, K2Node_CustomEvent_Msg) == 0x000004, "Member 'BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor::K2Node_CustomEvent_Msg' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00000C, "Member 'BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor, Temp_delegate_Variable) == 0x000020, "Member 'BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor, Temp_delegate_Variable_1) == 0x000030, "Member 'BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor, K2Node_CustomEvent_Msg_1) == 0x000050, "Member 'BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor::K2Node_CustomEvent_Msg_1' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor, CallFunc_BPGetAbilityByName_ReturnValue) == 0x000058, "Member 'BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor::CallFunc_BPGetAbilityByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000060, "Member 'BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor, K2Node_ComponentBoundEvent_OtherActor) == 0x000068, "Member 'BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor, K2Node_ComponentBoundEvent_OtherComp) == 0x000070, "Member 'BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000078, "Member 'BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor, K2Node_ComponentBoundEvent_bFromSweep) == 0x00007C, "Member 'BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor, K2Node_ComponentBoundEvent_SweepResult) == 0x000080, "Member 'BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor, CallFunc_IsValidDetonator_ReturnValue) == 0x000108, "Member 'BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor::CallFunc_IsValidDetonator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor, CallFunc_PostAkEvent_ReturnValue) == 0x00010C, "Member 'BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000110, "Member 'BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor, CallFunc_PostAkEvent_ReturnValue_1) == 0x00011C, "Member 'BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor, CallFunc_PostEventAtLocation_ReturnValue) == 0x000120, "Member 'BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000124, "Member 'BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor, CallFunc_PostEventAtLocation_ReturnValue_1) == 0x000130, "Member 'BP_UnstableTrail_Actor_C_ExecuteUbergraph_BP_UnstableTrail_Actor::CallFunc_PostEventAtLocation_ReturnValue_1' has a wrong offset!");

// Function BP_UnstableTrail_Actor.BP_UnstableTrail_Actor_C.ExplodeEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_UnstableTrail_Actor_C_ExplodeEvent final
{
public:
	class FName                                   Msg;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UnstableTrail_Actor_C_ExplodeEvent) == 0x000004, "Wrong alignment on BP_UnstableTrail_Actor_C_ExplodeEvent");
static_assert(sizeof(BP_UnstableTrail_Actor_C_ExplodeEvent) == 0x000008, "Wrong size on BP_UnstableTrail_Actor_C_ExplodeEvent");
static_assert(offsetof(BP_UnstableTrail_Actor_C_ExplodeEvent, Msg) == 0x000000, "Member 'BP_UnstableTrail_Actor_C_ExplodeEvent::Msg' has a wrong offset!");

// Function BP_UnstableTrail_Actor.BP_UnstableTrail_Actor_C.BndEvt__BP_UnstableTrail_Actor_Capsule_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_UnstableTrail_Actor_C_BndEvt__BP_UnstableTrail_Actor_Capsule_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_UnstableTrail_Actor_C_BndEvt__BP_UnstableTrail_Actor_Capsule_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_UnstableTrail_Actor_C_BndEvt__BP_UnstableTrail_Actor_Capsule_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_UnstableTrail_Actor_C_BndEvt__BP_UnstableTrail_Actor_Capsule_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_UnstableTrail_Actor_C_BndEvt__BP_UnstableTrail_Actor_Capsule_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_UnstableTrail_Actor_C_BndEvt__BP_UnstableTrail_Actor_Capsule_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_UnstableTrail_Actor_C_BndEvt__BP_UnstableTrail_Actor_Capsule_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrail_Actor_C_BndEvt__BP_UnstableTrail_Actor_Capsule_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_UnstableTrail_Actor_C_BndEvt__BP_UnstableTrail_Actor_Capsule_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrail_Actor_C_BndEvt__BP_UnstableTrail_Actor_Capsule_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_UnstableTrail_Actor_C_BndEvt__BP_UnstableTrail_Actor_Capsule_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrail_Actor_C_BndEvt__BP_UnstableTrail_Actor_Capsule_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_UnstableTrail_Actor_C_BndEvt__BP_UnstableTrail_Actor_Capsule_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrail_Actor_C_BndEvt__BP_UnstableTrail_Actor_Capsule_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_UnstableTrail_Actor_C_BndEvt__BP_UnstableTrail_Actor_Capsule_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_UnstableTrail_Actor_C_BndEvt__BP_UnstableTrail_Actor_Capsule_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_UnstableTrail_Actor_C_BndEvt__BP_UnstableTrail_Actor_Capsule_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_UnstableTrail_Actor.BP_UnstableTrail_Actor_C.OnCustomMessage_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BP_UnstableTrail_Actor_C_OnCustomMessage_Event_0 final
{
public:
	class FName                                   Msg;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UnstableTrail_Actor_C_OnCustomMessage_Event_0) == 0x000004, "Wrong alignment on BP_UnstableTrail_Actor_C_OnCustomMessage_Event_0");
static_assert(sizeof(BP_UnstableTrail_Actor_C_OnCustomMessage_Event_0) == 0x000008, "Wrong size on BP_UnstableTrail_Actor_C_OnCustomMessage_Event_0");
static_assert(offsetof(BP_UnstableTrail_Actor_C_OnCustomMessage_Event_0, Msg) == 0x000000, "Member 'BP_UnstableTrail_Actor_C_OnCustomMessage_Event_0::Msg' has a wrong offset!");

}

