#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UseItemNotification

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UseItemNotification.BP_UseItemNotification_C
// 0x0050 (0x02C8 - 0x0278)
class UBP_UseItemNotification_C final : public UHUDNotificationUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HidePanel;                                         // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowPanel;                                         // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Bg;                                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CountText;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconFrame;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           HideTimerHandle;                                   // 0x02B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSmallScreen;                                     // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BP_UseItemNotification(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void SetData(const class FText& Param_Name_0, class UTexture2D* Icon_0, int32 Number);
	void ShowNotification(float Timeout);
	void HideNotification();
	void ToggleSmallScreen(bool InIsSmallScreen);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UseItemNotification_C">();
	}
	static class UBP_UseItemNotification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UseItemNotification_C>();
	}
};
static_assert(alignof(UBP_UseItemNotification_C) == 0x000008, "Wrong alignment on UBP_UseItemNotification_C");
static_assert(sizeof(UBP_UseItemNotification_C) == 0x0002C8, "Wrong size on UBP_UseItemNotification_C");
static_assert(offsetof(UBP_UseItemNotification_C, UberGraphFrame) == 0x000278, "Member 'UBP_UseItemNotification_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UseItemNotification_C, HidePanel) == 0x000280, "Member 'UBP_UseItemNotification_C::HidePanel' has a wrong offset!");
static_assert(offsetof(UBP_UseItemNotification_C, ShowPanel) == 0x000288, "Member 'UBP_UseItemNotification_C::ShowPanel' has a wrong offset!");
static_assert(offsetof(UBP_UseItemNotification_C, Bg) == 0x000290, "Member 'UBP_UseItemNotification_C::Bg' has a wrong offset!");
static_assert(offsetof(UBP_UseItemNotification_C, CountText) == 0x000298, "Member 'UBP_UseItemNotification_C::CountText' has a wrong offset!");
static_assert(offsetof(UBP_UseItemNotification_C, Icon) == 0x0002A0, "Member 'UBP_UseItemNotification_C::Icon' has a wrong offset!");
static_assert(offsetof(UBP_UseItemNotification_C, IconFrame) == 0x0002A8, "Member 'UBP_UseItemNotification_C::IconFrame' has a wrong offset!");
static_assert(offsetof(UBP_UseItemNotification_C, Name_0) == 0x0002B0, "Member 'UBP_UseItemNotification_C::Name_0' has a wrong offset!");
static_assert(offsetof(UBP_UseItemNotification_C, HideTimerHandle) == 0x0002B8, "Member 'UBP_UseItemNotification_C::HideTimerHandle' has a wrong offset!");
static_assert(offsetof(UBP_UseItemNotification_C, IsSmallScreen) == 0x0002C0, "Member 'UBP_UseItemNotification_C::IsSmallScreen' has a wrong offset!");

}

