#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UIHelpers

#include "Basic.hpp"

#include "man_structs.hpp"


namespace SDK::Params
{

// Function BP_UIHelpers.BP_UIHelpers_C.GetAllChildrenOfClass
// 0x0098 (0x0098 - 0x0000)
struct BP_UIHelpers_C_GetAllChildrenOfClass final
{
public:
	class UPanelWidget*                           ParentWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 WidgetClass;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UWidget*>                        TempArray;                                         // 0x0028(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           K2Node_DynamicCast_AsPanel_Widget;                 // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildrenOfClass_ReturnValue;        // 0x0078(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UIHelpers_C_GetAllChildrenOfClass) == 0x000008, "Wrong alignment on BP_UIHelpers_C_GetAllChildrenOfClass");
static_assert(sizeof(BP_UIHelpers_C_GetAllChildrenOfClass) == 0x000098, "Wrong size on BP_UIHelpers_C_GetAllChildrenOfClass");
static_assert(offsetof(BP_UIHelpers_C_GetAllChildrenOfClass, ParentWidget) == 0x000000, "Member 'BP_UIHelpers_C_GetAllChildrenOfClass::ParentWidget' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetAllChildrenOfClass, WidgetClass) == 0x000008, "Member 'BP_UIHelpers_C_GetAllChildrenOfClass::WidgetClass' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetAllChildrenOfClass, __WorldContext) == 0x000010, "Member 'BP_UIHelpers_C_GetAllChildrenOfClass::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetAllChildrenOfClass, ReturnValue) == 0x000018, "Member 'BP_UIHelpers_C_GetAllChildrenOfClass::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetAllChildrenOfClass, TempArray) == 0x000028, "Member 'BP_UIHelpers_C_GetAllChildrenOfClass::TempArray' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetAllChildrenOfClass, CallFunc_GetAllChildren_ReturnValue) == 0x000038, "Member 'BP_UIHelpers_C_GetAllChildrenOfClass::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetAllChildrenOfClass, Temp_int_Array_Index_Variable) == 0x000048, "Member 'BP_UIHelpers_C_GetAllChildrenOfClass::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetAllChildrenOfClass, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'BP_UIHelpers_C_GetAllChildrenOfClass::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetAllChildrenOfClass, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_UIHelpers_C_GetAllChildrenOfClass::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetAllChildrenOfClass, K2Node_DynamicCast_AsPanel_Widget) == 0x000058, "Member 'BP_UIHelpers_C_GetAllChildrenOfClass::K2Node_DynamicCast_AsPanel_Widget' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetAllChildrenOfClass, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_UIHelpers_C_GetAllChildrenOfClass::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetAllChildrenOfClass, CallFunc_GetObjectClass_ReturnValue) == 0x000068, "Member 'BP_UIHelpers_C_GetAllChildrenOfClass::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetAllChildrenOfClass, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BP_UIHelpers_C_GetAllChildrenOfClass::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetAllChildrenOfClass, Temp_int_Loop_Counter_Variable) == 0x000074, "Member 'BP_UIHelpers_C_GetAllChildrenOfClass::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetAllChildrenOfClass, CallFunc_GetAllChildrenOfClass_ReturnValue) == 0x000078, "Member 'BP_UIHelpers_C_GetAllChildrenOfClass::CallFunc_GetAllChildrenOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetAllChildrenOfClass, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'BP_UIHelpers_C_GetAllChildrenOfClass::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetAllChildrenOfClass, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'BP_UIHelpers_C_GetAllChildrenOfClass::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetAllChildrenOfClass, CallFunc_Array_Add_ReturnValue) == 0x000090, "Member 'BP_UIHelpers_C_GetAllChildrenOfClass::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetAllChildrenOfClass, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000094, "Member 'BP_UIHelpers_C_GetAllChildrenOfClass::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");

// Function BP_UIHelpers.BP_UIHelpers_C.ShowWidescreenEffect
// 0x0018 (0x0018 - 0x0000)
struct BP_UIHelpers_C_ShowWidescreenEffect final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManUserWidgetBase*                     CallFunc_ShowManUserWidgetByZorder_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIHelpers_C_ShowWidescreenEffect) == 0x000008, "Wrong alignment on BP_UIHelpers_C_ShowWidescreenEffect");
static_assert(sizeof(BP_UIHelpers_C_ShowWidescreenEffect) == 0x000018, "Wrong size on BP_UIHelpers_C_ShowWidescreenEffect");
static_assert(offsetof(BP_UIHelpers_C_ShowWidescreenEffect, AnimDuration) == 0x000000, "Member 'BP_UIHelpers_C_ShowWidescreenEffect::AnimDuration' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_ShowWidescreenEffect, __WorldContext) == 0x000008, "Member 'BP_UIHelpers_C_ShowWidescreenEffect::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_ShowWidescreenEffect, CallFunc_ShowManUserWidgetByZorder_ReturnValue) == 0x000010, "Member 'BP_UIHelpers_C_ShowWidescreenEffect::CallFunc_ShowManUserWidgetByZorder_ReturnValue' has a wrong offset!");

// Function BP_UIHelpers.BP_UIHelpers_C.HideWidescreenEffect
// 0x0018 (0x0018 - 0x0000)
struct BP_UIHelpers_C_HideWidescreenEffect final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManUserWidgetBase*                     CallFunc_GetManUserWidgetBase_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIHelpers_C_HideWidescreenEffect) == 0x000008, "Wrong alignment on BP_UIHelpers_C_HideWidescreenEffect");
static_assert(sizeof(BP_UIHelpers_C_HideWidescreenEffect) == 0x000018, "Wrong size on BP_UIHelpers_C_HideWidescreenEffect");
static_assert(offsetof(BP_UIHelpers_C_HideWidescreenEffect, AnimDuration) == 0x000000, "Member 'BP_UIHelpers_C_HideWidescreenEffect::AnimDuration' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_HideWidescreenEffect, __WorldContext) == 0x000008, "Member 'BP_UIHelpers_C_HideWidescreenEffect::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_HideWidescreenEffect, CallFunc_GetManUserWidgetBase_ReturnValue) == 0x000010, "Member 'BP_UIHelpers_C_HideWidescreenEffect::CallFunc_GetManUserWidgetBase_ReturnValue' has a wrong offset!");

// Function BP_UIHelpers.BP_UIHelpers_C.Set Hotkey Images
// 0x0050 (0x0050 - 0x0000)
struct BP_UIHelpers_C_Set_Hotkey_Images final
{
public:
	TArray<class UTexture2D*>                     HotkeyImages;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class UImage*>                         HotkeyIconUserWidgets;                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIHelpers_C_Set_Hotkey_Images) == 0x000008, "Wrong alignment on BP_UIHelpers_C_Set_Hotkey_Images");
static_assert(sizeof(BP_UIHelpers_C_Set_Hotkey_Images) == 0x000050, "Wrong size on BP_UIHelpers_C_Set_Hotkey_Images");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Images, HotkeyImages) == 0x000000, "Member 'BP_UIHelpers_C_Set_Hotkey_Images::HotkeyImages' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Images, HotkeyIconUserWidgets) == 0x000010, "Member 'BP_UIHelpers_C_Set_Hotkey_Images::HotkeyIconUserWidgets' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Images, __WorldContext) == 0x000020, "Member 'BP_UIHelpers_C_Set_Hotkey_Images::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Images, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_UIHelpers_C_Set_Hotkey_Images::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Images, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BP_UIHelpers_C_Set_Hotkey_Images::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Images, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_UIHelpers_C_Set_Hotkey_Images::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Images, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'BP_UIHelpers_C_Set_Hotkey_Images::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Images, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_UIHelpers_C_Set_Hotkey_Images::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Images, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'BP_UIHelpers_C_Set_Hotkey_Images::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Images, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000048, "Member 'BP_UIHelpers_C_Set_Hotkey_Images::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Images, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'BP_UIHelpers_C_Set_Hotkey_Images::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Images, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'BP_UIHelpers_C_Set_Hotkey_Images::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_UIHelpers.BP_UIHelpers_C.Set Hotkey Text
// 0x0098 (0x0098 - 0x0000)
struct BP_UIHelpers_C_Set_Hotkey_Text final
{
public:
	TArray<class FText>                           HotkeyTexts;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class UTextBlock*>                     HotkeyTextUserWidgets;                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UWidget*>                        HotkeyTextBorderUserWidgets;                       // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item_1;                         // 0x0058(0x0018)()
	class UTextBlock*                             CallFunc_Array_Get_Item_2;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item_3;                         // 0x0078(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UIHelpers_C_Set_Hotkey_Text) == 0x000008, "Wrong alignment on BP_UIHelpers_C_Set_Hotkey_Text");
static_assert(sizeof(BP_UIHelpers_C_Set_Hotkey_Text) == 0x000098, "Wrong size on BP_UIHelpers_C_Set_Hotkey_Text");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Text, HotkeyTexts) == 0x000000, "Member 'BP_UIHelpers_C_Set_Hotkey_Text::HotkeyTexts' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Text, HotkeyTextUserWidgets) == 0x000010, "Member 'BP_UIHelpers_C_Set_Hotkey_Text::HotkeyTextUserWidgets' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Text, HotkeyTextBorderUserWidgets) == 0x000020, "Member 'BP_UIHelpers_C_Set_Hotkey_Text::HotkeyTextBorderUserWidgets' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Text, __WorldContext) == 0x000030, "Member 'BP_UIHelpers_C_Set_Hotkey_Text::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Text, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_UIHelpers_C_Set_Hotkey_Text::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Text, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'BP_UIHelpers_C_Set_Hotkey_Text::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Text, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'BP_UIHelpers_C_Set_Hotkey_Text::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Text, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_UIHelpers_C_Set_Hotkey_Text::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Text, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_UIHelpers_C_Set_Hotkey_Text::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Text, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'BP_UIHelpers_C_Set_Hotkey_Text::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Text, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'BP_UIHelpers_C_Set_Hotkey_Text::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Text, CallFunc_Array_Get_Item_2) == 0x000070, "Member 'BP_UIHelpers_C_Set_Hotkey_Text::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Text, CallFunc_Array_Get_Item_3) == 0x000078, "Member 'BP_UIHelpers_C_Set_Hotkey_Text::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Text, CallFunc_TextIsEmpty_ReturnValue) == 0x000090, "Member 'BP_UIHelpers_C_Set_Hotkey_Text::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_Set_Hotkey_Text, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000091, "Member 'BP_UIHelpers_C_Set_Hotkey_Text::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function BP_UIHelpers.BP_UIHelpers_C.GetCurrencyIcon
// 0x0260 (0x0260 - 0x0000)
struct BP_UIHelpers_C_GetCurrencyIcon final
{
public:
	EHeroProperty                                 PropertyType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHeroProperty                                 Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_3;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_4;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_5;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_6;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_7;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_8;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_9;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_10;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_11;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_12;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_13;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_14;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_15;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_16;                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_17;                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_18;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_19;                           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_20;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_21;                           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_22;                           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_23;                           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_24;                           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_25;                           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_26;                           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_27;                           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_28;                           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_29;                           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_30;                           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_31;                           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_32;                           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_33;                           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_34;                           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_35;                           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_36;                           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_37;                           // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_38;                           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_39;                           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_40;                           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_41;                           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_42;                           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_43;                           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_44;                           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_45;                           // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_46;                           // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_47;                           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_48;                           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_49;                           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_50;                           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_51;                           // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_52;                           // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_53;                           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_54;                           // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_55;                           // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_56;                           // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_57;                           // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_58;                           // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_59;                           // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_60;                           // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_61;                           // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_62;                           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_63;                           // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_64;                           // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_65;                           // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_66;                           // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_67;                           // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_68;                           // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_69;                           // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_70;                           // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIHelpers_C_GetCurrencyIcon) == 0x000008, "Wrong alignment on BP_UIHelpers_C_GetCurrencyIcon");
static_assert(sizeof(BP_UIHelpers_C_GetCurrencyIcon) == 0x000260, "Wrong size on BP_UIHelpers_C_GetCurrencyIcon");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, PropertyType) == 0x000000, "Member 'BP_UIHelpers_C_GetCurrencyIcon::PropertyType' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, __WorldContext) == 0x000008, "Member 'BP_UIHelpers_C_GetCurrencyIcon::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, ReturnValue) == 0x000010, "Member 'BP_UIHelpers_C_GetCurrencyIcon::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_byte_Variable) == 0x000018, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable) == 0x000020, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_1) == 0x000028, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_2) == 0x000030, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_3) == 0x000038, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_4) == 0x000040, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_5) == 0x000048, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_6) == 0x000050, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_7) == 0x000058, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_8) == 0x000060, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_9) == 0x000068, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_10) == 0x000070, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_11) == 0x000078, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_12) == 0x000080, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_12' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_13) == 0x000088, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_13' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_14) == 0x000090, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_14' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_15) == 0x000098, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_15' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_16) == 0x0000A0, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_16' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_17) == 0x0000A8, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_17' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_18) == 0x0000B0, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_18' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_19) == 0x0000B8, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_19' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_20) == 0x0000C0, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_20' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_21) == 0x0000C8, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_21' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_22) == 0x0000D0, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_22' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_23) == 0x0000D8, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_23' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_24) == 0x0000E0, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_24' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_25) == 0x0000E8, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_25' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_26) == 0x0000F0, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_26' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_27) == 0x0000F8, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_27' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_28) == 0x000100, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_28' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_29) == 0x000108, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_29' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_30) == 0x000110, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_30' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_31) == 0x000118, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_31' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_32) == 0x000120, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_32' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_33) == 0x000128, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_33' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_34) == 0x000130, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_34' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_35) == 0x000138, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_35' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_36) == 0x000140, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_36' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_37) == 0x000148, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_37' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_38) == 0x000150, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_38' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_39) == 0x000158, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_39' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_40) == 0x000160, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_40' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_41) == 0x000168, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_41' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_42) == 0x000170, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_42' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_43) == 0x000178, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_43' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_44) == 0x000180, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_44' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_45) == 0x000188, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_45' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_46) == 0x000190, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_46' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_47) == 0x000198, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_47' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_48) == 0x0001A0, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_48' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_49) == 0x0001A8, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_49' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_50) == 0x0001B0, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_50' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_51) == 0x0001B8, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_51' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_52) == 0x0001C0, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_52' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_53) == 0x0001C8, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_53' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_54) == 0x0001D0, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_54' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_55) == 0x0001D8, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_55' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_56) == 0x0001E0, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_56' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_57) == 0x0001E8, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_57' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_58) == 0x0001F0, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_58' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_59) == 0x0001F8, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_59' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_60) == 0x000200, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_60' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_61) == 0x000208, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_61' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_62) == 0x000210, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_62' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_63) == 0x000218, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_63' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_64) == 0x000220, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_64' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_65) == 0x000228, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_65' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_66) == 0x000230, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_66' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_67) == 0x000238, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_67' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_68) == 0x000240, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_68' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_69) == 0x000248, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_69' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, Temp_object_Variable_70) == 0x000250, "Member 'BP_UIHelpers_C_GetCurrencyIcon::Temp_object_Variable_70' has a wrong offset!");
static_assert(offsetof(BP_UIHelpers_C_GetCurrencyIcon, K2Node_Select_Default) == 0x000258, "Member 'BP_UIHelpers_C_GetCurrencyIcon::K2Node_Select_Default' has a wrong offset!");

// Function BP_UIHelpers.BP_UIHelpers_C.GetCurrencyText
// 0x06F0 (0x06F0 - 0x0000)
struct BP_UIHelpers_C_GetCurrencyText final
{
public:
	EHeroProperty                                 PropertyType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm)
	EHeroProperty                                 Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0030(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0048(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0078(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0090(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x00A8(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x00C0(0x0018)()
	class FText                                   Temp_text_Variable_7;                              // 0x00D8(0x0018)()
	class FText                                   Temp_text_Variable_8;                              // 0x00F0(0x0018)()
	class FText                                   Temp_text_Variable_9;                              // 0x0108(0x0018)()
	class FText                                   Temp_text_Variable_10;                             // 0x0120(0x0018)()
	class FText                                   Temp_text_Variable_11;                             // 0x0138(0x0018)()
	class FText                                   Temp_text_Variable_12;                             // 0x0150(0x0018)()
	class FText                                   Temp_text_Variable_13;                             // 0x0168(0x0018)()
	class FText                                   Temp_text_Variable_14;                             // 0x0180(0x0018)()
	class FText                                   Temp_text_Variable_15;                             // 0x0198(0x0018)()
	class FText                                   Temp_text_Variable_16;                             // 0x01B0(0x0018)()
	class FText                                   Temp_text_Variable_17;                             // 0x01C8(0x0018)()
	class FText                                   Temp_text_Variable_18;                             // 0x01E0(0x0018)()
	class FText                                   Temp_text_Variable_19;                             // 0x01F8(0x0018)()
	class FText                                   Temp_text_Variable_20;                             // 0x0210(0x0018)()
	class FText                                   Temp_text_Variable_21;                             // 0x0228(0x0018)()
	class FText                                   Temp_text_Variable_22;                             // 0x0240(0x0018)()
	class FText                                   Temp_text_Variable_23;                             // 0x0258(0x0018)()
	class FText                                   Temp_text_Variable_24;                             // 0x0270(0x0018)()
	class FText                                   Temp_text_Variable_25;                             // 0x0288(0x0018)()
	class FText                                   Temp_text_Variable_26;                             // 0x02A0(0x0018)()
	class FText                                   Temp_text_Variable_27;                             // 0x02B8(0x0018)()
	class FText                                   Temp_text_Variable_28;                             // 0x02D0(0x0018)()
	class FText                                   Temp_text_Variable_29;                             // 0x02E8(0x0018)()
	class FText                                   Temp_text_Variable_30;                             // 0x0300(0x0018)()
	class FText                                   Temp_text_Variable_31;                             // 0x0318(0x0018)()
	class FText                                   Temp_text_Variable_32;                             // 0x0330(0x0018)()
	class FText                                   Temp_text_Variable_33;                             // 0x0348(0x0018)()
	class FText                                   Temp_text_Variable_34;                             // 0x0360(0x0018)()
	class FText                                   Temp_text_Variable_35;                             // 0x0378(0x0018)()
	class FText                                   Temp_text_Variable_36;                             // 0x0390(0x0018)()
	class FText                                   Temp_text_Variable_37;                             // 0x03A8(0x0018)()
	class FText                                   Temp_text_Variable_38;                             // 0x03C0(0x0018)()
	class FText                                   Temp_text_Variable_39;                             // 0x03D8(0x0018)()
	class FText                                   Temp_text_Variable_40;                             // 0x03F0(0x0018)()
	class FText                                   Temp_text_Variable_41;                             // 0x0408(0x0018)()
	class FText                                   Temp_text_Variable_42;                             // 0x0420(0x0018)()
	class FText                                   Temp_text_Variable_43;                             // 0x0438(0x0018)()
	class FText                                   Temp_text_Variable_44;                             // 0x0450(0x0018)()
	class FText                                   Temp_text_Variable_45;                             // 0x0468(0x0018)()
	class FText                                   Temp_text_Variable_46;                             // 0x0480(0x0018)()
	class FText                                   Temp_text_Variable_47;                             // 0x0498(0x0018)()
	class FText                                   Temp_text_Variable_48;                             // 0x04B0(0x0018)()
	class FText                                   Temp_text_Variable_49;                             // 0x04C8(0x0018)()
	class FText                                   Temp_text_Variable_50;                             // 0x04E0(0x0018)()
	class FText                                   Temp_text_Variable_51;                             // 0x04F8(0x0018)()
	class FText                                   Temp_text_Variable_52;                             // 0x0510(0x0018)()
	class FText                                   Temp_text_Variable_53;                             // 0x0528(0x0018)()
	class FText                                   Temp_text_Variable_54;                             // 0x0540(0x0018)()
	class FText                                   Temp_text_Variable_55;                             // 0x0558(0x0018)()
