#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VendorActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VendorActor.BP_VendorActor_C
// 0x0020 (0x08A0 - 0x0880)
class ABP_VendorActor_C : public AVendorActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0880(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UNpcAnimInstance*>               CachedInstances;                                   // 0x0890(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void DoStuff();
	void ChangeBridge();
	void ExecuteUbergraph_BP_VendorActor(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VendorActor_C">();
	}
	static class ABP_VendorActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VendorActor_C>();
	}
};
static_assert(alignof(ABP_VendorActor_C) == 0x000008, "Wrong alignment on ABP_VendorActor_C");
static_assert(sizeof(ABP_VendorActor_C) == 0x0008A0, "Wrong size on ABP_VendorActor_C");
static_assert(offsetof(ABP_VendorActor_C, UberGraphFrame) == 0x000880, "Member 'ABP_VendorActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_VendorActor_C, DefaultSceneRoot) == 0x000888, "Member 'ABP_VendorActor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_VendorActor_C, CachedInstances) == 0x000890, "Member 'ABP_VendorActor_C::CachedInstances' has a wrong offset!");

}

