#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VampireStriga

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_VampireStriga.BP_VampireStriga_C.ExecuteUbergraph_BP_VampireStriga
// 0x0018 (0x0018 - 0x0000)
struct BP_VampireStriga_C_ExecuteUbergraph_BP_VampireStriga final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Killer;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     K2Node_CustomEvent_KillerAbilityController;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VampireStriga_C_ExecuteUbergraph_BP_VampireStriga) == 0x000008, "Wrong alignment on BP_VampireStriga_C_ExecuteUbergraph_BP_VampireStriga");
static_assert(sizeof(BP_VampireStriga_C_ExecuteUbergraph_BP_VampireStriga) == 0x000018, "Wrong size on BP_VampireStriga_C_ExecuteUbergraph_BP_VampireStriga");
static_assert(offsetof(BP_VampireStriga_C_ExecuteUbergraph_BP_VampireStriga, EntryPoint) == 0x000000, "Member 'BP_VampireStriga_C_ExecuteUbergraph_BP_VampireStriga::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VampireStriga_C_ExecuteUbergraph_BP_VampireStriga, K2Node_CustomEvent_Killer) == 0x000008, "Member 'BP_VampireStriga_C_ExecuteUbergraph_BP_VampireStriga::K2Node_CustomEvent_Killer' has a wrong offset!");
static_assert(offsetof(BP_VampireStriga_C_ExecuteUbergraph_BP_VampireStriga, K2Node_CustomEvent_KillerAbilityController) == 0x000010, "Member 'BP_VampireStriga_C_ExecuteUbergraph_BP_VampireStriga::K2Node_CustomEvent_KillerAbilityController' has a wrong offset!");

// Function BP_VampireStriga.BP_VampireStriga_C.OnKilled_Event_0
// 0x0010 (0x0010 - 0x0000)
struct BP_VampireStriga_C_OnKilled_Event_0 final
{
public:
	class UObject*                                Killer;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     KillerAbilityController;                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VampireStriga_C_OnKilled_Event_0) == 0x000008, "Wrong alignment on BP_VampireStriga_C_OnKilled_Event_0");
static_assert(sizeof(BP_VampireStriga_C_OnKilled_Event_0) == 0x000010, "Wrong size on BP_VampireStriga_C_OnKilled_Event_0");
static_assert(offsetof(BP_VampireStriga_C_OnKilled_Event_0, Killer) == 0x000000, "Member 'BP_VampireStriga_C_OnKilled_Event_0::Killer' has a wrong offset!");
static_assert(offsetof(BP_VampireStriga_C_OnKilled_Event_0, KillerAbilityController) == 0x000008, "Member 'BP_VampireStriga_C_OnKilled_Event_0::KillerAbilityController' has a wrong offset!");

}

