#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Vendor_MapFragments_Fragment

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Vendor_MapFragments_Fragment.BP_Vendor_MapFragments_Fragment_C
// 0x0018 (0x02D8 - 0x02C0)
class UBP_Vendor_MapFragments_Fragment_C final : public UVendorMapFragmentSlotUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UManImage*                              FragmentMask;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Visible;                                           // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BP_Vendor_MapFragments_Fragment(int32 EntryPoint);
	void OnSetTexture(bool bSet);
	void OnUnlock(bool bAnimate);
	void PreConstruct(bool IsDesignTime);
	void SetTexture();
	void SetVisible(bool InVisible, bool Animate);
	void Unlock();
	void ReleaseTexture();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Vendor_MapFragments_Fragment_C">();
	}
	static class UBP_Vendor_MapFragments_Fragment_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Vendor_MapFragments_Fragment_C>();
	}
};
static_assert(alignof(UBP_Vendor_MapFragments_Fragment_C) == 0x000008, "Wrong alignment on UBP_Vendor_MapFragments_Fragment_C");
static_assert(sizeof(UBP_Vendor_MapFragments_Fragment_C) == 0x0002D8, "Wrong size on UBP_Vendor_MapFragments_Fragment_C");
static_assert(offsetof(UBP_Vendor_MapFragments_Fragment_C, UberGraphFrame) == 0x0002C0, "Member 'UBP_Vendor_MapFragments_Fragment_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_MapFragments_Fragment_C, FragmentMask) == 0x0002C8, "Member 'UBP_Vendor_MapFragments_Fragment_C::FragmentMask' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_MapFragments_Fragment_C, Visible) == 0x0002D0, "Member 'UBP_Vendor_MapFragments_Fragment_C::Visible' has a wrong offset!");

}

