#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Vendor_Sell

#include "Basic.hpp"

#include "man_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_Vendor_Sell.BP_Vendor_Sell_C.ExecuteUbergraph_BP_Vendor_Sell
// 0x02F8 (0x02F8 - 0x0000)
struct BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration_1;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration;                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue_1;       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSellHistoryItem                       K2Node_Event_SellHistoryItem;                      // 0x0068(0x0058)(NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_VendorName;                           // 0x00C8(0x0018)(ConstParm)
	class UTexture2D*                             K2Node_Event_InItemIcon;                           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_InItemName;                           // 0x00E8(0x0018)(ConstParm)
	int32                                         K2Node_Event_InSelectedCount;                      // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InMaxCount;                           // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_InPriceText;                          // 0x0108(0x0018)(ConstParm)
	class FText                                   K2Node_Event_InPriceGoldValue;                     // 0x0120(0x0018)(ConstParm)
	class FText                                   K2Node_Event_InPriceEssenceValue;                  // 0x0138(0x0018)(ConstParm)
	class FText                                   K2Node_Event_InRequirementText;                    // 0x0150(0x0018)(ConstParm)
	class FText                                   K2Node_Event_InItemTypeText;                       // 0x0168(0x0018)(ConstParm)
	bool                                          K2Node_Event_bHasEnoughGold;                       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bHasEnoughEssence;                    // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_SortName;                             // 0x0188(0x0018)(ConstParm)
	EItemSlot                                     K2Node_Event_ItemSlot;                             // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_FilterName;                           // 0x01A8(0x0018)(ConstParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_12;     // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_11;     // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_10;     // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_9;      // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_8;      // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_7;      // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_6;      // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_5;      // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_4;      // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_3;      // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_2;      // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_1;      // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference;        // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteractButtonUserWidget*              K2Node_Event_InteractButtonUserWidget_3;           // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteractButtonUserWidget*              K2Node_Event_InteractButtonUserWidget_2;           // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteractButtonUserWidget*              K2Node_Event_InteractButtonUserWidget_1;           // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bMinTimeCancel;                       // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_ItemRequirementText;                  // 0x0250(0x0018)(ConstParm)
	class UItemAbility*                           K2Node_Event_InItem;                               // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemAbility*                           K2Node_Event_InComparedItem;                       // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEquipped;                            // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bAnimate;                             // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27B[0x5];                                      // 0x027B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCurrencyText_ReturnValue;              // 0x0280(0x0018)()
	class FText                                   CallFunc_GetCurrencyText_ReturnValue_1;            // 0x0298(0x0018)()
	class UInteractButtonUserWidget*              K2Node_Event_InteractButtonUserWidget;             // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCurrencyText_ReturnValue_2;            // 0x02B8(0x0018)()
	class FText                                   CallFunc_GetCurrencyText_ReturnValue_3;            // 0x02D0(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDisplay                                 K2Node_Event_InInputDisplay;                       // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDisplay                                 K2Node_Event_InControlDisplay;                     // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell) == 0x000008, "Wrong alignment on BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell");
static_assert(sizeof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell) == 0x0002F8, "Wrong size on BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, EntryPoint) == 0x000000, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, Temp_bool_Variable) == 0x000004, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, Temp_byte_Variable) == 0x000005, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, Temp_byte_Variable_1) == 0x000006, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_MyGeometry) == 0x000008, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_InDeltaTime) == 0x000040, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_AnimDuration_1) == 0x000044, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_AnimDuration_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, CallFunc_GetAnimPlaybackSpeed_ReturnValue) == 0x000048, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::CallFunc_GetAnimPlaybackSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_AnimDuration) == 0x00004C, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_AnimDuration' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, CallFunc_GetAnimPlaybackSpeed_ReturnValue_1) == 0x000058, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::CallFunc_GetAnimPlaybackSpeed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, CallFunc_PlayAnimation_ReturnValue_1) == 0x000060, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_SellHistoryItem) == 0x000068, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_SellHistoryItem' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C0, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_VendorName) == 0x0000C8, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_VendorName' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_InItemIcon) == 0x0000E0, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_InItemIcon' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_InItemName) == 0x0000E8, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_InItemName' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_InSelectedCount) == 0x000100, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_InSelectedCount' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_InMaxCount) == 0x000104, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_InMaxCount' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_InPriceText) == 0x000108, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_InPriceText' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_InPriceGoldValue) == 0x000120, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_InPriceGoldValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_InPriceEssenceValue) == 0x000138, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_InPriceEssenceValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_InRequirementText) == 0x000150, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_InRequirementText' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_InItemTypeText) == 0x000168, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_InItemTypeText' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_bHasEnoughGold) == 0x000180, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_bHasEnoughGold' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_bHasEnoughEssence) == 0x000181, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_bHasEnoughEssence' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_SortName) == 0x000188, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_SortName' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_ItemSlot) == 0x0001A0, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_ItemSlot' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_FilterName) == 0x0001A8, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_FilterName' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_IsDesignTime) == 0x0001C0, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_ComponentBoundEvent_WidgetReference_12) == 0x0001C8, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_ComponentBoundEvent_WidgetReference_12' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_ComponentBoundEvent_WidgetReference_11) == 0x0001D0, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_ComponentBoundEvent_WidgetReference_11' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_ComponentBoundEvent_WidgetReference_10) == 0x0001D8, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_ComponentBoundEvent_WidgetReference_10' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_ComponentBoundEvent_WidgetReference_9) == 0x0001E0, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_ComponentBoundEvent_WidgetReference_9' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_ComponentBoundEvent_WidgetReference_8) == 0x0001E8, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_ComponentBoundEvent_WidgetReference_8' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_ComponentBoundEvent_WidgetReference_7) == 0x0001F0, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_ComponentBoundEvent_WidgetReference_7' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_ComponentBoundEvent_WidgetReference_6) == 0x0001F8, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_ComponentBoundEvent_WidgetReference_6' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_ComponentBoundEvent_WidgetReference_5) == 0x000200, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_ComponentBoundEvent_WidgetReference_5' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_ComponentBoundEvent_WidgetReference_4) == 0x000208, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_ComponentBoundEvent_WidgetReference_4' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_ComponentBoundEvent_WidgetReference_3) == 0x000210, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_ComponentBoundEvent_WidgetReference_3' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_ComponentBoundEvent_WidgetReference_2) == 0x000218, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_ComponentBoundEvent_WidgetReference_2' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_ComponentBoundEvent_WidgetReference_1) == 0x000220, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_ComponentBoundEvent_WidgetReference_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_ComponentBoundEvent_WidgetReference) == 0x000228, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_ComponentBoundEvent_WidgetReference' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_InteractButtonUserWidget_3) == 0x000230, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_InteractButtonUserWidget_3' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_InteractButtonUserWidget_2) == 0x000238, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_InteractButtonUserWidget_2' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_InteractButtonUserWidget_1) == 0x000240, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_InteractButtonUserWidget_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_bMinTimeCancel) == 0x000248, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_bMinTimeCancel' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_ItemRequirementText) == 0x000250, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_ItemRequirementText' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_InItem) == 0x000268, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_InItem' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_InComparedItem) == 0x000270, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_InComparedItem' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_bEquipped) == 0x000278, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_bEquipped' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_bAnimate) == 0x000279, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_bAnimate' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Select_Default) == 0x00027A, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, CallFunc_GetCurrencyText_ReturnValue) == 0x000280, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::CallFunc_GetCurrencyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, CallFunc_GetCurrencyText_ReturnValue_1) == 0x000298, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::CallFunc_GetCurrencyText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_InteractButtonUserWidget) == 0x0002B0, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_InteractButtonUserWidget' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, CallFunc_GetCurrencyText_ReturnValue_2) == 0x0002B8, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::CallFunc_GetCurrencyText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, CallFunc_GetCurrencyText_ReturnValue_3) == 0x0002D0, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::CallFunc_GetCurrencyText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, CallFunc_PlayAnimation_ReturnValue_2) == 0x0002E8, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_InInputDisplay) == 0x0002F0, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_InInputDisplay' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell, K2Node_Event_InControlDisplay) == 0x0002F1, "Member 'BP_Vendor_Sell_C_ExecuteUbergraph_BP_Vendor_Sell::K2Node_Event_InControlDisplay' has a wrong offset!");

// Function BP_Vendor_Sell.BP_Vendor_Sell_C.OnSetInputDisplay
// 0x0002 (0x0002 - 0x0000)
struct BP_Vendor_Sell_C_OnSetInputDisplay final
{
public:
	EInputDisplay                                 InInputDisplay;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDisplay                                 InControlDisplay;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Sell_C_OnSetInputDisplay) == 0x000001, "Wrong alignment on BP_Vendor_Sell_C_OnSetInputDisplay");
static_assert(sizeof(BP_Vendor_Sell_C_OnSetInputDisplay) == 0x000002, "Wrong size on BP_Vendor_Sell_C_OnSetInputDisplay");
static_assert(offsetof(BP_Vendor_Sell_C_OnSetInputDisplay, InInputDisplay) == 0x000000, "Member 'BP_Vendor_Sell_C_OnSetInputDisplay::InInputDisplay' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_OnSetInputDisplay, InControlDisplay) == 0x000001, "Member 'BP_Vendor_Sell_C_OnSetInputDisplay::InControlDisplay' has a wrong offset!");

// Function BP_Vendor_Sell.BP_Vendor_Sell_C.OnErrorHiglight
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Sell_C_OnErrorHiglight final
{
public:
	class UInteractButtonUserWidget*              InteractButtonUserWidget;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Sell_C_OnErrorHiglight) == 0x000008, "Wrong alignment on BP_Vendor_Sell_C_OnErrorHiglight");
static_assert(sizeof(BP_Vendor_Sell_C_OnErrorHiglight) == 0x000008, "Wrong size on BP_Vendor_Sell_C_OnErrorHiglight");
static_assert(offsetof(BP_Vendor_Sell_C_OnErrorHiglight, InteractButtonUserWidget) == 0x000000, "Member 'BP_Vendor_Sell_C_OnErrorHiglight::InteractButtonUserWidget' has a wrong offset!");

// Function BP_Vendor_Sell.BP_Vendor_Sell_C.OnUpdateSelectedItemDetailsPanel
// 0x0030 (0x0030 - 0x0000)
struct BP_Vendor_Sell_C_OnUpdateSelectedItemDetailsPanel final
{
public:
	class FText                                   ItemRequirementText;                               // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UItemAbility*                           InItem;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemAbility*                           InComparedItem;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEquipped;                                         // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bAnimate;                                          // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Vendor_Sell_C_OnUpdateSelectedItemDetailsPanel) == 0x000008, "Wrong alignment on BP_Vendor_Sell_C_OnUpdateSelectedItemDetailsPanel");
static_assert(sizeof(BP_Vendor_Sell_C_OnUpdateSelectedItemDetailsPanel) == 0x000030, "Wrong size on BP_Vendor_Sell_C_OnUpdateSelectedItemDetailsPanel");
static_assert(offsetof(BP_Vendor_Sell_C_OnUpdateSelectedItemDetailsPanel, ItemRequirementText) == 0x000000, "Member 'BP_Vendor_Sell_C_OnUpdateSelectedItemDetailsPanel::ItemRequirementText' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_OnUpdateSelectedItemDetailsPanel, InItem) == 0x000018, "Member 'BP_Vendor_Sell_C_OnUpdateSelectedItemDetailsPanel::InItem' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_OnUpdateSelectedItemDetailsPanel, InComparedItem) == 0x000020, "Member 'BP_Vendor_Sell_C_OnUpdateSelectedItemDetailsPanel::InComparedItem' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_OnUpdateSelectedItemDetailsPanel, bEquipped) == 0x000028, "Member 'BP_Vendor_Sell_C_OnUpdateSelectedItemDetailsPanel::bEquipped' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_OnUpdateSelectedItemDetailsPanel, bAnimate) == 0x000029, "Member 'BP_Vendor_Sell_C_OnUpdateSelectedItemDetailsPanel::bAnimate' has a wrong offset!");

// Function BP_Vendor_Sell.BP_Vendor_Sell_C.OnHoldCanceled
// 0x0010 (0x0010 - 0x0000)
struct BP_Vendor_Sell_C_OnHoldCanceled final
{
public:
	class UInteractButtonUserWidget*              InteractButtonUserWidget;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bMinTimeCancel;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Vendor_Sell_C_OnHoldCanceled) == 0x000008, "Wrong alignment on BP_Vendor_Sell_C_OnHoldCanceled");
static_assert(sizeof(BP_Vendor_Sell_C_OnHoldCanceled) == 0x000010, "Wrong size on BP_Vendor_Sell_C_OnHoldCanceled");
static_assert(offsetof(BP_Vendor_Sell_C_OnHoldCanceled, InteractButtonUserWidget) == 0x000000, "Member 'BP_Vendor_Sell_C_OnHoldCanceled::InteractButtonUserWidget' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_OnHoldCanceled, bMinTimeCancel) == 0x000008, "Member 'BP_Vendor_Sell_C_OnHoldCanceled::bMinTimeCancel' has a wrong offset!");

// Function BP_Vendor_Sell.BP_Vendor_Sell_C.OnHoldStarted
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Sell_C_OnHoldStarted final
{
public:
	class UInteractButtonUserWidget*              InteractButtonUserWidget;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Sell_C_OnHoldStarted) == 0x000008, "Wrong alignment on BP_Vendor_Sell_C_OnHoldStarted");
static_assert(sizeof(BP_Vendor_Sell_C_OnHoldStarted) == 0x000008, "Wrong size on BP_Vendor_Sell_C_OnHoldStarted");
static_assert(offsetof(BP_Vendor_Sell_C_OnHoldStarted, InteractButtonUserWidget) == 0x000000, "Member 'BP_Vendor_Sell_C_OnHoldStarted::InteractButtonUserWidget' has a wrong offset!");

// Function BP_Vendor_Sell.BP_Vendor_Sell_C.OnHoldFinished
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Sell_C_OnHoldFinished final
{
public:
	class UInteractButtonUserWidget*              InteractButtonUserWidget;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Sell_C_OnHoldFinished) == 0x000008, "Wrong alignment on BP_Vendor_Sell_C_OnHoldFinished");
static_assert(sizeof(BP_Vendor_Sell_C_OnHoldFinished) == 0x000008, "Wrong size on BP_Vendor_Sell_C_OnHoldFinished");
static_assert(offsetof(BP_Vendor_Sell_C_OnHoldFinished, InteractButtonUserWidget) == 0x000000, "Member 'BP_Vendor_Sell_C_OnHoldFinished::InteractButtonUserWidget' has a wrong offset!");

// Function BP_Vendor_Sell.BP_Vendor_Sell_C.BndEvt__BP_Vendor_Sell_Filter_All_K2Node_ComponentBoundEvent_26_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Sell_C_BndEvt__BP_Vendor_Sell_Filter_All_K2Node_ComponentBoundEvent_26_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Sell_C_BndEvt__BP_Vendor_Sell_Filter_All_K2Node_ComponentBoundEvent_26_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Vendor_Sell_C_BndEvt__BP_Vendor_Sell_Filter_All_K2Node_ComponentBoundEvent_26_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Vendor_Sell_C_BndEvt__BP_Vendor_Sell_Filter_All_K2Node_ComponentBoundEvent_26_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Vendor_Sell_C_BndEvt__BP_Vendor_Sell_Filter_All_K2Node_ComponentBoundEvent_26_OnClicked__DelegateSignature");
static_assert(offsetof(BP_Vendor_Sell_C_BndEvt__BP_Vendor_Sell_Filter_All_K2Node_ComponentBoundEvent_26_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_Vendor_Sell_C_BndEvt__BP_Vendor_Sell_Filter_All_K2Node_ComponentBoundEvent_26_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_Vendor_Sell.BP_Vendor_Sell_C.BndEvt__BP_InventoryWindow_Filter_Diagrams_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Diagrams_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Diagrams_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Diagrams_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Diagrams_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Diagrams_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature");
static_assert(offsetof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Diagrams_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Diagrams_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_Vendor_Sell.BP_Vendor_Sell_C.BndEvt__BP_InventoryWindow_Filter_QuickUse_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_QuickUse_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_QuickUse_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_QuickUse_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_QuickUse_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_QuickUse_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature");
static_assert(offsetof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_QuickUse_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_QuickUse_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_Vendor_Sell.BP_Vendor_Sell_C.BndEvt__BP_InventoryWindow_Filter_QuestItems_K2Node_ComponentBoundEvent_24_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_QuestItems_K2Node_ComponentBoundEvent_24_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_QuestItems_K2Node_ComponentBoundEvent_24_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_QuestItems_K2Node_ComponentBoundEvent_24_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_QuestItems_K2Node_ComponentBoundEvent_24_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_QuestItems_K2Node_ComponentBoundEvent_24_OnClicked__DelegateSignature");
static_assert(offsetof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_QuestItems_K2Node_ComponentBoundEvent_24_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_QuestItems_K2Node_ComponentBoundEvent_24_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_Vendor_Sell.BP_Vendor_Sell_C.BndEvt__BP_InventoryWindow_Filter_Materials_K2Node_ComponentBoundEvent_23_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Materials_K2Node_ComponentBoundEvent_23_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Materials_K2Node_ComponentBoundEvent_23_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Materials_K2Node_ComponentBoundEvent_23_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Materials_K2Node_ComponentBoundEvent_23_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Materials_K2Node_ComponentBoundEvent_23_OnClicked__DelegateSignature");
static_assert(offsetof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Materials_K2Node_ComponentBoundEvent_23_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Materials_K2Node_ComponentBoundEvent_23_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_Vendor_Sell.BP_Vendor_Sell_C.BndEvt__BP_InventoryWindow_Filter_Ring_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Ring_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Ring_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Ring_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Ring_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Ring_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature");
static_assert(offsetof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Ring_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Ring_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_Vendor_Sell.BP_Vendor_Sell_C.BndEvt__BP_InventoryWindow_Filter_Back_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Back_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Back_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Back_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Back_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Back_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature");
static_assert(offsetof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Back_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Back_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_Vendor_Sell.BP_Vendor_Sell_C.BndEvt__BP_InventoryWindow_Filter_Legs_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Legs_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Legs_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Legs_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Legs_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Legs_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature");
static_assert(offsetof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Legs_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Legs_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_Vendor_Sell.BP_Vendor_Sell_C.BndEvt__BP_InventoryWindow_Filter_Hands_K2Node_ComponentBoundEvent_18_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Hands_K2Node_ComponentBoundEvent_18_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Hands_K2Node_ComponentBoundEvent_18_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Hands_K2Node_ComponentBoundEvent_18_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Hands_K2Node_ComponentBoundEvent_18_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Hands_K2Node_ComponentBoundEvent_18_OnClicked__DelegateSignature");
static_assert(offsetof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Hands_K2Node_ComponentBoundEvent_18_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Hands_K2Node_ComponentBoundEvent_18_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_Vendor_Sell.BP_Vendor_Sell_C.BndEvt__BP_InventoryWindow_Filter_Head_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Head_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Head_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Head_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Head_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Head_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature");
static_assert(offsetof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Head_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Head_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_Vendor_Sell.BP_Vendor_Sell_C.BndEvt__BP_InventoryWindow_Filter_Chest_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Chest_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Chest_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Chest_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Chest_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Chest_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature");
static_assert(offsetof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Chest_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Chest_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_Vendor_Sell.BP_Vendor_Sell_C.BndEvt__BP_InventoryWindow_Filter_Offhand_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Offhand_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Offhand_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Offhand_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Offhand_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Offhand_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature");
static_assert(offsetof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Offhand_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_Offhand_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_Vendor_Sell.BP_Vendor_Sell_C.BndEvt__BP_InventoryWindow_Filter_MainHand_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_MainHand_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_MainHand_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_MainHand_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_MainHand_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_MainHand_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature");
static_assert(offsetof(BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_MainHand_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_Vendor_Sell_C_BndEvt__BP_InventoryWindow_Filter_MainHand_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_Vendor_Sell.BP_Vendor_Sell_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_Vendor_Sell_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Vendor_Sell_C_PreConstruct) == 0x000001, "Wrong alignment on BP_Vendor_Sell_C_PreConstruct");
static_assert(sizeof(BP_Vendor_Sell_C_PreConstruct) == 0x000001, "Wrong size on BP_Vendor_Sell_C_PreConstruct");
static_assert(offsetof(BP_Vendor_Sell_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_Vendor_Sell_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_Vendor_Sell.BP_Vendor_Sell_C.OnSetFilterSlot
// 0x0020 (0x0020 - 0x0000)
struct BP_Vendor_Sell_C_OnSetFilterSlot final
{
public:
	EItemSlot                                     ItemSlot;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   FilterName;                                        // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Vendor_Sell_C_OnSetFilterSlot) == 0x000008, "Wrong alignment on BP_Vendor_Sell_C_OnSetFilterSlot");
static_assert(sizeof(BP_Vendor_Sell_C_OnSetFilterSlot) == 0x000020, "Wrong size on BP_Vendor_Sell_C_OnSetFilterSlot");
static_assert(offsetof(BP_Vendor_Sell_C_OnSetFilterSlot, ItemSlot) == 0x000000, "Member 'BP_Vendor_Sell_C_OnSetFilterSlot::ItemSlot' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_OnSetFilterSlot, FilterName) == 0x000008, "Member 'BP_Vendor_Sell_C_OnSetFilterSlot::FilterName' has a wrong offset!");

// Function BP_Vendor_Sell.BP_Vendor_Sell_C.OnSortChanged
// 0x0018 (0x0018 - 0x0000)
struct BP_Vendor_Sell_C_OnSortChanged final
{
public:
	class FText                                   SortName;                                          // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Vendor_Sell_C_OnSortChanged) == 0x000008, "Wrong alignment on BP_Vendor_Sell_C_OnSortChanged");
static_assert(sizeof(BP_Vendor_Sell_C_OnSortChanged) == 0x000018, "Wrong size on BP_Vendor_Sell_C_OnSortChanged");
static_assert(offsetof(BP_Vendor_Sell_C_OnSortChanged, SortName) == 0x000000, "Member 'BP_Vendor_Sell_C_OnSortChanged::SortName' has a wrong offset!");

// Function BP_Vendor_Sell.BP_Vendor_Sell_C.OnSetSelectedItemProperty
// 0x00A8 (0x00A8 - 0x0000)
struct BP_Vendor_Sell_C_OnSetSelectedItemProperty final
{
public:
	class UTexture2D*                             InItemIcon;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   InItemName;                                        // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         InSelectedCount;                                   // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMaxCount;                                        // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   InPriceText;                                       // 0x0028(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   InPriceGoldValue;                                  // 0x0040(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   InPriceEssenceValue;                               // 0x0058(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   InRequirementText;                                 // 0x0070(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   InItemTypeText;                                    // 0x0088(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bHasEnoughGold;                                    // 0x00A0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bHasEnoughEssence;                                 // 0x00A1(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Vendor_Sell_C_OnSetSelectedItemProperty) == 0x000008, "Wrong alignment on BP_Vendor_Sell_C_OnSetSelectedItemProperty");
static_assert(sizeof(BP_Vendor_Sell_C_OnSetSelectedItemProperty) == 0x0000A8, "Wrong size on BP_Vendor_Sell_C_OnSetSelectedItemProperty");
static_assert(offsetof(BP_Vendor_Sell_C_OnSetSelectedItemProperty, InItemIcon) == 0x000000, "Member 'BP_Vendor_Sell_C_OnSetSelectedItemProperty::InItemIcon' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_OnSetSelectedItemProperty, InItemName) == 0x000008, "Member 'BP_Vendor_Sell_C_OnSetSelectedItemProperty::InItemName' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_OnSetSelectedItemProperty, InSelectedCount) == 0x000020, "Member 'BP_Vendor_Sell_C_OnSetSelectedItemProperty::InSelectedCount' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_OnSetSelectedItemProperty, InMaxCount) == 0x000024, "Member 'BP_Vendor_Sell_C_OnSetSelectedItemProperty::InMaxCount' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Sell_C_OnSetSelectedItemProperty, InPriceText) == 0x000028, "Member 'BP_Vendor_Sell_C_OnSetSelectedItemProperty::InPriceText' has a wrong offset!");
