#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VoidBlastImpact_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VoidBlastImpact_VisualEntity.BP_VoidBlastImpact_VisualEntity_C
// 0x0020 (0x0370 - 0x0350)
class ABP_VoidBlastImpact_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           AkComponent;                                       // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_VoidBlast_Impact;                               // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_VoidBlastImpact_VisualEntity(int32 EntryPoint);
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VoidBlastImpact_VisualEntity_C">();
	}
	static class ABP_VoidBlastImpact_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VoidBlastImpact_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_VoidBlastImpact_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_VoidBlastImpact_VisualEntity_C");
static_assert(sizeof(ABP_VoidBlastImpact_VisualEntity_C) == 0x000370, "Wrong size on ABP_VoidBlastImpact_VisualEntity_C");
static_assert(offsetof(ABP_VoidBlastImpact_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_VoidBlastImpact_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_VoidBlastImpact_VisualEntity_C, AkComponent) == 0x000358, "Member 'ABP_VoidBlastImpact_VisualEntity_C::AkComponent' has a wrong offset!");
static_assert(offsetof(ABP_VoidBlastImpact_VisualEntity_C, NS_VoidBlast_Impact) == 0x000360, "Member 'ABP_VoidBlastImpact_VisualEntity_C::NS_VoidBlast_Impact' has a wrong offset!");
static_assert(offsetof(ABP_VoidBlastImpact_VisualEntity_C, ParticleSystem) == 0x000368, "Member 'ABP_VoidBlastImpact_VisualEntity_C::ParticleSystem' has a wrong offset!");

}

