#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Vendor_TransmogSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Vendor_TransmogSlot.BP_Vendor_TransmogSlot_C
// 0x00F0 (0x0390 - 0x02A0)
class UBP_Vendor_TransmogSlot_C final : public UVendorItemSlotUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TransmogFinishedAnim;                              // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 FilterImageActive;                                 // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FilterImageDisabled;                               // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Bg;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoldVFX_1;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoldVFX_2;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconImage;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               IndicatorSlot;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InnerShadow;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnlockVFX_1;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnlockVFX_2;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnlockVFX_3;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnlockVFX_4;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnlockVFX_5;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnlockVFX_6;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnHovered;                                         // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUnhovered;                                       // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnReleased;                                        // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnPressed;                                         // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUnfocus;                                         // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UTexture2D*                             IconTexture;                                       // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Quantity;                                          // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          QuantityVisible;                                   // 0x038C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsEmpty;                                           // 0x038D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Vendor_TransmogSlot(int32 EntryPoint);
	void OnSetSlot(const class UTexture2D* InIcon, const class FText& InName);
	void OnTemporaryEnchantIconsChanged(const TArray<class UTexture2D*>& InTemporaryEnchantIcons);
	void OnPermanentEnchantIconsChanged(const TArray<class UTexture2D*>& InPermanentEnchantIcons);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void SetIcon(class UTexture2D* InIcon);
	void SetUnavailable(bool IsUnavailable, bool IsUnavailableByResource);
	void Set_Filter_Icon(class UTexture2D* InFilterIconActive, class UTexture2D* InFilterIconDisabled);
	void PlayTransmogFinishedAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Vendor_TransmogSlot_C">();
	}
	static class UBP_Vendor_TransmogSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Vendor_TransmogSlot_C>();
	}
};
static_assert(alignof(UBP_Vendor_TransmogSlot_C) == 0x000008, "Wrong alignment on UBP_Vendor_TransmogSlot_C");
static_assert(sizeof(UBP_Vendor_TransmogSlot_C) == 0x000390, "Wrong size on UBP_Vendor_TransmogSlot_C");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, UberGraphFrame) == 0x0002A0, "Member 'UBP_Vendor_TransmogSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, TransmogFinishedAnim) == 0x0002A8, "Member 'UBP_Vendor_TransmogSlot_C::TransmogFinishedAnim' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, FilterImageActive) == 0x0002B0, "Member 'UBP_Vendor_TransmogSlot_C::FilterImageActive' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, FilterImageDisabled) == 0x0002B8, "Member 'UBP_Vendor_TransmogSlot_C::FilterImageDisabled' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, Frame) == 0x0002C0, "Member 'UBP_Vendor_TransmogSlot_C::Frame' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, Frame_Bg) == 0x0002C8, "Member 'UBP_Vendor_TransmogSlot_C::Frame_Bg' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, HoldVFX_1) == 0x0002D0, "Member 'UBP_Vendor_TransmogSlot_C::HoldVFX_1' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, HoldVFX_2) == 0x0002D8, "Member 'UBP_Vendor_TransmogSlot_C::HoldVFX_2' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, IconImage) == 0x0002E0, "Member 'UBP_Vendor_TransmogSlot_C::IconImage' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, IndicatorSlot) == 0x0002E8, "Member 'UBP_Vendor_TransmogSlot_C::IndicatorSlot' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, InnerShadow) == 0x0002F0, "Member 'UBP_Vendor_TransmogSlot_C::InnerShadow' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, Overlay_0) == 0x0002F8, "Member 'UBP_Vendor_TransmogSlot_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, UnlockVFX_1) == 0x000300, "Member 'UBP_Vendor_TransmogSlot_C::UnlockVFX_1' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, UnlockVFX_2) == 0x000308, "Member 'UBP_Vendor_TransmogSlot_C::UnlockVFX_2' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, UnlockVFX_3) == 0x000310, "Member 'UBP_Vendor_TransmogSlot_C::UnlockVFX_3' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, UnlockVFX_4) == 0x000318, "Member 'UBP_Vendor_TransmogSlot_C::UnlockVFX_4' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, UnlockVFX_5) == 0x000320, "Member 'UBP_Vendor_TransmogSlot_C::UnlockVFX_5' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, UnlockVFX_6) == 0x000328, "Member 'UBP_Vendor_TransmogSlot_C::UnlockVFX_6' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, OnHovered) == 0x000330, "Member 'UBP_Vendor_TransmogSlot_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, OnUnhovered) == 0x000340, "Member 'UBP_Vendor_TransmogSlot_C::OnUnhovered' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, OnReleased) == 0x000350, "Member 'UBP_Vendor_TransmogSlot_C::OnReleased' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, OnPressed) == 0x000360, "Member 'UBP_Vendor_TransmogSlot_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, OnUnfocus) == 0x000370, "Member 'UBP_Vendor_TransmogSlot_C::OnUnfocus' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, IconTexture) == 0x000380, "Member 'UBP_Vendor_TransmogSlot_C::IconTexture' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, Quantity) == 0x000388, "Member 'UBP_Vendor_TransmogSlot_C::Quantity' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, QuantityVisible) == 0x00038C, "Member 'UBP_Vendor_TransmogSlot_C::QuantityVisible' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogSlot_C, IsEmpty) == 0x00038D, "Member 'UBP_Vendor_TransmogSlot_C::IsEmpty' has a wrong offset!");

}

