#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Vendor_ItemSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Vendor_ItemSlot.BP_Vendor_ItemSlot_C
// 0x00D8 (0x0378 - 0x02A0)
class UBP_Vendor_ItemSlot_C final : public UVendorItemSlotUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LongpressEndAnim;                                  // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LongpressProgressAnim;                             // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HighlightAnim;                                     // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             CaptionQuantity;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         CountBox;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FilterImage;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Bg;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Highlight;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Normal;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Unavailable;                                 // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconImage;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               IndicatorSlot;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InnerShadow;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnHovered;                                         // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUnhovered;                                       // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnReleased;                                        // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnPressed;                                         // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUnfocus;                                         // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UTexture2D*                             IconTexture;                                       // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Quantity;                                          // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          QuantityVisible;                                   // 0x0374(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsEmpty;                                           // 0x0375(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Vendor_ItemSlot(int32 EntryPoint);
	void OnHighlighted(bool bHighlighted, bool bAnimate);
	void OnSetSlot(const class UTexture2D* InIcon, const class FText& InName);
	void OnTemporaryEnchantIconsChanged(const TArray<class UTexture2D*>& InTemporaryEnchantIcons);
	void OnPermanentEnchantIconsChanged(const TArray<class UTexture2D*>& InPermanentEnchantIcons);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void SetSlot(class UTexture2D* InIcon);
	void Highlight();
	void SetCount(int32 Quantity_0);
	void SetUnavailable(bool IsUnavailable, bool IsUnavailableByResource);
	void Show_Quantity(bool InShowQuantity);
	void Unhighlight();
	void PlayLongpressProgressAnim();
	void PlayLongpressCancelAnim();
	void PlayLongpressEndAnim();
	void PlayLongpressResetAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Vendor_ItemSlot_C">();
	}
	static class UBP_Vendor_ItemSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Vendor_ItemSlot_C>();
	}
};
static_assert(alignof(UBP_Vendor_ItemSlot_C) == 0x000008, "Wrong alignment on UBP_Vendor_ItemSlot_C");
static_assert(sizeof(UBP_Vendor_ItemSlot_C) == 0x000378, "Wrong size on UBP_Vendor_ItemSlot_C");
static_assert(offsetof(UBP_Vendor_ItemSlot_C, UberGraphFrame) == 0x0002A0, "Member 'UBP_Vendor_ItemSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_ItemSlot_C, LongpressEndAnim) == 0x0002A8, "Member 'UBP_Vendor_ItemSlot_C::LongpressEndAnim' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_ItemSlot_C, LongpressProgressAnim) == 0x0002B0, "Member 'UBP_Vendor_ItemSlot_C::LongpressProgressAnim' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_ItemSlot_C, HighlightAnim) == 0x0002B8, "Member 'UBP_Vendor_ItemSlot_C::HighlightAnim' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_ItemSlot_C, CaptionQuantity) == 0x0002C0, "Member 'UBP_Vendor_ItemSlot_C::CaptionQuantity' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_ItemSlot_C, CountBox) == 0x0002C8, "Member 'UBP_Vendor_ItemSlot_C::CountBox' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_ItemSlot_C, FilterImage) == 0x0002D0, "Member 'UBP_Vendor_ItemSlot_C::FilterImage' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_ItemSlot_C, Frame_Bg) == 0x0002D8, "Member 'UBP_Vendor_ItemSlot_C::Frame_Bg' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_ItemSlot_C, Frame_Highlight) == 0x0002E0, "Member 'UBP_Vendor_ItemSlot_C::Frame_Highlight' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_ItemSlot_C, Frame_Normal) == 0x0002E8, "Member 'UBP_Vendor_ItemSlot_C::Frame_Normal' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_ItemSlot_C, Frame_Unavailable) == 0x0002F0, "Member 'UBP_Vendor_ItemSlot_C::Frame_Unavailable' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_ItemSlot_C, IconImage) == 0x0002F8, "Member 'UBP_Vendor_ItemSlot_C::IconImage' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_ItemSlot_C, IndicatorSlot) == 0x000300, "Member 'UBP_Vendor_ItemSlot_C::IndicatorSlot' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_ItemSlot_C, InnerShadow) == 0x000308, "Member 'UBP_Vendor_ItemSlot_C::InnerShadow' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_ItemSlot_C, Overlay_0) == 0x000310, "Member 'UBP_Vendor_ItemSlot_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_ItemSlot_C, OnHovered) == 0x000318, "Member 'UBP_Vendor_ItemSlot_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_ItemSlot_C, OnUnhovered) == 0x000328, "Member 'UBP_Vendor_ItemSlot_C::OnUnhovered' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_ItemSlot_C, OnReleased) == 0x000338, "Member 'UBP_Vendor_ItemSlot_C::OnReleased' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_ItemSlot_C, OnPressed) == 0x000348, "Member 'UBP_Vendor_ItemSlot_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_ItemSlot_C, OnUnfocus) == 0x000358, "Member 'UBP_Vendor_ItemSlot_C::OnUnfocus' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_ItemSlot_C, IconTexture) == 0x000368, "Member 'UBP_Vendor_ItemSlot_C::IconTexture' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_ItemSlot_C, Quantity) == 0x000370, "Member 'UBP_Vendor_ItemSlot_C::Quantity' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_ItemSlot_C, QuantityVisible) == 0x000374, "Member 'UBP_Vendor_ItemSlot_C::QuantityVisible' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_ItemSlot_C, IsEmpty) == 0x000375, "Member 'UBP_Vendor_ItemSlot_C::IsEmpty' has a wrong offset!");

}

