#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Vendor_Transmog

#include "Basic.hpp"

#include "man_structs.hpp"
#include "man_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Vendor_Transmog.BP_Vendor_Transmog_C
// 0x01B8 (0x0730 - 0x0578)
class UBP_Vendor_Transmog_C final : public UVendorTransmogUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0578(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       BalanceErrorAnim;                                  // 0x0580(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BuyAnim;                                           // 0x0588(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x0590(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x0598(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur_0;                                  // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Balance;                                           // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BalanceBox;                                        // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BalanceText;                                       // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BalanceValue;                                      // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BottomScreenFrame;                                 // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CloseButton_C*                      BtnClose;                                          // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyA;                                        // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyB;                                        // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyDPadLeftRight;                            // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyHoldA;                                    // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnHotkeyHoldY;                                    // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnNextTab;                                        // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractButton_Normal_C*            BtnPreviousTab;                                    // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               CharacterView;                                     // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ContentFrame;                                      // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                CostBox;                                           // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               CostOverlay;                                       // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CurrencyIconBalance;                               // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CurrencyIconPrice;                                 // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           InventoryView;                                     // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MouseRotateSizeBox;                                // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NormalFrame;                                       // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PriceText;                                         // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PriceValue;                                        // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RenderPlaceholder;                                 // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScreenBg2;                                         // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           SlotView;                                          // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Bestiary;                                      // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Buy;                                           // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Craft;                                         // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Enchant;                                       // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Garden;                                        // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_MapFragments;                                  // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Sell;                                          // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Talk;                                          // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Transmog;                                      // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Tab_Button_New_C*                   Tab_Upgrade;                                       // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Tabs;                                              // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TopScreenFrame;                                    // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Vendor_Transmog_ItemsHandler_C*     TransmogItemsHandler;                              // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Vendor_TransmogRow_C*               TransmogRow_Back;                                  // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Vendor_TransmogRow_C*               TransmogRow_Chest;                                 // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Vendor_TransmogRow_C*               TransmogRow_Hand;                                  // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Vendor_TransmogRow_C*               TransmogRow_Head;                                  // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Vendor_TransmogRow_C*               TransmogRow_Leg;                                   // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           TransmogSlots;                                     // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              BtnCloseClickedEvent;                              // 0x0718(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsItemLoreVisible;                                 // 0x0728(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EHeroProperty                                 PropertyType;                                      // 0x0729(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NotEnoughGold;                                     // 0x072A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Vendor_Transmog(int32 EntryPoint);
	void OnHoldCanceled(class UInteractButtonUserWidget* InteractButtonUserWidget, bool bMinTimeCancel);
	void OnHoldFinished(class UInteractButtonUserWidget* InteractButtonUserWidget);
	void OnHoldStarted(class UInteractButtonUserWidget* InteractButtonUserWidget);
	void OnSetInputDisplay(EInputDisplay InInputDisplay, EInputDisplay InControlDisplay);
	void BndEvt__BP_Vendor_Alchemist_BtnClose_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature();
	void OnErrorHiglight(class UInteractButtonUserWidget* InteractButtonUserWidget);
	void OnSetSelectedItemProperty(class UTexture2D* InItemIcon, const class FText& InItemName, int32 InSelectedCount, int32 InMaxCount, const class FText& InPriceText, const class FText& InPriceGoldValue, const class FText& InPriceEssenceValue, const class FText& InRequirementText, const class FText& InItemTypeText, bool bHasEnoughGold, bool bHasEnoughEssence);
	void OnSetTransmogMode(bool bInTransmogMode);
	void OnTransmogItem();
	void BndEvt__BtnHotkeyA2_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void OnGamepadAEvent();
	void BndEvt__BP_Vendor_Transmog_Tab_Transmog_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void BndEvt__BP_Vendor_Enchant_Tab_Upgrade_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();
	void BndEvt__BP_Vendor_Buy_Tab_Talk_K2Node_ComponentBoundEvent_18_OnClicked__DelegateSignature();
	void BndEvt__BP_Vendor_Buy_Tab_Bestiary_K2Node_ComponentBoundEvent_17_OnClicked__DelegateSignature();
	void BndEvt__BP_Vendor_Buy_Tab_Garden_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature();
	void BndEvt__BP_Vendor_Buy_Tab_Upgrade_K2Node_ComponentBoundEvent_15_OnClicked__DelegateSignature();
	void BndEvt__BP_Vendor_Buy_Tab_Craft_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature();
	void BndEvt__BP_Vendor_Buy_Tab_Sell_K2Node_ComponentBoundEvent_13_OnClicked__DelegateSignature();
	void BndEvt__BP_Vendor_Buy_Tab_Buy_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature();
	void OnInitialized();
	void OnGamepadRBEvent();
	void OnGamepadLBEvent();
	void OnHide(float AnimDuration);
	void OnShow(float AnimDuration);
	void BndEvt__BtnNextTab_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature();
	void BndEvt__BtnPreviousTab_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature();
	void Construct();
	void BndEvt__BtnClose_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void OnGamepadBEvent();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void BtnHotkeyBClicked();
	void BtnHotkeyAClicked();
	void BP_SetTransmogMode(bool InTransmogMode);
	void SetCurrency(const class FText& InPriceText, const class FText& InPriceGoldValue);
	void SetHeroResource();
	void BalanceErrorHighlight();
	void SetBtnCloseVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Vendor_Transmog_C">();
	}
	static class UBP_Vendor_Transmog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Vendor_Transmog_C>();
	}
};
static_assert(alignof(UBP_Vendor_Transmog_C) == 0x000008, "Wrong alignment on UBP_Vendor_Transmog_C");
static_assert(sizeof(UBP_Vendor_Transmog_C) == 0x000730, "Wrong size on UBP_Vendor_Transmog_C");
static_assert(offsetof(UBP_Vendor_Transmog_C, UberGraphFrame) == 0x000578, "Member 'UBP_Vendor_Transmog_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, BalanceErrorAnim) == 0x000580, "Member 'UBP_Vendor_Transmog_C::BalanceErrorAnim' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, BuyAnim) == 0x000588, "Member 'UBP_Vendor_Transmog_C::BuyAnim' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, FadeOutAnim) == 0x000590, "Member 'UBP_Vendor_Transmog_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, FadeInAnim) == 0x000598, "Member 'UBP_Vendor_Transmog_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, BackgroundBlur_0) == 0x0005A0, "Member 'UBP_Vendor_Transmog_C::BackgroundBlur_0' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, Balance) == 0x0005A8, "Member 'UBP_Vendor_Transmog_C::Balance' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, BalanceBox) == 0x0005B0, "Member 'UBP_Vendor_Transmog_C::BalanceBox' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, BalanceText) == 0x0005B8, "Member 'UBP_Vendor_Transmog_C::BalanceText' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, BalanceValue) == 0x0005C0, "Member 'UBP_Vendor_Transmog_C::BalanceValue' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, BottomScreenFrame) == 0x0005C8, "Member 'UBP_Vendor_Transmog_C::BottomScreenFrame' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, BtnClose) == 0x0005D0, "Member 'UBP_Vendor_Transmog_C::BtnClose' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, BtnHotkeyA) == 0x0005D8, "Member 'UBP_Vendor_Transmog_C::BtnHotkeyA' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, BtnHotkeyB) == 0x0005E0, "Member 'UBP_Vendor_Transmog_C::BtnHotkeyB' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, BtnHotkeyDPadLeftRight) == 0x0005E8, "Member 'UBP_Vendor_Transmog_C::BtnHotkeyDPadLeftRight' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, BtnHotkeyHoldA) == 0x0005F0, "Member 'UBP_Vendor_Transmog_C::BtnHotkeyHoldA' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, BtnHotkeyHoldY) == 0x0005F8, "Member 'UBP_Vendor_Transmog_C::BtnHotkeyHoldY' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, BtnNextTab) == 0x000600, "Member 'UBP_Vendor_Transmog_C::BtnNextTab' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, BtnPreviousTab) == 0x000608, "Member 'UBP_Vendor_Transmog_C::BtnPreviousTab' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, CharacterView) == 0x000610, "Member 'UBP_Vendor_Transmog_C::CharacterView' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, ContentFrame) == 0x000618, "Member 'UBP_Vendor_Transmog_C::ContentFrame' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, CostBox) == 0x000620, "Member 'UBP_Vendor_Transmog_C::CostBox' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, CostOverlay) == 0x000628, "Member 'UBP_Vendor_Transmog_C::CostOverlay' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, CurrencyIconBalance) == 0x000630, "Member 'UBP_Vendor_Transmog_C::CurrencyIconBalance' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, CurrencyIconPrice) == 0x000638, "Member 'UBP_Vendor_Transmog_C::CurrencyIconPrice' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, InventoryView) == 0x000640, "Member 'UBP_Vendor_Transmog_C::InventoryView' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, MouseRotateSizeBox) == 0x000648, "Member 'UBP_Vendor_Transmog_C::MouseRotateSizeBox' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, NormalFrame) == 0x000650, "Member 'UBP_Vendor_Transmog_C::NormalFrame' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, PriceText) == 0x000658, "Member 'UBP_Vendor_Transmog_C::PriceText' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, PriceValue) == 0x000660, "Member 'UBP_Vendor_Transmog_C::PriceValue' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, RenderPlaceholder) == 0x000668, "Member 'UBP_Vendor_Transmog_C::RenderPlaceholder' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, ScreenBg2) == 0x000670, "Member 'UBP_Vendor_Transmog_C::ScreenBg2' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, SlotView) == 0x000678, "Member 'UBP_Vendor_Transmog_C::SlotView' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, Tab_Bestiary) == 0x000680, "Member 'UBP_Vendor_Transmog_C::Tab_Bestiary' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, Tab_Buy) == 0x000688, "Member 'UBP_Vendor_Transmog_C::Tab_Buy' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, Tab_Craft) == 0x000690, "Member 'UBP_Vendor_Transmog_C::Tab_Craft' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, Tab_Enchant) == 0x000698, "Member 'UBP_Vendor_Transmog_C::Tab_Enchant' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, Tab_Garden) == 0x0006A0, "Member 'UBP_Vendor_Transmog_C::Tab_Garden' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, Tab_MapFragments) == 0x0006A8, "Member 'UBP_Vendor_Transmog_C::Tab_MapFragments' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, Tab_Sell) == 0x0006B0, "Member 'UBP_Vendor_Transmog_C::Tab_Sell' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, Tab_Talk) == 0x0006B8, "Member 'UBP_Vendor_Transmog_C::Tab_Talk' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, Tab_Transmog) == 0x0006C0, "Member 'UBP_Vendor_Transmog_C::Tab_Transmog' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, Tab_Upgrade) == 0x0006C8, "Member 'UBP_Vendor_Transmog_C::Tab_Upgrade' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, Tabs) == 0x0006D0, "Member 'UBP_Vendor_Transmog_C::Tabs' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, TopScreenFrame) == 0x0006D8, "Member 'UBP_Vendor_Transmog_C::TopScreenFrame' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, TransmogItemsHandler) == 0x0006E0, "Member 'UBP_Vendor_Transmog_C::TransmogItemsHandler' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, TransmogRow_Back) == 0x0006E8, "Member 'UBP_Vendor_Transmog_C::TransmogRow_Back' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, TransmogRow_Chest) == 0x0006F0, "Member 'UBP_Vendor_Transmog_C::TransmogRow_Chest' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, TransmogRow_Hand) == 0x0006F8, "Member 'UBP_Vendor_Transmog_C::TransmogRow_Hand' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, TransmogRow_Head) == 0x000700, "Member 'UBP_Vendor_Transmog_C::TransmogRow_Head' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, TransmogRow_Leg) == 0x000708, "Member 'UBP_Vendor_Transmog_C::TransmogRow_Leg' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, TransmogSlots) == 0x000710, "Member 'UBP_Vendor_Transmog_C::TransmogSlots' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, BtnCloseClickedEvent) == 0x000718, "Member 'UBP_Vendor_Transmog_C::BtnCloseClickedEvent' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, IsItemLoreVisible) == 0x000728, "Member 'UBP_Vendor_Transmog_C::IsItemLoreVisible' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, PropertyType) == 0x000729, "Member 'UBP_Vendor_Transmog_C::PropertyType' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_Transmog_C, NotEnoughGold) == 0x00072A, "Member 'UBP_Vendor_Transmog_C::NotEnoughGold' has a wrong offset!");

}

