#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VE_DMG_BASE

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_VE_DMG_BASE.BP_VE_DMG_BASE_C.ExecuteUbergraph_BP_VE_DMG_BASE
// 0x00C8 (0x00C8 - 0x0000)
struct BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_1;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         CallFunc_GetAsset_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE) == 0x000008, "Wrong alignment on BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE");
static_assert(sizeof(BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE) == 0x0000C8, "Wrong size on BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE");
static_assert(offsetof(BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE, EntryPoint) == 0x000000, "Member 'BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000004, "Member 'BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE, CallFunc_Conv_BoolToFloat_ReturnValue_1) == 0x000008, "Member 'BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE::CallFunc_Conv_BoolToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE, CallFunc_GetAsset_ReturnValue) == 0x000010, "Member 'BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE::CallFunc_GetAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE, CallFunc_GetObjectClass_ReturnValue) == 0x000018, "Member 'BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE, CallFunc_GetClassDisplayName_ReturnValue) == 0x000028, "Member 'BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE, K2Node_MakeArray_Array) == 0x000090, "Member 'BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE, CallFunc_Format_ReturnValue) == 0x0000A0, "Member 'BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE, CallFunc_Conv_TextToString_ReturnValue) == 0x0000B8, "Member 'BP_VE_DMG_BASE_C_ExecuteUbergraph_BP_VE_DMG_BASE::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

}

