#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VendorUnlocked

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "man_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_VendorUnlocked.BP_VendorUnlocked_C.ExecuteUbergraph_BP_VendorUnlocked
// 0x00D8 (0x00D8 - 0x0000)
struct BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHUDPopupQueue                         K2Node_Event_InHUDPopupQueue;                      // 0x0008(0x0058)()
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0060(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0078(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration_1;                       // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue;         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration;                         // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue_1;       // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked) == 0x000008, "Wrong alignment on BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked");
static_assert(sizeof(BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked) == 0x0000D8, "Wrong size on BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked");
static_assert(offsetof(BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked, EntryPoint) == 0x000000, "Member 'BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked, K2Node_Event_InHUDPopupQueue) == 0x000008, "Member 'BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked::K2Node_Event_InHUDPopupQueue' has a wrong offset!");
static_assert(offsetof(BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked, Temp_delegate_Variable) == 0x000060, "Member 'BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked, CallFunc_PostEvent_ReturnValue) == 0x000070, "Member 'BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked, K2Node_Event_IsDesignTime) == 0x000074, "Member 'BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked, K2Node_Event_MyGeometry) == 0x000078, "Member 'BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked, K2Node_Event_InDeltaTime) == 0x0000B0, "Member 'BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked, K2Node_Event_AnimDuration_1) == 0x0000B4, "Member 'BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked::K2Node_Event_AnimDuration_1' has a wrong offset!");
static_assert(offsetof(BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked, CallFunc_GetAnimPlaybackSpeed_ReturnValue) == 0x0000B8, "Member 'BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked::CallFunc_GetAnimPlaybackSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked, K2Node_Event_AnimDuration) == 0x0000BC, "Member 'BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked::K2Node_Event_AnimDuration' has a wrong offset!");
static_assert(offsetof(BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked, CallFunc_PlayAnimation_ReturnValue) == 0x0000C0, "Member 'BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked, CallFunc_GetAnimPlaybackSpeed_ReturnValue_1) == 0x0000C8, "Member 'BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked::CallFunc_GetAnimPlaybackSpeed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000D0, "Member 'BP_VendorUnlocked_C_ExecuteUbergraph_BP_VendorUnlocked::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function BP_VendorUnlocked.BP_VendorUnlocked_C.OnSetData
// 0x0058 (0x0058 - 0x0000)
struct BP_VendorUnlocked_C_OnSetData final
{
public:
	struct FHUDPopupQueue                         InHUDPopupQueue;                                   // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_VendorUnlocked_C_OnSetData) == 0x000008, "Wrong alignment on BP_VendorUnlocked_C_OnSetData");
static_assert(sizeof(BP_VendorUnlocked_C_OnSetData) == 0x000058, "Wrong size on BP_VendorUnlocked_C_OnSetData");
static_assert(offsetof(BP_VendorUnlocked_C_OnSetData, InHUDPopupQueue) == 0x000000, "Member 'BP_VendorUnlocked_C_OnSetData::InHUDPopupQueue' has a wrong offset!");

// Function BP_VendorUnlocked.BP_VendorUnlocked_C.OnShow
// 0x0004 (0x0004 - 0x0000)
struct BP_VendorUnlocked_C_OnShow final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VendorUnlocked_C_OnShow) == 0x000004, "Wrong alignment on BP_VendorUnlocked_C_OnShow");
static_assert(sizeof(BP_VendorUnlocked_C_OnShow) == 0x000004, "Wrong size on BP_VendorUnlocked_C_OnShow");
static_assert(offsetof(BP_VendorUnlocked_C_OnShow, AnimDuration) == 0x000000, "Member 'BP_VendorUnlocked_C_OnShow::AnimDuration' has a wrong offset!");

// Function BP_VendorUnlocked.BP_VendorUnlocked_C.OnHide
// 0x0004 (0x0004 - 0x0000)
struct BP_VendorUnlocked_C_OnHide final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VendorUnlocked_C_OnHide) == 0x000004, "Wrong alignment on BP_VendorUnlocked_C_OnHide");
static_assert(sizeof(BP_VendorUnlocked_C_OnHide) == 0x000004, "Wrong size on BP_VendorUnlocked_C_OnHide");
static_assert(offsetof(BP_VendorUnlocked_C_OnHide, AnimDuration) == 0x000000, "Member 'BP_VendorUnlocked_C_OnHide::AnimDuration' has a wrong offset!");

// Function BP_VendorUnlocked.BP_VendorUnlocked_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_VendorUnlocked_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VendorUnlocked_C_Tick) == 0x000004, "Wrong alignment on BP_VendorUnlocked_C_Tick");
static_assert(sizeof(BP_VendorUnlocked_C_Tick) == 0x00003C, "Wrong size on BP_VendorUnlocked_C_Tick");
static_assert(offsetof(BP_VendorUnlocked_C_Tick, MyGeometry) == 0x000000, "Member 'BP_VendorUnlocked_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_VendorUnlocked_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_VendorUnlocked_C_Tick::InDeltaTime' has a wrong offset!");

// Function BP_VendorUnlocked.BP_VendorUnlocked_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_VendorUnlocked_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_VendorUnlocked_C_PreConstruct) == 0x000001, "Wrong alignment on BP_VendorUnlocked_C_PreConstruct");
static_assert(sizeof(BP_VendorUnlocked_C_PreConstruct) == 0x000001, "Wrong size on BP_VendorUnlocked_C_PreConstruct");
static_assert(offsetof(BP_VendorUnlocked_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_VendorUnlocked_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_VendorUnlocked.BP_VendorUnlocked_C.SetData
// 0x0020 (0x0020 - 0x0000)
struct BP_VendorUnlocked_C_SetData final
{
public:
	class FText                                   InCaption;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTexture2D*                             InPortrait;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VendorUnlocked_C_SetData) == 0x000008, "Wrong alignment on BP_VendorUnlocked_C_SetData");
static_assert(sizeof(BP_VendorUnlocked_C_SetData) == 0x000020, "Wrong size on BP_VendorUnlocked_C_SetData");
static_assert(offsetof(BP_VendorUnlocked_C_SetData, InCaption) == 0x000000, "Member 'BP_VendorUnlocked_C_SetData::InCaption' has a wrong offset!");
static_assert(offsetof(BP_VendorUnlocked_C_SetData, InPortrait) == 0x000018, "Member 'BP_VendorUnlocked_C_SetData::InPortrait' has a wrong offset!");

}

