#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VendorPortraits

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_VendorPortraits.BP_VendorPortraits_C
// 0x0120 (0x05F0 - 0x04D0)
class UBP_VendorPortraits_C final : public UVendorPortraitsUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LeftBot_BotToCenter;                               // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LeftMid_BotToCenter;                               // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LeftMid_TopToBot;                                  // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LeftMid_TopToCenter;                               // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LeftTop_TopToCenter;                               // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RightBot_BotToCenter;                              // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RightMid_BotToCenter;                              // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RightMid_TopToBot;                                 // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RightMid_TopToCenter;                              // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RightTop_TopToCenter;                              // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SetOpacityAnim;                                    // 0x0528(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowOptionsAnim;                                   // 0x0530(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowDialogAnim;                                    // 0x0538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x0540(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x0548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               ConversationPanel;                                 // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LeftContainer;                                     // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               LeftPortraits;                                     // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Conversation_Portrait_C*            Portrait_LeftBot;                                  // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Conversation_Portrait_C*            Portrait_LeftMid;                                  // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Conversation_Portrait_C*            Portrait_LeftTop;                                  // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Conversation_Portrait_C*            Portrait_RightBot;                                 // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Conversation_Portrait_C*            Portrait_RightMid;                                 // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Conversation_Portrait_C*            Portrait_RightTop;                                 // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RightContainer;                                    // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RightPortraits;                                    // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_LeftBot;                                  // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_LeftMid;                                  // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_LeftTop;                                  // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_RightBot;                                 // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_RightMid;                                 // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_RightTop;                                 // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScreenBg2;                                         // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Conversation_Portrait_C*            CurrentTalker;                                     // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Sound2D;                                           // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_VendorPortraits(int32 EntryPoint);
	void OnShowSlot(class UConversationPortraitUserWidget* ConversationPortraitUserWidget);
	void OnHideFinished();
	void OnInit();
	void OnHide(float AnimDuration);
	void OnShow(float AnimDuration);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void ArrangeSlots();
	void ResetSlots();
	void SetCurrentTalker(class UBP_Conversation_Portrait_C* NewTalker);
	void Set_Bg_Darkening(bool IsRightSide);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VendorPortraits_C">();
	}
	static class UBP_VendorPortraits_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_VendorPortraits_C>();
	}
};
static_assert(alignof(UBP_VendorPortraits_C) == 0x000008, "Wrong alignment on UBP_VendorPortraits_C");
static_assert(sizeof(UBP_VendorPortraits_C) == 0x0005F0, "Wrong size on UBP_VendorPortraits_C");
static_assert(offsetof(UBP_VendorPortraits_C, UberGraphFrame) == 0x0004D0, "Member 'UBP_VendorPortraits_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, LeftBot_BotToCenter) == 0x0004D8, "Member 'UBP_VendorPortraits_C::LeftBot_BotToCenter' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, LeftMid_BotToCenter) == 0x0004E0, "Member 'UBP_VendorPortraits_C::LeftMid_BotToCenter' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, LeftMid_TopToBot) == 0x0004E8, "Member 'UBP_VendorPortraits_C::LeftMid_TopToBot' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, LeftMid_TopToCenter) == 0x0004F0, "Member 'UBP_VendorPortraits_C::LeftMid_TopToCenter' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, LeftTop_TopToCenter) == 0x0004F8, "Member 'UBP_VendorPortraits_C::LeftTop_TopToCenter' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, RightBot_BotToCenter) == 0x000500, "Member 'UBP_VendorPortraits_C::RightBot_BotToCenter' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, RightMid_BotToCenter) == 0x000508, "Member 'UBP_VendorPortraits_C::RightMid_BotToCenter' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, RightMid_TopToBot) == 0x000510, "Member 'UBP_VendorPortraits_C::RightMid_TopToBot' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, RightMid_TopToCenter) == 0x000518, "Member 'UBP_VendorPortraits_C::RightMid_TopToCenter' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, RightTop_TopToCenter) == 0x000520, "Member 'UBP_VendorPortraits_C::RightTop_TopToCenter' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, SetOpacityAnim) == 0x000528, "Member 'UBP_VendorPortraits_C::SetOpacityAnim' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, ShowOptionsAnim) == 0x000530, "Member 'UBP_VendorPortraits_C::ShowOptionsAnim' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, ShowDialogAnim) == 0x000538, "Member 'UBP_VendorPortraits_C::ShowDialogAnim' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, FadeOutAnim) == 0x000540, "Member 'UBP_VendorPortraits_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, FadeInAnim) == 0x000548, "Member 'UBP_VendorPortraits_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, ConversationPanel) == 0x000550, "Member 'UBP_VendorPortraits_C::ConversationPanel' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, LeftContainer) == 0x000558, "Member 'UBP_VendorPortraits_C::LeftContainer' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, LeftPortraits) == 0x000560, "Member 'UBP_VendorPortraits_C::LeftPortraits' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, Portrait_LeftBot) == 0x000568, "Member 'UBP_VendorPortraits_C::Portrait_LeftBot' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, Portrait_LeftMid) == 0x000570, "Member 'UBP_VendorPortraits_C::Portrait_LeftMid' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, Portrait_LeftTop) == 0x000578, "Member 'UBP_VendorPortraits_C::Portrait_LeftTop' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, Portrait_RightBot) == 0x000580, "Member 'UBP_VendorPortraits_C::Portrait_RightBot' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, Portrait_RightMid) == 0x000588, "Member 'UBP_VendorPortraits_C::Portrait_RightMid' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, Portrait_RightTop) == 0x000590, "Member 'UBP_VendorPortraits_C::Portrait_RightTop' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, RightContainer) == 0x000598, "Member 'UBP_VendorPortraits_C::RightContainer' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, RightPortraits) == 0x0005A0, "Member 'UBP_VendorPortraits_C::RightPortraits' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, ScaleBox_LeftBot) == 0x0005A8, "Member 'UBP_VendorPortraits_C::ScaleBox_LeftBot' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, ScaleBox_LeftMid) == 0x0005B0, "Member 'UBP_VendorPortraits_C::ScaleBox_LeftMid' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, ScaleBox_LeftTop) == 0x0005B8, "Member 'UBP_VendorPortraits_C::ScaleBox_LeftTop' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, ScaleBox_RightBot) == 0x0005C0, "Member 'UBP_VendorPortraits_C::ScaleBox_RightBot' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, ScaleBox_RightMid) == 0x0005C8, "Member 'UBP_VendorPortraits_C::ScaleBox_RightMid' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, ScaleBox_RightTop) == 0x0005D0, "Member 'UBP_VendorPortraits_C::ScaleBox_RightTop' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, ScreenBg2) == 0x0005D8, "Member 'UBP_VendorPortraits_C::ScreenBg2' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, CurrentTalker) == 0x0005E0, "Member 'UBP_VendorPortraits_C::CurrentTalker' has a wrong offset!");
static_assert(offsetof(UBP_VendorPortraits_C, Sound2D) == 0x0005E8, "Member 'UBP_VendorPortraits_C::Sound2D' has a wrong offset!");

}

