#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Vendor_Craft_ItemsHandler

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_Vendor_Craft_ItemsHandler.BP_Vendor_Craft_ItemsHandler_C.ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler
// 0x0078 (0x0078 - 0x0000)
struct BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_ItemRequirementText;                  // 0x0048(0x0018)(ConstParm)
	class UItemAbility*                           K2Node_Event_Item;                                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemAbility*                           K2Node_Event_ComparedItem;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEquipped;                            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bAnimate;                             // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bHighlightTooltip;                    // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler) == 0x000008, "Wrong alignment on BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler");
static_assert(sizeof(BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler) == 0x000078, "Wrong size on BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler, EntryPoint) == 0x000000, "Member 'BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler, Temp_bool_Variable) == 0x000004, "Member 'BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler, Temp_byte_Variable) == 0x000005, "Member 'BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler, Temp_byte_Variable_1) == 0x000006, "Member 'BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler, K2Node_Event_IsDesignTime) == 0x000007, "Member 'BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler, K2Node_Event_MyGeometry) == 0x000008, "Member 'BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler, K2Node_Event_InDeltaTime) == 0x000040, "Member 'BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler, K2Node_Event_ItemRequirementText) == 0x000048, "Member 'BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler::K2Node_Event_ItemRequirementText' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler, K2Node_Event_Item) == 0x000060, "Member 'BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler::K2Node_Event_Item' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler, K2Node_Event_ComparedItem) == 0x000068, "Member 'BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler::K2Node_Event_ComparedItem' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler, K2Node_Event_bEquipped) == 0x000070, "Member 'BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler::K2Node_Event_bEquipped' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler, K2Node_Event_bAnimate) == 0x000071, "Member 'BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler::K2Node_Event_bAnimate' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler, K2Node_Event_bHighlightTooltip) == 0x000072, "Member 'BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler::K2Node_Event_bHighlightTooltip' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler, K2Node_Select_Default) == 0x000073, "Member 'BP_Vendor_Craft_ItemsHandler_C_ExecuteUbergraph_BP_Vendor_Craft_ItemsHandler::K2Node_Select_Default' has a wrong offset!");

// Function BP_Vendor_Craft_ItemsHandler.BP_Vendor_Craft_ItemsHandler_C.UpdateDetailsPanel
// 0x0030 (0x0030 - 0x0000)
struct BP_Vendor_Craft_ItemsHandler_C_UpdateDetailsPanel final
{
public:
	class FText                                   ItemRequirementText;                               // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UItemAbility*                           Item;                                              // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemAbility*                           ComparedItem;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEquipped;                                         // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bAnimate;                                          // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bHighlightTooltip;                                 // 0x002A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Vendor_Craft_ItemsHandler_C_UpdateDetailsPanel) == 0x000008, "Wrong alignment on BP_Vendor_Craft_ItemsHandler_C_UpdateDetailsPanel");
static_assert(sizeof(BP_Vendor_Craft_ItemsHandler_C_UpdateDetailsPanel) == 0x000030, "Wrong size on BP_Vendor_Craft_ItemsHandler_C_UpdateDetailsPanel");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_UpdateDetailsPanel, ItemRequirementText) == 0x000000, "Member 'BP_Vendor_Craft_ItemsHandler_C_UpdateDetailsPanel::ItemRequirementText' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_UpdateDetailsPanel, Item) == 0x000018, "Member 'BP_Vendor_Craft_ItemsHandler_C_UpdateDetailsPanel::Item' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_UpdateDetailsPanel, ComparedItem) == 0x000020, "Member 'BP_Vendor_Craft_ItemsHandler_C_UpdateDetailsPanel::ComparedItem' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_UpdateDetailsPanel, bEquipped) == 0x000028, "Member 'BP_Vendor_Craft_ItemsHandler_C_UpdateDetailsPanel::bEquipped' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_UpdateDetailsPanel, bAnimate) == 0x000029, "Member 'BP_Vendor_Craft_ItemsHandler_C_UpdateDetailsPanel::bAnimate' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_UpdateDetailsPanel, bHighlightTooltip) == 0x00002A, "Member 'BP_Vendor_Craft_ItemsHandler_C_UpdateDetailsPanel::bHighlightTooltip' has a wrong offset!");

// Function BP_Vendor_Craft_ItemsHandler.BP_Vendor_Craft_ItemsHandler_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_Vendor_Craft_ItemsHandler_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Craft_ItemsHandler_C_Tick) == 0x000004, "Wrong alignment on BP_Vendor_Craft_ItemsHandler_C_Tick");
static_assert(sizeof(BP_Vendor_Craft_ItemsHandler_C_Tick) == 0x00003C, "Wrong size on BP_Vendor_Craft_ItemsHandler_C_Tick");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_Tick, MyGeometry) == 0x000000, "Member 'BP_Vendor_Craft_ItemsHandler_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_Vendor_Craft_ItemsHandler_C_Tick::InDeltaTime' has a wrong offset!");

// Function BP_Vendor_Craft_ItemsHandler.BP_Vendor_Craft_ItemsHandler_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_Vendor_Craft_ItemsHandler_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Vendor_Craft_ItemsHandler_C_PreConstruct) == 0x000001, "Wrong alignment on BP_Vendor_Craft_ItemsHandler_C_PreConstruct");
static_assert(sizeof(BP_Vendor_Craft_ItemsHandler_C_PreConstruct) == 0x000001, "Wrong size on BP_Vendor_Craft_ItemsHandler_C_PreConstruct");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_Vendor_Craft_ItemsHandler_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_Vendor_Craft_ItemsHandler.BP_Vendor_Craft_ItemsHandler_C.SetItemsHeight
// 0x0048 (0x0048 - 0x0000)
struct BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight final
{
public:
	bool                                          HasGearFilter;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight) == 0x000008, "Wrong alignment on BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight");
static_assert(sizeof(BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight) == 0x000048, "Wrong size on BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight, HasGearFilter) == 0x000000, "Member 'BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight::HasGearFilter' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight, Temp_bool_Variable) == 0x000001, "Member 'BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight, Temp_float_Variable) == 0x000004, "Member 'BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight, Temp_float_Variable_1) == 0x000008, "Member 'BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight, Temp_bool_Variable_1) == 0x00000C, "Member 'BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight, Temp_float_Variable_2) == 0x000010, "Member 'BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight, Temp_float_Variable_3) == 0x000014, "Member 'BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight, Temp_bool_Variable_2) == 0x000018, "Member 'BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight, Temp_byte_Variable) == 0x000019, "Member 'BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight, Temp_byte_Variable_1) == 0x00001A, "Member 'BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight, K2Node_Select_Default) == 0x00001C, "Member 'BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight, K2Node_Select_Default_1) == 0x000020, "Member 'BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight, K2Node_MakeStruct_Margin) == 0x000024, "Member 'BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000038, "Member 'BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight, K2Node_Select_Default_2) == 0x000040, "Member 'BP_Vendor_Craft_ItemsHandler_C_SetItemsHeight::K2Node_Select_Default_2' has a wrong offset!");

// Function BP_Vendor_Craft_ItemsHandler.BP_Vendor_Craft_ItemsHandler_C.Get_ScrollMask_Visibility_0
// 0x000C (0x000C - 0x0000)
struct BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_Visibility_0) == 0x000004, "Wrong alignment on BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_Visibility_0");
static_assert(sizeof(BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_Visibility_0) == 0x00000C, "Wrong size on BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_Visibility_0");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_Visibility_0, ReturnValue) == 0x000000, "Member 'BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_Visibility_0, Temp_bool_Variable) == 0x000001, "Member 'BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_Visibility_0::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_Visibility_0, Temp_byte_Variable) == 0x000002, "Member 'BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_Visibility_0::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_Visibility_0, Temp_byte_Variable_1) == 0x000003, "Member 'BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_Visibility_0::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_Visibility_0, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x000004, "Member 'BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_Visibility_0::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_Visibility_0, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_Visibility_0::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_Visibility_0, K2Node_Select_Default) == 0x000009, "Member 'BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_Visibility_0::K2Node_Select_Default' has a wrong offset!");

// Function BP_Vendor_Craft_ItemsHandler.BP_Vendor_Craft_ItemsHandler_C.Get_ScrollMask_ColorAndOpacity_0
// 0x004C (0x004C - 0x0000)
struct BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_ColorAndOpacity_0 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_ColorAndOpacity_0) == 0x000004, "Wrong alignment on BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_ColorAndOpacity_0");
static_assert(sizeof(BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_ColorAndOpacity_0) == 0x00004C, "Wrong size on BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_ColorAndOpacity_0");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_ColorAndOpacity_0, ReturnValue) == 0x000000, "Member 'BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_ColorAndOpacity_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_ColorAndOpacity_0, Temp_bool_Variable) == 0x000010, "Member 'BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_ColorAndOpacity_0::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_ColorAndOpacity_0, Temp_struct_Variable) == 0x000014, "Member 'BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_ColorAndOpacity_0::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_ColorAndOpacity_0, Temp_struct_Variable_1) == 0x000024, "Member 'BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_ColorAndOpacity_0::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_ColorAndOpacity_0, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x000034, "Member 'BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_ColorAndOpacity_0::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_ColorAndOpacity_0, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000038, "Member 'BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_ColorAndOpacity_0::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_ColorAndOpacity_0, K2Node_Select_Default) == 0x00003C, "Member 'BP_Vendor_Craft_ItemsHandler_C_Get_ScrollMask_ColorAndOpacity_0::K2Node_Select_Default' has a wrong offset!");

// Function BP_Vendor_Craft_ItemsHandler.BP_Vendor_Craft_ItemsHandler_C.ToggleSmallScreen
// 0x00C8 (0x00C8 - 0x0000)
struct BP_Vendor_Craft_ItemsHandler_C_ToggleSmallScreen final
{
public:
	bool                                          InIsSmallScreen;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UDataTable*                             K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_Select_Default_2;                           // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0068(0x0058)(HasGetValueTypeHash)
	class UBorderSlot*                            CallFunc_SlotAsBorderSlot_ReturnValue;             // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Craft_ItemsHandler_C_ToggleSmallScreen) == 0x000008, "Wrong alignment on BP_Vendor_Craft_ItemsHandler_C_ToggleSmallScreen");
static_assert(sizeof(BP_Vendor_Craft_ItemsHandler_C_ToggleSmallScreen) == 0x0000C8, "Wrong size on BP_Vendor_Craft_ItemsHandler_C_ToggleSmallScreen");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_ToggleSmallScreen, InIsSmallScreen) == 0x000000, "Member 'BP_Vendor_Craft_ItemsHandler_C_ToggleSmallScreen::InIsSmallScreen' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_ItemsHandler_C_ToggleSmallScreen, Temp_bool_Variable) == 0x000001, "Member 'BP_Vendor_Craft_ItemsHandler_C_ToggleSmallScreen::Temp_bool_Variable' has a wrong offset!");
