#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VendorActor

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_VendorActor.BP_VendorActor_C.ExecuteUbergraph_BP_VendorActor
// 0x0080 (0x0080 - 0x0000)
struct BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNpcAnimInstance*                       K2Node_DynamicCast_AsNpc_Anim_Instance;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor) == 0x000008, "Wrong alignment on BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor");
static_assert(sizeof(BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor) == 0x000080, "Wrong size on BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor");
static_assert(offsetof(BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor, EntryPoint) == 0x000000, "Member 'BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor, Temp_bool_IsClosed_Variable) == 0x000008, "Member 'BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor, Temp_bool_Has_Been_Initd_Variable) == 0x000010, "Member 'BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor, Temp_int_Array_Index_Variable_1) == 0x000020, "Member 'BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor, Temp_int_Loop_Counter_Variable_2) == 0x000024, "Member 'BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor, CallFunc_Add_IntInt_ReturnValue_2) == 0x000028, "Member 'BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor, Temp_int_Array_Index_Variable_2) == 0x00002C, "Member 'BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000030, "Member 'BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor, CallFunc_GetAnimInstance_ReturnValue) == 0x000050, "Member 'BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor, K2Node_DynamicCast_AsNpc_Anim_Instance) == 0x000060, "Member 'BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor::K2Node_DynamicCast_AsNpc_Anim_Instance' has a wrong offset!");
static_assert(offsetof(BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor, CallFunc_Array_Add_ReturnValue) == 0x00006C, "Member 'BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor, CallFunc_Array_Length_ReturnValue_1) == 0x000070, "Member 'BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor, CallFunc_Less_IntInt_ReturnValue_1) == 0x000074, "Member 'BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor, CallFunc_Array_Length_ReturnValue_2) == 0x000078, "Member 'BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor, CallFunc_Less_IntInt_ReturnValue_2) == 0x00007C, "Member 'BP_VendorActor_C_ExecuteUbergraph_BP_VendorActor::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

}

