#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Vendor_BargainB_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_Vendor_BargainB_Anim.BP_Vendor_BargainB_Anim_C
// 0x0420 (0x0B10 - 0x06F0)
class UBP_Vendor_BargainB_Anim_C final : public UNpcAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06F8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0728(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x07A8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x07D0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0850(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0880(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0900(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0930(0x00B0)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x09E0(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0A88(0x0080)()

public:
	void ExecuteUbergraph_BP_Vendor_BargainB_Anim(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Vendor_BargainB_Anim_AnimGraphNode_TransitionResult_6E660CCC48B380F1BCC92B9CCEFE55A6();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Vendor_BargainB_Anim_C">();
	}
	static class UBP_Vendor_BargainB_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Vendor_BargainB_Anim_C>();
	}
};
static_assert(alignof(UBP_Vendor_BargainB_Anim_C) == 0x000010, "Wrong alignment on UBP_Vendor_BargainB_Anim_C");
static_assert(sizeof(UBP_Vendor_BargainB_Anim_C) == 0x000B10, "Wrong size on UBP_Vendor_BargainB_Anim_C");
static_assert(offsetof(UBP_Vendor_BargainB_Anim_C, UberGraphFrame) == 0x0006F0, "Member 'UBP_Vendor_BargainB_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_BargainB_Anim_C, AnimGraphNode_Root) == 0x0006F8, "Member 'UBP_Vendor_BargainB_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_BargainB_Anim_C, AnimGraphNode_SequencePlayer_3) == 0x000728, "Member 'UBP_Vendor_BargainB_Anim_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_BargainB_Anim_C, AnimGraphNode_TransitionResult) == 0x0007A8, "Member 'UBP_Vendor_BargainB_Anim_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_BargainB_Anim_C, AnimGraphNode_SequencePlayer_2) == 0x0007D0, "Member 'UBP_Vendor_BargainB_Anim_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_BargainB_Anim_C, AnimGraphNode_StateResult_1) == 0x000850, "Member 'UBP_Vendor_BargainB_Anim_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_BargainB_Anim_C, AnimGraphNode_SequencePlayer_1) == 0x000880, "Member 'UBP_Vendor_BargainB_Anim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_BargainB_Anim_C, AnimGraphNode_StateResult) == 0x000900, "Member 'UBP_Vendor_BargainB_Anim_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_BargainB_Anim_C, AnimGraphNode_StateMachine) == 0x000930, "Member 'UBP_Vendor_BargainB_Anim_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_BargainB_Anim_C, AnimGraphNode_BlendListByInt) == 0x0009E0, "Member 'UBP_Vendor_BargainB_Anim_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_BargainB_Anim_C, AnimGraphNode_SequencePlayer) == 0x000A88, "Member 'UBP_Vendor_BargainB_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");

}

