#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Vendor_Craft

#include "Basic.hpp"

#include "man_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Vendor_Craft.BP_Vendor_Craft_C.ExecuteUbergraph_BP_Vendor_Craft
// 0x0330 (0x0330 - 0x0000)
struct BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration_1;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue;         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AnimDuration;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimPlaybackSpeed_ReturnValue_1;       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InLevelUp;                            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_VendorName;                           // 0x0080(0x0018)(ConstParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0098(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	class UTexture2D*                             K2Node_Event_InItemIcon;                           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_InItemName;                           // 0x00F0(0x0018)(ConstParm)
	int32                                         K2Node_Event_InSelectedCount;                      // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InMaxCount;                           // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_InPriceText;                          // 0x0110(0x0018)(ConstParm)
	class FText                                   K2Node_Event_InPriceGoldValue;                     // 0x0128(0x0018)(ConstParm)
	class FText                                   K2Node_Event_InPriceEssenceValue;                  // 0x0140(0x0018)(ConstParm)
	class FText                                   K2Node_Event_InRequirementText;                    // 0x0158(0x0018)(ConstParm)
	class FText                                   K2Node_Event_InItemTypeText;                       // 0x0170(0x0018)(ConstParm)
	bool                                          K2Node_Event_bHasEnoughGold;                       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bHasEnoughEssence;                    // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0190(0x0018)()
	class FText                                   K2Node_Event_SortName;                             // 0x01A8(0x0018)(ConstParm)
	EItemSlot                                     K2Node_Event_ItemSlot;                             // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_FilterName;                           // 0x01C8(0x0018)(ConstParm)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_12;     // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_11;     // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_10;     // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_9;      // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_8;      // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_7;      // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_6;      // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_5;      // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_4;      // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_3;      // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_2;      // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference_1;      // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVendorFilterSlotUserWidget*            K2Node_ComponentBoundEvent_WidgetReference;        // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteractButtonUserWidget*              K2Node_Event_InteractButtonUserWidget_3;           // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteractButtonUserWidget*              K2Node_Event_InteractButtonUserWidget_2;           // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bMinTimeCancel;                       // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractButtonUserWidget*              K2Node_Event_InteractButtonUserWidget_1;           // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_ItemRequirementText;                  // 0x0270(0x0018)(ConstParm)
	class UItemAbility*                           K2Node_Event_InItem;                               // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemAbility*                           K2Node_Event_InComparedItem;                       // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEquipped;                            // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bAnimate;                             // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasGearFilter_ReturnValue;                // 0x029B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCurrencyText_ReturnValue;              // 0x02A0(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteractButtonUserWidget*              K2Node_Event_InteractButtonUserWidget;             // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetFocusedWidget_ReturnValue;             // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_CraftSlot_C*                        K2Node_DynamicCast_AsBP_Craft_Slot;                // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x02E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CraftingCost_Item_New_C*            K2Node_DynamicCast_AsBP_Crafting_Cost_Item_New;    // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30A[0x6];                                      // 0x030A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCurrencyText_ReturnValue_1;            // 0x0310(0x0018)()
	EInputDisplay                                 K2Node_Event_InInputDisplay;                       // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDisplay                                 K2Node_Event_InControlDisplay;                     // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft) == 0x000008, "Wrong alignment on BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft");
static_assert(sizeof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft) == 0x000330, "Wrong size on BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, EntryPoint) == 0x000000, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, Temp_bool_Variable) == 0x000004, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, Temp_byte_Variable) == 0x000005, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, Temp_byte_Variable_1) == 0x000006, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_IsDesignTime) == 0x00000C, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_MyGeometry) == 0x000010, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_InDeltaTime) == 0x000048, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_AnimDuration_1) == 0x00004C, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_AnimDuration_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, CallFunc_GetAnimPlaybackSpeed_ReturnValue) == 0x000050, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::CallFunc_GetAnimPlaybackSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_AnimDuration) == 0x000054, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_AnimDuration' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, CallFunc_PlayAnimation_ReturnValue) == 0x000058, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, CallFunc_GetAnimPlaybackSpeed_ReturnValue_1) == 0x000060, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::CallFunc_GetAnimPlaybackSpeed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, CallFunc_PlayAnimation_ReturnValue_1) == 0x000068, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_InLevelUp) == 0x000070, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_InLevelUp' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, CallFunc_K2_SetTimer_ReturnValue) == 0x000078, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_VendorName) == 0x000080, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_VendorName' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_MakeStruct_FormatArgumentData) == 0x000098, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_MakeArray_Array) == 0x0000D8, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_InItemIcon) == 0x0000E8, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_InItemIcon' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_InItemName) == 0x0000F0, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_InItemName' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_InSelectedCount) == 0x000108, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_InSelectedCount' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_InMaxCount) == 0x00010C, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_InMaxCount' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_InPriceText) == 0x000110, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_InPriceText' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_InPriceGoldValue) == 0x000128, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_InPriceGoldValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_InPriceEssenceValue) == 0x000140, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_InPriceEssenceValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_InRequirementText) == 0x000158, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_InRequirementText' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_InItemTypeText) == 0x000170, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_InItemTypeText' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_bHasEnoughGold) == 0x000188, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_bHasEnoughGold' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_bHasEnoughEssence) == 0x000189, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_bHasEnoughEssence' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, CallFunc_Format_ReturnValue) == 0x000190, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_SortName) == 0x0001A8, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_SortName' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_ItemSlot) == 0x0001C0, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_ItemSlot' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_FilterName) == 0x0001C8, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_FilterName' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_ComponentBoundEvent_WidgetReference_12) == 0x0001E0, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_ComponentBoundEvent_WidgetReference_12' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_ComponentBoundEvent_WidgetReference_11) == 0x0001E8, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_ComponentBoundEvent_WidgetReference_11' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_ComponentBoundEvent_WidgetReference_10) == 0x0001F0, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_ComponentBoundEvent_WidgetReference_10' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_ComponentBoundEvent_WidgetReference_9) == 0x0001F8, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_ComponentBoundEvent_WidgetReference_9' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_ComponentBoundEvent_WidgetReference_8) == 0x000200, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_ComponentBoundEvent_WidgetReference_8' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_ComponentBoundEvent_WidgetReference_7) == 0x000208, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_ComponentBoundEvent_WidgetReference_7' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_ComponentBoundEvent_WidgetReference_6) == 0x000210, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_ComponentBoundEvent_WidgetReference_6' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_ComponentBoundEvent_WidgetReference_5) == 0x000218, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_ComponentBoundEvent_WidgetReference_5' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_ComponentBoundEvent_WidgetReference_4) == 0x000220, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_ComponentBoundEvent_WidgetReference_4' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_ComponentBoundEvent_WidgetReference_3) == 0x000228, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_ComponentBoundEvent_WidgetReference_3' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_ComponentBoundEvent_WidgetReference_2) == 0x000230, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_ComponentBoundEvent_WidgetReference_2' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_ComponentBoundEvent_WidgetReference_1) == 0x000238, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_ComponentBoundEvent_WidgetReference_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_ComponentBoundEvent_WidgetReference) == 0x000240, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_ComponentBoundEvent_WidgetReference' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, Temp_int_Loop_Counter_Variable) == 0x000248, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, CallFunc_Add_IntInt_ReturnValue) == 0x00024C, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_InteractButtonUserWidget_3) == 0x000250, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_InteractButtonUserWidget_3' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_InteractButtonUserWidget_2) == 0x000258, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_InteractButtonUserWidget_2' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_bMinTimeCancel) == 0x000260, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_bMinTimeCancel' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_InteractButtonUserWidget_1) == 0x000268, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_InteractButtonUserWidget_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_ItemRequirementText) == 0x000270, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_ItemRequirementText' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_InItem) == 0x000288, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_InItem' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_InComparedItem) == 0x000290, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_InComparedItem' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_bEquipped) == 0x000298, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_bEquipped' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_bAnimate) == 0x000299, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_bAnimate' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Select_Default) == 0x00029A, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, CallFunc_HasGearFilter_ReturnValue) == 0x00029B, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::CallFunc_HasGearFilter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, CallFunc_GetCurrencyText_ReturnValue) == 0x0002A0, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::CallFunc_GetCurrencyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, CallFunc_PlayAnimation_ReturnValue_2) == 0x0002B8, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_InteractButtonUserWidget) == 0x0002C0, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_InteractButtonUserWidget' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, CallFunc_GetFocusedWidget_ReturnValue) == 0x0002C8, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::CallFunc_GetFocusedWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_DynamicCast_AsBP_Craft_Slot) == 0x0002D0, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_DynamicCast_AsBP_Craft_Slot' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_DynamicCast_bSuccess) == 0x0002D8, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, CallFunc_GetAllChildren_ReturnValue) == 0x0002E0, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, CallFunc_Array_Get_Item) == 0x0002F0, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, CallFunc_Array_Length_ReturnValue) == 0x0002F8, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_DynamicCast_AsBP_Crafting_Cost_Item_New) == 0x000300, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_DynamicCast_AsBP_Crafting_Cost_Item_New' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_DynamicCast_bSuccess_1) == 0x000308, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, CallFunc_Less_IntInt_ReturnValue) == 0x000309, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, CallFunc_GetCurrencyText_ReturnValue_1) == 0x000310, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::CallFunc_GetCurrencyText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_InInputDisplay) == 0x000328, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_InInputDisplay' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft, K2Node_Event_InControlDisplay) == 0x000329, "Member 'BP_Vendor_Craft_C_ExecuteUbergraph_BP_Vendor_Craft::K2Node_Event_InControlDisplay' has a wrong offset!");

// Function BP_Vendor_Craft.BP_Vendor_Craft_C.OnSetInputDisplay
// 0x0002 (0x0002 - 0x0000)
struct BP_Vendor_Craft_C_OnSetInputDisplay final
{
public:
	EInputDisplay                                 InInputDisplay;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDisplay                                 InControlDisplay;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Craft_C_OnSetInputDisplay) == 0x000001, "Wrong alignment on BP_Vendor_Craft_C_OnSetInputDisplay");
static_assert(sizeof(BP_Vendor_Craft_C_OnSetInputDisplay) == 0x000002, "Wrong size on BP_Vendor_Craft_C_OnSetInputDisplay");
static_assert(offsetof(BP_Vendor_Craft_C_OnSetInputDisplay, InInputDisplay) == 0x000000, "Member 'BP_Vendor_Craft_C_OnSetInputDisplay::InInputDisplay' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_OnSetInputDisplay, InControlDisplay) == 0x000001, "Member 'BP_Vendor_Craft_C_OnSetInputDisplay::InControlDisplay' has a wrong offset!");

// Function BP_Vendor_Craft.BP_Vendor_Craft_C.OnErrorHiglight
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Craft_C_OnErrorHiglight final
{
public:
	class UInteractButtonUserWidget*              InteractButtonUserWidget;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Craft_C_OnErrorHiglight) == 0x000008, "Wrong alignment on BP_Vendor_Craft_C_OnErrorHiglight");
static_assert(sizeof(BP_Vendor_Craft_C_OnErrorHiglight) == 0x000008, "Wrong size on BP_Vendor_Craft_C_OnErrorHiglight");
static_assert(offsetof(BP_Vendor_Craft_C_OnErrorHiglight, InteractButtonUserWidget) == 0x000000, "Member 'BP_Vendor_Craft_C_OnErrorHiglight::InteractButtonUserWidget' has a wrong offset!");

// Function BP_Vendor_Craft.BP_Vendor_Craft_C.OnUpdateSelectedItemDetailsPanel
// 0x0030 (0x0030 - 0x0000)
struct BP_Vendor_Craft_C_OnUpdateSelectedItemDetailsPanel final
{
public:
	class FText                                   ItemRequirementText;                               // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UItemAbility*                           InItem;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemAbility*                           InComparedItem;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEquipped;                                         // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bAnimate;                                          // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Vendor_Craft_C_OnUpdateSelectedItemDetailsPanel) == 0x000008, "Wrong alignment on BP_Vendor_Craft_C_OnUpdateSelectedItemDetailsPanel");
static_assert(sizeof(BP_Vendor_Craft_C_OnUpdateSelectedItemDetailsPanel) == 0x000030, "Wrong size on BP_Vendor_Craft_C_OnUpdateSelectedItemDetailsPanel");
static_assert(offsetof(BP_Vendor_Craft_C_OnUpdateSelectedItemDetailsPanel, ItemRequirementText) == 0x000000, "Member 'BP_Vendor_Craft_C_OnUpdateSelectedItemDetailsPanel::ItemRequirementText' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_OnUpdateSelectedItemDetailsPanel, InItem) == 0x000018, "Member 'BP_Vendor_Craft_C_OnUpdateSelectedItemDetailsPanel::InItem' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_OnUpdateSelectedItemDetailsPanel, InComparedItem) == 0x000020, "Member 'BP_Vendor_Craft_C_OnUpdateSelectedItemDetailsPanel::InComparedItem' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_OnUpdateSelectedItemDetailsPanel, bEquipped) == 0x000028, "Member 'BP_Vendor_Craft_C_OnUpdateSelectedItemDetailsPanel::bEquipped' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_OnUpdateSelectedItemDetailsPanel, bAnimate) == 0x000029, "Member 'BP_Vendor_Craft_C_OnUpdateSelectedItemDetailsPanel::bAnimate' has a wrong offset!");

// Function BP_Vendor_Craft.BP_Vendor_Craft_C.OnHoldFinished
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Craft_C_OnHoldFinished final
{
public:
	class UInteractButtonUserWidget*              InteractButtonUserWidget;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Craft_C_OnHoldFinished) == 0x000008, "Wrong alignment on BP_Vendor_Craft_C_OnHoldFinished");
static_assert(sizeof(BP_Vendor_Craft_C_OnHoldFinished) == 0x000008, "Wrong size on BP_Vendor_Craft_C_OnHoldFinished");
static_assert(offsetof(BP_Vendor_Craft_C_OnHoldFinished, InteractButtonUserWidget) == 0x000000, "Member 'BP_Vendor_Craft_C_OnHoldFinished::InteractButtonUserWidget' has a wrong offset!");

// Function BP_Vendor_Craft.BP_Vendor_Craft_C.OnHoldCanceled
// 0x0010 (0x0010 - 0x0000)
struct BP_Vendor_Craft_C_OnHoldCanceled final
{
public:
	class UInteractButtonUserWidget*              InteractButtonUserWidget;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bMinTimeCancel;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Vendor_Craft_C_OnHoldCanceled) == 0x000008, "Wrong alignment on BP_Vendor_Craft_C_OnHoldCanceled");
static_assert(sizeof(BP_Vendor_Craft_C_OnHoldCanceled) == 0x000010, "Wrong size on BP_Vendor_Craft_C_OnHoldCanceled");
static_assert(offsetof(BP_Vendor_Craft_C_OnHoldCanceled, InteractButtonUserWidget) == 0x000000, "Member 'BP_Vendor_Craft_C_OnHoldCanceled::InteractButtonUserWidget' has a wrong offset!");
static_assert(offsetof(BP_Vendor_Craft_C_OnHoldCanceled, bMinTimeCancel) == 0x000008, "Member 'BP_Vendor_Craft_C_OnHoldCanceled::bMinTimeCancel' has a wrong offset!");

// Function BP_Vendor_Craft.BP_Vendor_Craft_C.OnHoldStarted
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Craft_C_OnHoldStarted final
{
public:
	class UInteractButtonUserWidget*              InteractButtonUserWidget;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Craft_C_OnHoldStarted) == 0x000008, "Wrong alignment on BP_Vendor_Craft_C_OnHoldStarted");
static_assert(sizeof(BP_Vendor_Craft_C_OnHoldStarted) == 0x000008, "Wrong size on BP_Vendor_Craft_C_OnHoldStarted");
static_assert(offsetof(BP_Vendor_Craft_C_OnHoldStarted, InteractButtonUserWidget) == 0x000000, "Member 'BP_Vendor_Craft_C_OnHoldStarted::InteractButtonUserWidget' has a wrong offset!");

// Function BP_Vendor_Craft.BP_Vendor_Craft_C.BndEvt__BP_Vendor_Sell_Filter_All_K2Node_ComponentBoundEvent_26_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Craft_C_BndEvt__BP_Vendor_Sell_Filter_All_K2Node_ComponentBoundEvent_26_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Craft_C_BndEvt__BP_Vendor_Sell_Filter_All_K2Node_ComponentBoundEvent_26_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Vendor_Craft_C_BndEvt__BP_Vendor_Sell_Filter_All_K2Node_ComponentBoundEvent_26_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Vendor_Craft_C_BndEvt__BP_Vendor_Sell_Filter_All_K2Node_ComponentBoundEvent_26_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Vendor_Craft_C_BndEvt__BP_Vendor_Sell_Filter_All_K2Node_ComponentBoundEvent_26_OnClicked__DelegateSignature");
static_assert(offsetof(BP_Vendor_Craft_C_BndEvt__BP_Vendor_Sell_Filter_All_K2Node_ComponentBoundEvent_26_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_Vendor_Craft_C_BndEvt__BP_Vendor_Sell_Filter_All_K2Node_ComponentBoundEvent_26_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_Vendor_Craft.BP_Vendor_Craft_C.BndEvt__BP_InventoryWindow_Filter_Diagrams_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Diagrams_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Diagrams_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Diagrams_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Diagrams_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Diagrams_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature");
static_assert(offsetof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Diagrams_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Diagrams_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_Vendor_Craft.BP_Vendor_Craft_C.BndEvt__BP_InventoryWindow_Filter_QuickUse_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_QuickUse_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_QuickUse_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_QuickUse_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_QuickUse_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_QuickUse_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature");
static_assert(offsetof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_QuickUse_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_QuickUse_K2Node_ComponentBoundEvent_25_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_Vendor_Craft.BP_Vendor_Craft_C.BndEvt__BP_InventoryWindow_Filter_QuestItems_K2Node_ComponentBoundEvent_24_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_QuestItems_K2Node_ComponentBoundEvent_24_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_QuestItems_K2Node_ComponentBoundEvent_24_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_QuestItems_K2Node_ComponentBoundEvent_24_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_QuestItems_K2Node_ComponentBoundEvent_24_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_QuestItems_K2Node_ComponentBoundEvent_24_OnClicked__DelegateSignature");
static_assert(offsetof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_QuestItems_K2Node_ComponentBoundEvent_24_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_QuestItems_K2Node_ComponentBoundEvent_24_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_Vendor_Craft.BP_Vendor_Craft_C.BndEvt__BP_InventoryWindow_Filter_Materials_K2Node_ComponentBoundEvent_23_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Materials_K2Node_ComponentBoundEvent_23_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Materials_K2Node_ComponentBoundEvent_23_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Materials_K2Node_ComponentBoundEvent_23_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Materials_K2Node_ComponentBoundEvent_23_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Materials_K2Node_ComponentBoundEvent_23_OnClicked__DelegateSignature");
static_assert(offsetof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Materials_K2Node_ComponentBoundEvent_23_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Materials_K2Node_ComponentBoundEvent_23_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_Vendor_Craft.BP_Vendor_Craft_C.BndEvt__BP_InventoryWindow_Filter_Ring_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Ring_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Ring_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Ring_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Ring_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Ring_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature");
static_assert(offsetof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Ring_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Ring_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_Vendor_Craft.BP_Vendor_Craft_C.BndEvt__BP_InventoryWindow_Filter_Back_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Back_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Back_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Back_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Back_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Back_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature");
static_assert(offsetof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Back_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Back_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_Vendor_Craft.BP_Vendor_Craft_C.BndEvt__BP_InventoryWindow_Filter_Legs_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Legs_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Legs_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Legs_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Legs_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Legs_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature");
static_assert(offsetof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Legs_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Legs_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_Vendor_Craft.BP_Vendor_Craft_C.BndEvt__BP_InventoryWindow_Filter_Hands_K2Node_ComponentBoundEvent_18_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Hands_K2Node_ComponentBoundEvent_18_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Hands_K2Node_ComponentBoundEvent_18_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Hands_K2Node_ComponentBoundEvent_18_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Hands_K2Node_ComponentBoundEvent_18_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Hands_K2Node_ComponentBoundEvent_18_OnClicked__DelegateSignature");
static_assert(offsetof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Hands_K2Node_ComponentBoundEvent_18_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Hands_K2Node_ComponentBoundEvent_18_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_Vendor_Craft.BP_Vendor_Craft_C.BndEvt__BP_InventoryWindow_Filter_Head_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Head_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Head_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Head_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Head_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Head_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature");
static_assert(offsetof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Head_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Head_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_Vendor_Craft.BP_Vendor_Craft_C.BndEvt__BP_InventoryWindow_Filter_Chest_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Chest_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Chest_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Chest_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Chest_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Chest_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature");
static_assert(offsetof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Chest_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Chest_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_Vendor_Craft.BP_Vendor_Craft_C.BndEvt__BP_InventoryWindow_Filter_Offhand_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Offhand_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Offhand_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Offhand_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Offhand_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Offhand_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature");
static_assert(offsetof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Offhand_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature, WidgetReference) == 0x000000, "Member 'BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_Offhand_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature::WidgetReference' has a wrong offset!");

// Function BP_Vendor_Craft.BP_Vendor_Craft_C.BndEvt__BP_InventoryWindow_Filter_MainHand_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_MainHand_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature final
{
public:
	class UVendorFilterSlotUserWidget*            WidgetReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_MainHand_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_MainHand_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature");
static_assert(sizeof(BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_MainHand_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BP_Vendor_Craft_C_BndEvt__BP_InventoryWindow_Filter_MainHand_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature");
