#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Vendor_TransmogSlot

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_Vendor_TransmogSlot.BP_Vendor_TransmogSlot_C.ExecuteUbergraph_BP_Vendor_TransmogSlot
// 0x0088 (0x0088 - 0x0000)
struct BP_Vendor_TransmogSlot_C_ExecuteUbergraph_BP_Vendor_TransmogSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTexture2D*                       K2Node_Event_InIcon;                               // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_InName;                               // 0x0010(0x0018)(ConstParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x002C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     K2Node_Event_InPermanentEnchantIcons;              // 0x0068(0x0010)(ConstParm, ReferenceParm)
	TArray<class UTexture2D*>                     K2Node_Event_InTemporaryEnchantIcons;              // 0x0078(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(BP_Vendor_TransmogSlot_C_ExecuteUbergraph_BP_Vendor_TransmogSlot) == 0x000008, "Wrong alignment on BP_Vendor_TransmogSlot_C_ExecuteUbergraph_BP_Vendor_TransmogSlot");
static_assert(sizeof(BP_Vendor_TransmogSlot_C_ExecuteUbergraph_BP_Vendor_TransmogSlot) == 0x000088, "Wrong size on BP_Vendor_TransmogSlot_C_ExecuteUbergraph_BP_Vendor_TransmogSlot");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_ExecuteUbergraph_BP_Vendor_TransmogSlot, EntryPoint) == 0x000000, "Member 'BP_Vendor_TransmogSlot_C_ExecuteUbergraph_BP_Vendor_TransmogSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_ExecuteUbergraph_BP_Vendor_TransmogSlot, K2Node_Event_InIcon) == 0x000008, "Member 'BP_Vendor_TransmogSlot_C_ExecuteUbergraph_BP_Vendor_TransmogSlot::K2Node_Event_InIcon' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_ExecuteUbergraph_BP_Vendor_TransmogSlot, K2Node_Event_InName) == 0x000010, "Member 'BP_Vendor_TransmogSlot_C_ExecuteUbergraph_BP_Vendor_TransmogSlot::K2Node_Event_InName' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_ExecuteUbergraph_BP_Vendor_TransmogSlot, K2Node_Event_IsDesignTime) == 0x000028, "Member 'BP_Vendor_TransmogSlot_C_ExecuteUbergraph_BP_Vendor_TransmogSlot::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_ExecuteUbergraph_BP_Vendor_TransmogSlot, K2Node_Event_MyGeometry) == 0x00002C, "Member 'BP_Vendor_TransmogSlot_C_ExecuteUbergraph_BP_Vendor_TransmogSlot::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_ExecuteUbergraph_BP_Vendor_TransmogSlot, K2Node_Event_InDeltaTime) == 0x000064, "Member 'BP_Vendor_TransmogSlot_C_ExecuteUbergraph_BP_Vendor_TransmogSlot::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_ExecuteUbergraph_BP_Vendor_TransmogSlot, K2Node_Event_InPermanentEnchantIcons) == 0x000068, "Member 'BP_Vendor_TransmogSlot_C_ExecuteUbergraph_BP_Vendor_TransmogSlot::K2Node_Event_InPermanentEnchantIcons' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_ExecuteUbergraph_BP_Vendor_TransmogSlot, K2Node_Event_InTemporaryEnchantIcons) == 0x000078, "Member 'BP_Vendor_TransmogSlot_C_ExecuteUbergraph_BP_Vendor_TransmogSlot::K2Node_Event_InTemporaryEnchantIcons' has a wrong offset!");

// Function BP_Vendor_TransmogSlot.BP_Vendor_TransmogSlot_C.OnSetSlot
// 0x0020 (0x0020 - 0x0000)
struct BP_Vendor_TransmogSlot_C_OnSetSlot final
{
public:
	const class UTexture2D*                       InIcon;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   InName;                                            // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Vendor_TransmogSlot_C_OnSetSlot) == 0x000008, "Wrong alignment on BP_Vendor_TransmogSlot_C_OnSetSlot");
static_assert(sizeof(BP_Vendor_TransmogSlot_C_OnSetSlot) == 0x000020, "Wrong size on BP_Vendor_TransmogSlot_C_OnSetSlot");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_OnSetSlot, InIcon) == 0x000000, "Member 'BP_Vendor_TransmogSlot_C_OnSetSlot::InIcon' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_OnSetSlot, InName) == 0x000008, "Member 'BP_Vendor_TransmogSlot_C_OnSetSlot::InName' has a wrong offset!");

// Function BP_Vendor_TransmogSlot.BP_Vendor_TransmogSlot_C.OnTemporaryEnchantIconsChanged
// 0x0010 (0x0010 - 0x0000)
struct BP_Vendor_TransmogSlot_C_OnTemporaryEnchantIconsChanged final
{
public:
	TArray<class UTexture2D*>                     InTemporaryEnchantIcons;                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Vendor_TransmogSlot_C_OnTemporaryEnchantIconsChanged) == 0x000008, "Wrong alignment on BP_Vendor_TransmogSlot_C_OnTemporaryEnchantIconsChanged");
static_assert(sizeof(BP_Vendor_TransmogSlot_C_OnTemporaryEnchantIconsChanged) == 0x000010, "Wrong size on BP_Vendor_TransmogSlot_C_OnTemporaryEnchantIconsChanged");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_OnTemporaryEnchantIconsChanged, InTemporaryEnchantIcons) == 0x000000, "Member 'BP_Vendor_TransmogSlot_C_OnTemporaryEnchantIconsChanged::InTemporaryEnchantIcons' has a wrong offset!");

// Function BP_Vendor_TransmogSlot.BP_Vendor_TransmogSlot_C.OnPermanentEnchantIconsChanged
// 0x0010 (0x0010 - 0x0000)
struct BP_Vendor_TransmogSlot_C_OnPermanentEnchantIconsChanged final
{
public:
	TArray<class UTexture2D*>                     InPermanentEnchantIcons;                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Vendor_TransmogSlot_C_OnPermanentEnchantIconsChanged) == 0x000008, "Wrong alignment on BP_Vendor_TransmogSlot_C_OnPermanentEnchantIconsChanged");
static_assert(sizeof(BP_Vendor_TransmogSlot_C_OnPermanentEnchantIconsChanged) == 0x000010, "Wrong size on BP_Vendor_TransmogSlot_C_OnPermanentEnchantIconsChanged");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_OnPermanentEnchantIconsChanged, InPermanentEnchantIcons) == 0x000000, "Member 'BP_Vendor_TransmogSlot_C_OnPermanentEnchantIconsChanged::InPermanentEnchantIcons' has a wrong offset!");

// Function BP_Vendor_TransmogSlot.BP_Vendor_TransmogSlot_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_Vendor_TransmogSlot_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_TransmogSlot_C_Tick) == 0x000004, "Wrong alignment on BP_Vendor_TransmogSlot_C_Tick");
static_assert(sizeof(BP_Vendor_TransmogSlot_C_Tick) == 0x00003C, "Wrong size on BP_Vendor_TransmogSlot_C_Tick");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_Tick, MyGeometry) == 0x000000, "Member 'BP_Vendor_TransmogSlot_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_Vendor_TransmogSlot_C_Tick::InDeltaTime' has a wrong offset!");

// Function BP_Vendor_TransmogSlot.BP_Vendor_TransmogSlot_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_Vendor_TransmogSlot_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Vendor_TransmogSlot_C_PreConstruct) == 0x000001, "Wrong alignment on BP_Vendor_TransmogSlot_C_PreConstruct");
static_assert(sizeof(BP_Vendor_TransmogSlot_C_PreConstruct) == 0x000001, "Wrong size on BP_Vendor_TransmogSlot_C_PreConstruct");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_Vendor_TransmogSlot_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_Vendor_TransmogSlot.BP_Vendor_TransmogSlot_C.SetIcon
// 0x0020 (0x0020 - 0x0000)
struct BP_Vendor_TransmogSlot_C_SetIcon final
{
public:
	class UTexture2D*                             InIcon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_TransmogSlot_C_SetIcon) == 0x000008, "Wrong alignment on BP_Vendor_TransmogSlot_C_SetIcon");
static_assert(sizeof(BP_Vendor_TransmogSlot_C_SetIcon) == 0x000020, "Wrong size on BP_Vendor_TransmogSlot_C_SetIcon");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetIcon, InIcon) == 0x000000, "Member 'BP_Vendor_TransmogSlot_C_SetIcon::InIcon' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetIcon, Temp_bool_Variable) == 0x000008, "Member 'BP_Vendor_TransmogSlot_C_SetIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetIcon, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'BP_Vendor_TransmogSlot_C_SetIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetIcon, Temp_byte_Variable) == 0x00000A, "Member 'BP_Vendor_TransmogSlot_C_SetIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetIcon, CallFunc_Not_PreBool_ReturnValue) == 0x00000B, "Member 'BP_Vendor_TransmogSlot_C_SetIcon::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetIcon, Temp_byte_Variable_1) == 0x00000C, "Member 'BP_Vendor_TransmogSlot_C_SetIcon::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetIcon, Temp_bool_Variable_1) == 0x00000D, "Member 'BP_Vendor_TransmogSlot_C_SetIcon::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetIcon, Temp_byte_Variable_2) == 0x00000E, "Member 'BP_Vendor_TransmogSlot_C_SetIcon::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetIcon, Temp_byte_Variable_3) == 0x00000F, "Member 'BP_Vendor_TransmogSlot_C_SetIcon::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetIcon, K2Node_Select_Default) == 0x000010, "Member 'BP_Vendor_TransmogSlot_C_SetIcon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetIcon, K2Node_Select_Default_1) == 0x000011, "Member 'BP_Vendor_TransmogSlot_C_SetIcon::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetIcon, CallFunc_IsValid_ReturnValue_1) == 0x000012, "Member 'BP_Vendor_TransmogSlot_C_SetIcon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetIcon, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'BP_Vendor_TransmogSlot_C_SetIcon::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function BP_Vendor_TransmogSlot.BP_Vendor_TransmogSlot_C.SetUnavailable
// 0x0050 (0x0050 - 0x0000)
struct BP_Vendor_TransmogSlot_C_SetUnavailable final
{
public:
	bool                                          IsUnavailable;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsUnavailableByResource;                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_2;                           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_3;                           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_TransmogSlot_C_SetUnavailable) == 0x000008, "Wrong alignment on BP_Vendor_TransmogSlot_C_SetUnavailable");
static_assert(sizeof(BP_Vendor_TransmogSlot_C_SetUnavailable) == 0x000050, "Wrong size on BP_Vendor_TransmogSlot_C_SetUnavailable");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetUnavailable, IsUnavailable) == 0x000000, "Member 'BP_Vendor_TransmogSlot_C_SetUnavailable::IsUnavailable' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetUnavailable, IsUnavailableByResource) == 0x000001, "Member 'BP_Vendor_TransmogSlot_C_SetUnavailable::IsUnavailableByResource' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetUnavailable, Temp_bool_Variable) == 0x000002, "Member 'BP_Vendor_TransmogSlot_C_SetUnavailable::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetUnavailable, Temp_object_Variable) == 0x000008, "Member 'BP_Vendor_TransmogSlot_C_SetUnavailable::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetUnavailable, Temp_object_Variable_1) == 0x000010, "Member 'BP_Vendor_TransmogSlot_C_SetUnavailable::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetUnavailable, Temp_bool_Variable_1) == 0x000018, "Member 'BP_Vendor_TransmogSlot_C_SetUnavailable::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetUnavailable, Temp_byte_Variable) == 0x000019, "Member 'BP_Vendor_TransmogSlot_C_SetUnavailable::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetUnavailable, Temp_byte_Variable_1) == 0x00001A, "Member 'BP_Vendor_TransmogSlot_C_SetUnavailable::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetUnavailable, Temp_bool_Variable_2) == 0x00001B, "Member 'BP_Vendor_TransmogSlot_C_SetUnavailable::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetUnavailable, Temp_float_Variable) == 0x00001C, "Member 'BP_Vendor_TransmogSlot_C_SetUnavailable::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetUnavailable, Temp_float_Variable_1) == 0x000020, "Member 'BP_Vendor_TransmogSlot_C_SetUnavailable::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetUnavailable, Temp_bool_Variable_3) == 0x000024, "Member 'BP_Vendor_TransmogSlot_C_SetUnavailable::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetUnavailable, Temp_float_Variable_2) == 0x000028, "Member 'BP_Vendor_TransmogSlot_C_SetUnavailable::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetUnavailable, Temp_float_Variable_3) == 0x00002C, "Member 'BP_Vendor_TransmogSlot_C_SetUnavailable::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetUnavailable, K2Node_Select_Default) == 0x000030, "Member 'BP_Vendor_TransmogSlot_C_SetUnavailable::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetUnavailable, K2Node_Select_Default_1) == 0x000038, "Member 'BP_Vendor_TransmogSlot_C_SetUnavailable::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetUnavailable, K2Node_Select_Default_2) == 0x00003C, "Member 'BP_Vendor_TransmogSlot_C_SetUnavailable::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetUnavailable, K2Node_Select_Default_3) == 0x000040, "Member 'BP_Vendor_TransmogSlot_C_SetUnavailable::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_SetUnavailable, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000048, "Member 'BP_Vendor_TransmogSlot_C_SetUnavailable::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function BP_Vendor_TransmogSlot.BP_Vendor_TransmogSlot_C.Set Filter Icon
// 0x0010 (0x0010 - 0x0000)
struct BP_Vendor_TransmogSlot_C_Set_Filter_Icon final
{
public:
	class UTexture2D*                             InFilterIconActive;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             InFilterIconDisabled;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_TransmogSlot_C_Set_Filter_Icon) == 0x000008, "Wrong alignment on BP_Vendor_TransmogSlot_C_Set_Filter_Icon");
static_assert(sizeof(BP_Vendor_TransmogSlot_C_Set_Filter_Icon) == 0x000010, "Wrong size on BP_Vendor_TransmogSlot_C_Set_Filter_Icon");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_Set_Filter_Icon, InFilterIconActive) == 0x000000, "Member 'BP_Vendor_TransmogSlot_C_Set_Filter_Icon::InFilterIconActive' has a wrong offset!");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_Set_Filter_Icon, InFilterIconDisabled) == 0x000008, "Member 'BP_Vendor_TransmogSlot_C_Set_Filter_Icon::InFilterIconDisabled' has a wrong offset!");

// Function BP_Vendor_TransmogSlot.BP_Vendor_TransmogSlot_C.PlayTransmogFinishedAnim
// 0x0008 (0x0008 - 0x0000)
struct BP_Vendor_TransmogSlot_C_PlayTransmogFinishedAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Vendor_TransmogSlot_C_PlayTransmogFinishedAnim) == 0x000008, "Wrong alignment on BP_Vendor_TransmogSlot_C_PlayTransmogFinishedAnim");
static_assert(sizeof(BP_Vendor_TransmogSlot_C_PlayTransmogFinishedAnim) == 0x000008, "Wrong size on BP_Vendor_TransmogSlot_C_PlayTransmogFinishedAnim");
static_assert(offsetof(BP_Vendor_TransmogSlot_C_PlayTransmogFinishedAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'BP_Vendor_TransmogSlot_C_PlayTransmogFinishedAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

