#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Vendor_TransmogRow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Vendor_TransmogRow.BP_Vendor_TransmogRow_C
// 0x0098 (0x0310 - 0x0278)
class UBP_Vendor_TransmogRow_C final : public UVendorTransmogRowUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Arrow;                                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CharacterWindow_InventoryFilterSlot_C* InventorySlot;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SlotNameCaption;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TransmogItemName;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Vendor_TransmogSlot_C*              TransmogSlot;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TransmogText;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   SlotName;                                          // 0x02B8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UTexture2D*                             FilterIconUp;                                      // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             FilterIconDis;                                     // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             FilterIconOver;                                    // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             FilterIconSel;                                     // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsUnavailable;                                     // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             BgTexture;                                         // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             TransmogIcon;                                      // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsSmallScreen;                                     // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BP_Vendor_TransmogRow(int32 EntryPoint);
	void OnSetData(class UTexture2D* InEquippedItemIcon, class UTexture2D* InTransmogItemIcon, const class FText& InTransmogItemName, bool bInUnavailable);
	void PreConstruct(bool IsDesignTime);
	void SetSlotName(const class FText& InName);
	void SetTransmogItem(class UTexture2D* InIcon, const class FText& InName);
	void SetFilterIcon(class UTexture2D* InFilterIconUp, class UTexture2D* InFilterIconOver, class UTexture2D* InFilterIconSel, class UTexture2D* InFilterIconDis);
	void SetUnavailable(bool InUnavailable);
	void SetTextures();
	void ToggleSmallScreen(bool InIsSmallScreen);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Vendor_TransmogRow_C">();
	}
	static class UBP_Vendor_TransmogRow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Vendor_TransmogRow_C>();
	}
};
static_assert(alignof(UBP_Vendor_TransmogRow_C) == 0x000008, "Wrong alignment on UBP_Vendor_TransmogRow_C");
static_assert(sizeof(UBP_Vendor_TransmogRow_C) == 0x000310, "Wrong size on UBP_Vendor_TransmogRow_C");
static_assert(offsetof(UBP_Vendor_TransmogRow_C, UberGraphFrame) == 0x000278, "Member 'UBP_Vendor_TransmogRow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogRow_C, Arrow) == 0x000280, "Member 'UBP_Vendor_TransmogRow_C::Arrow' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogRow_C, Border_0) == 0x000288, "Member 'UBP_Vendor_TransmogRow_C::Border_0' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogRow_C, InventorySlot) == 0x000290, "Member 'UBP_Vendor_TransmogRow_C::InventorySlot' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogRow_C, SlotNameCaption) == 0x000298, "Member 'UBP_Vendor_TransmogRow_C::SlotNameCaption' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogRow_C, TransmogItemName) == 0x0002A0, "Member 'UBP_Vendor_TransmogRow_C::TransmogItemName' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogRow_C, TransmogSlot) == 0x0002A8, "Member 'UBP_Vendor_TransmogRow_C::TransmogSlot' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogRow_C, TransmogText) == 0x0002B0, "Member 'UBP_Vendor_TransmogRow_C::TransmogText' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogRow_C, SlotName) == 0x0002B8, "Member 'UBP_Vendor_TransmogRow_C::SlotName' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogRow_C, FilterIconUp) == 0x0002D0, "Member 'UBP_Vendor_TransmogRow_C::FilterIconUp' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogRow_C, FilterIconDis) == 0x0002D8, "Member 'UBP_Vendor_TransmogRow_C::FilterIconDis' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogRow_C, FilterIconOver) == 0x0002E0, "Member 'UBP_Vendor_TransmogRow_C::FilterIconOver' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogRow_C, FilterIconSel) == 0x0002E8, "Member 'UBP_Vendor_TransmogRow_C::FilterIconSel' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogRow_C, IsUnavailable) == 0x0002F0, "Member 'UBP_Vendor_TransmogRow_C::IsUnavailable' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogRow_C, BgTexture) == 0x0002F8, "Member 'UBP_Vendor_TransmogRow_C::BgTexture' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogRow_C, TransmogIcon) == 0x000300, "Member 'UBP_Vendor_TransmogRow_C::TransmogIcon' has a wrong offset!");
static_assert(offsetof(UBP_Vendor_TransmogRow_C, IsSmallScreen) == 0x000308, "Member 'UBP_Vendor_TransmogRow_C::IsSmallScreen' has a wrong offset!");

}

