#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WaterRings1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_WaterRings1.BP_WaterRings1_C.ExecuteUbergraph_BP_WaterRings1
// 0x01B8 (0x01B8 - 0x0000)
struct BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_WaterRings_Ability_C*               K2Node_DynamicCast_AsBP_Water_Rings_Ability;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0054(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_1;      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue_1;             // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue_2;             // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_5;             // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_6;             // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_8;        // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_9;        // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1) == 0x000008, "Wrong alignment on BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1");
static_assert(sizeof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1) == 0x0001B8, "Wrong size on BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, EntryPoint) == 0x000000, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Abs_ReturnValue) == 0x000004, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_GetAbilityController_ReturnValue) == 0x000008, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000010, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, K2Node_DynamicCast_AsBP_Water_Rings_Ability) == 0x000020, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::K2Node_DynamicCast_AsBP_Water_Rings_Ability' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00002C, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_BreakVector_X) == 0x000038, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_BreakVector_Y) == 0x00003C, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_BreakVector_Z) == 0x000040, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, K2Node_Event_DeltaTime) == 0x000044, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_MakeVector_ReturnValue) == 0x000048, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000054, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000DC, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000E0, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000E4, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0000E8, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0000EC, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x0000F0, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x0000F4, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0000F8, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0000FC, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000108, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_BreakVector_X_1) == 0x00010C, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_BreakVector_Y_1) == 0x000110, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_BreakVector_Z_1) == 0x000114, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000118, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x00011C, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000120, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Add_FloatFloat_ReturnValue) == 0x000124, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Conv_BoolToInt_ReturnValue) == 0x000128, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00012C, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000130, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000134, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_EqualEqual_FloatFloat_ReturnValue_1) == 0x000138, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_EqualEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x00013C, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Conv_BoolToInt_ReturnValue_1) == 0x000140, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Conv_BoolToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000144, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x000148, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_RandomFloatInRange_ReturnValue_5) == 0x00014C, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_RandomFloatInRange_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x000150, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Add_FloatFloat_ReturnValue_4) == 0x000154, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Add_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000158, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Conv_BoolToInt_ReturnValue_2) == 0x00015C, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Conv_BoolToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000160, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00016C, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_BreakVector_X_2) == 0x000170, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_BreakVector_Y_2) == 0x000174, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_BreakVector_Z_2) == 0x000178, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Add_FloatFloat_ReturnValue_5) == 0x00017C, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Add_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Add_FloatFloat_ReturnValue_6) == 0x000180, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Add_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000184, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_FClamp_ReturnValue) == 0x000188, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Multiply_FloatFloat_ReturnValue_7) == 0x00018C, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Multiply_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Multiply_FloatFloat_ReturnValue_8) == 0x000190, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Multiply_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_MakeVector_ReturnValue_1) == 0x000194, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Multiply_FloatFloat_ReturnValue_9) == 0x0001A0, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Multiply_FloatFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_MakeVector_ReturnValue_2) == 0x0001A4, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0001B0, "Member 'BP_WaterRings1_C_ExecuteUbergraph_BP_WaterRings1::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function BP_WaterRings1.BP_WaterRings1_C.BPTick
// 0x0004 (0x0004 - 0x0000)
struct BP_WaterRings1_C_BPTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WaterRings1_C_BPTick) == 0x000004, "Wrong alignment on BP_WaterRings1_C_BPTick");
static_assert(sizeof(BP_WaterRings1_C_BPTick) == 0x000004, "Wrong size on BP_WaterRings1_C_BPTick");
static_assert(offsetof(BP_WaterRings1_C_BPTick, DeltaTime) == 0x000000, "Member 'BP_WaterRings1_C_BPTick::DeltaTime' has a wrong offset!");

}

