#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "S_WeaponTrailEffectParameters_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_WeaponActor.BP_WeaponActor_C.ExecuteUbergraph_BP_WeaponActor
// 0x0048 (0x0048 - 0x0000)
struct BP_WeaponActor_C_ExecuteUbergraph_BP_WeaponActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bActivate, bool bLeftHand, bool bRightHand)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_bActivate;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bLeftHand;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bRightHand;                     // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAttached;                            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHeroBase*                              K2Node_DynamicCast_AsHero_Base;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WeaponActor_C_ExecuteUbergraph_BP_WeaponActor) == 0x000008, "Wrong alignment on BP_WeaponActor_C_ExecuteUbergraph_BP_WeaponActor");
static_assert(sizeof(BP_WeaponActor_C_ExecuteUbergraph_BP_WeaponActor) == 0x000048, "Wrong size on BP_WeaponActor_C_ExecuteUbergraph_BP_WeaponActor");
static_assert(offsetof(BP_WeaponActor_C_ExecuteUbergraph_BP_WeaponActor, EntryPoint) == 0x000000, "Member 'BP_WeaponActor_C_ExecuteUbergraph_BP_WeaponActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_ExecuteUbergraph_BP_WeaponActor, CallFunc_GetAbilityController_ReturnValue) == 0x000008, "Member 'BP_WeaponActor_C_ExecuteUbergraph_BP_WeaponActor::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_ExecuteUbergraph_BP_WeaponActor, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_WeaponActor_C_ExecuteUbergraph_BP_WeaponActor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_ExecuteUbergraph_BP_WeaponActor, K2Node_CustomEvent_bActivate) == 0x000020, "Member 'BP_WeaponActor_C_ExecuteUbergraph_BP_WeaponActor::K2Node_CustomEvent_bActivate' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_ExecuteUbergraph_BP_WeaponActor, K2Node_CustomEvent_bLeftHand) == 0x000021, "Member 'BP_WeaponActor_C_ExecuteUbergraph_BP_WeaponActor::K2Node_CustomEvent_bLeftHand' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_ExecuteUbergraph_BP_WeaponActor, K2Node_CustomEvent_bRightHand) == 0x000022, "Member 'BP_WeaponActor_C_ExecuteUbergraph_BP_WeaponActor::K2Node_CustomEvent_bRightHand' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_ExecuteUbergraph_BP_WeaponActor, CallFunc_GetAttachParentActor_ReturnValue) == 0x000028, "Member 'BP_WeaponActor_C_ExecuteUbergraph_BP_WeaponActor::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_ExecuteUbergraph_BP_WeaponActor, K2Node_Event_bAttached) == 0x000030, "Member 'BP_WeaponActor_C_ExecuteUbergraph_BP_WeaponActor::K2Node_Event_bAttached' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_ExecuteUbergraph_BP_WeaponActor, K2Node_DynamicCast_AsHero_Base) == 0x000038, "Member 'BP_WeaponActor_C_ExecuteUbergraph_BP_WeaponActor::K2Node_DynamicCast_AsHero_Base' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_ExecuteUbergraph_BP_WeaponActor, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_WeaponActor_C_ExecuteUbergraph_BP_WeaponActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_WeaponActor.BP_WeaponActor_C.BPPostWeaponAttachToggle
// 0x0001 (0x0001 - 0x0000)
struct BP_WeaponActor_C_BPPostWeaponAttachToggle final
{
public:
	bool                                          bAttached;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WeaponActor_C_BPPostWeaponAttachToggle) == 0x000001, "Wrong alignment on BP_WeaponActor_C_BPPostWeaponAttachToggle");
static_assert(sizeof(BP_WeaponActor_C_BPPostWeaponAttachToggle) == 0x000001, "Wrong size on BP_WeaponActor_C_BPPostWeaponAttachToggle");
static_assert(offsetof(BP_WeaponActor_C_BPPostWeaponAttachToggle, bAttached) == 0x000000, "Member 'BP_WeaponActor_C_BPPostWeaponAttachToggle::bAttached' has a wrong offset!");

// Function BP_WeaponActor.BP_WeaponActor_C.WeaponTrailToggle
// 0x0003 (0x0003 - 0x0000)
struct BP_WeaponActor_C_WeaponTrailToggle final
{
public:
	bool                                          bActivate;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLeftHand;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bRightHand;                                        // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WeaponActor_C_WeaponTrailToggle) == 0x000001, "Wrong alignment on BP_WeaponActor_C_WeaponTrailToggle");
static_assert(sizeof(BP_WeaponActor_C_WeaponTrailToggle) == 0x000003, "Wrong size on BP_WeaponActor_C_WeaponTrailToggle");
static_assert(offsetof(BP_WeaponActor_C_WeaponTrailToggle, bActivate) == 0x000000, "Member 'BP_WeaponActor_C_WeaponTrailToggle::bActivate' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_WeaponTrailToggle, bLeftHand) == 0x000001, "Member 'BP_WeaponActor_C_WeaponTrailToggle::bLeftHand' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_WeaponTrailToggle, bRightHand) == 0x000002, "Member 'BP_WeaponActor_C_WeaponTrailToggle::bRightHand' has a wrong offset!");

// Function BP_WeaponActor.BP_WeaponActor_C.UserConstructionScript
// 0x00B8 (0x00B8 - 0x0000)
struct BP_WeaponActor_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0028(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UNiagaraSystem*                         CallFunc_GetAsset_ReturnValue;                     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponActor_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_WeaponActor_C_UserConstructionScript");
static_assert(sizeof(BP_WeaponActor_C_UserConstructionScript) == 0x0000B8, "Wrong size on BP_WeaponActor_C_UserConstructionScript");
static_assert(offsetof(BP_WeaponActor_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000000, "Member 'BP_WeaponActor_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x00000C, "Member 'BP_WeaponActor_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_UserConstructionScript, CallFunc_VLerp_ReturnValue) == 0x000018, "Member 'BP_WeaponActor_C_UserConstructionScript::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_UserConstructionScript, CallFunc_Vector_Distance_ReturnValue) == 0x000024, "Member 'BP_WeaponActor_C_UserConstructionScript::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_UserConstructionScript, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000028, "Member 'BP_WeaponActor_C_UserConstructionScript::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_UserConstructionScript, CallFunc_GetAsset_ReturnValue) == 0x0000B0, "Member 'BP_WeaponActor_C_UserConstructionScript::CallFunc_GetAsset_ReturnValue' has a wrong offset!");

// Function BP_WeaponActor.BP_WeaponActor_C.GetWeaponTrailEffectParameters
// 0x002C (0x002C - 0x0000)
struct BP_WeaponActor_C_GetWeaponTrailEffectParameters final
{
public:
	struct FS_WeaponTrailEffectParameters         WeaponTrailEffectParameters_0;                     // 0x0000(0x002C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponActor_C_GetWeaponTrailEffectParameters) == 0x000004, "Wrong alignment on BP_WeaponActor_C_GetWeaponTrailEffectParameters");
static_assert(sizeof(BP_WeaponActor_C_GetWeaponTrailEffectParameters) == 0x00002C, "Wrong size on BP_WeaponActor_C_GetWeaponTrailEffectParameters");
static_assert(offsetof(BP_WeaponActor_C_GetWeaponTrailEffectParameters, WeaponTrailEffectParameters_0) == 0x000000, "Member 'BP_WeaponActor_C_GetWeaponTrailEffectParameters::WeaponTrailEffectParameters_0' has a wrong offset!");

// Function BP_WeaponActor.BP_WeaponActor_C.HeavyAttackChargeVFX
// 0x0050 (0x0050 - 0x0000)
struct BP_WeaponActor_C_HeavyAttackChargeVFX final
{
public:
	bool                                          Full;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrawlerHero_C*                      K2Node_DynamicCast_AsBP_Brawler_Hero;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceFeedbackComponent*                CallFunc_Force_Feedback_Vertical_FF1;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackComponent*                CallFunc_Force_Feedback_Vertical_FF2;              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackComponent*                CallFunc_Force_Feedback_Vertical_FF3;              // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackComponent*                CallFunc_Force_Feedback_Vertical_FF4;              // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponActor_C_HeavyAttackChargeVFX) == 0x000008, "Wrong alignment on BP_WeaponActor_C_HeavyAttackChargeVFX");
static_assert(sizeof(BP_WeaponActor_C_HeavyAttackChargeVFX) == 0x000050, "Wrong size on BP_WeaponActor_C_HeavyAttackChargeVFX");
static_assert(offsetof(BP_WeaponActor_C_HeavyAttackChargeVFX, Full) == 0x000000, "Member 'BP_WeaponActor_C_HeavyAttackChargeVFX::Full' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_HeavyAttackChargeVFX, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'BP_WeaponActor_C_HeavyAttackChargeVFX::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_HeavyAttackChargeVFX, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_WeaponActor_C_HeavyAttackChargeVFX::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_HeavyAttackChargeVFX, K2Node_DynamicCast_AsBP_Brawler_Hero) == 0x000020, "Member 'BP_WeaponActor_C_HeavyAttackChargeVFX::K2Node_DynamicCast_AsBP_Brawler_Hero' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_HeavyAttackChargeVFX, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_WeaponActor_C_HeavyAttackChargeVFX::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_HeavyAttackChargeVFX, CallFunc_Force_Feedback_Vertical_FF1) == 0x000030, "Member 'BP_WeaponActor_C_HeavyAttackChargeVFX::CallFunc_Force_Feedback_Vertical_FF1' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_HeavyAttackChargeVFX, CallFunc_Force_Feedback_Vertical_FF2) == 0x000038, "Member 'BP_WeaponActor_C_HeavyAttackChargeVFX::CallFunc_Force_Feedback_Vertical_FF2' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_HeavyAttackChargeVFX, CallFunc_Force_Feedback_Vertical_FF3) == 0x000040, "Member 'BP_WeaponActor_C_HeavyAttackChargeVFX::CallFunc_Force_Feedback_Vertical_FF3' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_HeavyAttackChargeVFX, CallFunc_Force_Feedback_Vertical_FF4) == 0x000048, "Member 'BP_WeaponActor_C_HeavyAttackChargeVFX::CallFunc_Force_Feedback_Vertical_FF4' has a wrong offset!");

// Function BP_WeaponActor.BP_WeaponActor_C.ToggleSwordTrailVFX
// 0x0001 (0x0001 - 0x0000)
struct BP_WeaponActor_C_ToggleSwordTrailVFX final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WeaponActor_C_ToggleSwordTrailVFX) == 0x000001, "Wrong alignment on BP_WeaponActor_C_ToggleSwordTrailVFX");
static_assert(sizeof(BP_WeaponActor_C_ToggleSwordTrailVFX) == 0x000001, "Wrong size on BP_WeaponActor_C_ToggleSwordTrailVFX");
static_assert(offsetof(BP_WeaponActor_C_ToggleSwordTrailVFX, On) == 0x000000, "Member 'BP_WeaponActor_C_ToggleSwordTrailVFX::On' has a wrong offset!");

// Function BP_WeaponActor.BP_WeaponActor_C.GetOwnerFacing
// 0x0003 (0x0003 - 0x0000)
struct BP_WeaponActor_C_GetOwnerFacing final
{
public:
	bool                                          isRight;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WeaponActor_C_GetOwnerFacing) == 0x000001, "Wrong alignment on BP_WeaponActor_C_GetOwnerFacing");
static_assert(sizeof(BP_WeaponActor_C_GetOwnerFacing) == 0x000003, "Wrong size on BP_WeaponActor_C_GetOwnerFacing");
static_assert(offsetof(BP_WeaponActor_C_GetOwnerFacing, isRight) == 0x000000, "Member 'BP_WeaponActor_C_GetOwnerFacing::isRight' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_GetOwnerFacing, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_WeaponActor_C_GetOwnerFacing::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_GetOwnerFacing, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000002, "Member 'BP_WeaponActor_C_GetOwnerFacing::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_WeaponActor.BP_WeaponActor_C.ApplyWeaponTrail
// 0x0028 (0x0028 - 0x0000)
struct BP_WeaponActor_C_ApplyWeaponTrail final
{
public:
	class UNiagaraSystem*                         NiagaraSystemAsset;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Remove;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponActor_C_ApplyWeaponTrail) == 0x000008, "Wrong alignment on BP_WeaponActor_C_ApplyWeaponTrail");
static_assert(sizeof(BP_WeaponActor_C_ApplyWeaponTrail) == 0x000028, "Wrong size on BP_WeaponActor_C_ApplyWeaponTrail");
static_assert(offsetof(BP_WeaponActor_C_ApplyWeaponTrail, NiagaraSystemAsset) == 0x000000, "Member 'BP_WeaponActor_C_ApplyWeaponTrail::NiagaraSystemAsset' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_ApplyWeaponTrail, Remove) == 0x000008, "Member 'BP_WeaponActor_C_ApplyWeaponTrail::Remove' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_ApplyWeaponTrail, CallFunc_Array_Contains_ReturnValue) == 0x000009, "Member 'BP_WeaponActor_C_ApplyWeaponTrail::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_ApplyWeaponTrail, CallFunc_IsValid_ReturnValue) == 0x00000A, "Member 'BP_WeaponActor_C_ApplyWeaponTrail::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_ApplyWeaponTrail, CallFunc_Array_RemoveItem_ReturnValue) == 0x00000B, "Member 'BP_WeaponActor_C_ApplyWeaponTrail::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_ApplyWeaponTrail, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BP_WeaponActor_C_ApplyWeaponTrail::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_ApplyWeaponTrail, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'BP_WeaponActor_C_ApplyWeaponTrail::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_ApplyWeaponTrail, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_WeaponActor_C_ApplyWeaponTrail::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_ApplyWeaponTrail, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'BP_WeaponActor_C_ApplyWeaponTrail::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_ApplyWeaponTrail, CallFunc_Array_Contains_ReturnValue_1) == 0x000021, "Member 'BP_WeaponActor_C_ApplyWeaponTrail::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_ApplyWeaponTrail, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'BP_WeaponActor_C_ApplyWeaponTrail::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_C_ApplyWeaponTrail, CallFunc_Array_AddUnique_ReturnValue) == 0x000024, "Member 'BP_WeaponActor_C_ApplyWeaponTrail::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

}

