#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WaterRings_Ability

#include "Basic.hpp"

#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WaterRings_Ability.BP_WaterRings_Ability_C
// 0x0010 (0x0640 - 0x0630)
class UBP_WaterRings_Ability_C final : public UEmptyPassiveAbility
{
public:
	float                                         WaterHeight;                                       // 0x0630(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaterDrift;                                        // 0x0634(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RingsOn;                                           // 0x0638(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WaterRings_Ability_C">();
	}
	static class UBP_WaterRings_Ability_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_WaterRings_Ability_C>();
	}
};
static_assert(alignof(UBP_WaterRings_Ability_C) == 0x000008, "Wrong alignment on UBP_WaterRings_Ability_C");
static_assert(sizeof(UBP_WaterRings_Ability_C) == 0x000640, "Wrong size on UBP_WaterRings_Ability_C");
static_assert(offsetof(UBP_WaterRings_Ability_C, WaterHeight) == 0x000630, "Member 'UBP_WaterRings_Ability_C::WaterHeight' has a wrong offset!");
static_assert(offsetof(UBP_WaterRings_Ability_C, WaterDrift) == 0x000634, "Member 'UBP_WaterRings_Ability_C::WaterDrift' has a wrong offset!");
static_assert(offsetof(UBP_WaterRings_Ability_C, RingsOn) == 0x000638, "Member 'UBP_WaterRings_Ability_C::RingsOn' has a wrong offset!");

}

