#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WitchAltarGameplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WitchAltarGameplay.BP_WitchAltarGameplay_C
// 0x0020 (0x07F8 - 0x07D8)
class ABP_WitchAltarGameplay_C final : public AActorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMiniMapActorComponent*                 MiniMapActor;                                      // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTriggerBoxComponent*                   TriggerBox;                                        // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BPPostBeginPlay();
	void ExecuteUbergraph_BP_WitchAltarGameplay(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WitchAltarGameplay_C">();
	}
	static class ABP_WitchAltarGameplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WitchAltarGameplay_C>();
	}
};
static_assert(alignof(ABP_WitchAltarGameplay_C) == 0x000008, "Wrong alignment on ABP_WitchAltarGameplay_C");
static_assert(sizeof(ABP_WitchAltarGameplay_C) == 0x0007F8, "Wrong size on ABP_WitchAltarGameplay_C");
static_assert(offsetof(ABP_WitchAltarGameplay_C, UberGraphFrame) == 0x0007D8, "Member 'ABP_WitchAltarGameplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_WitchAltarGameplay_C, MiniMapActor) == 0x0007E0, "Member 'ABP_WitchAltarGameplay_C::MiniMapActor' has a wrong offset!");
static_assert(offsetof(ABP_WitchAltarGameplay_C, TriggerBox) == 0x0007E8, "Member 'ABP_WitchAltarGameplay_C::TriggerBox' has a wrong offset!");
static_assert(offsetof(ABP_WitchAltarGameplay_C, DefaultSceneRoot) == 0x0007F0, "Member 'ABP_WitchAltarGameplay_C::DefaultSceneRoot' has a wrong offset!");

}

