#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WindmillBlades_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_WindmillBlades_Anim.BP_WindmillBlades_Anim_C
// 0x0210 (0x04D0 - 0x02C0)
class UBP_WindmillBlades_Anim_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x02F8(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0400(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0420(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0440(0x0080)()
	float                                         Angle;                                             // 0x04C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_WindmillBlades_Anim_AnimGraphNode_ModifyBone_BF6AB6874FCC18167FB804B265B22EF0();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_BP_WindmillBlades_Anim(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WindmillBlades_Anim_C">();
	}
	static class UBP_WindmillBlades_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_WindmillBlades_Anim_C>();
	}
};
static_assert(alignof(UBP_WindmillBlades_Anim_C) == 0x000010, "Wrong alignment on UBP_WindmillBlades_Anim_C");
static_assert(sizeof(UBP_WindmillBlades_Anim_C) == 0x0004D0, "Wrong size on UBP_WindmillBlades_Anim_C");
static_assert(offsetof(UBP_WindmillBlades_Anim_C, UberGraphFrame) == 0x0002C0, "Member 'UBP_WindmillBlades_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_WindmillBlades_Anim_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UBP_WindmillBlades_Anim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_WindmillBlades_Anim_C, AnimGraphNode_ModifyBone) == 0x0002F8, "Member 'UBP_WindmillBlades_Anim_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UBP_WindmillBlades_Anim_C, AnimGraphNode_LocalToComponentSpace) == 0x000400, "Member 'UBP_WindmillBlades_Anim_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UBP_WindmillBlades_Anim_C, AnimGraphNode_ComponentToLocalSpace) == 0x000420, "Member 'UBP_WindmillBlades_Anim_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UBP_WindmillBlades_Anim_C, AnimGraphNode_SequencePlayer) == 0x000440, "Member 'UBP_WindmillBlades_Anim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBP_WindmillBlades_Anim_C, Angle) == 0x0004C0, "Member 'UBP_WindmillBlades_Anim_C::Angle' has a wrong offset!");

}

