#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponCollision_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WeaponCollision_VisualEntity.BP_WeaponCollision_VisualEntity_C
// 0x0018 (0x0368 - 0x0350)
class ABP_WeaponCollision_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayerInstanced_;                                  // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_WeaponCollision_VisualEntity(int32 EntryPoint);
	void VisualEntityConstructionFinished();
	void GetTracedGroundPos(struct FVector* TraceStartPos, bool* ValidPos);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WeaponCollision_VisualEntity_C">();
	}
	static class ABP_WeaponCollision_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WeaponCollision_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_WeaponCollision_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_WeaponCollision_VisualEntity_C");
static_assert(sizeof(ABP_WeaponCollision_VisualEntity_C) == 0x000368, "Wrong size on ABP_WeaponCollision_VisualEntity_C");
static_assert(offsetof(ABP_WeaponCollision_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_WeaponCollision_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_WeaponCollision_VisualEntity_C, Niagara) == 0x000358, "Member 'ABP_WeaponCollision_VisualEntity_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_WeaponCollision_VisualEntity_C, PlayerInstanced_) == 0x000360, "Member 'ABP_WeaponCollision_VisualEntity_C::PlayerInstanced_' has a wrong offset!");

}

