#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponEffect_BASE_VisualEntity

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_WeaponEffect_BASE_VisualEntity.BP_WeaponEffect_BASE_VisualEntity_C.ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity
// 0x0080 (0x0080 - 0x0000)
struct BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_WeaponActor_C*                      K2Node_DynamicCast_AsBP_Weapon_Actor;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_WeaponActor_C*                      K2Node_DynamicCast_AsBP_Weapon_Actor_1;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0034(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0050(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStart;                               // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity) == 0x000008, "Wrong alignment on BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity");
static_assert(sizeof(BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity) == 0x000080, "Wrong size on BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity, CallFunc_GetAbilityController_ReturnValue) == 0x000008, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity, CallFunc_IsValid_ReturnValue_2) == 0x000010, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity, K2Node_DynamicCast_AsBP_Weapon_Actor) == 0x000018, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity::K2Node_DynamicCast_AsBP_Weapon_Actor' has a wrong offset!");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity, K2Node_DynamicCast_AsBP_Weapon_Actor_1) == 0x000028, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity::K2Node_DynamicCast_AsBP_Weapon_Actor_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity, Temp_delegate_Variable) == 0x000034, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity, CallFunc_IsValid_ReturnValue_3) == 0x000044, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity, CallFunc_IsValid_ReturnValue_4) == 0x000045, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity, Temp_delegate_Variable_1) == 0x000050, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity, K2Node_DynamicCast_AsCharacter_Base) == 0x000060, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity, K2Node_Event_bStart) == 0x000069, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity::K2Node_Event_bStart' has a wrong offset!");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity, CallFunc_PostAkEvent_ReturnValue) == 0x00006C, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity, CallFunc_IsValid_ReturnValue_5) == 0x000070, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity, CallFunc_NotEqual_NameName_ReturnValue) == 0x000071, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity, CallFunc_PostAkEvent_ReturnValue_1) == 0x000074, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity, CallFunc_IsValid_ReturnValue_6) == 0x000078, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_ExecuteUbergraph_BP_WeaponEffect_BASE_VisualEntity::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");

// Function BP_WeaponEffect_BASE_VisualEntity.BP_WeaponEffect_BASE_VisualEntity_C.AttachParentWeaponTrail
// 0x0001 (0x0001 - 0x0000)
struct BP_WeaponEffect_BASE_VisualEntity_C_AttachParentWeaponTrail final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WeaponEffect_BASE_VisualEntity_C_AttachParentWeaponTrail) == 0x000001, "Wrong alignment on BP_WeaponEffect_BASE_VisualEntity_C_AttachParentWeaponTrail");
static_assert(sizeof(BP_WeaponEffect_BASE_VisualEntity_C_AttachParentWeaponTrail) == 0x000001, "Wrong size on BP_WeaponEffect_BASE_VisualEntity_C_AttachParentWeaponTrail");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_AttachParentWeaponTrail, bStart) == 0x000000, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_AttachParentWeaponTrail::bStart' has a wrong offset!");

// Function BP_WeaponEffect_BASE_VisualEntity.BP_WeaponEffect_BASE_VisualEntity_C.SwapWeaponTrail
// 0x0018 (0x0018 - 0x0000)
struct BP_WeaponEffect_BASE_VisualEntity_C_SwapWeaponTrail final
{
public:
	bool                                          ToOriginal_;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_WeaponActor_C*                      WeaponActor_0;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WeaponEffect_BASE_VisualEntity_C_SwapWeaponTrail) == 0x000008, "Wrong alignment on BP_WeaponEffect_BASE_VisualEntity_C_SwapWeaponTrail");
static_assert(sizeof(BP_WeaponEffect_BASE_VisualEntity_C_SwapWeaponTrail) == 0x000018, "Wrong size on BP_WeaponEffect_BASE_VisualEntity_C_SwapWeaponTrail");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_SwapWeaponTrail, ToOriginal_) == 0x000000, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_SwapWeaponTrail::ToOriginal_' has a wrong offset!");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_SwapWeaponTrail, WeaponActor_0) == 0x000008, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_SwapWeaponTrail::WeaponActor_0' has a wrong offset!");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_SwapWeaponTrail, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_SwapWeaponTrail::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_WeaponEffect_BASE_VisualEntity.BP_WeaponEffect_BASE_VisualEntity_C.ApplyWeaponEffect
// 0x0018 (0x0018 - 0x0000)
struct BP_WeaponEffect_BASE_VisualEntity_C_ApplyWeaponEffect final
{
public:
	class ABP_WeaponActor_C*                      WeaponActor_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WeaponEffect_BASE_VisualEntity_C_ApplyWeaponEffect) == 0x000008, "Wrong alignment on BP_WeaponEffect_BASE_VisualEntity_C_ApplyWeaponEffect");
static_assert(sizeof(BP_WeaponEffect_BASE_VisualEntity_C_ApplyWeaponEffect) == 0x000018, "Wrong size on BP_WeaponEffect_BASE_VisualEntity_C_ApplyWeaponEffect");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_ApplyWeaponEffect, WeaponActor_0) == 0x000000, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_ApplyWeaponEffect::WeaponActor_0' has a wrong offset!");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_ApplyWeaponEffect, NiagaraComponent) == 0x000008, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_ApplyWeaponEffect::NiagaraComponent' has a wrong offset!");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_ApplyWeaponEffect, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_ApplyWeaponEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponEffect_BASE_VisualEntity_C_ApplyWeaponEffect, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'BP_WeaponEffect_BASE_VisualEntity_C_ApplyWeaponEffect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

