#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Widescreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Widescreen.BP_Widescreen_C
// 0x0028 (0x04D8 - 0x04B0)
class UBP_Widescreen_C final : public UCutsceneUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Bottom;                                            // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Top;                                               // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Widescreen(int32 EntryPoint);
	void OnHide(float AnimDuration);
	void OnShow(float AnimDuration);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Widescreen_C">();
	}
	static class UBP_Widescreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Widescreen_C>();
	}
};
static_assert(alignof(UBP_Widescreen_C) == 0x000008, "Wrong alignment on UBP_Widescreen_C");
static_assert(sizeof(UBP_Widescreen_C) == 0x0004D8, "Wrong size on UBP_Widescreen_C");
static_assert(offsetof(UBP_Widescreen_C, UberGraphFrame) == 0x0004B0, "Member 'UBP_Widescreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Widescreen_C, FadeOutAnim) == 0x0004B8, "Member 'UBP_Widescreen_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_Widescreen_C, FadeInAnim) == 0x0004C0, "Member 'UBP_Widescreen_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_Widescreen_C, Bottom) == 0x0004C8, "Member 'UBP_Widescreen_C::Bottom' has a wrong offset!");
static_assert(offsetof(UBP_Widescreen_C, Top) == 0x0004D0, "Member 'UBP_Widescreen_C::Top' has a wrong offset!");

}

