#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WyldSeed_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WyldSeed_VisualEntity.BP_WyldSeed_VisualEntity_C
// 0x0038 (0x0388 - 0x0350)
class ABP_WyldSeed_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_WyldSeed_chargeupMAX;                           // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_WyldSeed_SlowAura;                              // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FullGrowthTime;                                    // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_WIldSeedProjectile_C*               WildSeedProjectile;                                // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timer;                                             // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SlowAuraUnlocked;                                  // 0x0384(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsAlive;                                           // 0x0385(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_WyldSeed_VisualEntity(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void OnCustomMessage(class FName Msg);
	void OnKill();
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WyldSeed_VisualEntity_C">();
	}
	static class ABP_WyldSeed_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WyldSeed_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_WyldSeed_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_WyldSeed_VisualEntity_C");
static_assert(sizeof(ABP_WyldSeed_VisualEntity_C) == 0x000388, "Wrong size on ABP_WyldSeed_VisualEntity_C");
static_assert(offsetof(ABP_WyldSeed_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_WyldSeed_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_WyldSeed_VisualEntity_C, NS_WyldSeed_chargeupMAX) == 0x000358, "Member 'ABP_WyldSeed_VisualEntity_C::NS_WyldSeed_chargeupMAX' has a wrong offset!");
static_assert(offsetof(ABP_WyldSeed_VisualEntity_C, NS_WyldSeed_SlowAura) == 0x000360, "Member 'ABP_WyldSeed_VisualEntity_C::NS_WyldSeed_SlowAura' has a wrong offset!");
static_assert(offsetof(ABP_WyldSeed_VisualEntity_C, Niagara) == 0x000368, "Member 'ABP_WyldSeed_VisualEntity_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_WyldSeed_VisualEntity_C, FullGrowthTime) == 0x000370, "Member 'ABP_WyldSeed_VisualEntity_C::FullGrowthTime' has a wrong offset!");
static_assert(offsetof(ABP_WyldSeed_VisualEntity_C, WildSeedProjectile) == 0x000378, "Member 'ABP_WyldSeed_VisualEntity_C::WildSeedProjectile' has a wrong offset!");
static_assert(offsetof(ABP_WyldSeed_VisualEntity_C, Timer) == 0x000380, "Member 'ABP_WyldSeed_VisualEntity_C::Timer' has a wrong offset!");
static_assert(offsetof(ABP_WyldSeed_VisualEntity_C, SlowAuraUnlocked) == 0x000384, "Member 'ABP_WyldSeed_VisualEntity_C::SlowAuraUnlocked' has a wrong offset!");
static_assert(offsetof(ABP_WyldSeed_VisualEntity_C, IsAlive) == 0x000385, "Member 'ABP_WyldSeed_VisualEntity_C::IsAlive' has a wrong offset!");

}

