#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WindmillBlades

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WindmillBlades.BP_WindmillBlades_C
// 0x0040 (0x0848 - 0x0808)
class ABP_WindmillBlades_C final : public AActorCheckPoint
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0808(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Wing4;                                             // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Wing3;                                             // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Wing2;                                             // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Wing1;                                             // 0x0828(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_WindmillBlades;                                 // 0x0830(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0838(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          UseOverlapSound;                                   // 0x0840(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_WindmillBlades(int32 EntryPoint);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WindmillBlades_C">();
	}
	static class ABP_WindmillBlades_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WindmillBlades_C>();
	}
};
static_assert(alignof(ABP_WindmillBlades_C) == 0x000008, "Wrong alignment on ABP_WindmillBlades_C");
static_assert(sizeof(ABP_WindmillBlades_C) == 0x000848, "Wrong size on ABP_WindmillBlades_C");
static_assert(offsetof(ABP_WindmillBlades_C, UberGraphFrame) == 0x000808, "Member 'ABP_WindmillBlades_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_WindmillBlades_C, Wing4) == 0x000810, "Member 'ABP_WindmillBlades_C::Wing4' has a wrong offset!");
static_assert(offsetof(ABP_WindmillBlades_C, Wing3) == 0x000818, "Member 'ABP_WindmillBlades_C::Wing3' has a wrong offset!");
static_assert(offsetof(ABP_WindmillBlades_C, Wing2) == 0x000820, "Member 'ABP_WindmillBlades_C::Wing2' has a wrong offset!");
static_assert(offsetof(ABP_WindmillBlades_C, Wing1) == 0x000828, "Member 'ABP_WindmillBlades_C::Wing1' has a wrong offset!");
static_assert(offsetof(ABP_WindmillBlades_C, SK_WindmillBlades) == 0x000830, "Member 'ABP_WindmillBlades_C::SK_WindmillBlades' has a wrong offset!");
static_assert(offsetof(ABP_WindmillBlades_C, DefaultSceneRoot) == 0x000838, "Member 'ABP_WindmillBlades_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_WindmillBlades_C, UseOverlapSound) == 0x000840, "Member 'ABP_WindmillBlades_C::UseOverlapSound' has a wrong offset!");

}

