#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponCollision_VisualEntity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_WeaponCollision_VisualEntity.BP_WeaponCollision_VisualEntity_C.ExecuteUbergraph_BP_WeaponCollision_VisualEntity
// 0x00E8 (0x00E8 - 0x0000)
struct BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurfaceTypeVolume*                     CallFunc_GetSurfaceTypeVolumeByPosition_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTracedGroundPos_TraceStartPos;         // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTracedGroundPos_ValidPos;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0060(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity) == 0x000008, "Wrong alignment on BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity");
static_assert(sizeof(BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity) == 0x0000E8, "Wrong size on BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity, CallFunc_GetManGameMode_ReturnValue) == 0x000010, "Member 'BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity::CallFunc_GetManGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000018, "Member 'BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity, CallFunc_GetSurfaceTypeVolumeByPosition_ReturnValue) == 0x000028, "Member 'BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity::CallFunc_GetSurfaceTypeVolumeByPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000034, "Member 'BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity, CallFunc_GetTracedGroundPos_TraceStartPos) == 0x000044, "Member 'BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity::CallFunc_GetTracedGroundPos_TraceStartPos' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity, CallFunc_GetTracedGroundPos_ValidPos) == 0x000050, "Member 'BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity::CallFunc_GetTracedGroundPos_ValidPos' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000058, "Member 'BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000060, "Member 'BP_WeaponCollision_VisualEntity_C_ExecuteUbergraph_BP_WeaponCollision_VisualEntity::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function BP_WeaponCollision_VisualEntity.BP_WeaponCollision_VisualEntity_C.GetTracedGroundPos
// 0x0290 (0x0290 - 0x0000)
struct BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos final
{
public:
	struct FVector                                TraceStartPos;                                     // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ValidPos;                                          // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ActorTransform;                                    // 0x0010(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0050(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue_1;       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0xC];                                       // 0x00B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x00C0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0108(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x016C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F7[0x1];                                      // 0x01F7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos) == 0x000010, "Wrong alignment on BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos");
static_assert(sizeof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos) == 0x000290, "Wrong size on BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, TraceStartPos) == 0x000000, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::TraceStartPos' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, ValidPos) == 0x00000C, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::ValidPos' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, ActorTransform) == 0x000010, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::ActorTransform' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_GetTransform_ReturnValue) == 0x000050, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_GetAttachParentActor_ReturnValue) == 0x000080, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_GetAttachParentActor_ReturnValue_1) == 0x000088, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_GetAttachParentActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakTransform_Location) == 0x000090, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakTransform_Rotation) == 0x00009C, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakTransform_Scale) == 0x0000A8, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_GetTransform_ReturnValue_1) == 0x0000C0, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakVector_X) == 0x0000F0, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakVector_Y) == 0x0000F4, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakVector_Z) == 0x0000F8, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000100, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, Temp_object_Variable) == 0x000108, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000118, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000128, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakVector_X_1) == 0x000130, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakVector_Y_1) == 0x000134, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakVector_Z_1) == 0x000138, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x00013C, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_MakeVector_ReturnValue) == 0x000148, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakVector_X_2) == 0x000154, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakVector_Y_2) == 0x000158, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakVector_Z_2) == 0x00015C, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000160, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_LineTraceSingle_OutHit) == 0x00016C, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_LineTraceSingle_ReturnValue) == 0x0001F4, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakHitResult_bBlockingHit) == 0x0001F5, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001F6, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakHitResult_Time) == 0x0001F8, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakHitResult_Distance) == 0x0001FC, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakHitResult_Location) == 0x000200, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakHitResult_ImpactPoint) == 0x00020C, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakHitResult_Normal) == 0x000218, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakHitResult_ImpactNormal) == 0x000224, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakHitResult_PhysMat) == 0x000230, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakHitResult_HitActor) == 0x000238, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakHitResult_HitComponent) == 0x000240, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakHitResult_HitBoneName) == 0x000248, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakHitResult_HitItem) == 0x000250, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakHitResult_ElementIndex) == 0x000254, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakHitResult_FaceIndex) == 0x000258, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakHitResult_TraceStart) == 0x00025C, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakHitResult_TraceEnd) == 0x000268, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakVector_X_3) == 0x000274, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakVector_Y_3) == 0x000278, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_BreakVector_Z_3) == 0x00027C, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos, CallFunc_MakeVector_ReturnValue_1) == 0x000280, "Member 'BP_WeaponCollision_VisualEntity_C_GetTracedGroundPos::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");

}

