#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Whirlwind_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Whirlwind_VisualEntity.BP_Whirlwind_VisualEntity_C
// 0x0020 (0x0370 - 0x0350)
class ABP_Whirlwind_VisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastHitPos;                                        // 0x0360(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Whirlwind_VisualEntity(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void OnKill();
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Whirlwind_VisualEntity_C">();
	}
	static class ABP_Whirlwind_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Whirlwind_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_Whirlwind_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_Whirlwind_VisualEntity_C");
static_assert(sizeof(ABP_Whirlwind_VisualEntity_C) == 0x000370, "Wrong size on ABP_Whirlwind_VisualEntity_C");
static_assert(offsetof(ABP_Whirlwind_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_Whirlwind_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Whirlwind_VisualEntity_C, Niagara) == 0x000358, "Member 'ABP_Whirlwind_VisualEntity_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_Whirlwind_VisualEntity_C, LastHitPos) == 0x000360, "Member 'ABP_Whirlwind_VisualEntity_C::LastHitPos' has a wrong offset!");

}

