#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WispBeam_VE

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_WispBeam_VE.BP_WispBeam_VE_C.ExecuteUbergraph_BP_WispBeam_VE
// 0x00C8 (0x00C8 - 0x0000)
struct BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FriendlyWisp_Familiar_C*            K2Node_DynamicCast_AsBP_Friendly_Wisp_Familiar;    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShadowWispAttackAbility*               K2Node_DynamicCast_AsShadow_Wisp_Attack_Ability;   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEnemyCharacter*                        CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEnemyCharacter*                        CallFunc_Array_Get_Item_1;                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AEnemyCharacter*                        CallFunc_Array_Get_Item_2;                         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_2;          // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE) == 0x000008, "Wrong alignment on BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE");
static_assert(sizeof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE) == 0x0000C8, "Wrong size on BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, EntryPoint) == 0x000000, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000004, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, CallFunc_PostEventAtLocation_ReturnValue) == 0x000010, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, K2Node_DynamicCast_AsBP_Friendly_Wisp_Familiar) == 0x000028, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::K2Node_DynamicCast_AsBP_Friendly_Wisp_Familiar' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, CallFunc_GetAbilityController_ReturnValue) == 0x000038, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000040, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000050, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, K2Node_DynamicCast_AsShadow_Wisp_Attack_Ability) == 0x000058, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::K2Node_DynamicCast_AsShadow_Wisp_Attack_Ability' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, K2Node_Event_DeltaSeconds) == 0x000064, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, CallFunc_Array_Find_ReturnValue) == 0x000068, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, CallFunc_Array_Get_Item) == 0x000070, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, CallFunc_GetSocketLocation_ReturnValue) == 0x00007C, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, CallFunc_Multiply_IntInt_ReturnValue) == 0x000088, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, CallFunc_Array_Get_Item_1) == 0x000090, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, CallFunc_Add_IntInt_ReturnValue) == 0x000098, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, CallFunc_IsValid_ReturnValue_2) == 0x00009C, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, CallFunc_Array_Get_Item_2) == 0x0000A0, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, CallFunc_IsValid_ReturnValue_3) == 0x0000A8, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, CallFunc_GetSocketLocation_ReturnValue_1) == 0x0000AC, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, CallFunc_GetSocketLocation_ReturnValue_2) == 0x0000B8, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::CallFunc_GetSocketLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C4, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, CallFunc_IsValid_ReturnValue_4) == 0x0000C5, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, CallFunc_Less_IntInt_ReturnValue) == 0x0000C6, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE, CallFunc_IsValid_ReturnValue_5) == 0x0000C7, "Member 'BP_WispBeam_VE_C_ExecuteUbergraph_BP_WispBeam_VE::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");

// Function BP_WispBeam_VE.BP_WispBeam_VE_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_WispBeam_VE_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WispBeam_VE_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_WispBeam_VE_C_ReceiveTick");
static_assert(sizeof(BP_WispBeam_VE_C_ReceiveTick) == 0x000004, "Wrong size on BP_WispBeam_VE_C_ReceiveTick");
static_assert(offsetof(BP_WispBeam_VE_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_WispBeam_VE_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

