#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WyldSeed_VisualEntity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_WyldSeed_VisualEntity.BP_WyldSeed_VisualEntity_C.ExecuteUbergraph_BP_WyldSeed_VisualEntity
// 0x0090 (0x0090 - 0x0000)
struct BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentDamageRadius_ReturnValue;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Msg;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_WIldSeedProjectile_C*               K2Node_DynamicCast_AsBP_WIld_Seed_Projectile;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAbilityUpgradeUnlocked_ReturnValue;     // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaledBoxExtent_ReturnValue;           // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName Msg)>              K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83[0x1];                                       // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFullGrowthTime_ReturnValue;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentDamageRadius_ReturnValue_1;     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity) == 0x000008, "Wrong alignment on BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity");
static_assert(sizeof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity) == 0x000090, "Wrong size on BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, CallFunc_GetCurrentDamageRadius_ReturnValue) == 0x000008, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::CallFunc_GetCurrentDamageRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, Temp_bool_Has_Been_Initd_Variable) == 0x000010, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, K2Node_CustomEvent_Msg) == 0x000020, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::K2Node_CustomEvent_Msg' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, K2Node_DynamicCast_AsBP_WIld_Seed_Projectile) == 0x000028, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::K2Node_DynamicCast_AsBP_WIld_Seed_Projectile' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000031, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, K2Node_Event_DeltaSeconds) == 0x000034, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, CallFunc_GetAbilityController_ReturnValue) == 0x000038, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000040, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000044, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, CallFunc_Add_FloatFloat_ReturnValue) == 0x000048, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, CallFunc_IsAbilityUpgradeUnlocked_ReturnValue) == 0x00004C, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::CallFunc_IsAbilityUpgradeUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, CallFunc_FClamp_ReturnValue) == 0x000050, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, CallFunc_GetScaledBoxExtent_ReturnValue) == 0x000054, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::CallFunc_GetScaledBoxExtent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, CallFunc_BreakVector_X) == 0x000060, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, CallFunc_BreakVector_Y) == 0x000064, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, CallFunc_BreakVector_Z) == 0x000068, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, Temp_bool_IsClosed_Variable) == 0x00006C, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000080, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, CallFunc_IsValid_ReturnValue_1) == 0x000081, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, CallFunc_BooleanAND_ReturnValue) == 0x000082, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, CallFunc_GetFullGrowthTime_ReturnValue) == 0x000084, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::CallFunc_GetFullGrowthTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, CallFunc_GetCurrentDamageRadius_ReturnValue_1) == 0x000088, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::CallFunc_GetCurrentDamageRadius_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00008C, "Member 'BP_WyldSeed_VisualEntity_C_ExecuteUbergraph_BP_WyldSeed_VisualEntity::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function BP_WyldSeed_VisualEntity.BP_WyldSeed_VisualEntity_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_WyldSeed_VisualEntity_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WyldSeed_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_WyldSeed_VisualEntity_C_ReceiveTick");
static_assert(sizeof(BP_WyldSeed_VisualEntity_C_ReceiveTick) == 0x000004, "Wrong size on BP_WyldSeed_VisualEntity_C_ReceiveTick");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_WyldSeed_VisualEntity_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_WyldSeed_VisualEntity.BP_WyldSeed_VisualEntity_C.OnCustomMessage
// 0x0008 (0x0008 - 0x0000)
struct BP_WyldSeed_VisualEntity_C_OnCustomMessage final
{
public:
	class FName                                   Msg;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WyldSeed_VisualEntity_C_OnCustomMessage) == 0x000004, "Wrong alignment on BP_WyldSeed_VisualEntity_C_OnCustomMessage");
static_assert(sizeof(BP_WyldSeed_VisualEntity_C_OnCustomMessage) == 0x000008, "Wrong size on BP_WyldSeed_VisualEntity_C_OnCustomMessage");
static_assert(offsetof(BP_WyldSeed_VisualEntity_C_OnCustomMessage, Msg) == 0x000000, "Member 'BP_WyldSeed_VisualEntity_C_OnCustomMessage::Msg' has a wrong offset!");

}

