#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Warg_Boss

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Warg_Boss.BP_Warg_Boss_C.ExecuteUbergraph_BP_Warg_Boss
// 0x02C0 (0x02C0 - 0x0000)
struct BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Killer, class UAbilityController* KillerAbilityController)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0028(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BPGetAIPhaseIndex_ReturnValue;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_EntropyRift_SimpleClosable_C*> CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x0048(0x0010)(ReferenceParm)
	class ABP_EntropyRift_SimpleClosable_C*       CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Killer;                         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     K2Node_CustomEvent_KillerAbilityController;        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHitReactionPassive*                    CallFunc_GetHitReactionPassive_ReturnValue;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x00E0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UNiagaraComponent*                      CallFunc_SpawnSystemWithFixedFacing_System;        // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_VfxEventType;                         // 0x017C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0185(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_186[0x2];                                      // 0x0186(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue_1;       // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMandragoraGameMode*                    CallFunc_GetGameMode_ReturnValue;                  // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue_2;       // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetGameMode_ReturnValue_1;                // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrawlerHero_C*                      K2Node_DynamicCast_AsBP_Brawler_Hero;              // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceFeedbackComponent*                CallFunc_Force_Feedback_Vertical_FF1;              // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackComponent*                CallFunc_Force_Feedback_Vertical_FF2;              // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackComponent*                CallFunc_Force_Feedback_Vertical_FF3;              // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackComponent*                CallFunc_Force_Feedback_Vertical_FF4;              // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrawlerHero_C*                      K2Node_DynamicCast_AsBP_Brawler_Hero_1;            // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackComponent*                CallFunc_Force_Feedback_Vertical_FF1_1;            // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackComponent*                CallFunc_Force_Feedback_Vertical_FF2_1;            // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackComponent*                CallFunc_Force_Feedback_Vertical_FF3_1;            // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackComponent*                CallFunc_Force_Feedback_Vertical_FF4_1;            // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue_3;       // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetGameMode_ReturnValue_2;                // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrawlerHero_C*                      K2Node_DynamicCast_AsBP_Brawler_Hero_2;            // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceFeedbackComponent*                CallFunc_Force_Feedback_Vertical_FF1_2;            // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackComponent*                CallFunc_Force_Feedback_Vertical_FF2_2;            // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackComponent*                CallFunc_Force_Feedback_Vertical_FF3_2;            // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackComponent*                CallFunc_Force_Feedback_Vertical_FF4_2;            // 0x0270(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_7;        // 0x0284(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue_1;            // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss) == 0x000010, "Wrong alignment on BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss");
static_assert(sizeof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss) == 0x0002C0, "Wrong size on BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, EntryPoint) == 0x000000, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, Temp_delegate_Variable) == 0x000028, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_PostEvent_ReturnValue) == 0x000038, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_BPGetAIPhaseIndex_ReturnValue) == 0x00003C, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_BPGetAIPhaseIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, K2Node_Event_DeltaSeconds) == 0x000040, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000044, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, Temp_bool_Has_Been_Initd_Variable) == 0x000045, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_GetAllActorsOfClassWithTag_OutActors) == 0x000048, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_GetAllActorsOfClassWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00006C, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_Vector_Distance_ReturnValue) == 0x000078, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00007C, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000080, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000084, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, K2Node_CustomEvent_Killer) == 0x000088, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::K2Node_CustomEvent_Killer' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, K2Node_CustomEvent_KillerAbilityController) == 0x000090, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::K2Node_CustomEvent_KillerAbilityController' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_GetAbilityController_ReturnValue) == 0x000098, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_GetHitReactionPassive_ReturnValue) == 0x0000A0, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_GetHitReactionPassive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x0000A8, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x0000B0, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x0000E0, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_SpawnSystemWithFixedFacing_System) == 0x000168, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_SpawnSystemWithFixedFacing_System' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000170, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, K2Node_Event_VfxEventType) == 0x00017C, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::K2Node_Event_VfxEventType' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, K2Node_SwitchName_CmpSuccess) == 0x000184, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, Temp_bool_IsClosed_Variable) == 0x000185, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_GetSocketLocation_ReturnValue) == 0x000188, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000194, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_GetAbilityController_ReturnValue_1) == 0x0001A0, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_GetAbilityController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x0001A8, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_GetGameMode_ReturnValue) == 0x0001B8, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_GetAbilityController_ReturnValue_2) == 0x0001C0, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_GetAbilityController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_GetGameMode_ReturnValue_1) == 0x0001C8, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, K2Node_DynamicCast_AsBP_Brawler_Hero) == 0x0001D0, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::K2Node_DynamicCast_AsBP_Brawler_Hero' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, K2Node_DynamicCast_bSuccess) == 0x0001D8, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_Force_Feedback_Vertical_FF1) == 0x0001E0, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_Force_Feedback_Vertical_FF1' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_Force_Feedback_Vertical_FF2) == 0x0001E8, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_Force_Feedback_Vertical_FF2' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_Force_Feedback_Vertical_FF3) == 0x0001F0, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_Force_Feedback_Vertical_FF3' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_Force_Feedback_Vertical_FF4) == 0x0001F8, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_Force_Feedback_Vertical_FF4' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, K2Node_DynamicCast_AsBP_Brawler_Hero_1) == 0x000200, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::K2Node_DynamicCast_AsBP_Brawler_Hero_1' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, K2Node_DynamicCast_bSuccess_1) == 0x000208, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x00020C, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_Force_Feedback_Vertical_FF1_1) == 0x000218, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_Force_Feedback_Vertical_FF1_1' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_Force_Feedback_Vertical_FF2_1) == 0x000220, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_Force_Feedback_Vertical_FF2_1' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_Force_Feedback_Vertical_FF3_1) == 0x000228, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_Force_Feedback_Vertical_FF3_1' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_Force_Feedback_Vertical_FF4_1) == 0x000230, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_Force_Feedback_Vertical_FF4_1' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_GetAbilityController_ReturnValue_3) == 0x000238, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_GetAbilityController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_GetGameMode_ReturnValue_2) == 0x000240, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_GetGameMode_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, K2Node_DynamicCast_AsBP_Brawler_Hero_2) == 0x000248, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::K2Node_DynamicCast_AsBP_Brawler_Hero_2' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, K2Node_DynamicCast_bSuccess_2) == 0x000250, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_Force_Feedback_Vertical_FF1_2) == 0x000258, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_Force_Feedback_Vertical_FF1_2' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_Force_Feedback_Vertical_FF2_2) == 0x000260, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_Force_Feedback_Vertical_FF2_2' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_Force_Feedback_Vertical_FF3_2) == 0x000268, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_Force_Feedback_Vertical_FF3_2' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_Force_Feedback_Vertical_FF4_2) == 0x000270, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_Force_Feedback_Vertical_FF4_2' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_K2_GetActorLocation_ReturnValue_6) == 0x000278, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_K2_GetActorLocation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_K2_GetActorLocation_ReturnValue_7) == 0x000284, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_K2_GetActorLocation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_Add_VectorVector_ReturnValue) == 0x000290, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_Vector_Distance_ReturnValue_1) == 0x00029C, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0002A0, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0002A4, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_FClamp_ReturnValue) == 0x0002A8, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_Lerp_ReturnValue) == 0x0002AC, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_Lerp_ReturnValue_1) == 0x0002B0, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss, CallFunc_Lerp_ReturnValue_2) == 0x0002B4, "Member 'BP_Warg_Boss_C_ExecuteUbergraph_BP_Warg_Boss::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");

// Function BP_Warg_Boss.BP_Warg_Boss_C.OnVfxEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_Warg_Boss_C_OnVfxEvent final
{
public:
	class FName                                   VfxEventType;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Warg_Boss_C_OnVfxEvent) == 0x000004, "Wrong alignment on BP_Warg_Boss_C_OnVfxEvent");
static_assert(sizeof(BP_Warg_Boss_C_OnVfxEvent) == 0x000008, "Wrong size on BP_Warg_Boss_C_OnVfxEvent");
static_assert(offsetof(BP_Warg_Boss_C_OnVfxEvent, VfxEventType) == 0x000000, "Member 'BP_Warg_Boss_C_OnVfxEvent::VfxEventType' has a wrong offset!");

// Function BP_Warg_Boss.BP_Warg_Boss_C.OnKilled_Event_0
// 0x0010 (0x0010 - 0x0000)
struct BP_Warg_Boss_C_OnKilled_Event_0 final
{
public:
	class UObject*                                Killer;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityController*                     KillerAbilityController;                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Warg_Boss_C_OnKilled_Event_0) == 0x000008, "Wrong alignment on BP_Warg_Boss_C_OnKilled_Event_0");
static_assert(sizeof(BP_Warg_Boss_C_OnKilled_Event_0) == 0x000010, "Wrong size on BP_Warg_Boss_C_OnKilled_Event_0");
static_assert(offsetof(BP_Warg_Boss_C_OnKilled_Event_0, Killer) == 0x000000, "Member 'BP_Warg_Boss_C_OnKilled_Event_0::Killer' has a wrong offset!");
static_assert(offsetof(BP_Warg_Boss_C_OnKilled_Event_0, KillerAbilityController) == 0x000008, "Member 'BP_Warg_Boss_C_OnKilled_Event_0::KillerAbilityController' has a wrong offset!");

// Function BP_Warg_Boss.BP_Warg_Boss_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Warg_Boss_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Warg_Boss_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Warg_Boss_C_ReceiveTick");
static_assert(sizeof(BP_Warg_Boss_C_ReceiveTick) == 0x000004, "Wrong size on BP_Warg_Boss_C_ReceiveTick");
static_assert(offsetof(BP_Warg_Boss_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Warg_Boss_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

