#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WoolBandage_Item

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_WoolBandage_Item.BP_WoolBandage_Item_C.BPStartCondition
// 0x0018 (0x0018 - 0x0000)
struct BP_WoolBandage_Item_C_BPStartCondition final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttributeContainer*                    CallFunc_GetAttributeContainer_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsResourceLessThanPercent_ReturnValue;    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WoolBandage_Item_C_BPStartCondition) == 0x000008, "Wrong alignment on BP_WoolBandage_Item_C_BPStartCondition");
static_assert(sizeof(BP_WoolBandage_Item_C_BPStartCondition) == 0x000018, "Wrong size on BP_WoolBandage_Item_C_BPStartCondition");
static_assert(offsetof(BP_WoolBandage_Item_C_BPStartCondition, Result) == 0x000000, "Member 'BP_WoolBandage_Item_C_BPStartCondition::Result' has a wrong offset!");
static_assert(offsetof(BP_WoolBandage_Item_C_BPStartCondition, CallFunc_GetAttributeContainer_ReturnValue) == 0x000008, "Member 'BP_WoolBandage_Item_C_BPStartCondition::CallFunc_GetAttributeContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WoolBandage_Item_C_BPStartCondition, CallFunc_IsResourceLessThanPercent_ReturnValue) == 0x000010, "Member 'BP_WoolBandage_Item_C_BPStartCondition::CallFunc_IsResourceLessThanPercent_ReturnValue' has a wrong offset!");

}

