#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WIldSeedProjectile

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_WIldSeedProjectile.BP_WIldSeedProjectile_C.ExecuteUbergraph_BP_WIldSeedProjectile
// 0x0080 (0x0080 - 0x0000)
struct BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName Msg)>              K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0028(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Msg;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue_1;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue_1;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile) == 0x000008, "Wrong alignment on BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile");
static_assert(sizeof(BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile) == 0x000080, "Wrong size on BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile");
static_assert(offsetof(BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile, EntryPoint) == 0x000000, "Member 'BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile, Temp_delegate_Variable) == 0x000018, "Member 'BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile, Temp_delegate_Variable_1) == 0x000028, "Member 'BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile, CallFunc_PostAkEvent_ReturnValue) == 0x000038, "Member 'BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile, CallFunc_GetAbilityController_ReturnValue) == 0x000040, "Member 'BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile, K2Node_CustomEvent_Msg) == 0x000048, "Member 'BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile::K2Node_CustomEvent_Msg' has a wrong offset!");
static_assert(offsetof(BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile, CallFunc_GetManGameMode_ReturnValue) == 0x000050, "Member 'BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile::CallFunc_GetManGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000058, "Member 'BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile, CallFunc_GetManGameMode_ReturnValue_1) == 0x000060, "Member 'BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile::CallFunc_GetManGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000068, "Member 'BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile, CallFunc_SpawnVisualEntity_ReturnValue_1) == 0x000070, "Member 'BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile::CallFunc_SpawnVisualEntity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile, CallFunc_PostAkEvent_ReturnValue_1) == 0x000078, "Member 'BP_WIldSeedProjectile_C_ExecuteUbergraph_BP_WIldSeedProjectile::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");

// Function BP_WIldSeedProjectile.BP_WIldSeedProjectile_C.OnCustomMessage
// 0x0008 (0x0008 - 0x0000)
struct BP_WIldSeedProjectile_C_OnCustomMessage final
{
public:
	class FName                                   Msg;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WIldSeedProjectile_C_OnCustomMessage) == 0x000004, "Wrong alignment on BP_WIldSeedProjectile_C_OnCustomMessage");
static_assert(sizeof(BP_WIldSeedProjectile_C_OnCustomMessage) == 0x000008, "Wrong size on BP_WIldSeedProjectile_C_OnCustomMessage");
static_assert(offsetof(BP_WIldSeedProjectile_C_OnCustomMessage, Msg) == 0x000000, "Member 'BP_WIldSeedProjectile_C_OnCustomMessage::Msg' has a wrong offset!");

}

