#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Warden_BallLightning_VisualEntity

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Warden_BallLightning_VisualEntity.BP_Warden_BallLightning_VisualEntity_C.ExecuteUbergraph_BP_Warden_BallLightning_VisualEntity
// 0x0020 (0x0020 - 0x0000)
struct BP_Warden_BallLightning_VisualEntity_C_ExecuteUbergraph_BP_Warden_BallLightning_VisualEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BallLightningProjectile_C*          K2Node_DynamicCast_AsBP_Ball_Lightning_Projectile; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Warden_BallLightning_VisualEntity_C_ExecuteUbergraph_BP_Warden_BallLightning_VisualEntity) == 0x000008, "Wrong alignment on BP_Warden_BallLightning_VisualEntity_C_ExecuteUbergraph_BP_Warden_BallLightning_VisualEntity");
static_assert(sizeof(BP_Warden_BallLightning_VisualEntity_C_ExecuteUbergraph_BP_Warden_BallLightning_VisualEntity) == 0x000020, "Wrong size on BP_Warden_BallLightning_VisualEntity_C_ExecuteUbergraph_BP_Warden_BallLightning_VisualEntity");
static_assert(offsetof(BP_Warden_BallLightning_VisualEntity_C_ExecuteUbergraph_BP_Warden_BallLightning_VisualEntity, EntryPoint) == 0x000000, "Member 'BP_Warden_BallLightning_VisualEntity_C_ExecuteUbergraph_BP_Warden_BallLightning_VisualEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Warden_BallLightning_VisualEntity_C_ExecuteUbergraph_BP_Warden_BallLightning_VisualEntity, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_Warden_BallLightning_VisualEntity_C_ExecuteUbergraph_BP_Warden_BallLightning_VisualEntity::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warden_BallLightning_VisualEntity_C_ExecuteUbergraph_BP_Warden_BallLightning_VisualEntity, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_Warden_BallLightning_VisualEntity_C_ExecuteUbergraph_BP_Warden_BallLightning_VisualEntity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Warden_BallLightning_VisualEntity_C_ExecuteUbergraph_BP_Warden_BallLightning_VisualEntity, K2Node_DynamicCast_AsBP_Ball_Lightning_Projectile) == 0x000010, "Member 'BP_Warden_BallLightning_VisualEntity_C_ExecuteUbergraph_BP_Warden_BallLightning_VisualEntity::K2Node_DynamicCast_AsBP_Ball_Lightning_Projectile' has a wrong offset!");
static_assert(offsetof(BP_Warden_BallLightning_VisualEntity_C_ExecuteUbergraph_BP_Warden_BallLightning_VisualEntity, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Warden_BallLightning_VisualEntity_C_ExecuteUbergraph_BP_Warden_BallLightning_VisualEntity::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

