#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WispBolt_VE

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_WispBolt_VE.BP_WispBolt_VE_C.ExecuteUbergraph_BP_WispBolt_VE
// 0x0068 (0x0068 - 0x0000)
struct BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityBase*                           CallFunc_BPGetAbilityByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Whispers_ActiveAbility_C*           K2Node_DynamicCast_AsBP_Whispers_Active_Ability;   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE) == 0x000008, "Wrong alignment on BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE");
static_assert(sizeof(BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE) == 0x000068, "Wrong size on BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE");
static_assert(offsetof(BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE, EntryPoint) == 0x000000, "Member 'BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE, K2Node_DynamicCast_AsCharacter_Base) == 0x000010, "Member 'BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE, CallFunc_GetAbilityController_ReturnValue) == 0x000020, "Member 'BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE, CallFunc_BPGetAbilityByClass_ReturnValue) == 0x000038, "Member 'BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE::CallFunc_BPGetAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE, K2Node_DynamicCast_AsBP_Whispers_Active_Ability) == 0x000040, "Member 'BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE::K2Node_DynamicCast_AsBP_Whispers_Active_Ability' has a wrong offset!");
static_assert(offsetof(BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00004C, "Member 'BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE, CallFunc_Normal_ReturnValue) == 0x000058, "Member 'BP_WispBolt_VE_C_ExecuteUbergraph_BP_WispBolt_VE::CallFunc_Normal_ReturnValue' has a wrong offset!");

}

