#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WindowWarning

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_WindowWarning.BP_WindowWarning_C
// 0x0038 (0x04F0 - 0x04B8)
class UBP_WindowWarning_C final : public UWindowWarningUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Bg;                                                // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LargeWarning;                                      // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_HUD_Warning_C*                      SmallWarning;                                      // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Visible;                                           // 0x04E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_WindowWarning(int32 EntryPoint);
	void OnSetWarningText(bool bInShow, const class FText& WarningText, const TArray<EHasInventoryResourceResult>& InventoryResourceResults);
	void OnHide(float AnimDuration);
	void OnShow(float AnimDuration);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void SetWarningText(bool InShow, const class FText& InWarningText, TArray<EHasInventoryResourceResult>& InResourceResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WindowWarning_C">();
	}
	static class UBP_WindowWarning_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_WindowWarning_C>();
	}
};
static_assert(alignof(UBP_WindowWarning_C) == 0x000008, "Wrong alignment on UBP_WindowWarning_C");
static_assert(sizeof(UBP_WindowWarning_C) == 0x0004F0, "Wrong size on UBP_WindowWarning_C");
static_assert(offsetof(UBP_WindowWarning_C, UberGraphFrame) == 0x0004B8, "Member 'UBP_WindowWarning_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_WindowWarning_C, FadeOutAnim) == 0x0004C0, "Member 'UBP_WindowWarning_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UBP_WindowWarning_C, FadeInAnim) == 0x0004C8, "Member 'UBP_WindowWarning_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UBP_WindowWarning_C, Bg) == 0x0004D0, "Member 'UBP_WindowWarning_C::Bg' has a wrong offset!");
static_assert(offsetof(UBP_WindowWarning_C, LargeWarning) == 0x0004D8, "Member 'UBP_WindowWarning_C::LargeWarning' has a wrong offset!");
static_assert(offsetof(UBP_WindowWarning_C, SmallWarning) == 0x0004E0, "Member 'UBP_WindowWarning_C::SmallWarning' has a wrong offset!");
static_assert(offsetof(UBP_WindowWarning_C, Visible) == 0x0004E8, "Member 'UBP_WindowWarning_C::Visible' has a wrong offset!");

}

