#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponActor_DW_OffHand

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_WeaponActor_DW_OffHand.BP_WeaponActor_DW_OffHand_C.ExecuteUbergraph_BP_WeaponActor_DW_OffHand
// 0x000C (0x000C - 0x0000)
struct BP_WeaponActor_DW_OffHand_C_ExecuteUbergraph_BP_WeaponActor_DW_OffHand final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bActivate;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bLeftHand;                            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bRightHand;                           // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WeaponActor_DW_OffHand_C_ExecuteUbergraph_BP_WeaponActor_DW_OffHand) == 0x000004, "Wrong alignment on BP_WeaponActor_DW_OffHand_C_ExecuteUbergraph_BP_WeaponActor_DW_OffHand");
static_assert(sizeof(BP_WeaponActor_DW_OffHand_C_ExecuteUbergraph_BP_WeaponActor_DW_OffHand) == 0x00000C, "Wrong size on BP_WeaponActor_DW_OffHand_C_ExecuteUbergraph_BP_WeaponActor_DW_OffHand");
static_assert(offsetof(BP_WeaponActor_DW_OffHand_C_ExecuteUbergraph_BP_WeaponActor_DW_OffHand, EntryPoint) == 0x000000, "Member 'BP_WeaponActor_DW_OffHand_C_ExecuteUbergraph_BP_WeaponActor_DW_OffHand::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_DW_OffHand_C_ExecuteUbergraph_BP_WeaponActor_DW_OffHand, K2Node_Event_bActivate) == 0x000004, "Member 'BP_WeaponActor_DW_OffHand_C_ExecuteUbergraph_BP_WeaponActor_DW_OffHand::K2Node_Event_bActivate' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_DW_OffHand_C_ExecuteUbergraph_BP_WeaponActor_DW_OffHand, K2Node_Event_bLeftHand) == 0x000005, "Member 'BP_WeaponActor_DW_OffHand_C_ExecuteUbergraph_BP_WeaponActor_DW_OffHand::K2Node_Event_bLeftHand' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_DW_OffHand_C_ExecuteUbergraph_BP_WeaponActor_DW_OffHand, K2Node_Event_bRightHand) == 0x000006, "Member 'BP_WeaponActor_DW_OffHand_C_ExecuteUbergraph_BP_WeaponActor_DW_OffHand::K2Node_Event_bRightHand' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_DW_OffHand_C_ExecuteUbergraph_BP_WeaponActor_DW_OffHand, CallFunc_BooleanAND_ReturnValue) == 0x000007, "Member 'BP_WeaponActor_DW_OffHand_C_ExecuteUbergraph_BP_WeaponActor_DW_OffHand::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_DW_OffHand_C_ExecuteUbergraph_BP_WeaponActor_DW_OffHand, CallFunc_BooleanAND_ReturnValue_1) == 0x000008, "Member 'BP_WeaponActor_DW_OffHand_C_ExecuteUbergraph_BP_WeaponActor_DW_OffHand::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_WeaponActor_DW_OffHand.BP_WeaponActor_DW_OffHand_C.WeaponTrailToggle
// 0x0003 (0x0003 - 0x0000)
struct BP_WeaponActor_DW_OffHand_C_WeaponTrailToggle final
{
public:
	bool                                          bActivate;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLeftHand;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bRightHand;                                        // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WeaponActor_DW_OffHand_C_WeaponTrailToggle) == 0x000001, "Wrong alignment on BP_WeaponActor_DW_OffHand_C_WeaponTrailToggle");
static_assert(sizeof(BP_WeaponActor_DW_OffHand_C_WeaponTrailToggle) == 0x000003, "Wrong size on BP_WeaponActor_DW_OffHand_C_WeaponTrailToggle");
static_assert(offsetof(BP_WeaponActor_DW_OffHand_C_WeaponTrailToggle, bActivate) == 0x000000, "Member 'BP_WeaponActor_DW_OffHand_C_WeaponTrailToggle::bActivate' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_DW_OffHand_C_WeaponTrailToggle, bLeftHand) == 0x000001, "Member 'BP_WeaponActor_DW_OffHand_C_WeaponTrailToggle::bLeftHand' has a wrong offset!");
static_assert(offsetof(BP_WeaponActor_DW_OffHand_C_WeaponTrailToggle, bRightHand) == 0x000002, "Member 'BP_WeaponActor_DW_OffHand_C_WeaponTrailToggle::bRightHand' has a wrong offset!");

}

