#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponEffect_Cast_BASE_VisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WeaponEffect_Cast_BASE_VisualEntity.BP_WeaponEffect_Cast_BASE_VisualEntity_C
// 0x0058 (0x03A8 - 0x0350)
class ABP_WeaponEffect_Cast_BASE_VisualEntity_C : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ActivateEffect_VerticalMask_3E9E179645FDACE791CE3EBA72FA14E9; // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ActivateEffect_WeaponEffect_3E9E179645FDACE791CE3EBA72FA14E9; // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ActivateEffect_CurveTime_3E9E179645FDACE791CE3EBA72FA14E9; // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ActivateEffect__Direction_3E9E179645FDACE791CE3EBA72FA14E9; // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ActivateEffect;                                    // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   WeaponEffectParameterName;                         // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimelinePlayRate;                                  // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 _;                                                 // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CachedWep;                                         // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         OwnerCharacter;                                    // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_WeaponEffect_Cast_BASE_VisualEntity(int32 EntryPoint);
	void OnKill();
	void OnStaggered();
	void VisualEntityConstructionFinished();
	void ActivateEffect__UpdateFunc();
	void ActivateEffect__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WeaponEffect_Cast_BASE_VisualEntity_C">();
	}
	static class ABP_WeaponEffect_Cast_BASE_VisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WeaponEffect_Cast_BASE_VisualEntity_C>();
	}
};
static_assert(alignof(ABP_WeaponEffect_Cast_BASE_VisualEntity_C) == 0x000008, "Wrong alignment on ABP_WeaponEffect_Cast_BASE_VisualEntity_C");
static_assert(sizeof(ABP_WeaponEffect_Cast_BASE_VisualEntity_C) == 0x0003A8, "Wrong size on ABP_WeaponEffect_Cast_BASE_VisualEntity_C");
static_assert(offsetof(ABP_WeaponEffect_Cast_BASE_VisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_WeaponEffect_Cast_BASE_VisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_WeaponEffect_Cast_BASE_VisualEntity_C, Niagara) == 0x000358, "Member 'ABP_WeaponEffect_Cast_BASE_VisualEntity_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_WeaponEffect_Cast_BASE_VisualEntity_C, ActivateEffect_VerticalMask_3E9E179645FDACE791CE3EBA72FA14E9) == 0x000360, "Member 'ABP_WeaponEffect_Cast_BASE_VisualEntity_C::ActivateEffect_VerticalMask_3E9E179645FDACE791CE3EBA72FA14E9' has a wrong offset!");
static_assert(offsetof(ABP_WeaponEffect_Cast_BASE_VisualEntity_C, ActivateEffect_WeaponEffect_3E9E179645FDACE791CE3EBA72FA14E9) == 0x000364, "Member 'ABP_WeaponEffect_Cast_BASE_VisualEntity_C::ActivateEffect_WeaponEffect_3E9E179645FDACE791CE3EBA72FA14E9' has a wrong offset!");
static_assert(offsetof(ABP_WeaponEffect_Cast_BASE_VisualEntity_C, ActivateEffect_CurveTime_3E9E179645FDACE791CE3EBA72FA14E9) == 0x000368, "Member 'ABP_WeaponEffect_Cast_BASE_VisualEntity_C::ActivateEffect_CurveTime_3E9E179645FDACE791CE3EBA72FA14E9' has a wrong offset!");
static_assert(offsetof(ABP_WeaponEffect_Cast_BASE_VisualEntity_C, ActivateEffect__Direction_3E9E179645FDACE791CE3EBA72FA14E9) == 0x00036C, "Member 'ABP_WeaponEffect_Cast_BASE_VisualEntity_C::ActivateEffect__Direction_3E9E179645FDACE791CE3EBA72FA14E9' has a wrong offset!");
static_assert(offsetof(ABP_WeaponEffect_Cast_BASE_VisualEntity_C, ActivateEffect) == 0x000370, "Member 'ABP_WeaponEffect_Cast_BASE_VisualEntity_C::ActivateEffect' has a wrong offset!");
static_assert(offsetof(ABP_WeaponEffect_Cast_BASE_VisualEntity_C, WeaponEffectParameterName) == 0x000378, "Member 'ABP_WeaponEffect_Cast_BASE_VisualEntity_C::WeaponEffectParameterName' has a wrong offset!");
static_assert(offsetof(ABP_WeaponEffect_Cast_BASE_VisualEntity_C, TimelinePlayRate) == 0x000380, "Member 'ABP_WeaponEffect_Cast_BASE_VisualEntity_C::TimelinePlayRate' has a wrong offset!");
static_assert(offsetof(ABP_WeaponEffect_Cast_BASE_VisualEntity_C, _) == 0x000388, "Member 'ABP_WeaponEffect_Cast_BASE_VisualEntity_C::_' has a wrong offset!");
static_assert(offsetof(ABP_WeaponEffect_Cast_BASE_VisualEntity_C, CachedWep) == 0x000398, "Member 'ABP_WeaponEffect_Cast_BASE_VisualEntity_C::CachedWep' has a wrong offset!");
static_assert(offsetof(ABP_WeaponEffect_Cast_BASE_VisualEntity_C, OwnerCharacter) == 0x0003A0, "Member 'ABP_WeaponEffect_Cast_BASE_VisualEntity_C::OwnerCharacter' has a wrong offset!");

}

