#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WispBeam_VE

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WispBeam_VE.BP_WispBeam_VE_C
// 0x0030 (0x0380 - 0x0350)
class ABP_WispBeam_VE_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                From;                                              // 0x0360(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                To;                                                // 0x036C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_WispBeam_VE(int32 EntryPoint);
	void VisualEntityConstructionFinished();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WispBeam_VE_C">();
	}
	static class ABP_WispBeam_VE_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WispBeam_VE_C>();
	}
};
static_assert(alignof(ABP_WispBeam_VE_C) == 0x000008, "Wrong alignment on ABP_WispBeam_VE_C");
static_assert(sizeof(ABP_WispBeam_VE_C) == 0x000380, "Wrong size on ABP_WispBeam_VE_C");
static_assert(offsetof(ABP_WispBeam_VE_C, UberGraphFrame) == 0x000350, "Member 'ABP_WispBeam_VE_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_WispBeam_VE_C, Niagara) == 0x000358, "Member 'ABP_WispBeam_VE_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_WispBeam_VE_C, From) == 0x000360, "Member 'ABP_WispBeam_VE_C::From' has a wrong offset!");
static_assert(offsetof(ABP_WispBeam_VE_C, To) == 0x00036C, "Member 'ABP_WispBeam_VE_C::To' has a wrong offset!");
static_assert(offsetof(ABP_WispBeam_VE_C, Index_0) == 0x000378, "Member 'ABP_WispBeam_VE_C::Index_0' has a wrong offset!");

}

