#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Warg_Boss

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Warg_Boss.BP_Warg_Boss_C
// 0x0200 (0x1CC0 - 0x1AC0)
class ABP_Warg_Boss_C final : public AEnemyCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1AC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        SEHaloVFXPos1;                                     // 0x1AC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x1AD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                HowlHitBox5;                                       // 0x1AD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                HowlHitBox;                                        // 0x1AE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                HowlHitBox4;                                       // 0x1AE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                HowlHitBox3;                                       // 0x1AF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                HowlHitBox2;                                       // 0x1AF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                HowlHitBox1;                                       // 0x1B00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x1B08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                DashHitBox;                                        // 0x1B10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Warg_EntropyYetAgain;                           // 0x1B18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WargFeet03;                                     // 0x1B20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WargFeet02;                                     // 0x1B28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WargFeet01;                                     // 0x1B30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_WargDie;                                        // 0x1B38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Warg_Die_RiftFromCharacter;                     // 0x1B40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_WargToPortalRibbons;                            // 0x1B48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPoseableMeshComponent*                 PoseableMesh;                                      // 0x1B50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Warg_EntropyScarRibbon_P2_2;                    // 0x1B58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Warg_EntropyScarRibbon_P2;                      // 0x1B60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                LeapBodyHitBox;                                    // 0x1B68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Warg_EntropyScarRibbon2;                        // 0x1B70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Warg_EntropyScarRibbon1;                        // 0x1B78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Warg_EntropyScarRibbon;                         // 0x1B80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGroomComponent*                        Groom2;                                            // 0x1B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGroomComponent*                        Groom1;                                            // 0x1B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_WargEntropy;                                    // 0x1B98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_WargHowl;                                       // 0x1BA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DieEntropyPortalLocation;                          // 0x1BA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USurfaceEffectComponent*                LeftFootEffect;                                    // 0x1BB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USurfaceEffectComponent*                LeftFootEffectBack;                                // 0x1BB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USurfaceEffectComponent*                RightFootEffect;                                   // 0x1BC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USurfaceEffectComponent*                RightFootEffectBack;                               // 0x1BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SEHaloVFXPos;                                      // 0x1BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CameraSphere;                                      // 0x1BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_WargLiving;                                     // 0x1BE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_WargDash;                                       // 0x1BE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule6;                                      // 0x1BF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule5;                                      // 0x1BF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule4;                                      // 0x1C00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule3;                                      // 0x1C08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule2;                                      // 0x1C10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule1;                                      // 0x1C18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMiniMapActorComponent*                 MiniMapActor;                                      // 0x1C20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                HitBox_RightLeg;                                   // 0x1C28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                HitBox_LeftLeg;                                    // 0x1C30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CollisionBoxVsCharacters;                          // 0x1C38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                LeapHitBox;                                        // 0x1C40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CollisionBox;                                      // 0x1C48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtCapsule*                           HurtCapsule;                                       // 0x1C50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitBox*                                HeadHitBox;                                        // 0x1C58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         YetAnotherTImeline_Alpha_9AEAB94742565580FD7092BBF3D5975C; // 0x1C60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            YetAnotherTImeline__Direction_9AEAB94742565580FD7092BBF3D5975C; // 0x1C64(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C65[0x3];                                     // 0x1C65(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     YetAnotherTImeline;                                // 0x1C68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Poseable_Vis_B19027934CD0872F001F24B56CE5FD0F; // 0x1C70(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Poseable_Rad_B19027934CD0872F001F24B56CE5FD0F; // 0x1C74(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_Poseable__Direction_B19027934CD0872F001F24B56CE5FD0F; // 0x1C78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C79[0x7];                                     // 0x1C79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_Poseable;                                 // 0x1C80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_WargEmissive_1752224B46E1C093338561B25FB182E7; // 0x1C88(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_GDD_Dissolve_1752224B46E1C093338561B25FB182E7; // 0x1C8C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Radius_1752224B46E1C093338561B25FB182E7; // 0x1C90(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_1752224B46E1C093338561B25FB182E7; // 0x1C94(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C95[0x3];                                     // 0x1C95(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x1C98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DefaultEntropyScarLoc;                             // 0x1CA0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CAC[0x4];                                     // 0x1CAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EntropyRift_SimpleClosable_C*       WargDeathRift;                                     // 0x1CB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Warg_Boss(int32 EntryPoint);
	void ActivateWargDieVFXThings();
	void OnVfxEvent(class FName VfxEventType);
	void StopWargDieVFX();
	void OnKilled_Event_0(class UObject* Killer, class UAbilityController* KillerAbilityController);
	void WargDieEvent();
	void BPPostBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void OnStaggeredEvent_Event_0();
	void YetAnotherTImeline__ActivateAllTheThings__EventFunc();
	void YetAnotherTImeline__UpdateFunc();
	void YetAnotherTImeline__FinishedFunc();
	void Timeline_Poseable__UpdateFunc();
	void Timeline_Poseable__FinishedFunc();
	void Timeline_0__HideGroom__EventFunc();
	void Timeline_0__StopVFXs__EventFunc();
	void Timeline_0__PortalInsideEvent__EventFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Warg_Boss_C">();
	}
	static class ABP_Warg_Boss_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Warg_Boss_C>();
	}
};
static_assert(alignof(ABP_Warg_Boss_C) == 0x000010, "Wrong alignment on ABP_Warg_Boss_C");
static_assert(sizeof(ABP_Warg_Boss_C) == 0x001CC0, "Wrong size on ABP_Warg_Boss_C");
static_assert(offsetof(ABP_Warg_Boss_C, UberGraphFrame) == 0x001AC0, "Member 'ABP_Warg_Boss_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, SEHaloVFXPos1) == 0x001AC8, "Member 'ABP_Warg_Boss_C::SEHaloVFXPos1' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, Ak) == 0x001AD0, "Member 'ABP_Warg_Boss_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, HowlHitBox5) == 0x001AD8, "Member 'ABP_Warg_Boss_C::HowlHitBox5' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, HowlHitBox) == 0x001AE0, "Member 'ABP_Warg_Boss_C::HowlHitBox' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, HowlHitBox4) == 0x001AE8, "Member 'ABP_Warg_Boss_C::HowlHitBox4' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, HowlHitBox3) == 0x001AF0, "Member 'ABP_Warg_Boss_C::HowlHitBox3' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, HowlHitBox2) == 0x001AF8, "Member 'ABP_Warg_Boss_C::HowlHitBox2' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, HowlHitBox1) == 0x001B00, "Member 'ABP_Warg_Boss_C::HowlHitBox1' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, Scene) == 0x001B08, "Member 'ABP_Warg_Boss_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, DashHitBox) == 0x001B10, "Member 'ABP_Warg_Boss_C::DashHitBox' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, NS_Warg_EntropyYetAgain) == 0x001B18, "Member 'ABP_Warg_Boss_C::NS_Warg_EntropyYetAgain' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, SM_WargFeet03) == 0x001B20, "Member 'ABP_Warg_Boss_C::SM_WargFeet03' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, SM_WargFeet02) == 0x001B28, "Member 'ABP_Warg_Boss_C::SM_WargFeet02' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, SM_WargFeet01) == 0x001B30, "Member 'ABP_Warg_Boss_C::SM_WargFeet01' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, NS_WargDie) == 0x001B38, "Member 'ABP_Warg_Boss_C::NS_WargDie' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, NS_Warg_Die_RiftFromCharacter) == 0x001B40, "Member 'ABP_Warg_Boss_C::NS_Warg_Die_RiftFromCharacter' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, NS_WargToPortalRibbons) == 0x001B48, "Member 'ABP_Warg_Boss_C::NS_WargToPortalRibbons' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, PoseableMesh) == 0x001B50, "Member 'ABP_Warg_Boss_C::PoseableMesh' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, NS_Warg_EntropyScarRibbon_P2_2) == 0x001B58, "Member 'ABP_Warg_Boss_C::NS_Warg_EntropyScarRibbon_P2_2' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, NS_Warg_EntropyScarRibbon_P2) == 0x001B60, "Member 'ABP_Warg_Boss_C::NS_Warg_EntropyScarRibbon_P2' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, LeapBodyHitBox) == 0x001B68, "Member 'ABP_Warg_Boss_C::LeapBodyHitBox' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, NS_Warg_EntropyScarRibbon2) == 0x001B70, "Member 'ABP_Warg_Boss_C::NS_Warg_EntropyScarRibbon2' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, NS_Warg_EntropyScarRibbon1) == 0x001B78, "Member 'ABP_Warg_Boss_C::NS_Warg_EntropyScarRibbon1' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, NS_Warg_EntropyScarRibbon) == 0x001B80, "Member 'ABP_Warg_Boss_C::NS_Warg_EntropyScarRibbon' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, Groom2) == 0x001B88, "Member 'ABP_Warg_Boss_C::Groom2' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, Groom1) == 0x001B90, "Member 'ABP_Warg_Boss_C::Groom1' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, NS_WargEntropy) == 0x001B98, "Member 'ABP_Warg_Boss_C::NS_WargEntropy' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, NS_WargHowl) == 0x001BA0, "Member 'ABP_Warg_Boss_C::NS_WargHowl' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, DieEntropyPortalLocation) == 0x001BA8, "Member 'ABP_Warg_Boss_C::DieEntropyPortalLocation' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, LeftFootEffect) == 0x001BB0, "Member 'ABP_Warg_Boss_C::LeftFootEffect' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, LeftFootEffectBack) == 0x001BB8, "Member 'ABP_Warg_Boss_C::LeftFootEffectBack' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, RightFootEffect) == 0x001BC0, "Member 'ABP_Warg_Boss_C::RightFootEffect' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, RightFootEffectBack) == 0x001BC8, "Member 'ABP_Warg_Boss_C::RightFootEffectBack' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, SEHaloVFXPos) == 0x001BD0, "Member 'ABP_Warg_Boss_C::SEHaloVFXPos' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, CameraSphere) == 0x001BD8, "Member 'ABP_Warg_Boss_C::CameraSphere' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, NS_WargLiving) == 0x001BE0, "Member 'ABP_Warg_Boss_C::NS_WargLiving' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, NS_WargDash) == 0x001BE8, "Member 'ABP_Warg_Boss_C::NS_WargDash' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, HurtCapsule6) == 0x001BF0, "Member 'ABP_Warg_Boss_C::HurtCapsule6' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, HurtCapsule5) == 0x001BF8, "Member 'ABP_Warg_Boss_C::HurtCapsule5' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, HurtCapsule4) == 0x001C00, "Member 'ABP_Warg_Boss_C::HurtCapsule4' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, HurtCapsule3) == 0x001C08, "Member 'ABP_Warg_Boss_C::HurtCapsule3' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, HurtCapsule2) == 0x001C10, "Member 'ABP_Warg_Boss_C::HurtCapsule2' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, HurtCapsule1) == 0x001C18, "Member 'ABP_Warg_Boss_C::HurtCapsule1' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, MiniMapActor) == 0x001C20, "Member 'ABP_Warg_Boss_C::MiniMapActor' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, HitBox_RightLeg) == 0x001C28, "Member 'ABP_Warg_Boss_C::HitBox_RightLeg' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, HitBox_LeftLeg) == 0x001C30, "Member 'ABP_Warg_Boss_C::HitBox_LeftLeg' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, CollisionBoxVsCharacters) == 0x001C38, "Member 'ABP_Warg_Boss_C::CollisionBoxVsCharacters' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, LeapHitBox) == 0x001C40, "Member 'ABP_Warg_Boss_C::LeapHitBox' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, CollisionBox) == 0x001C48, "Member 'ABP_Warg_Boss_C::CollisionBox' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, HurtCapsule) == 0x001C50, "Member 'ABP_Warg_Boss_C::HurtCapsule' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, HeadHitBox) == 0x001C58, "Member 'ABP_Warg_Boss_C::HeadHitBox' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, YetAnotherTImeline_Alpha_9AEAB94742565580FD7092BBF3D5975C) == 0x001C60, "Member 'ABP_Warg_Boss_C::YetAnotherTImeline_Alpha_9AEAB94742565580FD7092BBF3D5975C' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, YetAnotherTImeline__Direction_9AEAB94742565580FD7092BBF3D5975C) == 0x001C64, "Member 'ABP_Warg_Boss_C::YetAnotherTImeline__Direction_9AEAB94742565580FD7092BBF3D5975C' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, YetAnotherTImeline) == 0x001C68, "Member 'ABP_Warg_Boss_C::YetAnotherTImeline' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, Timeline_Poseable_Vis_B19027934CD0872F001F24B56CE5FD0F) == 0x001C70, "Member 'ABP_Warg_Boss_C::Timeline_Poseable_Vis_B19027934CD0872F001F24B56CE5FD0F' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, Timeline_Poseable_Rad_B19027934CD0872F001F24B56CE5FD0F) == 0x001C74, "Member 'ABP_Warg_Boss_C::Timeline_Poseable_Rad_B19027934CD0872F001F24B56CE5FD0F' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, Timeline_Poseable__Direction_B19027934CD0872F001F24B56CE5FD0F) == 0x001C78, "Member 'ABP_Warg_Boss_C::Timeline_Poseable__Direction_B19027934CD0872F001F24B56CE5FD0F' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, Timeline_Poseable) == 0x001C80, "Member 'ABP_Warg_Boss_C::Timeline_Poseable' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, Timeline_0_WargEmissive_1752224B46E1C093338561B25FB182E7) == 0x001C88, "Member 'ABP_Warg_Boss_C::Timeline_0_WargEmissive_1752224B46E1C093338561B25FB182E7' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, Timeline_0_GDD_Dissolve_1752224B46E1C093338561B25FB182E7) == 0x001C8C, "Member 'ABP_Warg_Boss_C::Timeline_0_GDD_Dissolve_1752224B46E1C093338561B25FB182E7' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, Timeline_0_Radius_1752224B46E1C093338561B25FB182E7) == 0x001C90, "Member 'ABP_Warg_Boss_C::Timeline_0_Radius_1752224B46E1C093338561B25FB182E7' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, Timeline_0__Direction_1752224B46E1C093338561B25FB182E7) == 0x001C94, "Member 'ABP_Warg_Boss_C::Timeline_0__Direction_1752224B46E1C093338561B25FB182E7' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, Timeline_0) == 0x001C98, "Member 'ABP_Warg_Boss_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, DefaultEntropyScarLoc) == 0x001CA0, "Member 'ABP_Warg_Boss_C::DefaultEntropyScarLoc' has a wrong offset!");
static_assert(offsetof(ABP_Warg_Boss_C, WargDeathRift) == 0x001CB0, "Member 'ABP_Warg_Boss_C::WargDeathRift' has a wrong offset!");

}

