#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WaveOfLightVisualEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WaveOfLightVisualEntity.BP_WaveOfLightVisualEntity_C
// 0x0028 (0x0378 - 0x0350)
class ABP_WaveOfLightVisualEntity_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara1;                                          // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bDead;                                             // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_WaveOfLightVisualEntity(int32 EntryPoint);
	void VisualEntityConstructionFinished();
	void ReceiveTick(float DeltaSeconds);
	void OnKill();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WaveOfLightVisualEntity_C">();
	}
	static class ABP_WaveOfLightVisualEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WaveOfLightVisualEntity_C>();
	}
};
static_assert(alignof(ABP_WaveOfLightVisualEntity_C) == 0x000008, "Wrong alignment on ABP_WaveOfLightVisualEntity_C");
static_assert(sizeof(ABP_WaveOfLightVisualEntity_C) == 0x000378, "Wrong size on ABP_WaveOfLightVisualEntity_C");
static_assert(offsetof(ABP_WaveOfLightVisualEntity_C, UberGraphFrame) == 0x000350, "Member 'ABP_WaveOfLightVisualEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_WaveOfLightVisualEntity_C, Niagara1) == 0x000358, "Member 'ABP_WaveOfLightVisualEntity_C::Niagara1' has a wrong offset!");
static_assert(offsetof(ABP_WaveOfLightVisualEntity_C, StaticMesh) == 0x000360, "Member 'ABP_WaveOfLightVisualEntity_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_WaveOfLightVisualEntity_C, Niagara) == 0x000368, "Member 'ABP_WaveOfLightVisualEntity_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_WaveOfLightVisualEntity_C, bDead) == 0x000370, "Member 'ABP_WaveOfLightVisualEntity_C::bDead' has a wrong offset!");

}

