#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BQ12_FrostMage_Quest

#include "Basic.hpp"

#include "man_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BQ12_FrostMage_Quest.BQ12_FrostMage_Quest_C.ExecuteUbergraph_BQ12_FrostMage_Quest
// 0x0088 (0x0088 - 0x0000)
struct BQ12_FrostMage_Quest_C_ExecuteUbergraph_BQ12_FrostMage_Quest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	TArray<class FName>                           Temp_name_Variable;                                // 0x0018(0x0010)(ReferenceParm)
	struct FTextAndStoryParams                    K2Node_MakeStruct_TextAndStoryParams;              // 0x0028(0x0038)()
	struct FIntPoint                              K2Node_MakeStruct_IntPoint;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManQuestObjectiveKillEnemies*          CallFunc_AddKillObjective_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestMarker                           K2Node_MakeStruct_QuestMarker;                     // 0x0070(0x0010)(NoDestructor)
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue;                 // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BQ12_FrostMage_Quest_C_ExecuteUbergraph_BQ12_FrostMage_Quest) == 0x000008, "Wrong alignment on BQ12_FrostMage_Quest_C_ExecuteUbergraph_BQ12_FrostMage_Quest");
static_assert(sizeof(BQ12_FrostMage_Quest_C_ExecuteUbergraph_BQ12_FrostMage_Quest) == 0x000088, "Wrong size on BQ12_FrostMage_Quest_C_ExecuteUbergraph_BQ12_FrostMage_Quest");
static_assert(offsetof(BQ12_FrostMage_Quest_C_ExecuteUbergraph_BQ12_FrostMage_Quest, EntryPoint) == 0x000000, "Member 'BQ12_FrostMage_Quest_C_ExecuteUbergraph_BQ12_FrostMage_Quest::EntryPoint' has a wrong offset!");
static_assert(offsetof(BQ12_FrostMage_Quest_C_ExecuteUbergraph_BQ12_FrostMage_Quest, K2Node_MakeArray_Array) == 0x000008, "Member 'BQ12_FrostMage_Quest_C_ExecuteUbergraph_BQ12_FrostMage_Quest::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BQ12_FrostMage_Quest_C_ExecuteUbergraph_BQ12_FrostMage_Quest, Temp_name_Variable) == 0x000018, "Member 'BQ12_FrostMage_Quest_C_ExecuteUbergraph_BQ12_FrostMage_Quest::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BQ12_FrostMage_Quest_C_ExecuteUbergraph_BQ12_FrostMage_Quest, K2Node_MakeStruct_TextAndStoryParams) == 0x000028, "Member 'BQ12_FrostMage_Quest_C_ExecuteUbergraph_BQ12_FrostMage_Quest::K2Node_MakeStruct_TextAndStoryParams' has a wrong offset!");
static_assert(offsetof(BQ12_FrostMage_Quest_C_ExecuteUbergraph_BQ12_FrostMage_Quest, K2Node_MakeStruct_IntPoint) == 0x000060, "Member 'BQ12_FrostMage_Quest_C_ExecuteUbergraph_BQ12_FrostMage_Quest::K2Node_MakeStruct_IntPoint' has a wrong offset!");
static_assert(offsetof(BQ12_FrostMage_Quest_C_ExecuteUbergraph_BQ12_FrostMage_Quest, CallFunc_AddKillObjective_ReturnValue) == 0x000068, "Member 'BQ12_FrostMage_Quest_C_ExecuteUbergraph_BQ12_FrostMage_Quest::CallFunc_AddKillObjective_ReturnValue' has a wrong offset!");
static_assert(offsetof(BQ12_FrostMage_Quest_C_ExecuteUbergraph_BQ12_FrostMage_Quest, K2Node_MakeStruct_QuestMarker) == 0x000070, "Member 'BQ12_FrostMage_Quest_C_ExecuteUbergraph_BQ12_FrostMage_Quest::K2Node_MakeStruct_QuestMarker' has a wrong offset!");
static_assert(offsetof(BQ12_FrostMage_Quest_C_ExecuteUbergraph_BQ12_FrostMage_Quest, CallFunc_AddObjective_ReturnValue) == 0x000080, "Member 'BQ12_FrostMage_Quest_C_ExecuteUbergraph_BQ12_FrostMage_Quest::CallFunc_AddObjective_ReturnValue' has a wrong offset!");

}

