#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cat_Caravan_Conversation

#include "Basic.hpp"


namespace SDK::Params
{

// Function Cat_Caravan_Conversation.Cat_Caravan_Conversation_C.BPOnStartConversation
// 0x0008 (0x0008 - 0x0000)
struct Cat_Caravan_Conversation_C_BPOnStartConversation final
{
public:
	class FName                                   ConversationName;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cat_Caravan_Conversation_C_BPOnStartConversation) == 0x000004, "Wrong alignment on Cat_Caravan_Conversation_C_BPOnStartConversation");
static_assert(sizeof(Cat_Caravan_Conversation_C_BPOnStartConversation) == 0x000008, "Wrong size on Cat_Caravan_Conversation_C_BPOnStartConversation");
static_assert(offsetof(Cat_Caravan_Conversation_C_BPOnStartConversation, ConversationName) == 0x000000, "Member 'Cat_Caravan_Conversation_C_BPOnStartConversation::ConversationName' has a wrong offset!");

// Function Cat_Caravan_Conversation.Cat_Caravan_Conversation_C.ExecuteUbergraph_Cat_Caravan_Conversation
// 0x01F8 (0x01F8 - 0x0000)
struct Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EntryKey)>         Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EntryKey)>         Temp_delegate_Variable_1;                          // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    K2Node_DynamicCast_AsMandragora_Game_Mode;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPathName_ReturnValue;                  // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UManConversationManager*                CallFunc_GetConversationManager_ReturnValue;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_CreateGlobalVariableNameSafe_NewName;     // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_1;          // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_CreateGlobalVariableNameSafe_NewName_1;   // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    K2Node_DynamicCast_AsMandragora_Game_Mode_1;       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GlobalDictionarySetBool_ReturnValue;      // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UManConversationManager*                CallFunc_GetConversationManager_ReturnValue_1;     // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GlobalDictionaryGetBool_OutValue;         // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GlobalDictionaryGetBool_ReturnValue;      // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EntryKey)>         Temp_delegate_Variable_2;                          // 0x00EC(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EntryKey)>         Temp_delegate_Variable_3;                          // 0x00FC(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPathName_ReturnValue_1;                // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPathName_ReturnValue_2;                // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UManConversationManager*                CallFunc_GetConversationManager_ReturnValue_2;     // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GlobalDictionarySetBool_ReturnValue_1;    // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_2;          // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_CreateGlobalVariableNameSafe_NewName_2;   // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_ConversationName;                     // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_2;                // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GlobalDictionarySetBool_ReturnValue_2;    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMandragoraGameMode*                    K2Node_DynamicCast_AsMandragora_Game_Mode_2;       // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GlobalDictionaryGetBool_OutValue_1;       // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GlobalDictionaryGetBool_ReturnValue_1;    // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CB[0x5];                                      // 0x01CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UManConversationManager*                CallFunc_GetConversationManager_ReturnValue_3;     // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GlobalDictionarySetBool_ReturnValue_3;    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GlobalDictionaryGetBool_OutValue_2;       // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GlobalDictionaryGetBool_ReturnValue_2;    // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsObjectiveComplete_ReturnValue;          // 0x01DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGlobalBool_ReturnValue;                // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrawlerHero_C*                      K2Node_DynamicCast_AsBP_Brawler_Hero;              // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation) == 0x000008, "Wrong alignment on Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation");
static_assert(sizeof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation) == 0x0001F8, "Wrong size on Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, EntryPoint) == 0x000000, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::EntryPoint' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, Temp_delegate_Variable) == 0x000004, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, Temp_delegate_Variable_1) == 0x000014, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_GetGameMode_ReturnValue) == 0x000028, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, K2Node_DynamicCast_AsMandragora_Game_Mode) == 0x000030, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::K2Node_DynamicCast_AsMandragora_Game_Mode' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_GetPathName_ReturnValue) == 0x000040, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_GetPathName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_GetConversationManager_ReturnValue) == 0x000060, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_GetConversationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000068, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_MakeLiteralString_ReturnValue) == 0x000078, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_CreateGlobalVariableNameSafe_NewName) == 0x000088, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_CreateGlobalVariableNameSafe_NewName' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_MakeLiteralString_ReturnValue_1) == 0x000098, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_MakeLiteralString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_Conv_StringToName_ReturnValue) == 0x0000A8, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_CreateGlobalVariableNameSafe_NewName_1) == 0x0000B0, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_CreateGlobalVariableNameSafe_NewName_1' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_GetGameMode_ReturnValue_1) == 0x0000C0, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_Conv_StringToName_ReturnValue_1) == 0x0000C8, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, K2Node_DynamicCast_AsMandragora_Game_Mode_1) == 0x0000D0, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::K2Node_DynamicCast_AsMandragora_Game_Mode_1' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_GlobalDictionarySetBool_ReturnValue) == 0x0000D9, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_GlobalDictionarySetBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_GetConversationManager_ReturnValue_1) == 0x0000E0, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_GetConversationManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_GlobalDictionaryGetBool_OutValue) == 0x0000E8, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_GlobalDictionaryGetBool_OutValue' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_GlobalDictionaryGetBool_ReturnValue) == 0x0000E9, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_GlobalDictionaryGetBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, Temp_delegate_Variable_2) == 0x0000EC, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, Temp_delegate_Variable_3) == 0x0000FC, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_GetPathName_ReturnValue_1) == 0x000110, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_GetPathName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000120, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000130, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_GetPathName_ReturnValue_2) == 0x000140, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_GetPathName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000150, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_GetConversationManager_ReturnValue_2) == 0x000160, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_GetConversationManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000168, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_IsValid_ReturnValue) == 0x000178, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_GlobalDictionarySetBool_ReturnValue_1) == 0x000179, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_GlobalDictionarySetBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_MakeLiteralString_ReturnValue_2) == 0x000180, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_MakeLiteralString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_CreateGlobalVariableNameSafe_NewName_2) == 0x000190, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_CreateGlobalVariableNameSafe_NewName_2' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, K2Node_Event_ConversationName) == 0x0001A0, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::K2Node_Event_ConversationName' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_Conv_StringToName_ReturnValue_2) == 0x0001A8, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_GetGameMode_ReturnValue_2) == 0x0001B0, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_GetGameMode_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_GlobalDictionarySetBool_ReturnValue_2) == 0x0001B8, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_GlobalDictionarySetBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, K2Node_DynamicCast_AsMandragora_Game_Mode_2) == 0x0001C0, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::K2Node_DynamicCast_AsMandragora_Game_Mode_2' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, K2Node_DynamicCast_bSuccess_2) == 0x0001C8, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_GlobalDictionaryGetBool_OutValue_1) == 0x0001C9, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_GlobalDictionaryGetBool_OutValue_1' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_GlobalDictionaryGetBool_ReturnValue_1) == 0x0001CA, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_GlobalDictionaryGetBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_GetConversationManager_ReturnValue_3) == 0x0001D0, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_GetConversationManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_GlobalDictionarySetBool_ReturnValue_3) == 0x0001D8, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_GlobalDictionarySetBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_GlobalDictionaryGetBool_OutValue_2) == 0x0001D9, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_GlobalDictionaryGetBool_OutValue_2' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_GlobalDictionaryGetBool_ReturnValue_2) == 0x0001DA, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_GlobalDictionaryGetBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_IsObjectiveComplete_ReturnValue) == 0x0001DB, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_IsObjectiveComplete_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_GetGlobalBool_ReturnValue) == 0x0001DC, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_GetGlobalBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, CallFunc_GetPlayerPawn_ReturnValue) == 0x0001E0, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, K2Node_DynamicCast_AsBP_Brawler_Hero) == 0x0001E8, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::K2Node_DynamicCast_AsBP_Brawler_Hero' has a wrong offset!");
static_assert(offsetof(Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation, K2Node_DynamicCast_bSuccess_3) == 0x0001F0, "Member 'Cat_Caravan_Conversation_C_ExecuteUbergraph_Cat_Caravan_Conversation::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

}

