#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GDCDemo_CaravanGameplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "man_structs.hpp"
#include "man_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GDCDemo_CaravanGameplay.GDCDemo_CaravanGameplay_C
// 0x0198 (0x0420 - 0x0288)
class AGDCDemo_CaravanGameplay_C final : public AManLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class AActorBase*>                     NPCs;                                              // 0x0290(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class FName>                           NPCKeys;                                           // 0x02A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<bool>                                  NPCActive;                                         // 0x02B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABP_BrawlerHero_C*                      Brawler;                                           // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HeroAtUlfar;                                       // 0x02C8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HeroStarts;                                        // 0x02D4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IntroDone;                                         // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                UlfarIntro;                                        // 0x02E4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BranweenLeave;                                     // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BranweenGone;                                      // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BranweenReveal;                                    // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BranweenTransform;                                 // 0x0308(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BranweenKamera;                                    // 0x0314(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HeroToCheckPoint;                                  // 0x0320(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                InteractWith;                                      // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Key;                                               // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_FrontDoor_Invisible_C*              BP_FrontDoor_Invisible2_8_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_HerbGardenVisualManager_C*          BP_HerbGardenVisualManager_5_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_TailorAndHorseNPC_C*                BP_TailorAndHorseNPC_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_OccultistNPC_C*                     BP_OccultistNPC_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AdventurerNPC_C*                    BP_AdventurerNPC_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GoldsmithNPC_C*                     BP_GoldsmithNPC_5_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Cook_C*                             BP_Cook2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Alchemist_C*                        BP_Alchemist_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Branween_Disguise_C*                BP_Branween_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GeneralQuest_Interact_C*            BP_GeneralQuest_Trail1_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GeneralQuest_Interact_C*            BP_GeneralQuest_Trail2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GoatCaravan_C*                      BP_GoatCaravan_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GeneralQuest_Interact_C*            BP_GeneralQuest_Trail3_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GeneralQuest_Interact_C*            BP_GeneralQuest_Trail4_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GeneralQuest_Interact_C*            BP_GeneralQuest_Trail5_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LootActor_C*                        BP_LootActor_CatTreasure_3_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_FrontDoor_02_C*                     BP_FrontDoor_11_Cat_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GeneralQuest_Interact_C*            BP_GeneralQuest_Trail0_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATeleportTriggerVolume*                 TeleportTriggerVolume_ToCat_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Branween_C*                         BP_Branween2_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Faust_C*                            BP_Faust_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Alchemist_Cat_C*                    BP_Alchemist_Cat_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CheckPoint_C*                       Caravan_Checkpoint_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BlackSmithNPC_C*                    BP_BlackSmithNPC_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Rhys_Corpse_C*                      BP_Rhys_Corpse_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BountyBoardVisualManager_C*         BP_BountyBoardInteract_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraBlocker*                         CameraBlocker_Preview2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DynamicObstacleActor_C*             BP_DynamicObstacleActor_Preview2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty; // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ForceConversation(class AActorBase* Target);
	void ToggleNPC(class AActorBase* NPC, bool Active);
	void HandleNPCs(bool ForceUpdate);
	void ReceiveBeginPlay();
	void SaveNPCReferences();
	void ReceiveTick(float DeltaSeconds);
	void NPCActivated(class FName NPCConversationKey);
	void AlchemistActivated();
	void OccultistActivated();
	void CutscneEnds(class ULevelSequence* LevelSequence);
	void PostBeginPlay();
	void BranweenCheck();
	void GlobalChecks();
	void Check(class FName EntryKey);
	void BranweenOk();
	void BranwenGone();
	void CaravanCheck();
	void CheckPointTravel(class UCheckpointData* CheckpointData);
	void HeroPreTravel(class ALevelVisualVolume* SourceLevelVisualVolume, class ALevelVisualVolume* TargetLevelVisualVolume, const struct FVector& NewPos);
	void FadeDone();
	void FadeCheck();
	void SetHero();
	void SetSequance();
	void SeqEnds(class ULevelSequence* LevelSequence);
	void HeroResapwn(class AHeroBase* Hero);
	void BranReveal();
	void StartPlayerMonologue();
	void MonologEnds(class UManUserWidgetBase* ManUserWidgetBase);
	void FadeEnds();
	void Midfade();
	void FadeStarts(class UManUserWidgetBase* ManUserWidgetBase);
	void BndEvt__GDCDemo_CaravanGameplay_ManTriggerVolume_PCE_CAR_001_K2Node_ActorBoundEvent_1_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void SetInteract();
	void InteractEvent(class UOnInteractAbility* OnInteractAbility);
	void TrailsCheck();
	void BndEvt__GDCDemo_CaravanGameplay_CameraVolume36_K2Node_ActorBoundEvent_2_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BeginPlayFadeOutFinished();
	void BndEvt__GDCDemo_CaravanGameplay_CameraVolume36_K2Node_ActorBoundEvent_3_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void Trail2Hide();
	void Trail2Show();
	void Trail3Hide();
	void Trail3Show();
	void Trail4Hide();
	void Trail4Show();
	void Trail5Hide();
	void Trail5Show();
	void BndEvt__GDCDemo_CaravanGameplay_ManTriggerVolume_CatNest_K2Node_ActorBoundEvent_4_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__GDCDemo_CaravanGameplay_ManTriggerVolume_Goat_K2Node_ActorBoundEvent_5_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void CatLootDisable();
	void CatLootEnable();
	void Trail1Hide();
	void Trail1Show();
	void YrsaFlute();
	void ResumeYrsaConversation();
	void BndEvt__GDCDemo_CaravanGameplay_ManTriggerVolumeBranweenCaravan2_K2Node_ActorBoundEvent_6_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void A025_Start();
	void A025C_Start();
	void A025_Ends();
	void A025C_Ends();
	void SkillUpgrade();
	void UpgradeDone(class UManUserWidgetBase* ManUserWidgetBase);
	void UpgradeDone2(class UManUserWidgetBase* ManUserWidgetBase);
	void UpgradeDone3(class UManUserWidgetBase* ManUserWidgetBase);
	void BranweenCastSleepAnim();
	void BndEvt__GDCDemo_CaravanGameplay_BP_Branween2_2_K2Node_ActorBoundEvent_0_CharacterAnimEventDelegateBP__DelegateSignature(const struct FAnimEventParam& AnimEventParam);
	void B010_Start();
	void FaustCheck();
	void NotUsedEvent(class UManUserWidgetBase* ManUserWidgetBase);
	void A025_Ends_Sleep();
	void A025C_WitchAltarHighlight();
	void BndEvt__GDCDemo_CaravanGameplay_ManTriggerVolume_A062_K2Node_ActorBoundEvent_7_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void RhysCheck();
	void A062_Start();
	void A062_Ends();
	void FirstArrive();
	void BndEvt__GDCDemo_CaravanGameplay_ManTriggerVolume_TS_LevelUp_K2Node_ActorBoundEvent_8_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void CustomEvent_0(class UManUserWidgetBase* ManUserWidgetBase);
	void BndEvt__GDCDemo_CaravanGameplay_ManTriggerVolume_TS_BlackSmith_K2Node_ActorBoundEvent_9_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void CustomEvent(class UManUserWidgetBase* ManUserWidgetBase);
	void CustomEvent_1(class UManUserWidgetBase* ManUserWidgetBase);
	void CustomEvent_2(class UManUserWidgetBase* ManUserWidgetBase);
	void BndEvt__GDCDemo_CaravanGameplay_ManTriggerVolume_TS_Glossary_K2Node_ActorBoundEvent_10_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void CustomEvent_3(class UManUserWidgetBase* ManUserWidgetBase);
	void TutorialScreenEvent12();
	void ExecuteUbergraph_GDCDemo_CaravanGameplay(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GDCDemo_CaravanGameplay_C">();
	}
	static class AGDCDemo_CaravanGameplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGDCDemo_CaravanGameplay_C>();
	}
};
static_assert(alignof(AGDCDemo_CaravanGameplay_C) == 0x000008, "Wrong alignment on AGDCDemo_CaravanGameplay_C");
static_assert(sizeof(AGDCDemo_CaravanGameplay_C) == 0x000420, "Wrong size on AGDCDemo_CaravanGameplay_C");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, UberGraphFrame) == 0x000288, "Member 'AGDCDemo_CaravanGameplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, NPCs) == 0x000290, "Member 'AGDCDemo_CaravanGameplay_C::NPCs' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, NPCKeys) == 0x0002A0, "Member 'AGDCDemo_CaravanGameplay_C::NPCKeys' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, NPCActive) == 0x0002B0, "Member 'AGDCDemo_CaravanGameplay_C::NPCActive' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, Brawler) == 0x0002C0, "Member 'AGDCDemo_CaravanGameplay_C::Brawler' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, HeroAtUlfar) == 0x0002C8, "Member 'AGDCDemo_CaravanGameplay_C::HeroAtUlfar' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, HeroStarts) == 0x0002D4, "Member 'AGDCDemo_CaravanGameplay_C::HeroStarts' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, IntroDone) == 0x0002E0, "Member 'AGDCDemo_CaravanGameplay_C::IntroDone' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, UlfarIntro) == 0x0002E4, "Member 'AGDCDemo_CaravanGameplay_C::UlfarIntro' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BranweenLeave) == 0x0002F0, "Member 'AGDCDemo_CaravanGameplay_C::BranweenLeave' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BranweenGone) == 0x0002F8, "Member 'AGDCDemo_CaravanGameplay_C::BranweenGone' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BranweenReveal) == 0x000300, "Member 'AGDCDemo_CaravanGameplay_C::BranweenReveal' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BranweenTransform) == 0x000308, "Member 'AGDCDemo_CaravanGameplay_C::BranweenTransform' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BranweenKamera) == 0x000314, "Member 'AGDCDemo_CaravanGameplay_C::BranweenKamera' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, HeroToCheckPoint) == 0x000320, "Member 'AGDCDemo_CaravanGameplay_C::HeroToCheckPoint' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, InteractWith) == 0x000330, "Member 'AGDCDemo_CaravanGameplay_C::InteractWith' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, Key) == 0x000338, "Member 'AGDCDemo_CaravanGameplay_C::Key' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BP_FrontDoor_Invisible2_8_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x000340, "Member 'AGDCDemo_CaravanGameplay_C::BP_FrontDoor_Invisible2_8_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BP_HerbGardenVisualManager_5_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x000348, "Member 'AGDCDemo_CaravanGameplay_C::BP_HerbGardenVisualManager_5_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BP_TailorAndHorseNPC_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x000350, "Member 'AGDCDemo_CaravanGameplay_C::BP_TailorAndHorseNPC_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BP_OccultistNPC_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x000358, "Member 'AGDCDemo_CaravanGameplay_C::BP_OccultistNPC_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BP_AdventurerNPC_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x000360, "Member 'AGDCDemo_CaravanGameplay_C::BP_AdventurerNPC_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BP_GoldsmithNPC_5_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x000368, "Member 'AGDCDemo_CaravanGameplay_C::BP_GoldsmithNPC_5_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BP_Cook2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x000370, "Member 'AGDCDemo_CaravanGameplay_C::BP_Cook2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BP_Alchemist_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x000378, "Member 'AGDCDemo_CaravanGameplay_C::BP_Alchemist_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BP_Branween_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x000380, "Member 'AGDCDemo_CaravanGameplay_C::BP_Branween_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BP_GeneralQuest_Trail1_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x000388, "Member 'AGDCDemo_CaravanGameplay_C::BP_GeneralQuest_Trail1_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BP_GeneralQuest_Trail2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x000390, "Member 'AGDCDemo_CaravanGameplay_C::BP_GeneralQuest_Trail2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BP_GoatCaravan_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x000398, "Member 'AGDCDemo_CaravanGameplay_C::BP_GoatCaravan_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BP_GeneralQuest_Trail3_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x0003A0, "Member 'AGDCDemo_CaravanGameplay_C::BP_GeneralQuest_Trail3_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BP_GeneralQuest_Trail4_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x0003A8, "Member 'AGDCDemo_CaravanGameplay_C::BP_GeneralQuest_Trail4_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BP_GeneralQuest_Trail5_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x0003B0, "Member 'AGDCDemo_CaravanGameplay_C::BP_GeneralQuest_Trail5_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BP_LootActor_CatTreasure_3_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x0003B8, "Member 'AGDCDemo_CaravanGameplay_C::BP_LootActor_CatTreasure_3_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BP_FrontDoor_11_Cat_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x0003C0, "Member 'AGDCDemo_CaravanGameplay_C::BP_FrontDoor_11_Cat_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BP_GeneralQuest_Trail0_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x0003C8, "Member 'AGDCDemo_CaravanGameplay_C::BP_GeneralQuest_Trail0_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, TeleportTriggerVolume_ToCat_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x0003D0, "Member 'AGDCDemo_CaravanGameplay_C::TeleportTriggerVolume_ToCat_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BP_Branween2_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x0003D8, "Member 'AGDCDemo_CaravanGameplay_C::BP_Branween2_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BP_Faust_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x0003E0, "Member 'AGDCDemo_CaravanGameplay_C::BP_Faust_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BP_Alchemist_Cat_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x0003E8, "Member 'AGDCDemo_CaravanGameplay_C::BP_Alchemist_Cat_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, Caravan_Checkpoint_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x0003F0, "Member 'AGDCDemo_CaravanGameplay_C::Caravan_Checkpoint_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BP_BlackSmithNPC_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x0003F8, "Member 'AGDCDemo_CaravanGameplay_C::BP_BlackSmithNPC_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BP_Rhys_Corpse_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x000400, "Member 'AGDCDemo_CaravanGameplay_C::BP_Rhys_Corpse_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BP_BountyBoardInteract_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x000408, "Member 'AGDCDemo_CaravanGameplay_C::BP_BountyBoardInteract_2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, CameraBlocker_Preview2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x000410, "Member 'AGDCDemo_CaravanGameplay_C::CameraBlocker_Preview2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");
static_assert(offsetof(AGDCDemo_CaravanGameplay_C, BP_DynamicObstacleActor_Preview2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty) == 0x000418, "Member 'AGDCDemo_CaravanGameplay_C::BP_DynamicObstacleActor_Preview2_ExecuteUbergraph_GDCDemo_CaravanGameplay_RefProperty' has a wrong offset!");

}

