#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GDD_DissolveMaterial

#include "Basic.hpp"

#include "NiagaraAnimNotifies_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GDD_DissolveMaterial.GDD_DissolveMaterial_C
// 0x0010 (0x00E8 - 0x00D8)
class UGDD_DissolveMaterial_C final : public UAnimNotifyState_TimedNiagaraEffectAdvanced
{
public:
	bool                                          AnimPreview_;                                      // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Desaturate_;                                       // 0x00D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HasGroom_;                                         // 0x00DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DB[0x1];                                       // 0x00DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Random;                                            // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DiffuseMultiplier;                                 // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetMaterialParameters(float NotifyProgress, class UMeshComponent* Component) const;
	bool Received_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration) const;
	class FString GetNotifyName() const;
	bool Received_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation) const;
	bool Received_NotifyTick(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float FrameDeltaTime) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GDD_DissolveMaterial_C">();
	}
	static class UGDD_DissolveMaterial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGDD_DissolveMaterial_C>();
	}
};
static_assert(alignof(UGDD_DissolveMaterial_C) == 0x000008, "Wrong alignment on UGDD_DissolveMaterial_C");
static_assert(sizeof(UGDD_DissolveMaterial_C) == 0x0000E8, "Wrong size on UGDD_DissolveMaterial_C");
static_assert(offsetof(UGDD_DissolveMaterial_C, AnimPreview_) == 0x0000D8, "Member 'UGDD_DissolveMaterial_C::AnimPreview_' has a wrong offset!");
static_assert(offsetof(UGDD_DissolveMaterial_C, Desaturate_) == 0x0000D9, "Member 'UGDD_DissolveMaterial_C::Desaturate_' has a wrong offset!");
static_assert(offsetof(UGDD_DissolveMaterial_C, HasGroom_) == 0x0000DA, "Member 'UGDD_DissolveMaterial_C::HasGroom_' has a wrong offset!");
static_assert(offsetof(UGDD_DissolveMaterial_C, Random) == 0x0000DC, "Member 'UGDD_DissolveMaterial_C::Random' has a wrong offset!");
static_assert(offsetof(UGDD_DissolveMaterial_C, DiffuseMultiplier) == 0x0000E0, "Member 'UGDD_DissolveMaterial_C::DiffuseMultiplier' has a wrong offset!");

}

