#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ket_Conversation

#include "Basic.hpp"


namespace SDK::Params
{

// Function Ket_Conversation.Ket_Conversation_C.ExecuteUbergraph_Ket_Conversation
// 0x00E8 (0x00E8 - 0x0000)
struct Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    K2Node_DynamicCast_AsMandragora_Game_Mode;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPathName_ReturnValue;                  // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UManConversationManager*                CallFunc_GetConversationManager_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class FName EntryKey)>         Temp_delegate_Variable;                            // 0x0058(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UManConversationManager*                CallFunc_GetConversationManager_ReturnValue_1;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_CreateGlobalVariableNameSafe_NewName;     // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GlobalDictionaryGetBool_OutValue;         // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GlobalDictionaryGetBool_ReturnValue;      // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GlobalDictionarySetBool_ReturnValue;      // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9F[0x1];                                       // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EntryKey)>         Temp_delegate_Variable_1;                          // 0x00A0(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GlobalDictionarySetBool_ReturnValue_1;    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_ConversationName;                     // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UManQuestManager*                       CallFunc_GetQuestManager_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManQuest*                              CallFunc_AddQuest_ReturnValue;                     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrawlerHero_C*                      K2Node_DynamicCast_AsBP_Brawler_Hero;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation) == 0x000008, "Wrong alignment on Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation");
static_assert(sizeof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation) == 0x0000E8, "Wrong size on Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation");
static_assert(offsetof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation, EntryPoint) == 0x000000, "Member 'Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation, CallFunc_GetGameMode_ReturnValue) == 0x000008, "Member 'Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation, K2Node_DynamicCast_AsMandragora_Game_Mode) == 0x000010, "Member 'Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation::K2Node_DynamicCast_AsMandragora_Game_Mode' has a wrong offset!");
static_assert(offsetof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation, CallFunc_GetPathName_ReturnValue) == 0x000020, "Member 'Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation::CallFunc_GetPathName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation, CallFunc_GetConversationManager_ReturnValue) == 0x000040, "Member 'Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation::CallFunc_GetConversationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000048, "Member 'Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation, Temp_delegate_Variable) == 0x000058, "Member 'Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation, CallFunc_MakeLiteralString_ReturnValue) == 0x000068, "Member 'Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation, CallFunc_GetConversationManager_ReturnValue_1) == 0x000078, "Member 'Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation::CallFunc_GetConversationManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation, CallFunc_CreateGlobalVariableNameSafe_NewName) == 0x000080, "Member 'Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation::CallFunc_CreateGlobalVariableNameSafe_NewName' has a wrong offset!");
static_assert(offsetof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation, CallFunc_Conv_StringToName_ReturnValue) == 0x000094, "Member 'Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation, CallFunc_GlobalDictionaryGetBool_OutValue) == 0x00009C, "Member 'Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation::CallFunc_GlobalDictionaryGetBool_OutValue' has a wrong offset!");
static_assert(offsetof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation, CallFunc_GlobalDictionaryGetBool_ReturnValue) == 0x00009D, "Member 'Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation::CallFunc_GlobalDictionaryGetBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation, CallFunc_GlobalDictionarySetBool_ReturnValue) == 0x00009E, "Member 'Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation::CallFunc_GlobalDictionarySetBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation, Temp_delegate_Variable_1) == 0x0000A0, "Member 'Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation, CallFunc_GlobalDictionarySetBool_ReturnValue_1) == 0x0000B0, "Member 'Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation::CallFunc_GlobalDictionarySetBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation, K2Node_Event_ConversationName) == 0x0000B4, "Member 'Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation::K2Node_Event_ConversationName' has a wrong offset!");
static_assert(offsetof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation, CallFunc_GetQuestManager_ReturnValue) == 0x0000C0, "Member 'Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation, CallFunc_GetPlayerPawn_ReturnValue) == 0x0000C8, "Member 'Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation, CallFunc_AddQuest_ReturnValue) == 0x0000D0, "Member 'Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation::CallFunc_AddQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation, K2Node_DynamicCast_AsBP_Brawler_Hero) == 0x0000D8, "Member 'Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation::K2Node_DynamicCast_AsBP_Brawler_Hero' has a wrong offset!");
static_assert(offsetof(Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'Ket_Conversation_C_ExecuteUbergraph_Ket_Conversation::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function Ket_Conversation.Ket_Conversation_C.BPOnStartConversation
// 0x0008 (0x0008 - 0x0000)
struct Ket_Conversation_C_BPOnStartConversation final
{
public:
	class FName                                   ConversationName;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ket_Conversation_C_BPOnStartConversation) == 0x000004, "Wrong alignment on Ket_Conversation_C_BPOnStartConversation");
static_assert(sizeof(Ket_Conversation_C_BPOnStartConversation) == 0x000008, "Wrong size on Ket_Conversation_C_BPOnStartConversation");
static_assert(offsetof(Ket_Conversation_C_BPOnStartConversation, ConversationName) == 0x000000, "Member 'Ket_Conversation_C_BPOnStartConversation::ConversationName' has a wrong offset!");

}

