#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LadderHighlightTest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LadderHighlightTest.LadderHighlightTest_C
// 0x0018 (0x0368 - 0x0350)
class ALadderHighlightTest_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_0_NewTrack_0_C885782F4B718A7A7EFC5C8AA8168DBC; // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_C885782F4B718A7A7EFC5C8AA8168DBC; // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D[0x3];                                      // 0x035D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LadderHighlightTest(int32 EntryPoint);
	void OnKill();
	void VisualEntityConstructionFinished();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LadderHighlightTest_C">();
	}
	static class ALadderHighlightTest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALadderHighlightTest_C>();
	}
};
static_assert(alignof(ALadderHighlightTest_C) == 0x000008, "Wrong alignment on ALadderHighlightTest_C");
static_assert(sizeof(ALadderHighlightTest_C) == 0x000368, "Wrong size on ALadderHighlightTest_C");
static_assert(offsetof(ALadderHighlightTest_C, UberGraphFrame) == 0x000350, "Member 'ALadderHighlightTest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALadderHighlightTest_C, Timeline_0_NewTrack_0_C885782F4B718A7A7EFC5C8AA8168DBC) == 0x000358, "Member 'ALadderHighlightTest_C::Timeline_0_NewTrack_0_C885782F4B718A7A7EFC5C8AA8168DBC' has a wrong offset!");
static_assert(offsetof(ALadderHighlightTest_C, Timeline_0__Direction_C885782F4B718A7A7EFC5C8AA8168DBC) == 0x00035C, "Member 'ALadderHighlightTest_C::Timeline_0__Direction_C885782F4B718A7A7EFC5C8AA8168DBC' has a wrong offset!");
static_assert(offsetof(ALadderHighlightTest_C, Timeline_0) == 0x000360, "Member 'ALadderHighlightTest_C::Timeline_0' has a wrong offset!");

}

