#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: man

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "man_structs.hpp"
#include "MovieScene_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "PrimalConversation_structs.hpp"
#include "SlateCore_structs.hpp"
#include "AkAudio_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function man.AbilityBase.AbilityStartedEvent
// 0x0010 (0x0010 - 0x0000)
struct AbilityBase_AbilityStartedEvent final
{
public:
	class UAbilityBase*                           pStartedAbility;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDesired;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AbilityBase_AbilityStartedEvent) == 0x000008, "Wrong alignment on AbilityBase_AbilityStartedEvent");
static_assert(sizeof(AbilityBase_AbilityStartedEvent) == 0x000010, "Wrong size on AbilityBase_AbilityStartedEvent");
static_assert(offsetof(AbilityBase_AbilityStartedEvent, pStartedAbility) == 0x000000, "Member 'AbilityBase_AbilityStartedEvent::pStartedAbility' has a wrong offset!");
static_assert(offsetof(AbilityBase_AbilityStartedEvent, bDesired) == 0x000008, "Member 'AbilityBase_AbilityStartedEvent::bDesired' has a wrong offset!");

// Function man.AbilityBase.BPAbilityCustomEvent
// 0x0008 (0x0008 - 0x0000)
struct AbilityBase_BPAbilityCustomEvent final
{
public:
	class FName                                   CustomName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_BPAbilityCustomEvent) == 0x000004, "Wrong alignment on AbilityBase_BPAbilityCustomEvent");
static_assert(sizeof(AbilityBase_BPAbilityCustomEvent) == 0x000008, "Wrong size on AbilityBase_BPAbilityCustomEvent");
static_assert(offsetof(AbilityBase_BPAbilityCustomEvent, CustomName) == 0x000000, "Member 'AbilityBase_BPAbilityCustomEvent::CustomName' has a wrong offset!");

// Function man.AbilityBase.BPCustomEvent
// 0x0008 (0x0008 - 0x0000)
struct AbilityBase_BPCustomEvent final
{
public:
	class FName                                   CustomName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_BPCustomEvent) == 0x000004, "Wrong alignment on AbilityBase_BPCustomEvent");
static_assert(sizeof(AbilityBase_BPCustomEvent) == 0x000008, "Wrong size on AbilityBase_BPCustomEvent");
static_assert(offsetof(AbilityBase_BPCustomEvent, CustomName) == 0x000000, "Member 'AbilityBase_BPCustomEvent::CustomName' has a wrong offset!");

// Function man.AbilityBase.BPGetCaster
// 0x0008 (0x0008 - 0x0000)
struct AbilityBase_BPGetCaster final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_BPGetCaster) == 0x000008, "Wrong alignment on AbilityBase_BPGetCaster");
static_assert(sizeof(AbilityBase_BPGetCaster) == 0x000008, "Wrong size on AbilityBase_BPGetCaster");
static_assert(offsetof(AbilityBase_BPGetCaster, ReturnValue) == 0x000000, "Member 'AbilityBase_BPGetCaster::ReturnValue' has a wrong offset!");

// Function man.AbilityBase.BPGetComponentByClass
// 0x0018 (0x0018 - 0x0000)
struct AbilityBase_BPGetComponentByClass final
{
public:
	class UClass*                                 ComponentClass;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSub;                                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponent*                      ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_BPGetComponentByClass) == 0x000008, "Wrong alignment on AbilityBase_BPGetComponentByClass");
static_assert(sizeof(AbilityBase_BPGetComponentByClass) == 0x000018, "Wrong size on AbilityBase_BPGetComponentByClass");
static_assert(offsetof(AbilityBase_BPGetComponentByClass, ComponentClass) == 0x000000, "Member 'AbilityBase_BPGetComponentByClass::ComponentClass' has a wrong offset!");
static_assert(offsetof(AbilityBase_BPGetComponentByClass, bSub) == 0x000008, "Member 'AbilityBase_BPGetComponentByClass::bSub' has a wrong offset!");
static_assert(offsetof(AbilityBase_BPGetComponentByClass, ReturnValue) == 0x000010, "Member 'AbilityBase_BPGetComponentByClass::ReturnValue' has a wrong offset!");

// Function man.AbilityBase.BPGetComponentByName
// 0x0010 (0x0010 - 0x0000)
struct AbilityBase_BPGetComponentByName final
{
public:
	class FName                                   ComponentName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityComponent*                      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_BPGetComponentByName) == 0x000008, "Wrong alignment on AbilityBase_BPGetComponentByName");
static_assert(sizeof(AbilityBase_BPGetComponentByName) == 0x000010, "Wrong size on AbilityBase_BPGetComponentByName");
static_assert(offsetof(AbilityBase_BPGetComponentByName, ComponentName) == 0x000000, "Member 'AbilityBase_BPGetComponentByName::ComponentName' has a wrong offset!");
static_assert(offsetof(AbilityBase_BPGetComponentByName, ReturnValue) == 0x000008, "Member 'AbilityBase_BPGetComponentByName::ReturnValue' has a wrong offset!");

// Function man.AbilityBase.BPGetDuration
// 0x0004 (0x0004 - 0x0000)
struct AbilityBase_BPGetDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_BPGetDuration) == 0x000004, "Wrong alignment on AbilityBase_BPGetDuration");
static_assert(sizeof(AbilityBase_BPGetDuration) == 0x000004, "Wrong size on AbilityBase_BPGetDuration");
static_assert(offsetof(AbilityBase_BPGetDuration, ReturnValue) == 0x000000, "Member 'AbilityBase_BPGetDuration::ReturnValue' has a wrong offset!");

// Function man.AbilityBase.BPGetHitPosition
// 0x000C (0x000C - 0x0000)
struct AbilityBase_BPGetHitPosition final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_BPGetHitPosition) == 0x000004, "Wrong alignment on AbilityBase_BPGetHitPosition");
static_assert(sizeof(AbilityBase_BPGetHitPosition) == 0x00000C, "Wrong size on AbilityBase_BPGetHitPosition");
static_assert(offsetof(AbilityBase_BPGetHitPosition, ReturnValue) == 0x000000, "Member 'AbilityBase_BPGetHitPosition::ReturnValue' has a wrong offset!");

// Function man.AbilityBase.BPGetInstigatorAbility
// 0x0010 (0x0010 - 0x0000)
struct AbilityBase_BPGetInstigatorAbility final
{
public:
	bool                                          bAcrossEntities;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityBase*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_BPGetInstigatorAbility) == 0x000008, "Wrong alignment on AbilityBase_BPGetInstigatorAbility");
static_assert(sizeof(AbilityBase_BPGetInstigatorAbility) == 0x000010, "Wrong size on AbilityBase_BPGetInstigatorAbility");
static_assert(offsetof(AbilityBase_BPGetInstigatorAbility, bAcrossEntities) == 0x000000, "Member 'AbilityBase_BPGetInstigatorAbility::bAcrossEntities' has a wrong offset!");
static_assert(offsetof(AbilityBase_BPGetInstigatorAbility, ReturnValue) == 0x000008, "Member 'AbilityBase_BPGetInstigatorAbility::ReturnValue' has a wrong offset!");

// Function man.AbilityBase.BPGetRemainingTime
// 0x0004 (0x0004 - 0x0000)
struct AbilityBase_BPGetRemainingTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_BPGetRemainingTime) == 0x000004, "Wrong alignment on AbilityBase_BPGetRemainingTime");
static_assert(sizeof(AbilityBase_BPGetRemainingTime) == 0x000004, "Wrong size on AbilityBase_BPGetRemainingTime");
static_assert(offsetof(AbilityBase_BPGetRemainingTime, ReturnValue) == 0x000000, "Member 'AbilityBase_BPGetRemainingTime::ReturnValue' has a wrong offset!");

// Function man.AbilityBase.BPGetSummoner
// 0x0008 (0x0008 - 0x0000)
struct AbilityBase_BPGetSummoner final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_BPGetSummoner) == 0x000008, "Wrong alignment on AbilityBase_BPGetSummoner");
static_assert(sizeof(AbilityBase_BPGetSummoner) == 0x000008, "Wrong size on AbilityBase_BPGetSummoner");
static_assert(offsetof(AbilityBase_BPGetSummoner, ReturnValue) == 0x000000, "Member 'AbilityBase_BPGetSummoner::ReturnValue' has a wrong offset!");

// Function man.AbilityBase.BPGetTarget
// 0x0008 (0x0008 - 0x0000)
struct AbilityBase_BPGetTarget final
{
public:
	class UAbilityController*                     ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_BPGetTarget) == 0x000008, "Wrong alignment on AbilityBase_BPGetTarget");
static_assert(sizeof(AbilityBase_BPGetTarget) == 0x000008, "Wrong size on AbilityBase_BPGetTarget");
static_assert(offsetof(AbilityBase_BPGetTarget, ReturnValue) == 0x000000, "Member 'AbilityBase_BPGetTarget::ReturnValue' has a wrong offset!");

// Function man.AbilityBase.BPIsRuning
// 0x0001 (0x0001 - 0x0000)
struct AbilityBase_BPIsRuning final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_BPIsRuning) == 0x000001, "Wrong alignment on AbilityBase_BPIsRuning");
static_assert(sizeof(AbilityBase_BPIsRuning) == 0x000001, "Wrong size on AbilityBase_BPIsRuning");
static_assert(offsetof(AbilityBase_BPIsRuning, ReturnValue) == 0x000000, "Member 'AbilityBase_BPIsRuning::ReturnValue' has a wrong offset!");

// Function man.AbilityBase.BPOnTick
// 0x0004 (0x0004 - 0x0000)
struct AbilityBase_BPOnTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_BPOnTick) == 0x000004, "Wrong alignment on AbilityBase_BPOnTick");
static_assert(sizeof(AbilityBase_BPOnTick) == 0x000004, "Wrong size on AbilityBase_BPOnTick");
static_assert(offsetof(AbilityBase_BPOnTick, DeltaTime) == 0x000000, "Member 'AbilityBase_BPOnTick::DeltaTime' has a wrong offset!");

// Function man.AbilityBase.BPSetEnabled
// 0x0001 (0x0001 - 0x0000)
struct AbilityBase_BPSetEnabled final
{
public:
	bool                                          inEnabled;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_BPSetEnabled) == 0x000001, "Wrong alignment on AbilityBase_BPSetEnabled");
static_assert(sizeof(AbilityBase_BPSetEnabled) == 0x000001, "Wrong size on AbilityBase_BPSetEnabled");
static_assert(offsetof(AbilityBase_BPSetEnabled, inEnabled) == 0x000000, "Member 'AbilityBase_BPSetEnabled::inEnabled' has a wrong offset!");

// Function man.AbilityBase.BPStartCondition
// 0x0001 (0x0001 - 0x0000)
struct AbilityBase_BPStartCondition final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_BPStartCondition) == 0x000001, "Wrong alignment on AbilityBase_BPStartCondition");
static_assert(sizeof(AbilityBase_BPStartCondition) == 0x000001, "Wrong size on AbilityBase_BPStartCondition");
static_assert(offsetof(AbilityBase_BPStartCondition, Result) == 0x000000, "Member 'AbilityBase_BPStartCondition::Result' has a wrong offset!");

// Function man.AbilityBase.GetAbilityController
// 0x0008 (0x0008 - 0x0000)
struct AbilityBase_GetAbilityController final
{
public:
	class UAbilityController*                     ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_GetAbilityController) == 0x000008, "Wrong alignment on AbilityBase_GetAbilityController");
static_assert(sizeof(AbilityBase_GetAbilityController) == 0x000008, "Wrong size on AbilityBase_GetAbilityController");
static_assert(offsetof(AbilityBase_GetAbilityController, ReturnValue) == 0x000000, "Member 'AbilityBase_GetAbilityController::ReturnValue' has a wrong offset!");

// Function man.AbilityBase.GetActor
// 0x0008 (0x0008 - 0x0000)
struct AbilityBase_GetActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_GetActor) == 0x000008, "Wrong alignment on AbilityBase_GetActor");
static_assert(sizeof(AbilityBase_GetActor) == 0x000008, "Wrong size on AbilityBase_GetActor");
static_assert(offsetof(AbilityBase_GetActor, ReturnValue) == 0x000000, "Member 'AbilityBase_GetActor::ReturnValue' has a wrong offset!");

// Function man.AbilityBase.GetActorBase
// 0x0008 (0x0008 - 0x0000)
struct AbilityBase_GetActorBase final
{
public:
	class AActorBase*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_GetActorBase) == 0x000008, "Wrong alignment on AbilityBase_GetActorBase");
static_assert(sizeof(AbilityBase_GetActorBase) == 0x000008, "Wrong size on AbilityBase_GetActorBase");
static_assert(offsetof(AbilityBase_GetActorBase, ReturnValue) == 0x000000, "Member 'AbilityBase_GetActorBase::ReturnValue' has a wrong offset!");

// Function man.AbilityBase.GetAttributeContainer
// 0x0008 (0x0008 - 0x0000)
struct AbilityBase_GetAttributeContainer final
{
public:
	class UAttributeContainer*                    ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_GetAttributeContainer) == 0x000008, "Wrong alignment on AbilityBase_GetAttributeContainer");
static_assert(sizeof(AbilityBase_GetAttributeContainer) == 0x000008, "Wrong size on AbilityBase_GetAttributeContainer");
static_assert(offsetof(AbilityBase_GetAttributeContainer, ReturnValue) == 0x000000, "Member 'AbilityBase_GetAttributeContainer::ReturnValue' has a wrong offset!");

// Function man.AbilityBase.GetCharacter
// 0x0008 (0x0008 - 0x0000)
struct AbilityBase_GetCharacter final
{
public:
	class ACharacterBase*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_GetCharacter) == 0x000008, "Wrong alignment on AbilityBase_GetCharacter");
static_assert(sizeof(AbilityBase_GetCharacter) == 0x000008, "Wrong size on AbilityBase_GetCharacter");
static_assert(offsetof(AbilityBase_GetCharacter, ReturnValue) == 0x000000, "Member 'AbilityBase_GetCharacter::ReturnValue' has a wrong offset!");

// Function man.AbilityBase.GetEditorName
// 0x0010 (0x0010 - 0x0000)
struct AbilityBase_GetEditorName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_GetEditorName) == 0x000008, "Wrong alignment on AbilityBase_GetEditorName");
static_assert(sizeof(AbilityBase_GetEditorName) == 0x000010, "Wrong size on AbilityBase_GetEditorName");
static_assert(offsetof(AbilityBase_GetEditorName, ReturnValue) == 0x000000, "Member 'AbilityBase_GetEditorName::ReturnValue' has a wrong offset!");

// Function man.AbilityBase.GetEnemyCharacter
// 0x0008 (0x0008 - 0x0000)
struct AbilityBase_GetEnemyCharacter final
{
public:
	class AEnemyCharacter*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_GetEnemyCharacter) == 0x000008, "Wrong alignment on AbilityBase_GetEnemyCharacter");
static_assert(sizeof(AbilityBase_GetEnemyCharacter) == 0x000008, "Wrong size on AbilityBase_GetEnemyCharacter");
static_assert(offsetof(AbilityBase_GetEnemyCharacter, ReturnValue) == 0x000000, "Member 'AbilityBase_GetEnemyCharacter::ReturnValue' has a wrong offset!");

// Function man.AbilityBase.GetGameMode
// 0x0008 (0x0008 - 0x0000)
struct AbilityBase_GetGameMode final
{
public:
	class AMandragoraGameMode*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_GetGameMode) == 0x000008, "Wrong alignment on AbilityBase_GetGameMode");
static_assert(sizeof(AbilityBase_GetGameMode) == 0x000008, "Wrong size on AbilityBase_GetGameMode");
static_assert(offsetof(AbilityBase_GetGameMode, ReturnValue) == 0x000000, "Member 'AbilityBase_GetGameMode::ReturnValue' has a wrong offset!");

// Function man.AbilityBase.GetHero
// 0x0008 (0x0008 - 0x0000)
struct AbilityBase_GetHero final
{
public:
	class AHeroBase*                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_GetHero) == 0x000008, "Wrong alignment on AbilityBase_GetHero");
static_assert(sizeof(AbilityBase_GetHero) == 0x000008, "Wrong size on AbilityBase_GetHero");
static_assert(offsetof(AbilityBase_GetHero, ReturnValue) == 0x000000, "Member 'AbilityBase_GetHero::ReturnValue' has a wrong offset!");

// Function man.AbilityBase.GetRemainingChaosEffectTime
// 0x0004 (0x0004 - 0x0000)
struct AbilityBase_GetRemainingChaosEffectTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_GetRemainingChaosEffectTime) == 0x000004, "Wrong alignment on AbilityBase_GetRemainingChaosEffectTime");
static_assert(sizeof(AbilityBase_GetRemainingChaosEffectTime) == 0x000004, "Wrong size on AbilityBase_GetRemainingChaosEffectTime");
static_assert(offsetof(AbilityBase_GetRemainingChaosEffectTime, ReturnValue) == 0x000000, "Member 'AbilityBase_GetRemainingChaosEffectTime::ReturnValue' has a wrong offset!");

// Function man.AbilityBase.IsInterrupted
// 0x0001 (0x0001 - 0x0000)
struct AbilityBase_IsInterrupted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_IsInterrupted) == 0x000001, "Wrong alignment on AbilityBase_IsInterrupted");
static_assert(sizeof(AbilityBase_IsInterrupted) == 0x000001, "Wrong size on AbilityBase_IsInterrupted");
static_assert(offsetof(AbilityBase_IsInterrupted, ReturnValue) == 0x000000, "Member 'AbilityBase_IsInterrupted::ReturnValue' has a wrong offset!");

// Function man.AbilityBase.OnAbilityAnimReplacedBase
// 0x0018 (0x0018 - 0x0000)
struct AbilityBase_OnAbilityAnimReplacedBase final
{
public:
	class UAnimID*                                SrcAnimId;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimID*                                DestAnimId;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReplacerObject;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_OnAbilityAnimReplacedBase) == 0x000008, "Wrong alignment on AbilityBase_OnAbilityAnimReplacedBase");
static_assert(sizeof(AbilityBase_OnAbilityAnimReplacedBase) == 0x000018, "Wrong size on AbilityBase_OnAbilityAnimReplacedBase");
static_assert(offsetof(AbilityBase_OnAbilityAnimReplacedBase, SrcAnimId) == 0x000000, "Member 'AbilityBase_OnAbilityAnimReplacedBase::SrcAnimId' has a wrong offset!");
static_assert(offsetof(AbilityBase_OnAbilityAnimReplacedBase, DestAnimId) == 0x000008, "Member 'AbilityBase_OnAbilityAnimReplacedBase::DestAnimId' has a wrong offset!");
static_assert(offsetof(AbilityBase_OnAbilityAnimReplacedBase, ReplacerObject) == 0x000010, "Member 'AbilityBase_OnAbilityAnimReplacedBase::ReplacerObject' has a wrong offset!");

// Function man.AbilityBase.OnAnimEventBase
// 0x0030 (0x0030 - 0x0000)
struct AbilityBase_OnAnimEventBase final
{
public:
	struct FAnimEventParam                        AnimEventParam;                                    // 0x0000(0x0030)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_OnAnimEventBase) == 0x000008, "Wrong alignment on AbilityBase_OnAnimEventBase");
static_assert(sizeof(AbilityBase_OnAnimEventBase) == 0x000030, "Wrong size on AbilityBase_OnAnimEventBase");
static_assert(offsetof(AbilityBase_OnAnimEventBase, AnimEventParam) == 0x000000, "Member 'AbilityBase_OnAnimEventBase::AnimEventParam' has a wrong offset!");

// Function man.AbilityBase.OnAttackSpeedChanged
// 0x0010 (0x0010 - 0x0000)
struct AbilityBase_OnAttackSpeedChanged final
{
public:
	EAttribute                                    attribute;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttributeChangeDataInstance           preValue;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_OnAttackSpeedChanged) == 0x000008, "Wrong alignment on AbilityBase_OnAttackSpeedChanged");
static_assert(sizeof(AbilityBase_OnAttackSpeedChanged) == 0x000010, "Wrong size on AbilityBase_OnAttackSpeedChanged");
static_assert(offsetof(AbilityBase_OnAttackSpeedChanged, attribute) == 0x000000, "Member 'AbilityBase_OnAttackSpeedChanged::attribute' has a wrong offset!");
static_assert(offsetof(AbilityBase_OnAttackSpeedChanged, preValue) == 0x000008, "Member 'AbilityBase_OnAttackSpeedChanged::preValue' has a wrong offset!");

// Function man.AbilityBase.OnPreDamaged
// 0x02D8 (0x02D8 - 0x0000)
struct AbilityBase_OnPreDamaged final
{
public:
	struct FPreDamagedEventParam                  Param;                                             // 0x0000(0x02D8)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_OnPreDamaged) == 0x000008, "Wrong alignment on AbilityBase_OnPreDamaged");
static_assert(sizeof(AbilityBase_OnPreDamaged) == 0x0002D8, "Wrong size on AbilityBase_OnPreDamaged");
static_assert(offsetof(AbilityBase_OnPreDamaged, Param) == 0x000000, "Member 'AbilityBase_OnPreDamaged::Param' has a wrong offset!");

// Function man.AbilityBase.OnVisualEntitySpawned
// 0x0010 (0x0010 - 0x0000)
struct AbilityBase_OnVisualEntitySpawned final
{
public:
	class AVisualEntity*                          VisualEntity;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_OnVisualEntitySpawned) == 0x000008, "Wrong alignment on AbilityBase_OnVisualEntitySpawned");
static_assert(sizeof(AbilityBase_OnVisualEntitySpawned) == 0x000010, "Wrong size on AbilityBase_OnVisualEntitySpawned");
static_assert(offsetof(AbilityBase_OnVisualEntitySpawned, VisualEntity) == 0x000000, "Member 'AbilityBase_OnVisualEntitySpawned::VisualEntity' has a wrong offset!");
static_assert(offsetof(AbilityBase_OnVisualEntitySpawned, TargetActor) == 0x000008, "Member 'AbilityBase_OnVisualEntitySpawned::TargetActor' has a wrong offset!");

// Function man.AbilityBase.BPGetHudWidget
// 0x0008 (0x0008 - 0x0000)
struct AbilityBase_BPGetHudWidget final
{
public:
	class UHUDUserWidget*                         ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_BPGetHudWidget) == 0x000008, "Wrong alignment on AbilityBase_BPGetHudWidget");
static_assert(sizeof(AbilityBase_BPGetHudWidget) == 0x000008, "Wrong size on AbilityBase_BPGetHudWidget");
static_assert(offsetof(AbilityBase_BPGetHudWidget, ReturnValue) == 0x000000, "Member 'AbilityBase_BPGetHudWidget::ReturnValue' has a wrong offset!");

// Function man.AbilityBase.BPGetMaxStackNum
// 0x0004 (0x0004 - 0x0000)
struct AbilityBase_BPGetMaxStackNum final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityBase_BPGetMaxStackNum) == 0x000004, "Wrong alignment on AbilityBase_BPGetMaxStackNum");
static_assert(sizeof(AbilityBase_BPGetMaxStackNum) == 0x000004, "Wrong size on AbilityBase_BPGetMaxStackNum");
static_assert(offsetof(AbilityBase_BPGetMaxStackNum, ReturnValue) == 0x000000, "Member 'AbilityBase_BPGetMaxStackNum::ReturnValue' has a wrong offset!");

// Function man.AIBase.OnAbilityEndingBase
// 0x0008 (0x0008 - 0x0000)
struct AIBase_OnAbilityEndingBase final
{
public:
	class UAbilityBase*                           InAbility;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIBase_OnAbilityEndingBase) == 0x000008, "Wrong alignment on AIBase_OnAbilityEndingBase");
static_assert(sizeof(AIBase_OnAbilityEndingBase) == 0x000008, "Wrong size on AIBase_OnAbilityEndingBase");
static_assert(offsetof(AIBase_OnAbilityEndingBase, InAbility) == 0x000000, "Member 'AIBase_OnAbilityEndingBase::InAbility' has a wrong offset!");

// Function man.AIBase.OnAbilityStarting
// 0x0008 (0x0008 - 0x0000)
struct AIBase_OnAbilityStarting final
{
public:
	class UAbilityBase*                           InAbility;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIBase_OnAbilityStarting) == 0x000008, "Wrong alignment on AIBase_OnAbilityStarting");
static_assert(sizeof(AIBase_OnAbilityStarting) == 0x000008, "Wrong size on AIBase_OnAbilityStarting");
static_assert(offsetof(AIBase_OnAbilityStarting, InAbility) == 0x000000, "Member 'AIBase_OnAbilityStarting::InAbility' has a wrong offset!");

// Function man.AIBase.OnAbilityStartingBase
// 0x0010 (0x0010 - 0x0000)
struct AIBase_OnAbilityStartingBase final
{
public:
	class UAbilityBase*                           InAbility;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDesire;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AIBase_OnAbilityStartingBase) == 0x000008, "Wrong alignment on AIBase_OnAbilityStartingBase");
static_assert(sizeof(AIBase_OnAbilityStartingBase) == 0x000010, "Wrong size on AIBase_OnAbilityStartingBase");
static_assert(offsetof(AIBase_OnAbilityStartingBase, InAbility) == 0x000000, "Member 'AIBase_OnAbilityStartingBase::InAbility' has a wrong offset!");
static_assert(offsetof(AIBase_OnAbilityStartingBase, bDesire) == 0x000008, "Member 'AIBase_OnAbilityStartingBase::bDesire' has a wrong offset!");

// Function man.AIBase.OnAggroVolumeOverlap
// 0x0010 (0x0010 - 0x0000)
struct AIBase_OnAggroVolumeOverlap final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIBase_OnAggroVolumeOverlap) == 0x000008, "Wrong alignment on AIBase_OnAggroVolumeOverlap");
static_assert(sizeof(AIBase_OnAggroVolumeOverlap) == 0x000010, "Wrong size on AIBase_OnAggroVolumeOverlap");
static_assert(offsetof(AIBase_OnAggroVolumeOverlap, OverlappedActor) == 0x000000, "Member 'AIBase_OnAggroVolumeOverlap::OverlappedActor' has a wrong offset!");
static_assert(offsetof(AIBase_OnAggroVolumeOverlap, OtherActor) == 0x000008, "Member 'AIBase_OnAggroVolumeOverlap::OtherActor' has a wrong offset!");

// Function man.AIBase.OnRoomenterAbilityEnded
// 0x0008 (0x0008 - 0x0000)
struct AIBase_OnRoomenterAbilityEnded final
{
public:
	class UAbilityBase*                           AbilityEnded;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIBase_OnRoomenterAbilityEnded) == 0x000008, "Wrong alignment on AIBase_OnRoomenterAbilityEnded");
static_assert(sizeof(AIBase_OnRoomenterAbilityEnded) == 0x000008, "Wrong size on AIBase_OnRoomenterAbilityEnded");
static_assert(offsetof(AIBase_OnRoomenterAbilityEnded, AbilityEnded) == 0x000000, "Member 'AIBase_OnRoomenterAbilityEnded::AbilityEnded' has a wrong offset!");

// Function man.AIBase.OnRoomenterAnimEvent
// 0x0030 (0x0030 - 0x0000)
struct AIBase_OnRoomenterAnimEvent final
{
public:
	struct FAnimEventParam                        AnimEventParam;                                    // 0x0000(0x0030)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIBase_OnRoomenterAnimEvent) == 0x000008, "Wrong alignment on AIBase_OnRoomenterAnimEvent");
static_assert(sizeof(AIBase_OnRoomenterAnimEvent) == 0x000030, "Wrong size on AIBase_OnRoomenterAnimEvent");
static_assert(offsetof(AIBase_OnRoomenterAnimEvent, AnimEventParam) == 0x000000, "Member 'AIBase_OnRoomenterAnimEvent::AnimEventParam' has a wrong offset!");

// Function man.BasicAI.BasicAI_IsCollideSignature
// 0x0010 (0x0010 - 0x0000)
struct BasicAI_BasicAI_IsCollideSignature final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverride;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCollide;                                          // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BasicAI_BasicAI_IsCollideSignature) == 0x000008, "Wrong alignment on BasicAI_BasicAI_IsCollideSignature");
static_assert(sizeof(BasicAI_BasicAI_IsCollideSignature) == 0x000010, "Wrong size on BasicAI_BasicAI_IsCollideSignature");
static_assert(offsetof(BasicAI_BasicAI_IsCollideSignature, Actor) == 0x000000, "Member 'BasicAI_BasicAI_IsCollideSignature::Actor' has a wrong offset!");
static_assert(offsetof(BasicAI_BasicAI_IsCollideSignature, bOverride) == 0x000008, "Member 'BasicAI_BasicAI_IsCollideSignature::bOverride' has a wrong offset!");
static_assert(offsetof(BasicAI_BasicAI_IsCollideSignature, bCollide) == 0x000009, "Member 'BasicAI_BasicAI_IsCollideSignature::bCollide' has a wrong offset!");

// Function man.BasicAI.BasicAI_IsCollideSignatureEx
// 0x0030 (0x0030 - 0x0000)
struct BasicAI_BasicAI_IsCollideSignatureEx final
{
public:
	struct FGroundMovecollideIsCollideSignatureParam Param;                                             // 0x0000(0x0030)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BasicAI_BasicAI_IsCollideSignatureEx) == 0x000008, "Wrong alignment on BasicAI_BasicAI_IsCollideSignatureEx");
static_assert(sizeof(BasicAI_BasicAI_IsCollideSignatureEx) == 0x000030, "Wrong size on BasicAI_BasicAI_IsCollideSignatureEx");
static_assert(offsetof(BasicAI_BasicAI_IsCollideSignatureEx, Param) == 0x000000, "Member 'BasicAI_BasicAI_IsCollideSignatureEx::Param' has a wrong offset!");

// Function man.BasicAI.BPStartAggro
// 0x0002 (0x0002 - 0x0000)
struct BasicAI_BPStartAggro final
{
public:
	bool                                          bInSkipRoomEnter;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSerialize;                                        // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BasicAI_BPStartAggro) == 0x000001, "Wrong alignment on BasicAI_BPStartAggro");
static_assert(sizeof(BasicAI_BPStartAggro) == 0x000002, "Wrong size on BasicAI_BPStartAggro");
static_assert(offsetof(BasicAI_BPStartAggro, bInSkipRoomEnter) == 0x000000, "Member 'BasicAI_BPStartAggro::bInSkipRoomEnter' has a wrong offset!");
static_assert(offsetof(BasicAI_BPStartAggro, bSerialize) == 0x000001, "Member 'BasicAI_BPStartAggro::bSerialize' has a wrong offset!");

// Function man.BasicAI.OnActorRespawned
// 0x0008 (0x0008 - 0x0000)
struct BasicAI_OnActorRespawned final
{
public:
	class AActor*                                 RespawnedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BasicAI_OnActorRespawned) == 0x000008, "Wrong alignment on BasicAI_OnActorRespawned");
static_assert(sizeof(BasicAI_OnActorRespawned) == 0x000008, "Wrong size on BasicAI_OnActorRespawned");
static_assert(offsetof(BasicAI_OnActorRespawned, RespawnedActor) == 0x000000, "Member 'BasicAI_OnActorRespawned::RespawnedActor' has a wrong offset!");

// Function man.BasicAI.OnPostDamaged
// 0x02D8 (0x02D8 - 0x0000)
struct BasicAI_OnPostDamaged final
{
public:
	struct FPreDamagedEventParam                  Param;                                             // 0x0000(0x02D8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BasicAI_OnPostDamaged) == 0x000008, "Wrong alignment on BasicAI_OnPostDamaged");
static_assert(sizeof(BasicAI_OnPostDamaged) == 0x0002D8, "Wrong size on BasicAI_OnPostDamaged");
static_assert(offsetof(BasicAI_OnPostDamaged, Param) == 0x000000, "Member 'BasicAI_OnPostDamaged::Param' has a wrong offset!");

// Function man.ManUserWidgetBase.CloseRequest
// 0x0002 (0x0002 - 0x0000)
struct ManUserWidgetBase_CloseRequest final
{
public:
	bool                                          bOpenPauseMenu;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyClose;                                        // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManUserWidgetBase_CloseRequest) == 0x000001, "Wrong alignment on ManUserWidgetBase_CloseRequest");
static_assert(sizeof(ManUserWidgetBase_CloseRequest) == 0x000002, "Wrong size on ManUserWidgetBase_CloseRequest");
static_assert(offsetof(ManUserWidgetBase_CloseRequest, bOpenPauseMenu) == 0x000000, "Member 'ManUserWidgetBase_CloseRequest::bOpenPauseMenu' has a wrong offset!");
static_assert(offsetof(ManUserWidgetBase_CloseRequest, bOnlyClose) == 0x000001, "Member 'ManUserWidgetBase_CloseRequest::bOnlyClose' has a wrong offset!");

// Function man.ManUserWidgetBase.OnAnalogValueChangedEvent
// 0x0020 (0x0020 - 0x0000)
struct ManUserWidgetBase_OnAnalogValueChangedEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnalogValue;                                       // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ManUserWidgetBase_OnAnalogValueChangedEvent) == 0x000008, "Wrong alignment on ManUserWidgetBase_OnAnalogValueChangedEvent");
static_assert(sizeof(ManUserWidgetBase_OnAnalogValueChangedEvent) == 0x000020, "Wrong size on ManUserWidgetBase_OnAnalogValueChangedEvent");
static_assert(offsetof(ManUserWidgetBase_OnAnalogValueChangedEvent, Key) == 0x000000, "Member 'ManUserWidgetBase_OnAnalogValueChangedEvent::Key' has a wrong offset!");
static_assert(offsetof(ManUserWidgetBase_OnAnalogValueChangedEvent, AnalogValue) == 0x000018, "Member 'ManUserWidgetBase_OnAnalogValueChangedEvent::AnalogValue' has a wrong offset!");

// Function man.ManUserWidgetBase.OnErrorHiglight
// 0x0008 (0x0008 - 0x0000)
struct ManUserWidgetBase_OnErrorHiglight final
{
public:
	class UInteractButtonUserWidget*              InteractButtonUserWidget;                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManUserWidgetBase_OnErrorHiglight) == 0x000008, "Wrong alignment on ManUserWidgetBase_OnErrorHiglight");
static_assert(sizeof(ManUserWidgetBase_OnErrorHiglight) == 0x000008, "Wrong size on ManUserWidgetBase_OnErrorHiglight");
static_assert(offsetof(ManUserWidgetBase_OnErrorHiglight, InteractButtonUserWidget) == 0x000000, "Member 'ManUserWidgetBase_OnErrorHiglight::InteractButtonUserWidget' has a wrong offset!");

// Function man.ManUserWidgetBase.OnHide
// 0x0004 (0x0004 - 0x0000)
struct ManUserWidgetBase_OnHide final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManUserWidgetBase_OnHide) == 0x000004, "Wrong alignment on ManUserWidgetBase_OnHide");
static_assert(sizeof(ManUserWidgetBase_OnHide) == 0x000004, "Wrong size on ManUserWidgetBase_OnHide");
static_assert(offsetof(ManUserWidgetBase_OnHide, AnimDuration) == 0x000000, "Member 'ManUserWidgetBase_OnHide::AnimDuration' has a wrong offset!");

// Function man.ManUserWidgetBase.OnHoldCanceled
// 0x0010 (0x0010 - 0x0000)
struct ManUserWidgetBase_OnHoldCanceled final
{
public:
	class UInteractButtonUserWidget*              InteractButtonUserWidget;                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMinTimeCancel;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ManUserWidgetBase_OnHoldCanceled) == 0x000008, "Wrong alignment on ManUserWidgetBase_OnHoldCanceled");
static_assert(sizeof(ManUserWidgetBase_OnHoldCanceled) == 0x000010, "Wrong size on ManUserWidgetBase_OnHoldCanceled");
static_assert(offsetof(ManUserWidgetBase_OnHoldCanceled, InteractButtonUserWidget) == 0x000000, "Member 'ManUserWidgetBase_OnHoldCanceled::InteractButtonUserWidget' has a wrong offset!");
static_assert(offsetof(ManUserWidgetBase_OnHoldCanceled, bMinTimeCancel) == 0x000008, "Member 'ManUserWidgetBase_OnHoldCanceled::bMinTimeCancel' has a wrong offset!");

// Function man.ManUserWidgetBase.OnHoldFinished
// 0x0008 (0x0008 - 0x0000)
struct ManUserWidgetBase_OnHoldFinished final
{
public:
	class UInteractButtonUserWidget*              InteractButtonUserWidget;                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManUserWidgetBase_OnHoldFinished) == 0x000008, "Wrong alignment on ManUserWidgetBase_OnHoldFinished");
static_assert(sizeof(ManUserWidgetBase_OnHoldFinished) == 0x000008, "Wrong size on ManUserWidgetBase_OnHoldFinished");
static_assert(offsetof(ManUserWidgetBase_OnHoldFinished, InteractButtonUserWidget) == 0x000000, "Member 'ManUserWidgetBase_OnHoldFinished::InteractButtonUserWidget' has a wrong offset!");

// Function man.ManUserWidgetBase.OnHoldStarted
// 0x0008 (0x0008 - 0x0000)
struct ManUserWidgetBase_OnHoldStarted final
{
public:
	class UInteractButtonUserWidget*              InteractButtonUserWidget;                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManUserWidgetBase_OnHoldStarted) == 0x000008, "Wrong alignment on ManUserWidgetBase_OnHoldStarted");
static_assert(sizeof(ManUserWidgetBase_OnHoldStarted) == 0x000008, "Wrong size on ManUserWidgetBase_OnHoldStarted");
static_assert(offsetof(ManUserWidgetBase_OnHoldStarted, InteractButtonUserWidget) == 0x000000, "Member 'ManUserWidgetBase_OnHoldStarted::InteractButtonUserWidget' has a wrong offset!");

// Function man.ManUserWidgetBase.OnInputDisplayChanged
// 0x0002 (0x0002 - 0x0000)
struct ManUserWidgetBase_OnInputDisplayChanged final
{
public:
	EInputDisplay                                 InInputDisplay;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputDisplay                                 InControlDisplay;                                  // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManUserWidgetBase_OnInputDisplayChanged) == 0x000001, "Wrong alignment on ManUserWidgetBase_OnInputDisplayChanged");
static_assert(sizeof(ManUserWidgetBase_OnInputDisplayChanged) == 0x000002, "Wrong size on ManUserWidgetBase_OnInputDisplayChanged");
static_assert(offsetof(ManUserWidgetBase_OnInputDisplayChanged, InInputDisplay) == 0x000000, "Member 'ManUserWidgetBase_OnInputDisplayChanged::InInputDisplay' has a wrong offset!");
static_assert(offsetof(ManUserWidgetBase_OnInputDisplayChanged, InControlDisplay) == 0x000001, "Member 'ManUserWidgetBase_OnInputDisplayChanged::InControlDisplay' has a wrong offset!");

// Function man.ManUserWidgetBase.OnRotateCharacterLeft
// 0x0001 (0x0001 - 0x0000)
struct ManUserWidgetBase_OnRotateCharacterLeft final
{
public:
	bool                                          bRotate;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManUserWidgetBase_OnRotateCharacterLeft) == 0x000001, "Wrong alignment on ManUserWidgetBase_OnRotateCharacterLeft");
static_assert(sizeof(ManUserWidgetBase_OnRotateCharacterLeft) == 0x000001, "Wrong size on ManUserWidgetBase_OnRotateCharacterLeft");
static_assert(offsetof(ManUserWidgetBase_OnRotateCharacterLeft, bRotate) == 0x000000, "Member 'ManUserWidgetBase_OnRotateCharacterLeft::bRotate' has a wrong offset!");

// Function man.ManUserWidgetBase.OnRotateCharacterRight
// 0x0001 (0x0001 - 0x0000)
struct ManUserWidgetBase_OnRotateCharacterRight final
{
public:
	bool                                          bRotate;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManUserWidgetBase_OnRotateCharacterRight) == 0x000001, "Wrong alignment on ManUserWidgetBase_OnRotateCharacterRight");
static_assert(sizeof(ManUserWidgetBase_OnRotateCharacterRight) == 0x000001, "Wrong size on ManUserWidgetBase_OnRotateCharacterRight");
static_assert(offsetof(ManUserWidgetBase_OnRotateCharacterRight, bRotate) == 0x000000, "Member 'ManUserWidgetBase_OnRotateCharacterRight::bRotate' has a wrong offset!");

// Function man.ManUserWidgetBase.OnSetFocusedWidget
// 0x0018 (0x0018 - 0x0000)
struct ManUserWidgetBase_OnSetFocusedWidget final
{
public:
	class UWidget*                                OldFocusedWidget;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                NewFocusedWidget;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bChangeFocusByUser;                                // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bChangeFocusByMouse;                               // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ManUserWidgetBase_OnSetFocusedWidget) == 0x000008, "Wrong alignment on ManUserWidgetBase_OnSetFocusedWidget");
static_assert(sizeof(ManUserWidgetBase_OnSetFocusedWidget) == 0x000018, "Wrong size on ManUserWidgetBase_OnSetFocusedWidget");
static_assert(offsetof(ManUserWidgetBase_OnSetFocusedWidget, OldFocusedWidget) == 0x000000, "Member 'ManUserWidgetBase_OnSetFocusedWidget::OldFocusedWidget' has a wrong offset!");
static_assert(offsetof(ManUserWidgetBase_OnSetFocusedWidget, NewFocusedWidget) == 0x000008, "Member 'ManUserWidgetBase_OnSetFocusedWidget::NewFocusedWidget' has a wrong offset!");
static_assert(offsetof(ManUserWidgetBase_OnSetFocusedWidget, bChangeFocusByUser) == 0x000010, "Member 'ManUserWidgetBase_OnSetFocusedWidget::bChangeFocusByUser' has a wrong offset!");
static_assert(offsetof(ManUserWidgetBase_OnSetFocusedWidget, bChangeFocusByMouse) == 0x000011, "Member 'ManUserWidgetBase_OnSetFocusedWidget::bChangeFocusByMouse' has a wrong offset!");

// Function man.ManUserWidgetBase.OnSetInputDisplay
// 0x0002 (0x0002 - 0x0000)
struct ManUserWidgetBase_OnSetInputDisplay final
{
public:
	EInputDisplay                                 InInputDisplay;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputDisplay                                 InControlDisplay;                                  // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManUserWidgetBase_OnSetInputDisplay) == 0x000001, "Wrong alignment on ManUserWidgetBase_OnSetInputDisplay");
static_assert(sizeof(ManUserWidgetBase_OnSetInputDisplay) == 0x000002, "Wrong size on ManUserWidgetBase_OnSetInputDisplay");
static_assert(offsetof(ManUserWidgetBase_OnSetInputDisplay, InInputDisplay) == 0x000000, "Member 'ManUserWidgetBase_OnSetInputDisplay::InInputDisplay' has a wrong offset!");
static_assert(offsetof(ManUserWidgetBase_OnSetInputDisplay, InControlDisplay) == 0x000001, "Member 'ManUserWidgetBase_OnSetInputDisplay::InControlDisplay' has a wrong offset!");

// Function man.ManUserWidgetBase.OnSetTabButtonsVisbility
// 0x0004 (0x0004 - 0x0000)
struct ManUserWidgetBase_OnSetTabButtonsVisbility final
{
public:
	int32                                         InVisibleTabButtonNum;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManUserWidgetBase_OnSetTabButtonsVisbility) == 0x000004, "Wrong alignment on ManUserWidgetBase_OnSetTabButtonsVisbility");
static_assert(sizeof(ManUserWidgetBase_OnSetTabButtonsVisbility) == 0x000004, "Wrong size on ManUserWidgetBase_OnSetTabButtonsVisbility");
static_assert(offsetof(ManUserWidgetBase_OnSetTabButtonsVisbility, InVisibleTabButtonNum) == 0x000000, "Member 'ManUserWidgetBase_OnSetTabButtonsVisbility::InVisibleTabButtonNum' has a wrong offset!");

// Function man.ManUserWidgetBase.OnShow
// 0x0004 (0x0004 - 0x0000)
struct ManUserWidgetBase_OnShow final
{
public:
	float                                         AnimDuration;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManUserWidgetBase_OnShow) == 0x000004, "Wrong alignment on ManUserWidgetBase_OnShow");
static_assert(sizeof(ManUserWidgetBase_OnShow) == 0x000004, "Wrong size on ManUserWidgetBase_OnShow");
static_assert(offsetof(ManUserWidgetBase_OnShow, AnimDuration) == 0x000000, "Member 'ManUserWidgetBase_OnShow::AnimDuration' has a wrong offset!");

// Function man.ManUserWidgetBase.OnSortChanged
// 0x0018 (0x0018 - 0x0000)
struct ManUserWidgetBase_OnSortChanged final
{
public:
	class FText                                   SortName;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManUserWidgetBase_OnSortChanged) == 0x000008, "Wrong alignment on ManUserWidgetBase_OnSortChanged");
static_assert(sizeof(ManUserWidgetBase_OnSortChanged) == 0x000018, "Wrong size on ManUserWidgetBase_OnSortChanged");
static_assert(offsetof(ManUserWidgetBase_OnSortChanged, SortName) == 0x000000, "Member 'ManUserWidgetBase_OnSortChanged::SortName' has a wrong offset!");

// Function man.ManUserWidgetBase.OnUserScrolled
// 0x0004 (0x0004 - 0x0000)
struct ManUserWidgetBase_OnUserScrolled final
{
public:
	float                                         CurrentOffset;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManUserWidgetBase_OnUserScrolled) == 0x000004, "Wrong alignment on ManUserWidgetBase_OnUserScrolled");
static_assert(sizeof(ManUserWidgetBase_OnUserScrolled) == 0x000004, "Wrong size on ManUserWidgetBase_OnUserScrolled");
static_assert(offsetof(ManUserWidgetBase_OnUserScrolled, CurrentOffset) == 0x000000, "Member 'ManUserWidgetBase_OnUserScrolled::CurrentOffset' has a wrong offset!");

// Function man.ManUserWidgetBase.SetFocusedWidget
// 0x0010 (0x0010 - 0x0000)
struct ManUserWidgetBase_SetFocusedWidget final
{
public:
	class UWidget*                                InFocusedWidget;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnimate;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bChangeFocusByUser;                                // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bChangeFocusByMouse;                               // 0x000A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceSetLastValidFocusedWidget;                   // 0x000B(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ManUserWidgetBase_SetFocusedWidget) == 0x000008, "Wrong alignment on ManUserWidgetBase_SetFocusedWidget");
static_assert(sizeof(ManUserWidgetBase_SetFocusedWidget) == 0x000010, "Wrong size on ManUserWidgetBase_SetFocusedWidget");
static_assert(offsetof(ManUserWidgetBase_SetFocusedWidget, InFocusedWidget) == 0x000000, "Member 'ManUserWidgetBase_SetFocusedWidget::InFocusedWidget' has a wrong offset!");
static_assert(offsetof(ManUserWidgetBase_SetFocusedWidget, bAnimate) == 0x000008, "Member 'ManUserWidgetBase_SetFocusedWidget::bAnimate' has a wrong offset!");
static_assert(offsetof(ManUserWidgetBase_SetFocusedWidget, bChangeFocusByUser) == 0x000009, "Member 'ManUserWidgetBase_SetFocusedWidget::bChangeFocusByUser' has a wrong offset!");
static_assert(offsetof(ManUserWidgetBase_SetFocusedWidget, bChangeFocusByMouse) == 0x00000A, "Member 'ManUserWidgetBase_SetFocusedWidget::bChangeFocusByMouse' has a wrong offset!");
static_assert(offsetof(ManUserWidgetBase_SetFocusedWidget, bForceSetLastValidFocusedWidget) == 0x00000B, "Member 'ManUserWidgetBase_SetFocusedWidget::bForceSetLastValidFocusedWidget' has a wrong offset!");

// Function man.ManUserWidgetBase.SetInteractedActor
// 0x0008 (0x0008 - 0x0000)
struct ManUserWidgetBase_SetInteractedActor final
{
public:
	class AActorBase*                             InInteractedActor;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManUserWidgetBase_SetInteractedActor) == 0x000008, "Wrong alignment on ManUserWidgetBase_SetInteractedActor");
static_assert(sizeof(ManUserWidgetBase_SetInteractedActor) == 0x000008, "Wrong size on ManUserWidgetBase_SetInteractedActor");
static_assert(offsetof(ManUserWidgetBase_SetInteractedActor, InInteractedActor) == 0x000000, "Member 'ManUserWidgetBase_SetInteractedActor::InInteractedActor' has a wrong offset!");

// Function man.ManUserWidgetBase.SetTab
// 0x0002 (0x0002 - 0x0000)
struct ManUserWidgetBase_SetTab final
{
public:
	ETabButtonType                                TabButtonType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowWindow;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
