#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MQ01_WitchHunt_Quest

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "man_structs.hpp"


namespace SDK::Params
{

// Function MQ01_WitchHunt_Quest.MQ01_WitchHunt_Quest_C.ExecuteUbergraph_MQ01_WitchHunt_Quest
// 0x01E0 (0x01E0 - 0x0000)
struct MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint;                        // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestMarker                           K2Node_MakeStruct_QuestMarker;                     // 0x000C(0x0010)(NoDestructor)
	TDelegate<void(class UManQuestObjective* Objectile)> K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EntryKey)>         Temp_delegate_Variable;                            // 0x002C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EntryKey)>         Temp_delegate_Variable_1;                          // 0x003C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EntryKey)>         Temp_delegate_Variable_2;                          // 0x004C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GlobalDictionaryGetBool_OutValue;         // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GlobalDictionaryGetBool_ReturnValue;      // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F[0x1];                                       // 0x005F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UManQuestObjective*                     K2Node_CustomEvent_Objectile;                      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UManConversationManager*                CallFunc_GetConversationManager_ReturnValue;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GlobalDictionarySetBool_ReturnValue;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GlobalDictionarySetInt_ReturnValue;       // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GlobalDictionarySetInt_ReturnValue_1;     // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83[0x1];                                       // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              K2Node_MakeStruct_IntPoint_1;                      // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuestMarker                           K2Node_MakeStruct_QuestMarker_1;                   // 0x0090(0x0010)(NoDestructor)
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue;                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint_2;                      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint_3;                      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestMarker                           K2Node_MakeStruct_QuestMarker_2;                   // 0x00B8(0x0010)(NoDestructor)
	struct FQuestMarker                           K2Node_MakeStruct_QuestMarker_3;                   // 0x00C8(0x0010)(NoDestructor)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint_4;                      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint_5;                      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestMarker                           K2Node_MakeStruct_QuestMarker_4;                   // 0x00E8(0x0010)(NoDestructor)
	struct FQuestMarker                           K2Node_MakeStruct_QuestMarker_5;                   // 0x00F8(0x0010)(NoDestructor)
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue_1;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue_2;               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint_6;                      // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint_7;                      // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestMarker                           K2Node_MakeStruct_QuestMarker_6;                   // 0x0128(0x0010)(NoDestructor)
	struct FQuestMarker                           K2Node_MakeStruct_QuestMarker_7;                   // 0x0138(0x0010)(NoDestructor)
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue_3;               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue_4;               // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue_5;               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue_6;               // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint_8;                      // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint_9;                      // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestMarker                           K2Node_MakeStruct_QuestMarker_8;                   // 0x0178(0x0010)(NoDestructor)
	struct FQuestMarker                           K2Node_MakeStruct_QuestMarker_9;                   // 0x0188(0x0010)(NoDestructor)
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue_7;               // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint_10;                     // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue_8;               // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestMarker                           K2Node_MakeStruct_QuestMarker_10;                  // 0x01B0(0x0010)(NoDestructor)
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue_9;               // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue_10;              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue_11;              // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue_12;              // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest) == 0x000008, "Wrong alignment on MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest");
static_assert(sizeof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest) == 0x0001E0, "Wrong size on MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, EntryPoint) == 0x000000, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::EntryPoint' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, K2Node_MakeStruct_IntPoint) == 0x000004, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::K2Node_MakeStruct_IntPoint' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, K2Node_MakeStruct_QuestMarker) == 0x00000C, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::K2Node_MakeStruct_QuestMarker' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, Temp_delegate_Variable) == 0x00002C, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, Temp_delegate_Variable_1) == 0x00003C, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, Temp_delegate_Variable_2) == 0x00004C, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, CallFunc_GlobalDictionaryGetBool_OutValue) == 0x00005C, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::CallFunc_GlobalDictionaryGetBool_OutValue' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, CallFunc_GlobalDictionaryGetBool_ReturnValue) == 0x00005D, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::CallFunc_GlobalDictionaryGetBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, Temp_bool_IsClosed_Variable) == 0x00005E, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, K2Node_CustomEvent_Objectile) == 0x000060, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::K2Node_CustomEvent_Objectile' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, CallFunc_GetManGameMode_ReturnValue) == 0x000068, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::CallFunc_GetManGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000070, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, CallFunc_GetConversationManager_ReturnValue) == 0x000078, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::CallFunc_GetConversationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, CallFunc_GlobalDictionarySetBool_ReturnValue) == 0x000080, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::CallFunc_GlobalDictionarySetBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, CallFunc_GlobalDictionarySetInt_ReturnValue) == 0x000081, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::CallFunc_GlobalDictionarySetInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, CallFunc_GlobalDictionarySetInt_ReturnValue_1) == 0x000082, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::CallFunc_GlobalDictionarySetInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, K2Node_MakeStruct_IntPoint_1) == 0x000084, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::K2Node_MakeStruct_IntPoint_1' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, Temp_bool_Has_Been_Initd_Variable) == 0x00008C, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, K2Node_MakeStruct_QuestMarker_1) == 0x000090, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::K2Node_MakeStruct_QuestMarker_1' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, CallFunc_AddObjective_ReturnValue) == 0x0000A0, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::CallFunc_AddObjective_ReturnValue' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, K2Node_MakeStruct_IntPoint_2) == 0x0000A8, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::K2Node_MakeStruct_IntPoint_2' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, K2Node_MakeStruct_IntPoint_3) == 0x0000B0, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::K2Node_MakeStruct_IntPoint_3' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, K2Node_MakeStruct_QuestMarker_2) == 0x0000B8, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::K2Node_MakeStruct_QuestMarker_2' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, K2Node_MakeStruct_QuestMarker_3) == 0x0000C8, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::K2Node_MakeStruct_QuestMarker_3' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, K2Node_MakeStruct_IntPoint_4) == 0x0000D8, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::K2Node_MakeStruct_IntPoint_4' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, K2Node_MakeStruct_IntPoint_5) == 0x0000E0, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::K2Node_MakeStruct_IntPoint_5' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, K2Node_MakeStruct_QuestMarker_4) == 0x0000E8, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::K2Node_MakeStruct_QuestMarker_4' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, K2Node_MakeStruct_QuestMarker_5) == 0x0000F8, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::K2Node_MakeStruct_QuestMarker_5' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, CallFunc_AddObjective_ReturnValue_1) == 0x000108, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::CallFunc_AddObjective_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, CallFunc_AddObjective_ReturnValue_2) == 0x000110, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::CallFunc_AddObjective_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, K2Node_MakeStruct_IntPoint_6) == 0x000118, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::K2Node_MakeStruct_IntPoint_6' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, K2Node_MakeStruct_IntPoint_7) == 0x000120, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::K2Node_MakeStruct_IntPoint_7' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, K2Node_MakeStruct_QuestMarker_6) == 0x000128, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::K2Node_MakeStruct_QuestMarker_6' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, K2Node_MakeStruct_QuestMarker_7) == 0x000138, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::K2Node_MakeStruct_QuestMarker_7' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, CallFunc_AddObjective_ReturnValue_3) == 0x000148, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::CallFunc_AddObjective_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, CallFunc_AddObjective_ReturnValue_4) == 0x000150, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::CallFunc_AddObjective_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, CallFunc_AddObjective_ReturnValue_5) == 0x000158, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::CallFunc_AddObjective_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, CallFunc_AddObjective_ReturnValue_6) == 0x000160, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::CallFunc_AddObjective_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, K2Node_MakeStruct_IntPoint_8) == 0x000168, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::K2Node_MakeStruct_IntPoint_8' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, K2Node_MakeStruct_IntPoint_9) == 0x000170, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::K2Node_MakeStruct_IntPoint_9' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, K2Node_MakeStruct_QuestMarker_8) == 0x000178, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::K2Node_MakeStruct_QuestMarker_8' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, K2Node_MakeStruct_QuestMarker_9) == 0x000188, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::K2Node_MakeStruct_QuestMarker_9' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, CallFunc_AddObjective_ReturnValue_7) == 0x000198, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::CallFunc_AddObjective_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, K2Node_MakeStruct_IntPoint_10) == 0x0001A0, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::K2Node_MakeStruct_IntPoint_10' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, CallFunc_AddObjective_ReturnValue_8) == 0x0001A8, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::CallFunc_AddObjective_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, K2Node_MakeStruct_QuestMarker_10) == 0x0001B0, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::K2Node_MakeStruct_QuestMarker_10' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, CallFunc_AddObjective_ReturnValue_9) == 0x0001C0, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::CallFunc_AddObjective_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, CallFunc_AddObjective_ReturnValue_10) == 0x0001C8, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::CallFunc_AddObjective_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, CallFunc_AddObjective_ReturnValue_11) == 0x0001D0, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::CallFunc_AddObjective_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest, CallFunc_AddObjective_ReturnValue_12) == 0x0001D8, "Member 'MQ01_WitchHunt_Quest_C_ExecuteUbergraph_MQ01_WitchHunt_Quest::CallFunc_AddObjective_ReturnValue_12' has a wrong offset!");

// Function MQ01_WitchHunt_Quest.MQ01_WitchHunt_Quest_C.PreObjectileComplete
// 0x0008 (0x0008 - 0x0000)
struct MQ01_WitchHunt_Quest_C_PreObjectileComplete final
{
public:
	class UManQuestObjective*                     Objectile;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MQ01_WitchHunt_Quest_C_PreObjectileComplete) == 0x000008, "Wrong alignment on MQ01_WitchHunt_Quest_C_PreObjectileComplete");
static_assert(sizeof(MQ01_WitchHunt_Quest_C_PreObjectileComplete) == 0x000008, "Wrong size on MQ01_WitchHunt_Quest_C_PreObjectileComplete");
static_assert(offsetof(MQ01_WitchHunt_Quest_C_PreObjectileComplete, Objectile) == 0x000000, "Member 'MQ01_WitchHunt_Quest_C_PreObjectileComplete::Objectile' has a wrong offset!");

}

