#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MQ02_WolfAttack_Quest

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "man_structs.hpp"


namespace SDK::Params
{

// Function MQ02_WolfAttack_Quest.MQ02_WolfAttack_Quest_C.ExecuteUbergraph_MQ02_WolfAttack_Quest
// 0x0068 (0x0068 - 0x0000)
struct MQ02_WolfAttack_Quest_C_ExecuteUbergraph_MQ02_WolfAttack_Quest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	TArray<class FName>                           Temp_name_Variable;                                // 0x0018(0x0010)(ReferenceParm)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint;                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint_1;                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestMarker                           K2Node_MakeStruct_QuestMarker;                     // 0x0038(0x0010)(NoDestructor)
	struct FQuestMarker                           K2Node_MakeStruct_QuestMarker_1;                   // 0x0048(0x0010)(NoDestructor)
	class UManQuestObjectiveKillEnemies*          CallFunc_AddKillObjective_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MQ02_WolfAttack_Quest_C_ExecuteUbergraph_MQ02_WolfAttack_Quest) == 0x000008, "Wrong alignment on MQ02_WolfAttack_Quest_C_ExecuteUbergraph_MQ02_WolfAttack_Quest");
static_assert(sizeof(MQ02_WolfAttack_Quest_C_ExecuteUbergraph_MQ02_WolfAttack_Quest) == 0x000068, "Wrong size on MQ02_WolfAttack_Quest_C_ExecuteUbergraph_MQ02_WolfAttack_Quest");
static_assert(offsetof(MQ02_WolfAttack_Quest_C_ExecuteUbergraph_MQ02_WolfAttack_Quest, EntryPoint) == 0x000000, "Member 'MQ02_WolfAttack_Quest_C_ExecuteUbergraph_MQ02_WolfAttack_Quest::EntryPoint' has a wrong offset!");
static_assert(offsetof(MQ02_WolfAttack_Quest_C_ExecuteUbergraph_MQ02_WolfAttack_Quest, K2Node_MakeArray_Array) == 0x000008, "Member 'MQ02_WolfAttack_Quest_C_ExecuteUbergraph_MQ02_WolfAttack_Quest::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(MQ02_WolfAttack_Quest_C_ExecuteUbergraph_MQ02_WolfAttack_Quest, Temp_name_Variable) == 0x000018, "Member 'MQ02_WolfAttack_Quest_C_ExecuteUbergraph_MQ02_WolfAttack_Quest::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(MQ02_WolfAttack_Quest_C_ExecuteUbergraph_MQ02_WolfAttack_Quest, K2Node_MakeStruct_IntPoint) == 0x000028, "Member 'MQ02_WolfAttack_Quest_C_ExecuteUbergraph_MQ02_WolfAttack_Quest::K2Node_MakeStruct_IntPoint' has a wrong offset!");
static_assert(offsetof(MQ02_WolfAttack_Quest_C_ExecuteUbergraph_MQ02_WolfAttack_Quest, K2Node_MakeStruct_IntPoint_1) == 0x000030, "Member 'MQ02_WolfAttack_Quest_C_ExecuteUbergraph_MQ02_WolfAttack_Quest::K2Node_MakeStruct_IntPoint_1' has a wrong offset!");
static_assert(offsetof(MQ02_WolfAttack_Quest_C_ExecuteUbergraph_MQ02_WolfAttack_Quest, K2Node_MakeStruct_QuestMarker) == 0x000038, "Member 'MQ02_WolfAttack_Quest_C_ExecuteUbergraph_MQ02_WolfAttack_Quest::K2Node_MakeStruct_QuestMarker' has a wrong offset!");
static_assert(offsetof(MQ02_WolfAttack_Quest_C_ExecuteUbergraph_MQ02_WolfAttack_Quest, K2Node_MakeStruct_QuestMarker_1) == 0x000048, "Member 'MQ02_WolfAttack_Quest_C_ExecuteUbergraph_MQ02_WolfAttack_Quest::K2Node_MakeStruct_QuestMarker_1' has a wrong offset!");
static_assert(offsetof(MQ02_WolfAttack_Quest_C_ExecuteUbergraph_MQ02_WolfAttack_Quest, CallFunc_AddKillObjective_ReturnValue) == 0x000058, "Member 'MQ02_WolfAttack_Quest_C_ExecuteUbergraph_MQ02_WolfAttack_Quest::CallFunc_AddKillObjective_ReturnValue' has a wrong offset!");
static_assert(offsetof(MQ02_WolfAttack_Quest_C_ExecuteUbergraph_MQ02_WolfAttack_Quest, CallFunc_AddObjective_ReturnValue) == 0x000060, "Member 'MQ02_WolfAttack_Quest_C_ExecuteUbergraph_MQ02_WolfAttack_Quest::CallFunc_AddObjective_ReturnValue' has a wrong offset!");

}

