#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NiagaraAnimNotifies

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class NiagaraAnimNotifies.AnimNotify_PlayNiagaraEffect
// 0x0088 (0x00C0 - 0x0038)
class alignas(0x10) UAnimNotify_PlayNiagaraEffect : public UAnimNotify
{
public:
	TSoftObjectPtr<class UNiagaraSystem>          Template;                                          // 0x0038(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         TemplateLoaded;                                    // 0x0060(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x4];                                       // 0x0068(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocationOffset;                                    // 0x006C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RotationOffset;                                    // 0x0078(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Scale;                                             // 0x0084(0x000C)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAbsoluteScale;                                    // 0x0090(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x1F];                                      // 0x0091(0x001F)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         Attached : 1;                                      // 0x00B0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SocketName;                                        // 0x00B4(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UFXSystemComponent* GetSpawnedEffect() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_PlayNiagaraEffect">();
	}
	static class UAnimNotify_PlayNiagaraEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_PlayNiagaraEffect>();
	}
};
static_assert(alignof(UAnimNotify_PlayNiagaraEffect) == 0x000010, "Wrong alignment on UAnimNotify_PlayNiagaraEffect");
static_assert(sizeof(UAnimNotify_PlayNiagaraEffect) == 0x0000C0, "Wrong size on UAnimNotify_PlayNiagaraEffect");
static_assert(offsetof(UAnimNotify_PlayNiagaraEffect, Template) == 0x000038, "Member 'UAnimNotify_PlayNiagaraEffect::Template' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayNiagaraEffect, TemplateLoaded) == 0x000060, "Member 'UAnimNotify_PlayNiagaraEffect::TemplateLoaded' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayNiagaraEffect, LocationOffset) == 0x00006C, "Member 'UAnimNotify_PlayNiagaraEffect::LocationOffset' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayNiagaraEffect, RotationOffset) == 0x000078, "Member 'UAnimNotify_PlayNiagaraEffect::RotationOffset' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayNiagaraEffect, Scale) == 0x000084, "Member 'UAnimNotify_PlayNiagaraEffect::Scale' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayNiagaraEffect, bAbsoluteScale) == 0x000090, "Member 'UAnimNotify_PlayNiagaraEffect::bAbsoluteScale' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayNiagaraEffect, SocketName) == 0x0000B4, "Member 'UAnimNotify_PlayNiagaraEffect::SocketName' has a wrong offset!");

// Class NiagaraAnimNotifies.AnimNotifyState_TimedNiagaraEffect
// 0x0058 (0x0088 - 0x0030)
class UAnimNotifyState_TimedNiagaraEffect : public UAnimNotifyState
{
public:
	TSoftObjectPtr<class UNiagaraSystem>          Template;                                          // 0x0030(0x0028)(Edit, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         TemplateLoaded;                                    // 0x0058(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x4];                                       // 0x0060(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SocketName;                                        // 0x0064(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocationOffset;                                    // 0x006C(0x000C)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RotationOffset;                                    // 0x0078(0x000C)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bDestroyAtEnd;                                     // 0x0084(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UFXSystemComponent* GetSpawnedEffect(class UMeshComponent* MeshComp) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_TimedNiagaraEffect">();
	}
	static class UAnimNotifyState_TimedNiagaraEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_TimedNiagaraEffect>();
	}
};
static_assert(alignof(UAnimNotifyState_TimedNiagaraEffect) == 0x000008, "Wrong alignment on UAnimNotifyState_TimedNiagaraEffect");
static_assert(sizeof(UAnimNotifyState_TimedNiagaraEffect) == 0x000088, "Wrong size on UAnimNotifyState_TimedNiagaraEffect");
static_assert(offsetof(UAnimNotifyState_TimedNiagaraEffect, Template) == 0x000030, "Member 'UAnimNotifyState_TimedNiagaraEffect::Template' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_TimedNiagaraEffect, TemplateLoaded) == 0x000058, "Member 'UAnimNotifyState_TimedNiagaraEffect::TemplateLoaded' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_TimedNiagaraEffect, SocketName) == 0x000064, "Member 'UAnimNotifyState_TimedNiagaraEffect::SocketName' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_TimedNiagaraEffect, LocationOffset) == 0x00006C, "Member 'UAnimNotifyState_TimedNiagaraEffect::LocationOffset' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_TimedNiagaraEffect, RotationOffset) == 0x000078, "Member 'UAnimNotifyState_TimedNiagaraEffect::RotationOffset' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_TimedNiagaraEffect, bDestroyAtEnd) == 0x000084, "Member 'UAnimNotifyState_TimedNiagaraEffect::bDestroyAtEnd' has a wrong offset!");

// Class NiagaraAnimNotifies.AnimNotifyState_TimedNiagaraEffectAdvanced
// 0x0050 (0x00D8 - 0x0088)
class UAnimNotifyState_TimedNiagaraEffectAdvanced : public UAnimNotifyState_TimedNiagaraEffect
{
public:
	uint8                                         Pad_88[0x50];                                      // 0x0088(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetNotifyProgress(class UMeshComponent* MeshComp) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_TimedNiagaraEffectAdvanced">();
	}
	static class UAnimNotifyState_TimedNiagaraEffectAdvanced* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_TimedNiagaraEffectAdvanced>();
	}
};
static_assert(alignof(UAnimNotifyState_TimedNiagaraEffectAdvanced) == 0x000008, "Wrong alignment on UAnimNotifyState_TimedNiagaraEffectAdvanced");
static_assert(sizeof(UAnimNotifyState_TimedNiagaraEffectAdvanced) == 0x0000D8, "Wrong size on UAnimNotifyState_TimedNiagaraEffectAdvanced");

}

