#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrimalSharedEnginePlugin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PrimalSharedEnginePlugin.Graphics.GetDPIScaling
// 0x0004 (0x0004 - 0x0000)
struct Graphics_GetDPIScaling final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Graphics_GetDPIScaling) == 0x000004, "Wrong alignment on Graphics_GetDPIScaling");
static_assert(sizeof(Graphics_GetDPIScaling) == 0x000004, "Wrong size on Graphics_GetDPIScaling");
static_assert(offsetof(Graphics_GetDPIScaling, ReturnValue) == 0x000000, "Member 'Graphics_GetDPIScaling::ReturnValue' has a wrong offset!");

// Function PrimalSharedEnginePlugin.Graphics.GetProjectResolution
// 0x0008 (0x0008 - 0x0000)
struct Graphics_GetProjectResolution final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Graphics_GetProjectResolution) == 0x000004, "Wrong alignment on Graphics_GetProjectResolution");
static_assert(sizeof(Graphics_GetProjectResolution) == 0x000008, "Wrong size on Graphics_GetProjectResolution");
static_assert(offsetof(Graphics_GetProjectResolution, ReturnValue) == 0x000000, "Member 'Graphics_GetProjectResolution::ReturnValue' has a wrong offset!");

}

