#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_BreakableProps

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_BreakableProps.S_BreakableProps
// 0x00B0 (0x00B0 - 0x0000)
struct FS_BreakableProps final
{
public:
	TSoftObjectPtr<class UDestructibleMesh>       Mesh_29_6F74E1FF41FAE3F1C62575943AC8DEAF;          // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UDamageTakenVFXDataAsset> DamageTakenVFXDataAsset_30_BEE93EE54B01D89DA23E40B29EC640B3; // 0x0028(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAkAudioEvent>           DestroyedSound_31_4A2B2676437B79679EDC189509F95F45; // 0x0050(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UNiagaraSystem>          DestroyedParticleEffect_32_48B962B14FFB1CFA81042C9E28787F78; // 0x0078(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FVector                                Collision_17_705B97A64E42E16214519498F930FA3F;     // 0x00A0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_BreakableProps) == 0x000008, "Wrong alignment on FS_BreakableProps");
static_assert(sizeof(FS_BreakableProps) == 0x0000B0, "Wrong size on FS_BreakableProps");
static_assert(offsetof(FS_BreakableProps, Mesh_29_6F74E1FF41FAE3F1C62575943AC8DEAF) == 0x000000, "Member 'FS_BreakableProps::Mesh_29_6F74E1FF41FAE3F1C62575943AC8DEAF' has a wrong offset!");
static_assert(offsetof(FS_BreakableProps, DamageTakenVFXDataAsset_30_BEE93EE54B01D89DA23E40B29EC640B3) == 0x000028, "Member 'FS_BreakableProps::DamageTakenVFXDataAsset_30_BEE93EE54B01D89DA23E40B29EC640B3' has a wrong offset!");
static_assert(offsetof(FS_BreakableProps, DestroyedSound_31_4A2B2676437B79679EDC189509F95F45) == 0x000050, "Member 'FS_BreakableProps::DestroyedSound_31_4A2B2676437B79679EDC189509F95F45' has a wrong offset!");
static_assert(offsetof(FS_BreakableProps, DestroyedParticleEffect_32_48B962B14FFB1CFA81042C9E28787F78) == 0x000078, "Member 'FS_BreakableProps::DestroyedParticleEffect_32_48B962B14FFB1CFA81042C9E28787F78' has a wrong offset!");
static_assert(offsetof(FS_BreakableProps, Collision_17_705B97A64E42E16214519498F930FA3F) == 0x0000A0, "Member 'FS_BreakableProps::Collision_17_705B97A64E42E16214519498F930FA3F' has a wrong offset!");

}

