#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_WeaponTrailEffectParameters

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_WeaponTrailEffectParameters.S_WeaponTrailEffectParameters
// 0x002C (0x002C - 0x0000)
struct FS_WeaponTrailEffectParameters final
{
public:
	struct FLinearColor                           Color_2_7649A244473F67697C84A785DDA9B147;          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cutoff_5_DC70567A4CBB1FBB7388DD83407F872E;         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Length_7_0459F1D04C120CB2441867B90D04F133;         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lifetimetraillength_9_CEAD0996403337FBB2D13DAB155DC98B; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Noise2_strength_11_1EC5429A4653ECECEF14D2ACD2806E86; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NoiseVTile_13_9EB4CDB84DA4ECCFEC44BBB1DA6E7130;    // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TrailFacingScreen_15_1882A2604B09EC7F8ABAD6B035A600F2; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VGradi_contrast_17_45C52CEE474BD57640DB9ABFA20BAC64; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_WeaponTrailEffectParameters) == 0x000004, "Wrong alignment on FS_WeaponTrailEffectParameters");
static_assert(sizeof(FS_WeaponTrailEffectParameters) == 0x00002C, "Wrong size on FS_WeaponTrailEffectParameters");
static_assert(offsetof(FS_WeaponTrailEffectParameters, Color_2_7649A244473F67697C84A785DDA9B147) == 0x000000, "Member 'FS_WeaponTrailEffectParameters::Color_2_7649A244473F67697C84A785DDA9B147' has a wrong offset!");
static_assert(offsetof(FS_WeaponTrailEffectParameters, Cutoff_5_DC70567A4CBB1FBB7388DD83407F872E) == 0x000010, "Member 'FS_WeaponTrailEffectParameters::Cutoff_5_DC70567A4CBB1FBB7388DD83407F872E' has a wrong offset!");
static_assert(offsetof(FS_WeaponTrailEffectParameters, Length_7_0459F1D04C120CB2441867B90D04F133) == 0x000014, "Member 'FS_WeaponTrailEffectParameters::Length_7_0459F1D04C120CB2441867B90D04F133' has a wrong offset!");
static_assert(offsetof(FS_WeaponTrailEffectParameters, Lifetimetraillength_9_CEAD0996403337FBB2D13DAB155DC98B) == 0x000018, "Member 'FS_WeaponTrailEffectParameters::Lifetimetraillength_9_CEAD0996403337FBB2D13DAB155DC98B' has a wrong offset!");
static_assert(offsetof(FS_WeaponTrailEffectParameters, Noise2_strength_11_1EC5429A4653ECECEF14D2ACD2806E86) == 0x00001C, "Member 'FS_WeaponTrailEffectParameters::Noise2_strength_11_1EC5429A4653ECECEF14D2ACD2806E86' has a wrong offset!");
static_assert(offsetof(FS_WeaponTrailEffectParameters, NoiseVTile_13_9EB4CDB84DA4ECCFEC44BBB1DA6E7130) == 0x000020, "Member 'FS_WeaponTrailEffectParameters::NoiseVTile_13_9EB4CDB84DA4ECCFEC44BBB1DA6E7130' has a wrong offset!");
static_assert(offsetof(FS_WeaponTrailEffectParameters, TrailFacingScreen_15_1882A2604B09EC7F8ABAD6B035A600F2) == 0x000024, "Member 'FS_WeaponTrailEffectParameters::TrailFacingScreen_15_1882A2604B09EC7F8ABAD6B035A600F2' has a wrong offset!");
static_assert(offsetof(FS_WeaponTrailEffectParameters, VGradi_contrast_17_45C52CEE474BD57640DB9ABFA20BAC64) == 0x000028, "Member 'FS_WeaponTrailEffectParameters::VGradi_contrast_17_45C52CEE474BD57640DB9ABFA20BAC64' has a wrong offset!");

}

