#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shirin_Caravan_Conversation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Shirin_Caravan_Conversation.Shirin_Caravan_Conversation_C
// 0x0038 (0x0260 - 0x0228)
class AShirin_Caravan_Conversation_C final : public AConversationInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsBreaked;                                         // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CaravanNPC;                                        // 0x0238(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	TArray<bool>                                  CarvanNPCTalked;                                   // 0x0248(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	class ABP_TailorAndHorseNPC_C*                Shirin;                                            // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPOnStartConversation(class FName ConversationName);
	void Hub();
	void Trade();
	void Questions();
	void CharacterIntro();
	void Break();
	void AfterNPC();
	void Quest();
	void Assasin();
	void ClearText();
	void asd();
	void ReceiveBeginPlay();
	void Intro();
	void ExecuteUbergraph_Shirin_Caravan_Conversation(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Shirin_Caravan_Conversation_C">();
	}
	static class AShirin_Caravan_Conversation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AShirin_Caravan_Conversation_C>();
	}
};
static_assert(alignof(AShirin_Caravan_Conversation_C) == 0x000008, "Wrong alignment on AShirin_Caravan_Conversation_C");
static_assert(sizeof(AShirin_Caravan_Conversation_C) == 0x000260, "Wrong size on AShirin_Caravan_Conversation_C");
static_assert(offsetof(AShirin_Caravan_Conversation_C, UberGraphFrame) == 0x000228, "Member 'AShirin_Caravan_Conversation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AShirin_Caravan_Conversation_C, IsBreaked) == 0x000230, "Member 'AShirin_Caravan_Conversation_C::IsBreaked' has a wrong offset!");
static_assert(offsetof(AShirin_Caravan_Conversation_C, CaravanNPC) == 0x000238, "Member 'AShirin_Caravan_Conversation_C::CaravanNPC' has a wrong offset!");
static_assert(offsetof(AShirin_Caravan_Conversation_C, CarvanNPCTalked) == 0x000248, "Member 'AShirin_Caravan_Conversation_C::CarvanNPCTalked' has a wrong offset!");
static_assert(offsetof(AShirin_Caravan_Conversation_C, Shirin) == 0x000258, "Member 'AShirin_Caravan_Conversation_C::Shirin' has a wrong offset!");

}

