#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpawnWeaponCollisionVE

#include "Basic.hpp"


namespace SDK::Params
{

// Function SpawnWeaponCollisionVE.SpawnWeaponCollisionVE_C.Received_Notify
// 0x0088 (0x0088 - 0x0000)
struct SpawnWeaponCollisionVE_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         K2Node_DynamicCast_AsCharacter_Base;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrawlerHero_C*                      K2Node_DynamicCast_AsBP_Brawler_Hero;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityController*                     CallFunc_GetAbilityController_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_WeaponActor_C*                      K2Node_DynamicCast_AsBP_Weapon_Actor;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    CallFunc_GetManGameMode_ReturnValue_1;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVisualEntity*                          CallFunc_SpawnVisualEntity_ReturnValue_1;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_WeaponCollision_VisualEntity_C*     K2Node_DynamicCast_AsWGR;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpawnWeaponCollisionVE_C_Received_Notify) == 0x000008, "Wrong alignment on SpawnWeaponCollisionVE_C_Received_Notify");
static_assert(sizeof(SpawnWeaponCollisionVE_C_Received_Notify) == 0x000088, "Wrong size on SpawnWeaponCollisionVE_C_Received_Notify");
static_assert(offsetof(SpawnWeaponCollisionVE_C_Received_Notify, MeshComp) == 0x000000, "Member 'SpawnWeaponCollisionVE_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(SpawnWeaponCollisionVE_C_Received_Notify, Animation) == 0x000008, "Member 'SpawnWeaponCollisionVE_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(SpawnWeaponCollisionVE_C_Received_Notify, ReturnValue) == 0x000010, "Member 'SpawnWeaponCollisionVE_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnWeaponCollisionVE_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'SpawnWeaponCollisionVE_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnWeaponCollisionVE_C_Received_Notify, K2Node_DynamicCast_AsCharacter_Base) == 0x000020, "Member 'SpawnWeaponCollisionVE_C_Received_Notify::K2Node_DynamicCast_AsCharacter_Base' has a wrong offset!");
static_assert(offsetof(SpawnWeaponCollisionVE_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'SpawnWeaponCollisionVE_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SpawnWeaponCollisionVE_C_Received_Notify, K2Node_DynamicCast_AsBP_Brawler_Hero) == 0x000030, "Member 'SpawnWeaponCollisionVE_C_Received_Notify::K2Node_DynamicCast_AsBP_Brawler_Hero' has a wrong offset!");
static_assert(offsetof(SpawnWeaponCollisionVE_C_Received_Notify, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'SpawnWeaponCollisionVE_C_Received_Notify::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SpawnWeaponCollisionVE_C_Received_Notify, CallFunc_GetAbilityController_ReturnValue) == 0x000040, "Member 'SpawnWeaponCollisionVE_C_Received_Notify::CallFunc_GetAbilityController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnWeaponCollisionVE_C_Received_Notify, CallFunc_GetManGameMode_ReturnValue) == 0x000048, "Member 'SpawnWeaponCollisionVE_C_Received_Notify::CallFunc_GetManGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnWeaponCollisionVE_C_Received_Notify, K2Node_DynamicCast_AsBP_Weapon_Actor) == 0x000050, "Member 'SpawnWeaponCollisionVE_C_Received_Notify::K2Node_DynamicCast_AsBP_Weapon_Actor' has a wrong offset!");
static_assert(offsetof(SpawnWeaponCollisionVE_C_Received_Notify, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'SpawnWeaponCollisionVE_C_Received_Notify::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(SpawnWeaponCollisionVE_C_Received_Notify, CallFunc_SpawnVisualEntity_ReturnValue) == 0x000060, "Member 'SpawnWeaponCollisionVE_C_Received_Notify::CallFunc_SpawnVisualEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnWeaponCollisionVE_C_Received_Notify, CallFunc_GetManGameMode_ReturnValue_1) == 0x000068, "Member 'SpawnWeaponCollisionVE_C_Received_Notify::CallFunc_GetManGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpawnWeaponCollisionVE_C_Received_Notify, CallFunc_SpawnVisualEntity_ReturnValue_1) == 0x000070, "Member 'SpawnWeaponCollisionVE_C_Received_Notify::CallFunc_SpawnVisualEntity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpawnWeaponCollisionVE_C_Received_Notify, K2Node_DynamicCast_AsWGR) == 0x000078, "Member 'SpawnWeaponCollisionVE_C_Received_Notify::K2Node_DynamicCast_AsWGR' has a wrong offset!");
static_assert(offsetof(SpawnWeaponCollisionVE_C_Received_Notify, K2Node_DynamicCast_bSuccess_3) == 0x000080, "Member 'SpawnWeaponCollisionVE_C_Received_Notify::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

}

