#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SplineActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SplineActor.SplineActor_C
// 0x0018 (0x0240 - 0x0228)
class ASplineActor_C final : public AActor
{
public:
	class USplineComponent*                       Spline;                                            // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            StaticMesh;                                        // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESplineMeshAxis                               ForwardAxis;                                       // 0x0238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Collision;                                         // 0x0239(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SplineActor_C">();
	}
	static class ASplineActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASplineActor_C>();
	}
};
static_assert(alignof(ASplineActor_C) == 0x000008, "Wrong alignment on ASplineActor_C");
static_assert(sizeof(ASplineActor_C) == 0x000240, "Wrong size on ASplineActor_C");
static_assert(offsetof(ASplineActor_C, Spline) == 0x000228, "Member 'ASplineActor_C::Spline' has a wrong offset!");
static_assert(offsetof(ASplineActor_C, StaticMesh) == 0x000230, "Member 'ASplineActor_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ASplineActor_C, ForwardAxis) == 0x000238, "Member 'ASplineActor_C::ForwardAxis' has a wrong offset!");
static_assert(offsetof(ASplineActor_C, Collision) == 0x000239, "Member 'ASplineActor_C::Collision' has a wrong offset!");

}

