#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SplineActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SplineActor.SplineActor_C.UserConstructionScript
// 0x0090 (0x0090 - 0x0000)
struct SplineActor_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtSplinePoint_ReturnValue;      // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtSplinePoint_ReturnValue_1;    // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_1;   // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SplineActor_C_UserConstructionScript) == 0x000010, "Wrong alignment on SplineActor_C_UserConstructionScript");
static_assert(sizeof(SplineActor_C_UserConstructionScript) == 0x000090, "Wrong size on SplineActor_C_UserConstructionScript");
static_assert(offsetof(SplineActor_C_UserConstructionScript, Temp_int_Variable) == 0x000000, "Member 'SplineActor_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SplineActor_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'SplineActor_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineActor_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x000008, "Member 'SplineActor_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SplineActor_C_UserConstructionScript, Temp_struct_Variable) == 0x000010, "Member 'SplineActor_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(SplineActor_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000040, "Member 'SplineActor_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineActor_C_UserConstructionScript, CallFunc_GetTangentAtSplinePoint_ReturnValue) == 0x000048, "Member 'SplineActor_C_UserConstructionScript::CallFunc_GetTangentAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineActor_C_UserConstructionScript, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000054, "Member 'SplineActor_C_UserConstructionScript::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineActor_C_UserConstructionScript, CallFunc_GetTangentAtSplinePoint_ReturnValue_1) == 0x000060, "Member 'SplineActor_C_UserConstructionScript::CallFunc_GetTangentAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SplineActor_C_UserConstructionScript, CallFunc_GetLocationAtSplinePoint_ReturnValue_1) == 0x00006C, "Member 'SplineActor_C_UserConstructionScript::CallFunc_GetLocationAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SplineActor_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000078, "Member 'SplineActor_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineActor_C_UserConstructionScript, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x00007C, "Member 'SplineActor_C_UserConstructionScript::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineActor_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x000080, "Member 'SplineActor_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineActor_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000084, "Member 'SplineActor_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineActor_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000085, "Member 'SplineActor_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

}

