#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SQ02_Thief_Quest

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "man_structs.hpp"


namespace SDK::Params
{

// Function SQ02_Thief_Quest.SQ02_Thief_Quest_C.ExecuteUbergraph_SQ02_Thief_Quest
// 0x0048 (0x0048 - 0x0000)
struct SQ02_Thief_Quest_C_ExecuteUbergraph_SQ02_Thief_Quest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint;                        // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestMarker                           K2Node_MakeStruct_QuestMarker;                     // 0x000C(0x0010)(NoDestructor)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint_1;                      // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestMarker                           K2Node_MakeStruct_QuestMarker_1;                   // 0x0024(0x0010)(NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue_1;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SQ02_Thief_Quest_C_ExecuteUbergraph_SQ02_Thief_Quest) == 0x000008, "Wrong alignment on SQ02_Thief_Quest_C_ExecuteUbergraph_SQ02_Thief_Quest");
static_assert(sizeof(SQ02_Thief_Quest_C_ExecuteUbergraph_SQ02_Thief_Quest) == 0x000048, "Wrong size on SQ02_Thief_Quest_C_ExecuteUbergraph_SQ02_Thief_Quest");
static_assert(offsetof(SQ02_Thief_Quest_C_ExecuteUbergraph_SQ02_Thief_Quest, EntryPoint) == 0x000000, "Member 'SQ02_Thief_Quest_C_ExecuteUbergraph_SQ02_Thief_Quest::EntryPoint' has a wrong offset!");
static_assert(offsetof(SQ02_Thief_Quest_C_ExecuteUbergraph_SQ02_Thief_Quest, K2Node_MakeStruct_IntPoint) == 0x000004, "Member 'SQ02_Thief_Quest_C_ExecuteUbergraph_SQ02_Thief_Quest::K2Node_MakeStruct_IntPoint' has a wrong offset!");
static_assert(offsetof(SQ02_Thief_Quest_C_ExecuteUbergraph_SQ02_Thief_Quest, K2Node_MakeStruct_QuestMarker) == 0x00000C, "Member 'SQ02_Thief_Quest_C_ExecuteUbergraph_SQ02_Thief_Quest::K2Node_MakeStruct_QuestMarker' has a wrong offset!");
static_assert(offsetof(SQ02_Thief_Quest_C_ExecuteUbergraph_SQ02_Thief_Quest, K2Node_MakeStruct_IntPoint_1) == 0x00001C, "Member 'SQ02_Thief_Quest_C_ExecuteUbergraph_SQ02_Thief_Quest::K2Node_MakeStruct_IntPoint_1' has a wrong offset!");
static_assert(offsetof(SQ02_Thief_Quest_C_ExecuteUbergraph_SQ02_Thief_Quest, K2Node_MakeStruct_QuestMarker_1) == 0x000024, "Member 'SQ02_Thief_Quest_C_ExecuteUbergraph_SQ02_Thief_Quest::K2Node_MakeStruct_QuestMarker_1' has a wrong offset!");
static_assert(offsetof(SQ02_Thief_Quest_C_ExecuteUbergraph_SQ02_Thief_Quest, CallFunc_AddObjective_ReturnValue) == 0x000038, "Member 'SQ02_Thief_Quest_C_ExecuteUbergraph_SQ02_Thief_Quest::CallFunc_AddObjective_ReturnValue' has a wrong offset!");
static_assert(offsetof(SQ02_Thief_Quest_C_ExecuteUbergraph_SQ02_Thief_Quest, CallFunc_AddObjective_ReturnValue_1) == 0x000040, "Member 'SQ02_Thief_Quest_C_ExecuteUbergraph_SQ02_Thief_Quest::CallFunc_AddObjective_ReturnValue_1' has a wrong offset!");

}

