#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SQ07_AGourmetMeal_Quest

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "man_structs.hpp"


namespace SDK::Params
{

// Function SQ07_AGourmetMeal_Quest.SQ07_AGourmetMeal_Quest_C.ExecuteUbergraph_SQ07_AGourmetMeal_Quest
// 0x00C8 (0x00C8 - 0x0000)
struct SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint;                        // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestMarker                           K2Node_MakeStruct_QuestMarker;                     // 0x000C(0x0010)(NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GlobalDictionaryGetBool_OutValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GlobalDictionaryGetBool_ReturnValue;      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue_1;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuantisedItemAbility                  K2Node_MakeStruct_QuantisedItemAbility;            // 0x0038(0x0010)(NoDestructor)
	struct FQuantisedItemAbility                  K2Node_MakeStruct_QuantisedItemAbility_1;          // 0x0048(0x0010)(NoDestructor)
	struct FQuantisedItemAbility                  K2Node_MakeStruct_QuantisedItemAbility_2;          // 0x0058(0x0010)(NoDestructor)
	struct FQuantisedItemAbility                  K2Node_MakeStruct_QuantisedItemAbility_3;          // 0x0068(0x0010)(NoDestructor)
	TArray<struct FQuantisedItemAbility>          K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	struct FTextAndStoryParams                    K2Node_MakeStruct_TextAndStoryParams;              // 0x0088(0x0038)()
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue_2;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest) == 0x000008, "Wrong alignment on SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest");
static_assert(sizeof(SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest) == 0x0000C8, "Wrong size on SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest");
static_assert(offsetof(SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest, EntryPoint) == 0x000000, "Member 'SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest::EntryPoint' has a wrong offset!");
static_assert(offsetof(SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest, K2Node_MakeStruct_IntPoint) == 0x000004, "Member 'SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest::K2Node_MakeStruct_IntPoint' has a wrong offset!");
static_assert(offsetof(SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest, K2Node_MakeStruct_QuestMarker) == 0x00000C, "Member 'SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest::K2Node_MakeStruct_QuestMarker' has a wrong offset!");
static_assert(offsetof(SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest, CallFunc_AddObjective_ReturnValue) == 0x000020, "Member 'SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest::CallFunc_AddObjective_ReturnValue' has a wrong offset!");
static_assert(offsetof(SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest, CallFunc_GlobalDictionaryGetBool_OutValue) == 0x000028, "Member 'SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest::CallFunc_GlobalDictionaryGetBool_OutValue' has a wrong offset!");
static_assert(offsetof(SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest, CallFunc_GlobalDictionaryGetBool_ReturnValue) == 0x000029, "Member 'SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest::CallFunc_GlobalDictionaryGetBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest, CallFunc_AddObjective_ReturnValue_1) == 0x000030, "Member 'SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest::CallFunc_AddObjective_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest, K2Node_MakeStruct_QuantisedItemAbility) == 0x000038, "Member 'SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest::K2Node_MakeStruct_QuantisedItemAbility' has a wrong offset!");
static_assert(offsetof(SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest, K2Node_MakeStruct_QuantisedItemAbility_1) == 0x000048, "Member 'SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest::K2Node_MakeStruct_QuantisedItemAbility_1' has a wrong offset!");
static_assert(offsetof(SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest, K2Node_MakeStruct_QuantisedItemAbility_2) == 0x000058, "Member 'SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest::K2Node_MakeStruct_QuantisedItemAbility_2' has a wrong offset!");
static_assert(offsetof(SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest, K2Node_MakeStruct_QuantisedItemAbility_3) == 0x000068, "Member 'SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest::K2Node_MakeStruct_QuantisedItemAbility_3' has a wrong offset!");
static_assert(offsetof(SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest, K2Node_MakeArray_Array) == 0x000078, "Member 'SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest, K2Node_MakeStruct_TextAndStoryParams) == 0x000088, "Member 'SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest::K2Node_MakeStruct_TextAndStoryParams' has a wrong offset!");
static_assert(offsetof(SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest, CallFunc_AddObjective_ReturnValue_2) == 0x0000C0, "Member 'SQ07_AGourmetMeal_Quest_C_ExecuteUbergraph_SQ07_AGourmetMeal_Quest::CallFunc_AddObjective_ReturnValue_2' has a wrong offset!");

}

