#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SQ12_StrangeMaterial_Quest

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "man_structs.hpp"


namespace SDK::Params
{

// Function SQ12_StrangeMaterial_Quest.SQ12_StrangeMaterial_Quest_C.ExecuteUbergraph_SQ12_StrangeMaterial_Quest
// 0x00B0 (0x00B0 - 0x0000)
struct SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint;                        // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestMarker                           K2Node_MakeStruct_QuestMarker;                     // 0x000C(0x0010)(NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuantisedItemAbility                  K2Node_MakeStruct_QuantisedItemAbility;            // 0x0028(0x0010)(NoDestructor)
	struct FQuantisedItemAbility                  K2Node_MakeStruct_QuantisedItemAbility_1;          // 0x0038(0x0010)(NoDestructor)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint_1;                      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FQuantisedItemAbility>          K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
	struct FQuestMarker                           K2Node_MakeStruct_QuestMarker_1;                   // 0x0060(0x0010)(NoDestructor)
	struct FTextAndStoryParams                    K2Node_MakeStruct_TextAndStoryParams;              // 0x0070(0x0038)()
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue_1;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest) == 0x000008, "Wrong alignment on SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest");
static_assert(sizeof(SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest) == 0x0000B0, "Wrong size on SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest");
static_assert(offsetof(SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest, EntryPoint) == 0x000000, "Member 'SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest::EntryPoint' has a wrong offset!");
static_assert(offsetof(SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest, K2Node_MakeStruct_IntPoint) == 0x000004, "Member 'SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest::K2Node_MakeStruct_IntPoint' has a wrong offset!");
static_assert(offsetof(SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest, K2Node_MakeStruct_QuestMarker) == 0x00000C, "Member 'SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest::K2Node_MakeStruct_QuestMarker' has a wrong offset!");
static_assert(offsetof(SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest, CallFunc_AddObjective_ReturnValue) == 0x000020, "Member 'SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest::CallFunc_AddObjective_ReturnValue' has a wrong offset!");
static_assert(offsetof(SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest, K2Node_MakeStruct_QuantisedItemAbility) == 0x000028, "Member 'SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest::K2Node_MakeStruct_QuantisedItemAbility' has a wrong offset!");
static_assert(offsetof(SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest, K2Node_MakeStruct_QuantisedItemAbility_1) == 0x000038, "Member 'SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest::K2Node_MakeStruct_QuantisedItemAbility_1' has a wrong offset!");
static_assert(offsetof(SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest, K2Node_MakeStruct_IntPoint_1) == 0x000048, "Member 'SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest::K2Node_MakeStruct_IntPoint_1' has a wrong offset!");
static_assert(offsetof(SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest, K2Node_MakeArray_Array) == 0x000050, "Member 'SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest, K2Node_MakeStruct_QuestMarker_1) == 0x000060, "Member 'SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest::K2Node_MakeStruct_QuestMarker_1' has a wrong offset!");
static_assert(offsetof(SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest, K2Node_MakeStruct_TextAndStoryParams) == 0x000070, "Member 'SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest::K2Node_MakeStruct_TextAndStoryParams' has a wrong offset!");
static_assert(offsetof(SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest, CallFunc_AddObjective_ReturnValue_1) == 0x0000A8, "Member 'SQ12_StrangeMaterial_Quest_C_ExecuteUbergraph_SQ12_StrangeMaterial_Quest::CallFunc_AddObjective_ReturnValue_1' has a wrong offset!");

}

