#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SQ14_OhSweetMemories_Quest

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "man_structs.hpp"


namespace SDK::Params
{

// Function SQ14_OhSweetMemories_Quest.SQ14_OhSweetMemories_Quest_C.ExecuteUbergraph_SQ14_OhSweetMemories_Quest
// 0x0030 (0x0030 - 0x0000)
struct SQ14_OhSweetMemories_Quest_C_ExecuteUbergraph_SQ14_OhSweetMemories_Quest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint;                        // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestMarker                           K2Node_MakeStruct_QuestMarker;                     // 0x000C(0x0010)(NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue_1;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SQ14_OhSweetMemories_Quest_C_ExecuteUbergraph_SQ14_OhSweetMemories_Quest) == 0x000008, "Wrong alignment on SQ14_OhSweetMemories_Quest_C_ExecuteUbergraph_SQ14_OhSweetMemories_Quest");
static_assert(sizeof(SQ14_OhSweetMemories_Quest_C_ExecuteUbergraph_SQ14_OhSweetMemories_Quest) == 0x000030, "Wrong size on SQ14_OhSweetMemories_Quest_C_ExecuteUbergraph_SQ14_OhSweetMemories_Quest");
static_assert(offsetof(SQ14_OhSweetMemories_Quest_C_ExecuteUbergraph_SQ14_OhSweetMemories_Quest, EntryPoint) == 0x000000, "Member 'SQ14_OhSweetMemories_Quest_C_ExecuteUbergraph_SQ14_OhSweetMemories_Quest::EntryPoint' has a wrong offset!");
static_assert(offsetof(SQ14_OhSweetMemories_Quest_C_ExecuteUbergraph_SQ14_OhSweetMemories_Quest, K2Node_MakeStruct_IntPoint) == 0x000004, "Member 'SQ14_OhSweetMemories_Quest_C_ExecuteUbergraph_SQ14_OhSweetMemories_Quest::K2Node_MakeStruct_IntPoint' has a wrong offset!");
static_assert(offsetof(SQ14_OhSweetMemories_Quest_C_ExecuteUbergraph_SQ14_OhSweetMemories_Quest, K2Node_MakeStruct_QuestMarker) == 0x00000C, "Member 'SQ14_OhSweetMemories_Quest_C_ExecuteUbergraph_SQ14_OhSweetMemories_Quest::K2Node_MakeStruct_QuestMarker' has a wrong offset!");
static_assert(offsetof(SQ14_OhSweetMemories_Quest_C_ExecuteUbergraph_SQ14_OhSweetMemories_Quest, CallFunc_AddObjective_ReturnValue) == 0x000020, "Member 'SQ14_OhSweetMemories_Quest_C_ExecuteUbergraph_SQ14_OhSweetMemories_Quest::CallFunc_AddObjective_ReturnValue' has a wrong offset!");
static_assert(offsetof(SQ14_OhSweetMemories_Quest_C_ExecuteUbergraph_SQ14_OhSweetMemories_Quest, CallFunc_AddObjective_ReturnValue_1) == 0x000028, "Member 'SQ14_OhSweetMemories_Quest_C_ExecuteUbergraph_SQ14_OhSweetMemories_Quest::CallFunc_AddObjective_ReturnValue_1' has a wrong offset!");

}

