#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SQ25_TheBrilliant_Quest

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "man_structs.hpp"


namespace SDK::Params
{

// Function SQ25_TheBrilliant_Quest.SQ25_TheBrilliant_Quest_C.ExecuteUbergraph_SQ25_TheBrilliant_Quest
// 0x0050 (0x0050 - 0x0000)
struct SQ25_TheBrilliant_Quest_C_ExecuteUbergraph_SQ25_TheBrilliant_Quest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint;                        // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestMarker                           K2Node_MakeStruct_QuestMarker;                     // 0x000C(0x0010)(NoDestructor)
	bool                                          CallFunc_GlobalDictionaryGetBool_OutValue;         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GlobalDictionaryGetBool_ReturnValue;      // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint_1;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue_1;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestMarker                           K2Node_MakeStruct_QuestMarker_1;                   // 0x0038(0x0010)(NoDestructor)
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue_2;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SQ25_TheBrilliant_Quest_C_ExecuteUbergraph_SQ25_TheBrilliant_Quest) == 0x000008, "Wrong alignment on SQ25_TheBrilliant_Quest_C_ExecuteUbergraph_SQ25_TheBrilliant_Quest");
static_assert(sizeof(SQ25_TheBrilliant_Quest_C_ExecuteUbergraph_SQ25_TheBrilliant_Quest) == 0x000050, "Wrong size on SQ25_TheBrilliant_Quest_C_ExecuteUbergraph_SQ25_TheBrilliant_Quest");
static_assert(offsetof(SQ25_TheBrilliant_Quest_C_ExecuteUbergraph_SQ25_TheBrilliant_Quest, EntryPoint) == 0x000000, "Member 'SQ25_TheBrilliant_Quest_C_ExecuteUbergraph_SQ25_TheBrilliant_Quest::EntryPoint' has a wrong offset!");
static_assert(offsetof(SQ25_TheBrilliant_Quest_C_ExecuteUbergraph_SQ25_TheBrilliant_Quest, K2Node_MakeStruct_IntPoint) == 0x000004, "Member 'SQ25_TheBrilliant_Quest_C_ExecuteUbergraph_SQ25_TheBrilliant_Quest::K2Node_MakeStruct_IntPoint' has a wrong offset!");
static_assert(offsetof(SQ25_TheBrilliant_Quest_C_ExecuteUbergraph_SQ25_TheBrilliant_Quest, K2Node_MakeStruct_QuestMarker) == 0x00000C, "Member 'SQ25_TheBrilliant_Quest_C_ExecuteUbergraph_SQ25_TheBrilliant_Quest::K2Node_MakeStruct_QuestMarker' has a wrong offset!");
static_assert(offsetof(SQ25_TheBrilliant_Quest_C_ExecuteUbergraph_SQ25_TheBrilliant_Quest, CallFunc_GlobalDictionaryGetBool_OutValue) == 0x00001C, "Member 'SQ25_TheBrilliant_Quest_C_ExecuteUbergraph_SQ25_TheBrilliant_Quest::CallFunc_GlobalDictionaryGetBool_OutValue' has a wrong offset!");
static_assert(offsetof(SQ25_TheBrilliant_Quest_C_ExecuteUbergraph_SQ25_TheBrilliant_Quest, CallFunc_GlobalDictionaryGetBool_ReturnValue) == 0x00001D, "Member 'SQ25_TheBrilliant_Quest_C_ExecuteUbergraph_SQ25_TheBrilliant_Quest::CallFunc_GlobalDictionaryGetBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SQ25_TheBrilliant_Quest_C_ExecuteUbergraph_SQ25_TheBrilliant_Quest, CallFunc_AddObjective_ReturnValue) == 0x000020, "Member 'SQ25_TheBrilliant_Quest_C_ExecuteUbergraph_SQ25_TheBrilliant_Quest::CallFunc_AddObjective_ReturnValue' has a wrong offset!");
static_assert(offsetof(SQ25_TheBrilliant_Quest_C_ExecuteUbergraph_SQ25_TheBrilliant_Quest, K2Node_MakeStruct_IntPoint_1) == 0x000028, "Member 'SQ25_TheBrilliant_Quest_C_ExecuteUbergraph_SQ25_TheBrilliant_Quest::K2Node_MakeStruct_IntPoint_1' has a wrong offset!");
static_assert(offsetof(SQ25_TheBrilliant_Quest_C_ExecuteUbergraph_SQ25_TheBrilliant_Quest, CallFunc_AddObjective_ReturnValue_1) == 0x000030, "Member 'SQ25_TheBrilliant_Quest_C_ExecuteUbergraph_SQ25_TheBrilliant_Quest::CallFunc_AddObjective_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SQ25_TheBrilliant_Quest_C_ExecuteUbergraph_SQ25_TheBrilliant_Quest, K2Node_MakeStruct_QuestMarker_1) == 0x000038, "Member 'SQ25_TheBrilliant_Quest_C_ExecuteUbergraph_SQ25_TheBrilliant_Quest::K2Node_MakeStruct_QuestMarker_1' has a wrong offset!");
static_assert(offsetof(SQ25_TheBrilliant_Quest_C_ExecuteUbergraph_SQ25_TheBrilliant_Quest, CallFunc_AddObjective_ReturnValue_2) == 0x000048, "Member 'SQ25_TheBrilliant_Quest_C_ExecuteUbergraph_SQ25_TheBrilliant_Quest::CallFunc_AddObjective_ReturnValue_2' has a wrong offset!");

}

