#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SQ29_ChartingtheUnknown_Quest

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "man_structs.hpp"


namespace SDK::Params
{

// Function SQ29_ChartingtheUnknown_Quest.SQ29_ChartingtheUnknown_Quest_C.ExecuteUbergraph_SQ29_ChartingtheUnknown_Quest
// 0x0040 (0x0040 - 0x0000)
struct SQ29_ChartingtheUnknown_Quest_C_ExecuteUbergraph_SQ29_ChartingtheUnknown_Quest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint;                        // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestMarker                           K2Node_MakeStruct_QuestMarker;                     // 0x000C(0x0010)(NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GlobalDictionaryGetBool_OutValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GlobalDictionaryGetBool_ReturnValue;      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue_1;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue_2;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SQ29_ChartingtheUnknown_Quest_C_ExecuteUbergraph_SQ29_ChartingtheUnknown_Quest) == 0x000008, "Wrong alignment on SQ29_ChartingtheUnknown_Quest_C_ExecuteUbergraph_SQ29_ChartingtheUnknown_Quest");
static_assert(sizeof(SQ29_ChartingtheUnknown_Quest_C_ExecuteUbergraph_SQ29_ChartingtheUnknown_Quest) == 0x000040, "Wrong size on SQ29_ChartingtheUnknown_Quest_C_ExecuteUbergraph_SQ29_ChartingtheUnknown_Quest");
static_assert(offsetof(SQ29_ChartingtheUnknown_Quest_C_ExecuteUbergraph_SQ29_ChartingtheUnknown_Quest, EntryPoint) == 0x000000, "Member 'SQ29_ChartingtheUnknown_Quest_C_ExecuteUbergraph_SQ29_ChartingtheUnknown_Quest::EntryPoint' has a wrong offset!");
static_assert(offsetof(SQ29_ChartingtheUnknown_Quest_C_ExecuteUbergraph_SQ29_ChartingtheUnknown_Quest, K2Node_MakeStruct_IntPoint) == 0x000004, "Member 'SQ29_ChartingtheUnknown_Quest_C_ExecuteUbergraph_SQ29_ChartingtheUnknown_Quest::K2Node_MakeStruct_IntPoint' has a wrong offset!");
static_assert(offsetof(SQ29_ChartingtheUnknown_Quest_C_ExecuteUbergraph_SQ29_ChartingtheUnknown_Quest, K2Node_MakeStruct_QuestMarker) == 0x00000C, "Member 'SQ29_ChartingtheUnknown_Quest_C_ExecuteUbergraph_SQ29_ChartingtheUnknown_Quest::K2Node_MakeStruct_QuestMarker' has a wrong offset!");
static_assert(offsetof(SQ29_ChartingtheUnknown_Quest_C_ExecuteUbergraph_SQ29_ChartingtheUnknown_Quest, CallFunc_AddObjective_ReturnValue) == 0x000020, "Member 'SQ29_ChartingtheUnknown_Quest_C_ExecuteUbergraph_SQ29_ChartingtheUnknown_Quest::CallFunc_AddObjective_ReturnValue' has a wrong offset!");
static_assert(offsetof(SQ29_ChartingtheUnknown_Quest_C_ExecuteUbergraph_SQ29_ChartingtheUnknown_Quest, CallFunc_GlobalDictionaryGetBool_OutValue) == 0x000028, "Member 'SQ29_ChartingtheUnknown_Quest_C_ExecuteUbergraph_SQ29_ChartingtheUnknown_Quest::CallFunc_GlobalDictionaryGetBool_OutValue' has a wrong offset!");
static_assert(offsetof(SQ29_ChartingtheUnknown_Quest_C_ExecuteUbergraph_SQ29_ChartingtheUnknown_Quest, CallFunc_GlobalDictionaryGetBool_ReturnValue) == 0x000029, "Member 'SQ29_ChartingtheUnknown_Quest_C_ExecuteUbergraph_SQ29_ChartingtheUnknown_Quest::CallFunc_GlobalDictionaryGetBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SQ29_ChartingtheUnknown_Quest_C_ExecuteUbergraph_SQ29_ChartingtheUnknown_Quest, CallFunc_AddObjective_ReturnValue_1) == 0x000030, "Member 'SQ29_ChartingtheUnknown_Quest_C_ExecuteUbergraph_SQ29_ChartingtheUnknown_Quest::CallFunc_AddObjective_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SQ29_ChartingtheUnknown_Quest_C_ExecuteUbergraph_SQ29_ChartingtheUnknown_Quest, CallFunc_AddObjective_ReturnValue_2) == 0x000038, "Member 'SQ29_ChartingtheUnknown_Quest_C_ExecuteUbergraph_SQ29_ChartingtheUnknown_Quest::CallFunc_AddObjective_ReturnValue_2' has a wrong offset!");

}

