#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SQ32_TheWitchsCall_Quest

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "man_structs.hpp"


namespace SDK::Params
{

// Function SQ32_TheWitchsCall_Quest.SQ32_TheWitchsCall_Quest_C.ExecuteUbergraph_SQ32_TheWitchsCall_Quest
// 0x0028 (0x0028 - 0x0000)
struct SQ32_TheWitchsCall_Quest_C_ExecuteUbergraph_SQ32_TheWitchsCall_Quest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint;                        // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestMarker                           K2Node_MakeStruct_QuestMarker;                     // 0x000C(0x0010)(NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UManQuestObjective*                     CallFunc_AddObjective_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SQ32_TheWitchsCall_Quest_C_ExecuteUbergraph_SQ32_TheWitchsCall_Quest) == 0x000008, "Wrong alignment on SQ32_TheWitchsCall_Quest_C_ExecuteUbergraph_SQ32_TheWitchsCall_Quest");
static_assert(sizeof(SQ32_TheWitchsCall_Quest_C_ExecuteUbergraph_SQ32_TheWitchsCall_Quest) == 0x000028, "Wrong size on SQ32_TheWitchsCall_Quest_C_ExecuteUbergraph_SQ32_TheWitchsCall_Quest");
static_assert(offsetof(SQ32_TheWitchsCall_Quest_C_ExecuteUbergraph_SQ32_TheWitchsCall_Quest, EntryPoint) == 0x000000, "Member 'SQ32_TheWitchsCall_Quest_C_ExecuteUbergraph_SQ32_TheWitchsCall_Quest::EntryPoint' has a wrong offset!");
static_assert(offsetof(SQ32_TheWitchsCall_Quest_C_ExecuteUbergraph_SQ32_TheWitchsCall_Quest, K2Node_MakeStruct_IntPoint) == 0x000004, "Member 'SQ32_TheWitchsCall_Quest_C_ExecuteUbergraph_SQ32_TheWitchsCall_Quest::K2Node_MakeStruct_IntPoint' has a wrong offset!");
static_assert(offsetof(SQ32_TheWitchsCall_Quest_C_ExecuteUbergraph_SQ32_TheWitchsCall_Quest, K2Node_MakeStruct_QuestMarker) == 0x00000C, "Member 'SQ32_TheWitchsCall_Quest_C_ExecuteUbergraph_SQ32_TheWitchsCall_Quest::K2Node_MakeStruct_QuestMarker' has a wrong offset!");
static_assert(offsetof(SQ32_TheWitchsCall_Quest_C_ExecuteUbergraph_SQ32_TheWitchsCall_Quest, CallFunc_AddObjective_ReturnValue) == 0x000020, "Member 'SQ32_TheWitchsCall_Quest_C_ExecuteUbergraph_SQ32_TheWitchsCall_Quest::CallFunc_AddObjective_ReturnValue' has a wrong offset!");

}

