#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tutorial_Lighting

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Tutorial_Lighting.Tutorial_Lighting_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Tutorial_Lighting_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tutorial_Lighting_C_ReceiveTick) == 0x000004, "Wrong alignment on Tutorial_Lighting_C_ReceiveTick");
static_assert(sizeof(Tutorial_Lighting_C_ReceiveTick) == 0x000004, "Wrong size on Tutorial_Lighting_C_ReceiveTick");
static_assert(offsetof(Tutorial_Lighting_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Tutorial_Lighting_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Tutorial_Lighting.Tutorial_Lighting_C.ExecuteUbergraph_Tutorial_Lighting
// 0x00E0 (0x00E0 - 0x0000)
struct Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0054(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting) == 0x000008, "Wrong alignment on Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting");
static_assert(sizeof(Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting) == 0x0000E0, "Wrong size on Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting");
static_assert(offsetof(Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting, EntryPoint) == 0x000000, "Member 'Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting::EntryPoint' has a wrong offset!");
static_assert(offsetof(Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000018, "Member 'Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting, CallFunc_BreakVector_X) == 0x000020, "Member 'Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting, CallFunc_BreakVector_Y) == 0x000024, "Member 'Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting, CallFunc_BreakVector_Z) == 0x000028, "Member 'Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting, CallFunc_GetCameraLocation_ReturnValue) == 0x00002C, "Member 'Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting, CallFunc_BreakVector_X_1) == 0x000038, "Member 'Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting, CallFunc_BreakVector_Y_1) == 0x00003C, "Member 'Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting, CallFunc_BreakVector_Z_1) == 0x000040, "Member 'Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting, CallFunc_Add_FloatFloat_ReturnValue) == 0x000044, "Member 'Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting, CallFunc_MakeVector_ReturnValue) == 0x000048, "Member 'Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000054, "Member 'Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0000DC, "Member 'Tutorial_Lighting_C_ExecuteUbergraph_Tutorial_Lighting::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

}

