#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ulfar_Tutorial_Conversation

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function Ulfar_Tutorial_Conversation.Ulfar_Tutorial_Conversation_C.ExecuteUbergraph_Ulfar_Tutorial_Conversation
// 0x0118 (0x0118 - 0x0000)
struct Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPathName_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMandragoraGameMode*                    K2Node_DynamicCast_AsMandragora_Game_Mode;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UManConversationManager*                CallFunc_GetConversationManager_ReturnValue;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EntryKey)>         Temp_delegate_Variable;                            // 0x0058(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class UManConversationManager*                CallFunc_GetConversationManager_ReturnValue_1;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EntryKey)>         Temp_delegate_Variable_1;                          // 0x0070(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GlobalDictionarySetBool_ReturnValue;      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0084(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_CreateGlobalVariableNameSafe_NewName;     // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UManConversationManager*                CallFunc_GetConversationManager_ReturnValue_2;     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GlobalDictionarySetBool_ReturnValue_1;    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GlobalDictionaryGetBool_OutValue;         // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GlobalDictionaryGetBool_ReturnValue;      // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class FName EntryKey)>         Temp_delegate_Variable_3;                          // 0x00D4(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GlobalDictionarySetBool_ReturnValue_2;    // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_ConversationName;                     // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManQuestManager*                       CallFunc_GetQuestManager_ReturnValue;              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManQuest*                              CallFunc_AddQuest_ReturnValue;                     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManQuestManager*                       CallFunc_GetQuestManager_ReturnValue_1;            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsQuestObjectiveCompleted_ReturnValue;    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventory*                             CallFunc_GetInventory_ReturnValue;                 // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation) == 0x000008, "Wrong alignment on Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation");
static_assert(sizeof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation) == 0x000118, "Wrong size on Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, EntryPoint) == 0x000000, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, CallFunc_GetGameMode_ReturnValue) == 0x000008, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, CallFunc_GetPathName_ReturnValue) == 0x000010, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::CallFunc_GetPathName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, K2Node_DynamicCast_AsMandragora_Game_Mode) == 0x000020, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::K2Node_DynamicCast_AsMandragora_Game_Mode' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000040, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, CallFunc_GetConversationManager_ReturnValue) == 0x000050, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::CallFunc_GetConversationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, Temp_delegate_Variable) == 0x000058, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, CallFunc_GetConversationManager_ReturnValue_1) == 0x000068, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::CallFunc_GetConversationManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, Temp_delegate_Variable_1) == 0x000070, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, CallFunc_GlobalDictionarySetBool_ReturnValue) == 0x000081, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::CallFunc_GlobalDictionarySetBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, Temp_delegate_Variable_2) == 0x000084, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, CallFunc_MakeLiteralString_ReturnValue) == 0x000098, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, CallFunc_PostEvent_ReturnValue) == 0x0000A8, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, CallFunc_CreateGlobalVariableNameSafe_NewName) == 0x0000B0, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::CallFunc_CreateGlobalVariableNameSafe_NewName' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, CallFunc_GetConversationManager_ReturnValue_2) == 0x0000C0, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::CallFunc_GetConversationManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, CallFunc_Conv_StringToName_ReturnValue) == 0x0000C8, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, CallFunc_IsValid_ReturnValue_1) == 0x0000D0, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, CallFunc_GlobalDictionarySetBool_ReturnValue_1) == 0x0000D1, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::CallFunc_GlobalDictionarySetBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, CallFunc_GlobalDictionaryGetBool_OutValue) == 0x0000D2, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::CallFunc_GlobalDictionaryGetBool_OutValue' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, CallFunc_GlobalDictionaryGetBool_ReturnValue) == 0x0000D3, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::CallFunc_GlobalDictionaryGetBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, Temp_delegate_Variable_3) == 0x0000D4, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, CallFunc_GlobalDictionarySetBool_ReturnValue_2) == 0x0000E4, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::CallFunc_GlobalDictionarySetBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, K2Node_Event_ConversationName) == 0x0000E8, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::K2Node_Event_ConversationName' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, CallFunc_GetQuestManager_ReturnValue) == 0x0000F0, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, CallFunc_AddQuest_ReturnValue) == 0x0000F8, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::CallFunc_AddQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, CallFunc_GetQuestManager_ReturnValue_1) == 0x000100, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::CallFunc_GetQuestManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, CallFunc_IsQuestObjectiveCompleted_ReturnValue) == 0x000108, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::CallFunc_IsQuestObjectiveCompleted_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation, CallFunc_GetInventory_ReturnValue) == 0x000110, "Member 'Ulfar_Tutorial_Conversation_C_ExecuteUbergraph_Ulfar_Tutorial_Conversation::CallFunc_GetInventory_ReturnValue' has a wrong offset!");

// Function Ulfar_Tutorial_Conversation.Ulfar_Tutorial_Conversation_C.BPOnStartConversation
// 0x0008 (0x0008 - 0x0000)
struct Ulfar_Tutorial_Conversation_C_BPOnStartConversation final
{
public:
	class FName                                   ConversationName;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ulfar_Tutorial_Conversation_C_BPOnStartConversation) == 0x000004, "Wrong alignment on Ulfar_Tutorial_Conversation_C_BPOnStartConversation");
static_assert(sizeof(Ulfar_Tutorial_Conversation_C_BPOnStartConversation) == 0x000008, "Wrong size on Ulfar_Tutorial_Conversation_C_BPOnStartConversation");
static_assert(offsetof(Ulfar_Tutorial_Conversation_C_BPOnStartConversation, ConversationName) == 0x000000, "Member 'Ulfar_Tutorial_Conversation_C_BPOnStartConversation::ConversationName' has a wrong offset!");

}

