#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ulfar_Caravan_Conversation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Ulfar_Caravan_Conversation.Ulfar_Caravan_Conversation_C
// 0x0038 (0x0260 - 0x0228)
class AUlfar_Caravan_Conversation_C final : public AConversationInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class FName>                           CaravanNPC;                                        // 0x0230(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	TArray<bool>                                  CarvanNPCTalked;                                   // 0x0240(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	bool                                          IsBreaked;                                         // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)
	bool                                          FirstLeave;                                        // 0x0251(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)
	bool                                          OreAsked;                                          // 0x0252(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)
	uint8                                         Pad_253[0x5];                                      // 0x0253(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BlackSmithNPC_C*                    Ulfar;                                             // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPOnStartConversation(class FName ConversationName);
	void Trade();
	void Hub();
	void Questions();
	void StartConv();
	void SpecialIntro();
	void CharacterIntro();
	void BreakNPC();
	void AfterNPC();
	void Quest();
	void Trade2();
	void OreDone();
	void UlfarTools();
	void ClearText();
	void asd();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_Ulfar_Caravan_Conversation(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Ulfar_Caravan_Conversation_C">();
	}
	static class AUlfar_Caravan_Conversation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUlfar_Caravan_Conversation_C>();
	}
};
static_assert(alignof(AUlfar_Caravan_Conversation_C) == 0x000008, "Wrong alignment on AUlfar_Caravan_Conversation_C");
static_assert(sizeof(AUlfar_Caravan_Conversation_C) == 0x000260, "Wrong size on AUlfar_Caravan_Conversation_C");
static_assert(offsetof(AUlfar_Caravan_Conversation_C, UberGraphFrame) == 0x000228, "Member 'AUlfar_Caravan_Conversation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AUlfar_Caravan_Conversation_C, CaravanNPC) == 0x000230, "Member 'AUlfar_Caravan_Conversation_C::CaravanNPC' has a wrong offset!");
static_assert(offsetof(AUlfar_Caravan_Conversation_C, CarvanNPCTalked) == 0x000240, "Member 'AUlfar_Caravan_Conversation_C::CarvanNPCTalked' has a wrong offset!");
static_assert(offsetof(AUlfar_Caravan_Conversation_C, IsBreaked) == 0x000250, "Member 'AUlfar_Caravan_Conversation_C::IsBreaked' has a wrong offset!");
static_assert(offsetof(AUlfar_Caravan_Conversation_C, FirstLeave) == 0x000251, "Member 'AUlfar_Caravan_Conversation_C::FirstLeave' has a wrong offset!");
static_assert(offsetof(AUlfar_Caravan_Conversation_C, OreAsked) == 0x000252, "Member 'AUlfar_Caravan_Conversation_C::OreAsked' has a wrong offset!");
static_assert(offsetof(AUlfar_Caravan_Conversation_C, Ulfar) == 0x000258, "Member 'AUlfar_Caravan_Conversation_C::Ulfar' has a wrong offset!");

}

