#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VE

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "man_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass VE.VE_C
// 0x0018 (0x0368 - 0x0350)
class AVE_C final : public AVisualEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   measuringTapeLOL;                                  // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VE(int32 EntryPoint);
	void VisualEntityConstructionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VE_C">();
	}
	static class AVE_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVE_C>();
	}
};
static_assert(alignof(AVE_C) == 0x000008, "Wrong alignment on AVE_C");
static_assert(sizeof(AVE_C) == 0x000368, "Wrong size on AVE_C");
static_assert(offsetof(AVE_C, UberGraphFrame) == 0x000350, "Member 'AVE_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AVE_C, Niagara) == 0x000358, "Member 'AVE_C::Niagara' has a wrong offset!");
static_assert(offsetof(AVE_C, measuringTapeLOL) == 0x000360, "Member 'AVE_C::measuringTapeLOL' has a wrong offset!");

}

