#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VE

#include "Basic.hpp"


namespace SDK::Params
{

// Function VE.VE_C.ExecuteUbergraph_VE
// 0x0020 (0x0020 - 0x0000)
struct VE_C_ExecuteUbergraph_VE final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USurfaceEffectTypeDataAsset*            CallFunc_GetManSurfaceType_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VE_C_ExecuteUbergraph_VE) == 0x000008, "Wrong alignment on VE_C_ExecuteUbergraph_VE");
static_assert(sizeof(VE_C_ExecuteUbergraph_VE) == 0x000020, "Wrong size on VE_C_ExecuteUbergraph_VE");
static_assert(offsetof(VE_C_ExecuteUbergraph_VE, EntryPoint) == 0x000000, "Member 'VE_C_ExecuteUbergraph_VE::EntryPoint' has a wrong offset!");
static_assert(offsetof(VE_C_ExecuteUbergraph_VE, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'VE_C_ExecuteUbergraph_VE::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(VE_C_ExecuteUbergraph_VE, CallFunc_GetManSurfaceType_ReturnValue) == 0x000010, "Member 'VE_C_ExecuteUbergraph_VE::CallFunc_GetManSurfaceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(VE_C_ExecuteUbergraph_VE, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'VE_C_ExecuteUbergraph_VE::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

